{"video_id": "CoZp6xaTbWw", "title": "[State of MechInterp] SAEs in Production, Circuit Tracing, AI4Science, \"Pragmatic\" Interp — Goodfire", "link": "https://www.youtube.com/watch?v=CoZp6xaTbWw", "published": "2025-12-31T19:50:01+00:00", "summary": "From PhD research on grounding and language models to shipping interpretability tools in production at *Goodfire,* *Jack Merullo* and *Mark Bissell* are building the infrastructure to crack open the black box—making models not just powerful, but *understandable, steerable, and safe.* We caught up with them live at *NeurIPS* to dig into the state of mechanistic interpretability heading into 2026: why interpretability is no longer just a research curiosity but a *practical tool for deployment in high-stakes industries* (healthcare, finance, life sciences), how *Goodfire's platform* turns unsupervised feature discovery into real-world applications like *paint.goodfire.ai* (painting directly into Stable Diffusion's mental map) and *PII detection for Rakuten* (500x cheaper than GPT-5 as a judge, higher recall than LLM-based methods), why the *memorization vs. reasoning spectrum* matters more than binary \"memorized or not\" framing (factual recall sits somewhere between rote memorization and logical reasoning), how *cross-layer transcoders and circuit tracing* are scaling interpretability across every layer of a model (creating attribution graphs through interpretable features), why *Neil Nanda's pivot to pragmatic interpretability* isn't a retreat but a validation that interp is ready for real-world impact (managing by outcome, not just reverse-engineering from scratch), the *Pasteur's Quadrant* philosophy that drives Goodfire (bouncing between foundational research and applied use cases, like Pasteur pioneering germ theory _and_ vaccines), and their thesis that *interpretability unlocks latent capacity in models* that you simply can't access by treating them as black boxes—whether that's finding novel biomarkers of disease in genomics models, scrubbing PII from customer chats, or giving creative tools direct access to a diffusion model's internal concept map.\nWe discuss:\n\n* Jack's path: *PhD student (2020–2025) working on grounding in language models → full pivot to interpretability research → Goodfire*\n* Mark's path: *Palantir healthcare engineer → Goodfire in March 2024,* focused on applied interpretability and platform engineering\n* What Goodfire does: *AI research company building a platform for interpreting models across modalities and domains,* focused on real-world deployment in high-stakes industries\n* *paint.goodfire.ai:* using interpretability to paint directly into Stable Diffusion's mental map—unsupervised concept discovery (animals, backgrounds, scenes) lets you select and paint concepts on a 2D canvas, a totally new interface for a text-only model\n* Fact editing and the *ROME paper* (rank-one model editing): updating facts (\"capital of France is now Marseille\") is an interpretability problem, not yet deployed at scale\n* What's new in 2025: *interpretability showing up in model cards, evals, red teaming exercises* (Gemini, Claude), and real production deployments like Rakuten's PII detection\n* AI for science: *narrowly superhuman models in genomics, medical imaging, proteomics, materials science*—interpretability unlocks novel biomarkers of disease and scientific discovery in domains humans can't natively understand (base pairs in, base pairs out)\n* *Cross-layer transcoders and circuit tracing:* scaling SAEs across every layer, tying features across layers, and creating attribution graphs to trace how models produce outputs through interpretable primitives\n* Why *Neel Nanda's pivot to pragmatic interpretability* isn't \"interpretability is dead\" but a validation that interp is ready for real-world impact—managing by outcome, not just reverse-engineering models from scratch\n* *Pasteur's Quadrant:* bouncing between foundational research (Niels Bohr understanding the atom) and applied research (Edison inventing the light bulb), with Pasteur as the model for doing both (germ theory _and_ vaccines)\n\n—\nGoodfire Team\n\n* Goodfire: https://goodfire.ai\n* Paint demo: https://paint.goodfire.ai\n* Careers: https://goodfire.ai/careers\n\n00:00:00 Introduction: GoodFire's Mission and the State of Mechanistic Interpretability\n00:00:56 From Grounding to Interpretability: Jack's PhD Journey\n00:03:04 Paint.GoodFire.ai: Interpretability for Creative Control\n00:05:30 Disentangling Memorization from Reasoning: The Spectrum of Model Capabilities\n00:06:40 Unlearning vs Suppression: The Challenge of Removing Information\n00:08:15 Real-World Deployments: PII Detection and Enterprise Applications\n00:10:20 AI for Science: Genomics, Proteomics, and Novel Biomarker Discovery\n00:11:20 Circuit Tracing and Cross-Layer Transcoders: Anthropic's Contribution\n00:15:44 The Neil Nanda Pivot: Pragmatic Interpretability and Managing by Outcome\n00:18:37 Pasteur's Quadrant: Balancing Discovery and Application at GoodFire", "transcript_html": "<h2>Introduction: GoodFire&#x27;s Mission and the State of Mechanistic Interpretability</h2>\n<p>[music] Light space to fire up. [music] &gt;&gt; Okay, we are here live hive at Europe&#x27;s with two good folks. We want to cover the state of Mechinf basically and you guys are very passionate. Mark, I had you on for AIE before. Welcome back. &gt;&gt; Thank you. &gt;&gt; Uh and Jack, you&#x27;re new but uh also part of Goodfire. Yeah. &gt;&gt; Uh how how would you describe uh what do you guys do and your path into Mecher? Maybe Jack, you want to go first?</p>\n<p>&gt;&gt; So we do interpretability research primarily. Uh we&#x27;re a company focused on like making models interpretable and and robust and safe. And I guess I would describe like the type of work we do as like the science of deep learning which is trying to make models not just black boxes like that we things that we can actually trust and like deploy in in high stakes uh industries. I guess my</p>\n<h2>From Grounding to Interpretability: Jack&#x27;s PhD Journey</h2>\n<p>own path into interpretability um was I was a PhD student um from 2020 to 2025. I graduated in May. Uh and I started working on I was working on language models. I was working on grounding in language models which is basically the idea that you need more than text data to represent meaning in the world. And it was basically right away as I started like at some point, you know, GPD3 had come out and I had a moment of like, oh, this is actually like, you know, just really good at like understanding the</p>\n<p>world and like it was kind of a slow transition, but somewhere along the way in grad school, I switched to fully doing interpretability. &gt;&gt; Cool. Yeah. As like Jack mentioned, Goodfire um is an AI research company uh focused on building a platform for interpreting models of all kinds across lots of different modalities and domains. My path looks very different uh than Jack. So prior to Goodfire, I was at Palunteer as an engineer on our healthcare team and then joined Goodfire back in March. And I guess one cool thing about kind of the the state of</p>\n<p>interpretability as a field and also how Goodfire is set up um is there&#x27;s a lot of foundational research still to be done that folks like Jack are working on and our team. But at GoodFire, I&#x27;m more focused on sort of like our applied real world use cases for for interp. building out a platform that can help in use cases like scientific discovery or for kind of like inference time monitoring of models um for deployment in enterprises uh and things like that. So I think there&#x27;s a lot of exciting just</p>\n<p>totally new theoretical research to be done. But uh especially over the past year I think we&#x27;re starting to see interpretability have practical use cases be actually deployed in like especially situations where models are being used for high stakes industries um and problems which is which is super exciting. &gt;&gt; Yeah. I I think a lot of people are ignorance of the fact that we&#x27;re actually at this point where people could actually apply these things for for real life use cases. I saw the</p>\n<h2>Paint.GoodFire.ai: Interpretability for Creative Control</h2>\n<p>platform directly. I you guys had like a launch party in your office for the diffusion thing. Maybe you want to recap what that was so that people can go play around with it again. &gt;&gt; Yeah. Yeah. So, this is uh kind of a a research preview that we put out. It&#x27;s at paint.goodfire.ai. It&#x27;s live. That was a use case of interpretability for um sort of like the creative domain. I think just giving one hint at like interpretability gives you a set of I think of it almost as like power user tools for accessing models and doing things with them that you might not have realized you could. Uh so that example is you take stable</p>\n<p>diffusion XL turbo. So a model that typically you use text input to prompt the model and you get an image out. But using interpretability techniques you can sort of like plug directly into the mind of the model and you get a 2D canvas where you can basically like paint directly into its mental map of the image. And so we used unsupervised techniques to basically figure out all the concepts that the model like has internally. So animals, backgrounds, um, scenes and stuff like that. And so you</p>\n<p>can select any of those concepts, which again we&#x27;re found totally unsupervised, and you can just like paint a lion over here and then drag it and move it over here. It&#x27;s just a totally new way. Like this is a model that only takes text prompts as input, but when you plug into the brain, you can do these cool things. &gt;&gt; Yeah. and then highlighting other work because I think people that one went relatively viral. Uh Jack, I don&#x27;t know if you want to take a turn at like other highlights of your year in terms of stuff that you shared. &gt;&gt; You start with the memorization. &gt;&gt; Okay. Sure. So there&#x27;s a lot of work and like going back years on like so models memorize a lot of their training data.</p>\n<p>That&#x27;s a privacy concern, but it&#x27;s also I think just scientifically under interesting to understand and there&#x27;s sort of like an unclear picture of like how should we think about how it&#x27;s represented like within a model when it&#x27;s is is it like a a computer with like like a file system that we can kind of tap into where maybe files are redundantly stored like you know memorized training sequence are kind of spread throughout or should we think about like some other way and we kind of proposed a a kind of like different lens on it. I think a exciting question around the work was um whether we can like disentangle like core cognitive</p>\n<p>capacities in a language model from &gt;&gt; from knowledge right &gt;&gt; from knowledge &gt;&gt; I was thinking like GPQ QA0 &gt;&gt; and uh you know if 100 &gt;&gt; exactly &gt;&gt; right so this is a paper we put out</p>\n<h2>Disentangling Memorization from Reasoning: The Spectrum of Model Capabilities</h2>\n<p>recently in October um and uh we showed u there&#x27;s this like nice spectrum of like capabilities in so there&#x27;s another I think another new lens on on memorization which is that in language models it&#x27;s not so black and white like what is memorized and not so like memorizing that the the capital of France is Paris is you know memorized in some sense but it&#x27;s it&#x27;s a lot different than just like memorizing like single page like license agreement document that shows up a thousand times in the pre-trending data or something like that you can actually see like a the way that we like disentangle memorization you can</p>\n<p>kind of see this uh like gradient of memorization uh in between both mechanistically and and behaviorally with like logical reasoning tasks being quite distinct from wrote memorization and then like factual recall it&#x27;s kind of somewhere in the middle. &gt;&gt; What&#x27;s your uh follow on work after you&#x27;ve done this? &gt;&gt; So I think like understanding um like the reasoning capabilities is is very interesting. I think like understanding how postraining affects those capabilities in general is super interesting and I think we&#x27;re going to keep pushing on that. &gt;&gt; Can you induce forgetting so activity?</p>\n<p>we show and so yeah so there&#x27;s there&#x27;s a</p>\n<h2>Unlearning vs Suppression: The Challenge of Removing Information</h2>\n<p>lot of work on like unlearning uh I would I would describe it more as not unlearning but maybe suppression um I think there&#x27;s like really like I guess guarantees that you&#x27;ve fully removed information from a model is is I don&#x27;t think it&#x27;s been convincingly showed anywhere yet and I I think that it&#x27;s I think maybe some of the point that we want to make in our work is that when we look at memorization this way it makes a a point about how hard or or you know possibly like intractable that is &gt;&gt; I don&#x27;t know if this is a related problem or it&#x27;s too different but</p>\n<p>instead of unlearning but updating &gt;&gt; so I moved the capital of France to Marseilles &gt;&gt; but there&#x27;s so much training data saying the capital of France is Paris &gt;&gt; I need like a date I need to be able to tell the model hey like this is now out of date but like short of tagging a date on everything I don&#x27;t know when that makes sense you know that&#x27;s like a weird &gt;&gt; yeah yeah a really big uh like paper from a couple years ago on this exact thing on fact editing was the the Rome paper. It&#x27;s rank one model edit and um &gt;&gt; nice acronym.</p>\n<p>&gt;&gt; Yeah. Yeah. Here we go. Uh and they look at exactly like exactly what you&#x27;re describing. Um it&#x27;s a really nice nice paper. I don&#x27;t think it&#x27;s it&#x27;s being used like in deployment anywhere. But I think that&#x27;s like and it&#x27;s it&#x27;s really an interpretability paper. And um I think that&#x27;s somewhere where like you know from a basic science perspective like interpretability has like so much to to offer is understanding how we can do something like that which is currently just very difficult. &gt;&gt; So call you over to market a little bit for industry stuff. What can people do</p>\n<h2>Real-World Deployments: PII Detection and Enterprise Applications</h2>\n<p>at the end of 2025 that they could not do at the start of 2025? &gt;&gt; So I&#x27;ll preface with saying we we still have a long way to go but but we are excited about seeing like the seeds of you know things actually being deployed in practice. I I would say that we&#x27;re just continuing to make progress on understanding that models have a lot of latent capacity that you can&#x27;t get at by treating them entirely as as black boxes. So, we&#x27;re seeing interpretability show up in like model cards now for um eval people are running um for various like red teaming exercises and stuff.</p>\n<p>Yeah, I know. Uh there&#x27;s some stuff in Gemini 3 um Claude I think Claude 4 and it&#x27;s definitely &gt;&gt; Victor. &gt;&gt; Yeah, for sure. I mean, yeah, the interp team there is is phenomenal and I think works across some of their other teams, but and then from Goodfire&#x27;s perspective, you know, we so like one of our partners, Racketin, is deploying an interpretability based tool in production with one of their language agents. This is a really cool use case where if you what they needed to do was take chats between uh their customers and their agent, find instances where</p>\n<p>personally identifiable information is mentioned. So names, emails, phone numbers, things like that, and scrub it out. And interpretability turned out to be the the best way to do this at scale and in a cost-effective way. It was both more effective and cheaper than alternative techniques. &gt;&gt; And you do that by having like a PII feature. &gt;&gt; Uh yeah, exactly. So what you do is you the uh customer is talking with an agent, but then separately you&#x27;re putting that transcript through what we call like a sidecar model. And you could, what&#x27;s really interesting is if you ask that model, try to like use it</p>\n<p>as an LLM as a judge, it&#x27;s not very good. But if you probe its mind and you sort of detect when the features related to personally identifiable information are firing, that gets you the highest recall of anything. It&#x27;s it&#x27;s the equivalent of using GPT5 as a judge, but it&#x27;s, you know, like 500 times cheaper. So So they&#x27;re they&#x27;re deploying that. And then I you know am personally very</p>\n<h2>AI for Science: Genomics, Proteomics, and Novel Biomarker Discovery</h2>\n<p>excited about the use cases for scientific discovery. So some of our partners in the life sciences and in materials uh there there are these narrowly superhuman models for things like genomics, for medical imaging, for proteomics, for material science and those are um especially uninterpretable because they are working in domains that yeah we can&#x27;t well they&#x27;re they&#x27;re huge and like we can&#x27;t native I don&#x27;t speak genome you know like it&#x27;s literally base pairs in base pairs out but they&#x27;re super human at tasks. that are very</p>\n<p>interesting. So, we have some some, you know, exciting early results in in finding novel biomarkers of disease with some of our partners that um we&#x27;re excited to share soon. And yeah, I mean, I think AI for science is, you know, becoming a very hot topic and I think for good reason. &gt;&gt; Yeah, we&#x27;re literally starting AI for science pond like we&#x27;re spinning out a separate inspace AI for science bot. &gt;&gt; I love to hear that. Yeah. &gt;&gt; Yeah. Featuring other work uh done notable work this year. I feel like I</p>\n<h2>Circuit Tracing and Cross-Layer Transcoders: Anthropic&#x27;s Contribution</h2>\n<p>have to mention in topics circuit tracing paper. I don&#x27;t know if there&#x27;s much discussion internally for you guys. Let&#x27;s just let you riff like what do you think? &gt;&gt; Yeah, Jack I know has done a lot of circuit tracing. You want to &gt;&gt; Yeah, when that so when that came out we we did a so that was um back in like March. Yeah, March or April. &gt;&gt; If you could uh let&#x27;s say people know about the SAPE work. Yeah. &gt;&gt; What is the difference? Because I I struggle summarizing it. My my summary you can correct me. It&#x27;s like take an individ like have a full access to a model. take an individual layer and train a replacement circuit that simplifies what it uh does.</p>\n<p>&gt;&gt; Yeah. So, yeah, that&#x27;s right. And a good way to maybe put it is that um you take a representation in the middle which is this like weird dense uninterpretable like web of concepts and you know features in a representation and the the essay like decomposes it into like primitives like um concepts firing for like mentions of coffee shops or mentions of like uh New York City or something like that and those are those are much more interpretable and that it basically decompos it shatters the representation to like many many pieces. The uh big change with the the cross layer transcoder so the circuit tracing</p>\n<p>work was a to to really scale up the models to incorporate like every layer uh so like cross layer uh so the the model is called a cross layer transcoder so it&#x27;s incorporating like it&#x27;s um tying features across different layers and then the the tracing part is a method for creating like an it&#x27;s called an attribution graph through those features which are interpretable to like describe how the model is like producing one output like through every layer and through like a bunch of token positions. I can talk a bit more about it. So, when that came out in like March or April, we um so still pretty early for us. There</p>\n<p>were like eight to 10 of us at the time, I think. So, we we tried to we like uh went had to replicate some of their findings. We&#x27;re really curious about, you know, what would look like training one, like what it&#x27;s like to use it and basic scientific questions as well, which is like could it rediscover um some like rich representations from like previously understood circuits. So we we put out a post I don&#x27;t remember when exactly that went up but over I think over the summer like uh May or June on um our replication effort on that and like um how that works. Is there is there an obvious next step like what is</p>\n<p>what is this all leading up to? Because to me it&#x27;s like basically just always scaling it up, always making it more unsupervised. Uh I don&#x27;t know if there other trends that you can see like yeah these are the core principles that we&#x27;re just exploring. That&#x27;s like a good point to bring up interpretability as as an alignment science versus as like a science for understanding models like more broadly which is like if you &gt;&gt; you&#x27;re one in the same kind of &gt;&gt; I think it depends on what your motivations are. Um so if you are focused on reading a model&#x27;s mind um and understanding like what&#x27;s going on internally to make sure it&#x27;s not having</p>\n<p>bad thoughts or like it&#x27;s not misaligned. It makes a &gt;&gt; bad thought. &gt;&gt; Yeah. [laughter] uh it makes a lot of sense to to like do exactly what they&#x27;re doing. So I think and that I think they&#x27;re just not they&#x27;re I don&#x27;t know exactly what they&#x27;re up to but uh applying like these techniques to like read out what&#x27;s going on inside these models mind. So it&#x27;s like very nice detection like framework but um if we want like really robust control uh like really robust control of models like what they learn during training I think like that&#x27;s where there&#x27;s so much more work to be done. I think you know many</p>\n<p>different teams are all working on on these problems but in terms of next steps that&#x27;s uh yeah like some other directions to go. &gt;&gt; Yeah. No, I think to to Jack&#x27;s point I think the the circuit tracing work is super cool and I think it&#x27;s um it&#x27;s sort of one arrow in a in a larger quiver of techniques that are useful and you know what technique is useful depends on the task at hand that you&#x27;re interested in. So to Jack&#x27;s point, like the techniques that are useful for alignment science and evaluations, you know, that&#x27;s one use case, but there&#x27;s a whole world of</p>\n<p>other things that you might wish to apply other techniques for. And maybe maybe you don&#x27;t need circuits for things that can be uncovered using probes or using other techniques to understand how you know post-training changed a model. also this like model diffing use case and maybe the things that you want to use as like inference time sort of guarantees for for models look a little bit different. So I think it&#x27;s super cool but yeah to your point kind of like there&#x27;s there&#x27;s a variety of um a variety of techniques depending on the the final use case that you&#x27;re interested in.</p>\n<h2>The Neil Nanda Pivot: Pragmatic Interpretability and Managing by Outcome</h2>\n<p>&gt;&gt; Last thing that a lot of people hear in New York I&#x27;ve had like two conversations about it already is what&#x27;s happening with Neil Nanda. I don&#x27;t like celebrity culture, but it&#x27;s hard to avoid Neil&#x27;s impact. And he basically said he&#x27;s pivoting his team at Deep Mind uh to no longer focus on whatever and now it&#x27;s like pragmatic interpretability. What&#x27;s that conversation about? Like what what do insiders think? &gt;&gt; You know, I I read uh Neil&#x27;s post and I think like I also share the the hope that of of a pragmatic future for for interpretability for sure. Um I think a</p>\n<p>lot of the &gt;&gt; Why didn&#x27;t we think of that earlier? we should [laughter] medic like oh god &gt;&gt; I well I also think I also think a lot of the um the response to that I&#x27;m not sure that folks actually kind of read it all the way all the way through I think there&#x27;s a lot of reading of that for some reason folks thinking oh like interpretability is dead or something if anything that says interpretability is alive and well like there are use cases for not black te blackbox techniques that that can be brought to bear in real world use cases so I you know I I think we&#x27;re Um we we probably agree with Neil</p>\n<p>on that. And then um you know I think also good for like different companies to have different agendas that they&#x27;re pursuing. Uh I think it&#x27;s dangerous you know a field will stagnate if everyone sort of is just converging on the exact same same approaches of things. Not sure if you have other &gt;&gt; to the point about like is um interpretability like dead or something I think is like a a like gross like misattribution of like what that post is about. to melt your wine. &gt;&gt; Nobody&#x27;s I&#x27;m not saying it. Nobody nobody I talked to was saying it. It was much more like the existing approaches</p>\n<p>for him were not scaling to some extent and he was the way I put it is kind of like it&#x27;s like like well okay let&#x27;s forget about complete understanding and let&#x27;s manage by outcome and like let&#x27;s measure ourselves by our ability to steer outcomes and forget if we know precisely what&#x27;s going on. &gt;&gt; Yeah. Yeah. I totally So in terms of like should we just be focusing on like reverse engineering models like from the ground up? So that&#x27;s maybe where the big change is. I think like we we probably agree that like interpretability should be useful and we&#x27;re trying to get it</p>\n<p>like like used right now and we are getting it used right now. I think like maybe where like where we kind of align on this is like we&#x27;re really focused on like use case inspired like basic research. So yes, like we&#x27;re very pragmatic, but there&#x27;s also like a like a lot of like very deep foundational science to be done on understanding models, which is yes, driven by outcomes, but we also want to like develop like the understanding of of what goes on in models because if we&#x27;re not doing that, then every other uh like lab producing models is just a blackbox AI lab. And you know, that&#x27;s not how</p>\n<p>things should be done. or Jack snuck in a little um reference there that I think was was good. So there&#x27;s this concept</p>\n<h2>Pasteur&#x27;s Quadrant: Balancing Discovery and Application at GoodFire</h2>\n<p>that we like to talk about internally called pastor&#x27;s quadrant. So Louie pastor like &gt;&gt; is this like a statistical thing with like the the same distribution but four different that&#x27;s an okay &gt;&gt; yeah no this is more like a conceptual kind of framework but the idea is that you can have so the two axes of the quadrant are I&#x27;ve heard it described as like discovery and invention or like pure research versus applied research like something in in that kind of domain but the idea is that you can have just pure basic research and so the classic example there is like Neil&#x27;s bore like</p>\n<p>understanding the atom, understanding the electron just for sort of like theoretical physics uh interest and then you have the uh corner that is just like purely applied research purely you have an end in insight which is like Edisonian research. So Thomas Edison says I want to make a light bulb I don&#x27;t really like I&#x27;ll learn the chemistry that I need to but it&#x27;s just this goal is is the goal and then there&#x27;s Louis Pastor who like spans both of these. And so the idea is that it&#x27;s not just this linear thing between basic research and applied research. You can kind of have a combination of those two. And so past</p>\n<p>your, you know, sort of pioneer of like germ theory, but also engineered some of the first vaccines. And so this idea that you should sort of be bouncing back and forth between kind of open-ended foundational research, but then also having a goal in sight and be able to really foot back and forth between the two. I think there&#x27;s a lot of cases where you see this being a really productive way to make progress in a field. So, there&#x27;s a company like hero mascot. &gt;&gt; I think it&#x27;s Tom McGrath, one of the co-fire co-founders of Goodfire, who um he started the interp team uh in Deep Mind back in the day, and he uh he has a</p>\n<p>lot of these like great references from other domains of science that are just uh I think really good kind of grounding points for for how we operate. &gt;&gt; Amazing. Let&#x27;s get a quick call to action in. Uh you guys are hiring. What are you hiring for? What&#x27;s what&#x27;s hard to find? &gt;&gt; Definitely actively hiring. Uh, I hope the AI engineer community um should should definitely go to um goodfire.ai, check out our careers page, actively hiring for researchers and uh engineers and &gt;&gt; and you hear nuts. &gt;&gt; Yeah. Yeah. Exactly. Exactly. There&#x27;s a combination. Um uh so so yeah, we&#x27;re you know we&#x27;re doing foundational</p>\n<p>interpretability research, but we&#x27;re building out a platform to apply this in real world use cases. You know, customers across life sciences, materials, government, um financial services. So if you&#x27;re uh someone with an MLE background, no interp experience required whatsoever. You can see we have different backgrounds. I&#x27;m kind of coming from industry from engineering. Jack&#x27;s coming from a PhD. Other folks at Goodfire have backgrounds in like quant trading firms or frontier labs um all sorts of places. But if you like training big models, uh building agents, engineering systems, um we&#x27;re hiring</p>\n<p>across uh a variety of roles and really looking to fill some of those engineering gaps. Exit. I think that&#x27;s it. &gt;&gt; Yeah, that&#x27;s what it Thanks for having us, son. &gt;&gt; Thanks for coming. &gt;&gt; Yeah. [music]</p>", "chapters_count": 10}