{"video_id": "32X3nD3fLYw", "title": "“I hate to break it to you”, but elite colleges matter.", "link": "https://www.youtube.com/shorts/32X3nD3fLYw", "published": "2026-02-12T18:00:09+00:00", "summary": "Private school tuition is hitting record highs. Is it worth it Scott Galloway and Jessica Tarlov discuss, on Raging Moderates.\n#politics #podcast #economy", "transcript_html": "<h2>Transcript</h2>\n<p>Private school tuition in New York City has officially crossed jaw-dropping territory. Several elite schools are now charging more than $70,000 a year, more than many top colleges as families flee a struggling public system embraced from major changes under the new mayor. By the way, there&#x27;s a lot of research showing the best school for your kid is the closest, public or private, and reinvest that commute time back into study, sleep, play, time with parents. But let&#x27;s say you send them to their local public school and you were wrong. They don&#x27;t get as good an education. And to be clear, the average public school in America spends $15,000. The average private school 75. So over the course of</p>\n<p>12 years, $720,000 funneled through an education system. It&#x27;s going to pay off for your kids as evidenced by the SAT where lower income kids score 150 points less than middle- inome kids. And then hold your hats. Upper income kids score 250 points higher than middle class kids because for 12 years they&#x27;ve had another $60,000 in education, tutoring, counseling. If you took that $70,000 and you were disciplined and you sent it to Vanguard every year and send them to the local public schools, say you [ __ ] up. They don&#x27;t get into an elite school. They don&#x27;t get into an elite college. Okay, people will say elite college</p>\n<p>doesn&#x27;t matter. Yeah, it does, folks. I hate to break it to you, it does. And any parent telling you college doesn&#x27;t matter anymore just found out their little Susie got a 22 on the ACT and is trying to make himself feel better. But say, fine. Okay, we put that $72,000 a year aside. The kid doesn&#x27;t get into an elite school, doesn&#x27;t get out of the gate strong, can&#x27;t get a house. We [ __ ] up sending them to public school. If you had taken that $72,000 and over 12 years were disciplined about putting it in an index fund and the market went up 9% at 35, you can ease your guilt and your kids&#x27; pain by giving them $4.5</p>\n<p>million.</p>", "chapters_count": 0}