{"video_id": "Oe4Qqschj4g", "title": "Howard Lutnick’s “reputation is in the sewer”", "link": "https://www.youtube.com/shorts/Oe4Qqschj4g", "published": "2026-02-13T15:00:47+00:00", "summary": "Yale School of Management’s Jeffrey Sonnenfeld joins Jessica Tarlov and Scott Galloway on Raging Moderates to discuss Commerce Secretary Howard Lutnick’s congressional testimony about Jeffrey Epstein.\n#epsteinfiles #trump #podcast", "transcript_html": "<p><strong>[00:00]</strong></p>\n<p>Commerce Secretary Howard Lutnik is testifying \nbefore the Senate. Did you in fact make the visit to Jeffrey Epstein's private island? I did have \nlunch with him as I was on a boat going across on a family vacation. This guy's reputation \nis in the sewer. He has overtly lied. On that clip you showed, it doesn't demonstrate whether \nor not he actually perjured himself under oath, but we do know that he said repeatedly into \nrecently to the media that as you pointed out was 2005. He's had no more contact with \nthat disgusting person. And now we see that he not only built a house next door to him, but \nhe was investing in businesses for years later.</p>\n<p>He stayed in contact for 12 years past. He told \nus he'd stopped all contact. Based upon what you know about Trump's view and his leadership \nstyle, how do you think that he's going to handle having a cabinet secretary caught in this \nkind of lie and the attention that it brings to the administration? If he takes the move on \nLutnik and pushes him out, which he should, does that start the quote unquote proverbial \nslippery slope where all the indiscretions of Hegsth and others start to spiral out of \ncontrol? I think it's possible that um he</p>\n<p>could lose Lutnik. Lutnik is not popular on the \ncabinet. A lot of CEOs tell us after they shake hands with Howard Lutnik now, they want to wash \ntheir hands. I mean, obviously, they feel soiled.</p>"}