{"video_id": "EEefUdNCs94", "title": "\"China Will Utterly Dominate\" Without This – Elon Musk", "link": "https://www.youtube.com/watch?v=EEefUdNCs94", "published": "2026-02-05T20:53:30+00:00", "summary": "Full episode: https://www.youtube.com/watch?v=BYXbuik3dgA\nMe on twitter: https://x.com/dwarkesh_sp\n\nIn the full episode, John and I got to do a real deep-dive with Elon. We discuss the economics of orbital data centers, the difficulties of scaling power on Earth, what it would take to manufacture humanoids at high-volume in America, xAI’s business and alignment plans, DOGE, and much more.", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=EEefUdNCs94\">https://www.youtube.com/watch?v=EEefUdNCs94</a></p>\n<h2>Transcript</h2>\n<p>Many not very many Americans are are pining to do refining. [laughter] &gt;&gt; I mean how many have you run into? &gt;&gt; Very few. &gt;&gt; Very few plan to refine. &gt;&gt; You know BYD is reaching Tesla production or sales in quantity. What do you think happens in global markets as Chinese production in EV scales up? Um well uh China&#x27;s extremely competitive in manufacturing. So um I think this</p>\n<p>there&#x27;s going to be a a massive flood of Chinese vehicles and and and and other basically most manufactured uh things. I mean as it is as I said like China&#x27;s like probably does twice as much refining as the rest of the world combined. So if you go, you know, if if you just go go down to like fourth and fifth tier, uh supply chain stuff like like like at the base level, you got energy, then you got mining and refining. Um those those</p>\n<p>foundation layers uh are like said, ch as a rough guess, China&#x27;s doing twice as much refining as the rest of the world combined. So any given thing is going to have uh Chinese content because China&#x27;s doing twice as much manufact refining work as the rest of the world. Um and uh and then they they&#x27;ll go all the way to the finished product with the cars. Uh I mean China&#x27;s a powerhouse. I mean I think this year China will exceed three times US electricity output. like electricity output is a is a</p>\n<p>reasonable proxy for uh you know for the economy. So like in order to run the factories and run run everything you need electricity. So electricity is is is a it&#x27;s a good proxy for the for the real economy. Um and so if China is if China passes three times the US electricity output it means that its industrial capacity that&#x27;s a rough approximation is three times that will be three times that of the US. Reading between the lines, it sounds like what you&#x27;re sort of saying</p>\n<p>is absence and sort of humanoid recursive miracle in the next few years on the the sort of like whole manufacturing energy uh raw materials chain like China will just dominate whether it comes to like AI or manufacturing EVs or manufacturing humanoids &gt;&gt; in the absence of of um breakthrough innovations uh in in the US. uh China will uh utterly dominate. &gt;&gt; Interesting.</p>\n<p>&gt;&gt; Yes. &gt;&gt; Robotics being the main breakthrough innovation. &gt;&gt; Well, if you do like to to scale AI uh in in space like like basically need &gt;&gt; space, &gt;&gt; you need need the humanoid robots, you need real world AI, you need um a million tons a year to orbit. Um like let&#x27;s just say like if we get the mass driver on the moon going my favorite thing. Um then I think uh &gt;&gt; we&#x27;ll have solved [clears throat] all our problems. &gt;&gt; Yeah. So this is like I call that winning. [laughter]</p>\n<p>&gt;&gt; Um &gt;&gt; I&#x27;d call that winning time. &gt;&gt; You can finally be satisfied you&#x27;ve done something. &gt;&gt; Yes. &gt;&gt; You have the mass driver on the moon. &gt;&gt; That&#x27;s right. I just want to see that thing in operation. &gt;&gt; Was that out of some sci-fi or where did you &gt;&gt; uh Well, actually the there is a Highland book. The moon, the moon is a harsh. Okay. Yeah, but that&#x27;s slightly different. That&#x27;s a gravity slingshot or um &gt;&gt; No, they have a mass driver on the moon. &gt;&gt; Okay. Yeah, but they use that to attack Earth. So maybe it&#x27;s something &gt;&gt; they use that to uh their independence from. &gt;&gt; Exactly. What are your plans for the mass driver on the moon? &gt;&gt; They they asserted their [laughter] independence. The Earth government</p>\n<p>disagreed and they loved things until they earth government agreed. &gt;&gt; That book is a hoot. I found that book much better than um his other one that everyone reads. Um Stranger Strange Land. Yeah, Grock Grock comes from Stranger Strange Line. &gt;&gt; Yeah. Yeah. But I much preferred &gt;&gt; Yeah, the first two/3s of Stranger and Strange Lines are good and then it gets very weird in the third third. Yeah. [snorts] Um, but there&#x27;s still some good concepts in there. Yeah. &gt;&gt; If you enjoyed this clip, you can watch the full episode here and subscribe for more clips. Thanks.</p>", "chapters_count": 0}