{"video_id": "dCAfEwShIlU", "title": "The Cold War Could Have Ended Very Differently – Sarah Paine", "link": "https://www.youtube.com/watch?v=dCAfEwShIlU", "published": "2026-01-16T22:36:53+00:00", "summary": "Full episode: https://www.youtube.com/watch?v=FdkpWrlR5zg\nMe on twitter: https://x.com/dwarkesh_sp\n\nFinal Sarah Paine lecture: Why Russia lost the Cold War.\n\nTo me, the most interesting question is not why the Soviet Union ultimately collapsed - it's how a brutal, centrally planned, stupendously inefficient, colonial land empire survived for so long.\n\nI was surprised to learn about the central role that oil played in sustaining (and eventually dissolving) the Soviet Union.\n\nBy the 1950s, the Soviet system was in a crisis. Soviet growth rates had started to slow significantly as compared to the booming West. USSR's heavy-industry based economy was energy-starved. The 1953 CIA-backed coup in Iran blocked Soviet access to Iranian oil.", "transcript_html": "<h2>Transcript</h2>\n<p>You could argue with this many serious problems, it was a matter of time before the Soviet Union collapsed. And um it was an objectionable system for precisely the reasons the west didn&#x27;t like it. It had a brutally inefficient economic system and Russians who invented the thing at the end of the day didn&#x27;t want it either. So by this way of looking at it you have people like um Yuri Rushkov a genuine rocket scientist who says look the main reason for the</p>\n<p>collapse uh of the Soviet Union is the rottness of its system and then here&#x27;s a journalist Timura Chapanov who said look I think from the beginning the genes of disintegration were contained in the genetics of this governmental political formation. Don&#x27;t you love the products of the Soviet educational system? Uh don&#x27;t ever use wording like that. All right. So, you could argue that the Soviet Union was destined to to fail with this many problems. Others would come to the opposite conclusion. They would say, &quot;No, it took every [snorts] single one of them for the cold war to</p>\n<p>end on Western terms.&quot; And here&#x27;s back to Anatoli Kov uh Kovaleov, the deputy foreign minister. He said, &quot;Look, all these factors merge internal, ideological, economic, military, it&#x27;s all of them. You remove any one of them and you get a different outcome. Maybe the cold war ends but it might end completely differently. So by this line of reason the best were uh barely one should feel very fortunate that it did. One can take this last argument and say it was more than that. It also took the confluence and office of two very</p>\n<p>talented leaders. Helmet Cole of Germany and George Bush senior of the United States. not not the son who got in got into those forever wars, but the dad who didn&#x27;t. Uh George Bush Senior had one of the most amazing resumes of any president ever to um any any person to become president of the United States. Just look at him when he&#x27;s really young. He&#x27;s a a war hero in World War II. He&#x27;s a Navy pilot. Dangerous thing to do. He did it. And he comes back and he gets his BA at Yale and graduates with honors. And then he becomes a</p>\n<p>representative for this uh district in in Texas after he&#x27;s already made himself a millionaire by the oil business that he started. And then he come becomes ambassador to the UN followed by US representative to the PRC. It&#x27;s before we had formal diplomatic relations. So he&#x27;s the guy who&#x27;s setting that off. Becomes director of the CIA and then he is Ronald Reagan&#x27;s understudy for eight years as vice president. He is incredibly uh fit for the job and Helm Cole is equally fit for the job. He is the longest serving chancellor in uh</p>\n<p>German history since his illustrious predecessor Otto van Bismar. He uh starts out getting a PhD in history and political science. He also starts out in business, but then he works for state government, initially as a representative, then as a governor, and um he becomes chairman of his political party, the Christian Democratic Union, uh for a quarter of a century. Once he gets in, he decides he&#x27;s going to buy up East Germany, one tourist at a time. How does that work? East Germans turned out</p>\n<p>really like to travel. West Germans had always been able to travel to East Germany or they long had been able to travel to East Germany, but East Germans definitely could not uh easily travel to West Germany. Why? Because they have it a habit of staying. But all of a sudden, East Germany eases up on the travel regulations. And you might ask why? And the answer would be money. Just like the Poles, the East Germans were deep in an economic mess of their own making. would be tankman Eric Haniker who got the boot at the very end. Well, his uh uh staying</p>\n<p>in power paradigm that he implements in 1971 is going to be easily going to live off debt. He needs to make certain uh social benefits available and consumer benefits a available for labor uh stability, not having labor unrest. And the way he&#x27;s going to do that is he&#x27;s not going to do many in domestic investments and he&#x27;s going to do a lot of borrowing uh particularly from um West Germany. Well, that&#x27;s unsustainable long term. So, by the time you get to the end of the cold war, if he&#x27;s going</p>\n<p>to fix that and uh even out the accounts, it would be a 30% decline in East German standard of living. So, he really needs the pocket change from the tourists. So what uh Cole does is a brisk uh a g a brisk business of tourists and things. What he does in return for the uh easing of tra uh travel restrictions uh he pays East Germany several hundred million uh Deutsch marks extra to allow that to happen. And then he gets the Hungarians to go along. He gets the Hungarians to</p>\n<p>open up their Austrian border to let East Germans out that way. and he gives them a half a billion Deutsch marks for that little favor. And then uh when Cole introduces his 10-point unification program because now he&#x27;s thinking he&#x27;s going to get both Germanies together. Um this is when he starts doing out big bucks to the Soviet Union whose economy is unraveling and Gorbachev is going to be desperate for this cash as that&#x27;s happening. So um uh West Germany provides 100 million in food especially in meat for the Soviet Union that</p>\n<p>doesn&#x27;t have these things. Uh nevertheless these the unrest uh just keeps on going. The Berlin Wall, as I&#x27;ve told you, is breached. And then you wind up with a West German caretaker government and the financial situation in Russia itself is unraveling. And by the time you get to January 1990, Bush and Cole get together and they&#x27;ve decided they want to really fasttrack German reunification. Why? Because they got to get it done before this unraveling crisis uh that Gorbachov falls from power as a result of it. So,</p>\n<p>they are uh have got a a game going, the two of them. &gt;&gt; If you enjoyed this clip, you can watch the full episode here and subscribe for more clips. Thanks.</p>", "chapters_count": 0}