{"video_id": "YLvbRFu60Q8", "title": "Are space GPUs practical? – Elon Musk", "link": "https://www.youtube.com/watch?v=YLvbRFu60Q8", "published": "2026-02-08T21:30:09+00:00", "summary": "Full episode: https://www.youtube.com/watch?v=BYXbuik3dgA\nMe on twitter: https://x.com/dwarkesh_sp\n\nIn the full episode, John and I got to do a real deep-dive with Elon. We discuss the economics of orbital data centers, the difficulties of scaling power on Earth, what it would take to manufacture humanoids at high-volume in America, xAI’s business and alignment plans, DOGE, and much more.", "transcript_html": "<h2>Transcript</h2>\n<p>The total cost of ownership of a data center only 10 to 15% is energy and that&#x27;s the part you&#x27;re presumably saving by moving this into space. Most of it&#x27;s the GPUs. If they&#x27;re in space it&#x27;s hard to service them or you can&#x27;t service them and so the depreciation cycle goes down on them. So like it&#x27;s just way more expensive to have the GPUs in space presumably. What&#x27;s the reason to put them in space? &gt;&gt; Um well the availability of energy is the issue. Um so uh I mean if you look at at electrical output um outside of China everywhere outside of China it&#x27;s</p>\n<p>more or less flat. It&#x27;s very you know maybe a slight increase but for pretty close flat. China has a rapid increase in electrical output. But if you&#x27;re putting data centers anywhere except China where you going to get your electricity um especially as you scale uh the output of chips is growing um pretty much exponentially but the output of electricity is flat. So how you going to turn them chips on? um you know &gt;&gt; magical power sources, magical electricity fairies. &gt;&gt; You mean you&#x27;re famously a you&#x27;re famously a big fan of solar one terowatt of solar power. So with a 25% capacity</p>\n<p>factor like four terowatts of solar panels it&#x27;s like 1% of the land area of the United States and that&#x27;s like far in this you were in the singularity when we&#x27;ve got one terowatt of data centers right um so what are we running out of exactly &gt;&gt; how far into the singularity are you though &gt;&gt; you tell me &gt;&gt; yeah exactly so I think I think we&#x27;ll find we&#x27;re in the singularity and like okay we still got a long way to go &gt;&gt; but is this like a is the plan to like put it in the space after we&#x27;ve covered Nevada and solar panels &gt;&gt; I think it&#x27;s pretty hard to cover Nevada solar panels you have to get the permits from like the permits for try getting the permits for that.</p>\n<p>&gt;&gt; So space is really a reg it&#x27;s really a regulatory play. It&#x27;s like harder to harder to build on land than it is in space. &gt;&gt; It&#x27;s it&#x27;s harder to scale um on the ground than it is to scale in space. U but but also the the you&#x27;re going to get about five times the um effectiveness of solar panels in space versus the ground. And you don&#x27;t need batteries. Um I almost wore my other shirt which says it&#x27;s always sunny in space which it is. So um because you don&#x27;t have a dayight</p>\n<p>cycle or uh seasonality uh clouds uh or or an atmosphere in space uh because the atmosphere alone um uh results in about a 30% uh lo loss of energy. Um so uh so you&#x27;re going for any given uh solar panels can do about five times more uh power in space than on the ground and you avoid the cost of having batteries to carry you through the night. Um so it&#x27;s it&#x27;s actually much cheaper to do it in space. And I I my prediction is that</p>\n<p>um it will be by far the cheapest place to put uh AI will be space in 36 months or less. Maybe 3 months. &gt;&gt; 36 months. &gt;&gt; Less than 36 months. Um, how do you service GPUs as they fail, which happens quite often in training? &gt;&gt; Actually, it it it depends on how how recent the GPUs are that arrived. I mean, at this point, we found our GPUs to be quite reliable. Um, there&#x27;s infant mortality, which you can obviously iron out on the ground. Um, so you can just run them on the ground um and confirm that you don&#x27;t have info mortality with with the GPUs. But once they once they</p>\n<p>start working, their actual reliability and and once they start working and you&#x27;re past the initial, you know, debug cycle of Nvidia or whatever or or whoever is making the chips, um could be Tesla Tesla AI 6 chips or something like that or it could be, you know, TPUs or traniums or whatever. Um the uh the reliability is actually they&#x27;re quite reliable past certain point. Um so um I I don&#x27;t think I don&#x27;t think it you that the servicing thing is an issue. Um but you can mark my words. Uh in in 36</p>\n<p>months but probably closer to 30 months the the most economically compelling place to put AI will be space. Um and then and and and then it will get from it&#x27;ll it&#x27;ll then get like ridiculously better to be in space. Um and then the scaling uh the only place you can really scale is space. Um you know once you start thinking in terms of uh what percentage of the sun&#x27;s power are you harnessing uh you realize you have to go to space uh you can&#x27;t uh scale very very much on earth &gt;&gt; but by very much to be clear you&#x27;re</p>\n<p>talking like terowatts. &gt;&gt; Yeah. Um well all of the United States currently uses only half a terowatt of power on average. &gt;&gt; Yeah. &gt;&gt; Right. So, you know, if you say a terowatt, that would be twice as much electricity as the United States currently consumes. So, that&#x27;s quite a lot. And can you imagine building that many data centers? I that many power plants. &gt;&gt; It&#x27;s like those who have like lived in software land uh don&#x27;t realize they&#x27;re about to have a a hard lesson in hardware.</p>\n<p>uh that um there&#x27;s there&#x27;s it&#x27;s actually very difficult to build power plants and and then you don&#x27;t just need the you need power plants, you need all of the electrical equipment, you need the the electrical transformers to run the transformers, the AI transformers. Um now the utility industry is a very slow industry. They they are they they pretty much uh you know they impedance match to the to the government to the the public utility commission. Um, so they&#x27;re uh the impedance smash like literally figuratively. Um, so they&#x27;re very slow because the h their past has been very</p>\n<p>slow. Um, so trying to get them to move fast is like you know like if you&#x27;re trying to do an interconnect agreement with have you ever tried to do an internet interconnect agreement with a utility at scale like with a lot of power &gt;&gt; as a professional podcaster I can say that I have not in fact &gt;&gt; yeah they have to need many more views before that becomes an issue. &gt;&gt; They have to do a study for a year. Okay. at like a year later they they&#x27;ll come back to you with their interconnect study. &gt;&gt; Can&#x27;t you solve this with your own behind the meter power stuff? &gt;&gt; You can build power plants. &gt;&gt; Yeah,</p>\n<p>&gt;&gt; that&#x27;s what we did at XAI for classes to so for classes too. &gt;&gt; But so yeah, why grid? Why not just like build GPUs and power colloccated? &gt;&gt; That&#x27;s what we did. &gt;&gt; Right. Right. But I&#x27;m saying why isn&#x27;t this a generalized solution when you&#x27;re talking about all the issues? &gt;&gt; Where do you get the power plants from? &gt;&gt; I&#x27;m saying when you talk about all the issues working working with utilities, you can just build private power plants with the with the data centers. &gt;&gt; Right. But it begs the question of where do you get the power plants? Where do where do you get the power plants from? &gt;&gt; I mean &gt;&gt; the power plant makers. &gt;&gt; Oh, as you&#x27;re saying like there&#x27;s the gas turbine backlog basically. &gt;&gt; Yes. It you can drill down to a level further. It&#x27;s the it&#x27;s the the veins and</p>\n<p>blades in the turbines um that are the limiting factor because the the casting may it&#x27;s like a very specialized process to cast the blades and veins in the in the in the uh turbines you&#x27;re using gas power. Um and uh it&#x27;s very it&#x27;s very difficult to scale other other forms of power. You can scale potentially uh solar but but the the tariffs currently for importing solar in the US are gigantic and the domestic solar production is is pitiful. &gt;&gt; If you enjoyed this clip, you can watch the full episode here and subscribe for more clips. Thanks.</p>", "chapters_count": 0}