{"video_id": "FwLA4AcLIwM", "title": "Companies With Humans in the Loop Will Lose – Elon Musk", "link": "https://www.youtube.com/watch?v=FwLA4AcLIwM", "published": "2026-02-11T17:57:36+00:00", "summary": "Full episode: https://www.youtube.com/watch?v=BYXbuik3dgA\nMe on twitter: https://x.com/dwarkesh_sp\n\nIn the full episode, John and I got to do a real deep-dive with Elon. We discuss the economics of orbital data centers, the difficulties of scaling power on Earth, what it would take to manufacture humanoids at high-volume in America, xAI’s business and alignment plans, DOGE, and much more.", "transcript_html": "<h2>Transcript</h2>\n<p>So you&#x27;re expecting fully digital corporations rather than like SpaceX becomes part AI and I &gt;&gt; I think there&#x27;ll be digital corporations, but it looks some some of this is going to sound kind of doomerish, okay? But it I&#x27;m just I&#x27;m just saying what I think will happen. It&#x27;s not it&#x27;s not meant to be dumerish or anything else. Just just like this is what I think will happen. um is is that is that pure AI corporations that are purely AI and</p>\n<p>robotics uh will uh vastly outperform any corporations that have people in the loop. Um so you can you can think of say like like like computer used to be a a job that humans had that you you would go and get a job as a computer where you would do calculations. Um and they&#x27;d have like entire skyscrapers full of humans like you know 20 30 floors of of humans just doing calculations. Um now that entire uh skyscraper of humans doing calculations</p>\n<p>um can be replaced by a laptop with a spreadsheet. That spreadsheet can do um vastly more calculations than an entire building full of human computers. Um, so you can then think about, okay, well, what if only some of the cells in your some of the cells in your spreadsheet were uh calculated by humans? Actually, that that that would be much worse than if all of the cells in your spreadsheet were calculated by the computer. And so really what will happen is uh the pure AI, pure robotics</p>\n<p>um corporations or collectives will far outperform any corporations that have humans in the loop &gt;&gt; and this will happen very quickly. &gt;&gt; Speaking of closing the loop, sorry, Optimus. Um uh you I mean as far as like manufacturing targets and so forth go you your companies have sort of been like carrying American manufacturing of hard tech on their back but in the fields that you are um you know Tesla&#x27;s been dominant in you&#x27;re and now you want to</p>\n<p>go into humanoids in China there&#x27;s entire dozens and dozens of companies that are doing this kind of manufacturing cheaply and at scale uh and are incredibly competitive. So give us sort of like advice or a plan of how America can build the humanoid armies or you know the EVs etc at scale and as cheaply as as China is on track to. &gt;&gt; Well there there really only three hard things for human robots. Um the the real world intelligence</p>\n<p>um the the hand and scale manufacturing. Yeah. &gt;&gt; Um, so, uh, I haven&#x27;t seen any even demo robots that have a a a great hand like with all the degrees of freedom of a human hand, but Optimus will have that. &gt;&gt; If you enjoyed this clip, you can watch the full episode here and subscribe for more clips. Thanks.</p>", "chapters_count": 0}