{"video_id": "B17LBJJTFW4", "title": "How To *Finally* Log Off And Live More | Cal Newport", "link": "https://www.youtube.com/watch?v=B17LBJJTFW4", "published": "2026-01-01T11:45:02+00:00", "summary": "Cal Newport offers concrete advice to a caller struggling to face the world outside his devices.\n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\n0:00 How can I use my phone less if I struggle to know what to do when I put it down?\n2:00 YouTube shorts\n5:50  Moving through buckets\n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=B17LBJJTFW4\">https://www.youtube.com/watch?v=B17LBJJTFW4</a></p>\n<h2>How can I use my phone less if I struggle to know what to do when I put it down?</h2>\n<p>This is why the notion of the deep life has become I think so important. Yeah. Here&#x27;s the way I think about this. One way to think about this my book deep work I think one of the reasons why that book was popular is there was an issue that people were recognizing in the workplace which was we&#x27;re really pretty distracted. like I&#x27;m on email all the time and we&#x27;re running back and forth and I have all these projects and it seems very frenetic in work. This doesn&#x27;t seem great, right? Like I&#x27;m exhausted all the time and what am I really doing? And what Deep Work came in and said that book came in and</p>\n<p>said, &quot;Yeah, that this is a problem, but what I what I want to give you is a bigger better offer.&quot; Deep work as an alternative to shallow work that&#x27;s dominating your your day right now. The bigger better offer was more compelling. Oh, I see what I could be spending my this instead of being on email all day. I could be producing something really hard. Oh, I want to do that. Bigger, better offer, one out. In our current world with uh smartphone distraction, you&#x27;re constantly looking at this thing to pacify yourself. You need a bigger, better offer. That&#x27;s what we&#x27;re missing. We&#x27;re talking about be worried about Tik Tok. Be worried about Meta Vibes and</p>\n<p>Sora. Be worried about spending all your time yelling at people on X and mindlessly scrolling through uh auto recommendations on YouTube. What we&#x27;re missing in that discussion is the bigger better offer of what you should do next. Because you are absolutely right. Without that bigger, better offer, people say, &quot;I&#x27;ll take the devil I know because it&#x27;s kind of fun than the devil I don&#x27;t.&quot; Which is staring into the pit of existential despair. That&#x27;s exactly what was happening in the workplace. People are like, &quot;Yeah, we do send a lot of emails, but like what am I supposed to do instead? Just like sit here?&quot; They needed a bigger, better offer. This is where the</p>\n<p>deep work enters the picture. I don&#x27;t think we can deal with the issues of phones and non-professional technology use without giving people a vision of how to make their life so interesting and intentional autonomous and meaning producing that the idea of looking at YouTube shorts all day is nonsensical to them like why would I do that I have</p>\n<h2>YouTube shorts</h2>\n<p>this other stuff that&#x27;s so much more important and so I say this in part to point out a problem in our current discussion about technology and meaning I say this in part as a way to have empathy if you&#x27;re struggling to put down your phone like you&#x27;re talking out with your friends. This is not some moral flaw you have. This is not a lack of will or discipline. It is probably a really rational calculus on the on the uh part of your mind. I saying we don&#x27;t have anything else to go to. So, I&#x27;d rather be here. It&#x27;s it&#x27;s it&#x27;s I&#x27;d rather be</p>\n<p>here than staring into the pit. Just like late 19th century in the leadup to prohibition. Well, I&#x27;d rather be at the bar with like my friends, like something to do than just be, you know, at the old turf house, you know, pioneer house, just depressed, right? You have to have a bigger, better offer. So, that&#x27;s where the deep life comes in. Now, I do have this whole book, but it&#x27;s going to be a year. Uh, so let&#x27;s like get to some key principles right away. Like, what you need to do is you need to fix a a contingent vision of your ideal lifestyle. I say contingent so you don&#x27;t feel like you have to get this right from day one. Good enough for now. What</p>\n<p>do I want my daily life to actually be like? This has to cover multiple areas. On the show, we often call these buckets. You can&#x27;t just focus on your job. You can&#x27;t just focus on a single hobby. You got to cover all of the areas of your life and be able to describe in each what you want that part of your life to be like. Two, these descriptions can&#x27;t be concrete. I want to have this job and live in this town. That&#x27;s not a lifestyle vision. That&#x27;s a goals. So describe what you want in each of these different areas in terms of first-person declarative properties. I live in a a city that&#x27;s high energy. My job is one</p>\n<p>in which um I can be done with work by five and it&#x27;s not a big deal, right? Like it&#x27;s not dominating my time. You&#x27;re describing the properties of the different areas of your life. That&#x27;s your lifestyle vision. Buckets plus properties. Now, the whole goal is how do I try to get closer to those visions in each of these buckets given the particular obstacles I face and the particular opportunities I have. I&#x27;m not going to start from scratch, but I want to navigate around specific obstacles. Oh, living in this city makes all these things really hard. Well, how do I get out of this city? Oh god, if I could do this, this, this, and this, we could move and that&#x27;s going to make these</p>\n<p>other things better. Or I am a computer programmer. How can I use that? That that&#x27;s a valuable skill. Where could I go with that in a way that&#x27;s going to let me get closer to bucket A, B, and C? And then this becomes the main wheel cyclical process of lifestyle ccentric planning. How do I move closer to these uh visions in these buckets? Repeat, repeat, repeat. And I suggest going bucket by bucket. Let&#x27;s spend a month just working on the constitution bucket. The bucket about our physical health. Let&#x27;s do some one-time goals and get in place some new practices and feel good about that. Okay. Now, let&#x27;s move on to the next bucket.</p>\n<p>All right. Now, we&#x27;re dealing with craft like my job. Not going to solve it all now, but I have this lifestyle vision for what what I want these properties. I want my job. I want to spend a month or two make getting closer to that. Finishing some project that builds up a career capital store that might be useful in the future. Changing up my practices so that I&#x27;m not so distracted and my work has less of a footprint on my life. And you move through each of your buckets and repeat and repeat. And at least once a year on your birthday, go back and make sure those properties are right. That is the rhythm for building a deep life. It&#x27;s not done with one radical change. It&#x27;s not something that&#x27;s going to happen in two weeks, but it it&#x27;s going to be a creative like it&#x27;s</p>\n<p>going to get better as you move closer to that ideal lifestyle vision. You&#x27;re going to feel more self-efficacious, meaning you feel like you have the ability to actually uh produce positive change in your life. You&#x27;re going to feel more autonomous. And now the distraction merchants are going to seem more superolous. And now suddenly what used to be your lifeline, your pacifier is going to seem sort of trit. It&#x27;s going to seem kind of embarrassing. You&#x27;ve got stuff you got to do. You don&#x27;t need to be looking at a video of Abraham Lincoln, you know, break dancing. I got real stuff I got to do. I&#x27;m imshed in a real community that</p>\n<h2>Moving through buckets</h2>\n<p>I&#x27;m taking a leadership role in. I don&#x27;t care about the fight happening on Twitter about some nonsense. Right? This is the type of thing that begins to happen as you begin the cycle of moving closer to deep life. So, I want to end on this question because I think as we enter the new year, the week after you hear this episode, think about the deep life as your bigger better offer for all this other stuff that&#x27;s occupying your time. And suddenly that challenge of of getting away from the sort of Zuckerbergs and Altman&#x27;s of the world becomes a lot less uh something that is scary or seeming</p>\n<p>impossible and something that&#x27;ll instead begin to seem inevitable. Hey, if you like this video, I think you&#x27;ll really like this one as well. Check it out.</p>", "chapters_count": 3}