{"video_id": "HnzbIL-huR4", "title": "Companies applying emerging technologies to lesser known frontiers", "link": "https://www.youtube.com/watch?v=HnzbIL-huR4", "published": "2025-12-17T22:21:56+00:00", "summary": "Our users are bringing new technology, standards, and opportunity to every industry. We spoke with Lucid Bots, who save lives by building cleaning robots, or Archistar, who are using AI to speed up property planning applications by 50%, or Katalyst, who build fitness techwear that intensifies your training 6x. We also spoke to pioneers in their industries like Playdate, Atomic Industries, Light, Sorcerer, and Masquerade, who are innovating in some of the lesser known frontiers.", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=HnzbIL-huR4\">https://www.youtube.com/watch?v=HnzbIL-huR4</a></p>\n<h2>Transcript</h2>\n<p>In the year 2025 Playdate is very different than anything else that exists out there. Video game hardware projects? Kind of uncharted territory. Rocketry and aerospace engineering became a thing. Why did we not elevate manufacturing to that same plane of existence? The skill that we needed to actually make things is almost completely depleted. What we&#x27;re trying to do here is actually preserve very precious trade skill and ultimately scale it. There&#x27;s not a lot of software being developed around power and utilities. We&#x27;re hoping to build the tools and the critical infrastructure</p>\n<p>that the entire grid needs in order to operate in this new world. This is a unique product that doesn&#x27;t really fit into any existing category. In 20 minutes you&#x27;re getting a workout that&#x27;s like two hours of an intense gym workout. It&#x27;s doing the workout to my body and that&#x27;s really different from anything I&#x27;ve seen over the last 40 years. When people talk about permitting, it sounds simple. Design your building. Get your permit. Proceed. In reality, that permitting process can take longer than actually building the house. We built the Archistar platform to generate building designs</p>\n<p>that comply with the local city rules. And that has never happened before. Every four days somebody passes away cleaning a building in the United States. So we started with building a drone that can clean buildings. We&#x27;ve had to solve problems that others haven&#x27;t addressed. How do we get a drone to fly with stability in the most complicated environments where most drones quite simply can&#x27;t? Weather forecasting was one of the first fundamental problems that humans have tried to solve with technology. The ways in which we collect that data hasn’t changed much since the eighties. Masquerade is an original show inspired by Phantom of the Opera</p>\n<p>but in a way you&#x27;ve never experienced it before. We invented technology for this show. The way the microphones are triggered across six floors, across six casts, the cueing of all the music. It&#x27;s so madly technical, and yet it&#x27;s all designed to feel like it&#x27;s just happening. About 80% of the world lacks accurate weather information. In El Salvador, a one-day forecast is about as accurate as a seven-day forecast in Florida. We can launch the Sorcerer weather balloon from San Francisco and navigate them to pretty much anywhere in the world.</p>\n<p>They float for months collecting thousands of times more data. This is the first time in history that something like this has been possible. I can&#x27;t really think of anyone that has tried a new platform with its own SDK and its own everything. There&#x27;s something super special about putting that game on a thing that you&#x27;re holding in your hands. It&#x27;s like, oh my God, I made a console game. Price of power is incredibly volatile. Power prices will put cryptocurrency to shame. Explaining to customers is really difficult. Talking to devices is very simple. We can talk to an EV</p>\n<p>or talk to a home battery tell it when to use power, when not to. We&#x27;re shifting power consumption to when it&#x27;s abundant, cheap, and renewable. Classically we&#x27;re very trapped in a mindset where manufacturing is just cost optimization for everything. I can save a penny here, a nickel here. And ultimately nobody is thinking about, if I could just make my entire product 10 times faster how much is that worth? We&#x27;re here in the LA office to help the recovery for the wildfires. There are 12,000 homes that were burnt. What Archistar is doing</p>\n<p>with technology is getting those permits out the door. So that we can build faster. It is saving applicants 50% of the time to get a permit through. Not being in the Broadway arena was critical to the innovation that we were allowed to even entertain in our minds. You are literally like this in our show. You are literally a foot away from these Broadway singers pouring out their hearts right next to you. This is truly frontier technology. We&#x27;re tethered by a hose to the ground. So every foot I go up in height is a</p>\n<p>different weight profile. I need to be able to counteract high flow rates, pressures up to 4,000 PSI. You can go into an EMS studio and you&#x27;ll see people standing in a squat attached by a wire to a very complicated-looking control panel. What we&#x27;ve done with Katalyst is we&#x27;ve incorporated that all into a self-contained suit with an impulse pack that connects wirelessly to an app for home consumers. Every aspect of the suit, is tested by the FDA to be sure that everything&#x27;s engaging the muscles precisely when you need it. When we think about growing</p>\n<p>at an exponential pace, Stripe&#x27;s a really important part of that equation for us. We use Stripe Atlas to rapidly set up a US entity. We use Stripe We use so many Stripe products at this point. Stripe Connect to enable Playdate Catalog, Stripe Tax, Atlas, Stripe Terminal when we go to trade shows, definitely Stripe power users at this point. Is there a record for number of services used by a company? Because if there is we will shoot for the stars.</p>", "chapters_count": 0}