{"video_id": "_EjN9ejoxR8", "title": "The Financial Weapon That Unified Germany – Sarah Paine", "link": "https://www.youtube.com/watch?v=_EjN9ejoxR8", "published": "2026-01-17T21:06:00+00:00", "summary": "Full episode: https://www.youtube.com/watch?v=FdkpWrlR5zg\nMe on twitter: https://x.com/dwarkesh_sp\n\nFinal Sarah Paine lecture: Why Russia lost the Cold War.\n\nTo me, the most interesting question is not why the Soviet Union ultimately collapsed - it's how a brutal, centrally planned, stupendously inefficient, colonial land empire survived for so long.\n\nI was surprised to learn about the central role that oil played in sustaining (and eventually dissolving) the Soviet Union.\n\nBy the 1950s, the Soviet system was in a crisis. Soviet growth rates had started to slow significantly as compared to the booming West. USSR's heavy-industry based economy was energy-starved. The 1953 CIA-backed coup in Iran blocked Soviet access to Iranian oil.", "transcript_html": "<h2>Transcript</h2>\n<p>Bush and Cole get together and they&#x27;ve decided they want to really fasttrack German reunification. Why? Because they got to get it done before this unraveling crisis uh that Gorbachev falls from power as a result of it. So they are uh have got a a game going, the two of them, and it&#x27;s complicated. And here&#x27;s why. Uh Gorbachev was dead against uh Germany, a united Germany in NATO. He&#x27;s not keen about really a United Germany, let alone one in NATO. The US State Department experts, the guys who know everything are saying,</p>\n<p>&quot;No, no, no. You want to go slow on this unification business.&quot; Uh, and then uh Cole is running a coalition government. There are people in that government he cannot fire who are because they&#x27;re from different uh political parties. One of them is his foreign minister, this guy Genture, who is very skeptical about Germany being part of NATO. And then it turns out although Britain had talked a good peace during the cold war, it didn&#x27;t actually want a unified Germany, nor did France. Why? Because that uh unified Germany would eclipse theirs economically. They didn&#x27;t want that to</p>\n<p>happen. So Cole and Bush divide up the tasks. Cole is going to re reassure the Soviet Union that Germanyy&#x27;s not going to be bur or do horrible things. And Cole&#x27;s going to work on the financial unification because the Soviets are thinking in terms of military unification. You know, where you deploy your troops, that determines things. Uh-uh. Wrong instrument of national power. Uh precisely because the Soviets didn&#x27;t understand finance. That&#x27;s why they&#x27;re in such a mess. Whereas the Germans do, what they&#x27;re going to do is get East Germany on the West German Deutschmark. And at that point, they</p>\n<p>will control all the money and they will control decisions. But the Russians aren&#x27;t going to see that coming. Meanwhile, Bush is supposed to work uh the alliances with uh particularly Britain and France in the west. There are all sorts of meetings that were coming up and Bush&#x27;s job is to de delay those meetings for as long as possible so German unification can proceed as far as possible. And the two of them are doing a tag team diplomacy with Gorbachov that he just can&#x27;t keep up with with given that uh his own home economy is got this doubledigit uh</p>\n<p>shrinkage rates. So here&#x27;s how they go. As the trades get bigger, the amount of money you pay Gorbachev gets bigger. So first of all, it&#x27;s just to get a a unified Germany. Then it&#x27;s to get a unified Germany with West Germany still in NATO. Then it&#x27;s to get unified Germany with all of Germany in NATO. So here&#x27;s how the money goes. Gorbachev agrees to German unification. We are no longer paying hundreds of millions of Deutsch mark. We&#x27;re paying billions of Deutsch mark. Five billion do uh Deutsch mark for that one. Then Gorbachov agrees</p>\n<p>that states can choose their own alliances i.e. whether or not to join NATO. And then he gets the US offers nine assurance but he it&#x27;s also a trade agreement that Gorbachoff really wants. And then the economic union goes into effect. So we&#x27;ve now done the financial reunification of Germany. And this is when London, there&#x27;s a London declaration that&#x27;s inviting Eastern European countries to coordinate more closely with NATO. And then in return, Gorbachev has got a promise of a G7 summit meeting that&#x27;s going to fasttrack</p>\n<p>aid to him, which it will do. And then Gorbachov agrees to German NATO membership. And at this point, big even bigger things are happening. Germanyy&#x27;s going to agree to its B uh border with Poland. I&#x27;ll get there and explain. And Germany provides 15 billion in Deutsch Mark, including building all kinds of new apartment buildings for repatriated Soviet soldiers who are going home. Why are you doing that? Because you want those soldiers focused on buying furniture, not running a military coup. That&#x27;s what they&#x27;re doing. So, uh, the unification happens in midepptember 1990. If you enjoyed this clip, you can</p>\n<p>watch the full episode here and subscribe for more clips.</p>", "chapters_count": 0}