{"video_id": "Q_eiboafxTU", "title": "The Cold War Ended in Iraq – Sarah Paine", "link": "https://www.youtube.com/watch?v=Q_eiboafxTU", "published": "2026-01-18T20:48:39+00:00", "summary": "Full episode: https://www.youtube.com/watch?v=FdkpWrlR5zg\nMe on twitter: https://x.com/dwarkesh_sp\n\nFinal Sarah Paine lecture: Why Russia lost the Cold War.\n\nTo me, the most interesting question is not why the Soviet Union ultimately collapsed - it's how a brutal, centrally planned, stupendously inefficient, colonial land empire survived for so long.\n\nI was surprised to learn about the central role that oil played in sustaining (and eventually dissolving) the Soviet Union.\n\nBy the 1950s, the Soviet system was in a crisis. Soviet growth rates had started to slow significantly as compared to the booming West. USSR's heavy-industry based economy was energy-starved. The 1953 CIA-backed coup in Iran blocked Soviet access to Iranian oil.", "transcript_html": "<p><strong>[00:00]</strong></p>\n<p>And here's the Polish borders. At the end of World War II, Stalin moved Poland 200 kilometers to the west and it winds up taking a third of German territory by the time that's all over. And so the Germans uh don't really want to sign all that away. And in addition, as part of that, there were 12 million German refugees who were thrown out of wherever they were living to send them back to Germany, of whom 2 million died. So this is a big deal and it's in living memory. Germany agrees to this that the borders are done. German B Polish uh borders are</p>\n<p>set. Complicating factor a month and a half before this unification treaty is signed, Sodom Hussein decides he's going to invade Kuwait because he's broke because he's had a long war with Iran, huge debts, many owed to Kuwait, which he doesn't want to pay back. So if you invade them, that solves that problem. and also he would take over uh Kuwait's very rich oil fields and together that would make Iraq probably the swing producer of oil. So he thinks that's a</p>\n<p>great idea except uh the cold war's over actually and the Russians are more than willing to cooperate with the United States. Gorbachev really needs more money and he is willing to go along with Iraq out of Kuwait, but not with regime change in Iraq because think about it. Iraq is a very important creditor state to the Soviet Union. It owed them between 10 and 13 billion. That's a lot of money for a broke creditor. But Gorbachev is being extraordinarily</p>\n<p>cooperative with Bush Senior. He sends Agenei uh Primacov on multiple missions to Baghdad. The first one, Primikov gets all Russian hostages out of um Iraq and then on the second trip he gets all Westerners out, Americans included. Third trip, not so lucky. He's there for the for the coalition force bombing. I don't think he liked that very much. Um but imagine that bombing going on if there were Western human shields going down with every target. Russia took that</p>\n<p>card right off the table. And here's some of the reasoning. Sergey Tarosenko was an aid to foreign minister Chevrona and um they understood that the United States was going to do something about this invasion of of Kuwait and uh so the Russians thought it'll be better if we force all of this to go through the UN where Russia has a veto power and he said look um there was a division of</p>\n<p>roles it extends to China the help that Russia provided Uh when the Americans asked us to work with the Chinese, we told the Chinese, think about it. You're one of the big five with veto player. Doesn't it suit your interest to funnel everything through the UN where you can put your foot down? And the Chinese came around to that idea. Um however, the Russians had red lines and here's</p>\n<p><strong>[03:00]</strong></p>\n<p>Anatoli Kovald again, the deputy foreign ministry. The red line is American troops stay out of Iraq. No regime change in Iraq. You do that and you will tank termination of the coal uh coal war and that would be the goal of the the uh the goal. Here's Kovale off saying I advance the basic principle that we must support the territorial integrity of Iraq. This was our sacred position. Uh but we uh must not permit a division of Iraq. So if you wonder why the ground war ended after</p>\n<p>100 hours, this is it. that um the the the big thing out there is war termination of the Cold War. That's the big thing. Saddam uh is saying Hussein is a minor event over there. Sorry, but he was. If you enjoyed this clip, you can watch the full episode here and subscribe for more clips. Thanks.</p>"}