{"video_id": "gJ8pa9NiWm4", "title": "Was 2025 A Good Or Bad Year for AI? (Cal Newport and Ed Zitron Break it Down) | Cal Newport", "link": "https://www.youtube.com/watch?v=gJ8pa9NiWm4", "published": "2026-01-05T11:01:26+00:00", "summary": "Cal Newport talks with Ed Zitron to judge if 2025 was a good or bad year for AI in episode 386 of the Deep Questions podcast. \n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\n2025 was a year that was saturated in AI news, from Deep Seek, through claims of economic “blood baths,” to to GPT-5, Sora, and Chatbot girlfriends. Frankly, it was exhausting. As we now look back on 2025 an interesting question arises: all in all, did this end up being a good or bad year for AI? To help me answer this question, I’m joined by hard-hitting AI commentator Ed Zitron, who's been everywhere in the media in recent months helping to make sense of the wild claims being thrown in the general public’s direction. Together we go through the biggest AI stories of the year to try to make sense of what just happened. \n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\nLinks:\nGet a signed copy of Cal’s “Slow Productivity” at https://peoplesbooktakoma.com/event/cal-newport/ \nCal’s monthly book directory: bramses.notion.site/059db2641def4a88988b4d2cee4657ba?\nhttps://www.bbc.com/news/articles/c5yv5976z9po\nhttp://www.axios.com/2025/01/23/davos-2025-ai-agents\nhttps://blog.google/technology/google-deepmind/gemini-model-updates-february-2025/\nhttps://openai.com/index/sora/\nhttps://openai.com/index/introducing-gpt-4-5/\nhttps://ai-2027.com/\nhttps://fortune.com/2025/05/28/anthropic-ceo-warning-ai-job-loss/\nhttps://www.media.mit.edu/publications/your-brain-on-chatgpt/\nhttps://www.usatoday.com/story/tech/2025/08/07/chat-gpt-5-release-date-open-ai/85566627007/#:~:text=GPT%2D5%20release%20date,release%20date%20for%20Part%202\nhttps://www.newyorker.com/culture/open-questions/what-if-ai-doesnt-get-much-better-than-this\nhttps://www.wsj.com/tech/ai/ai-bubble-building-spree-55ee6128\nhttps://nvidianews.nvidia.com/news/openai-and-nvidia-announce-strategic-partnership-to-deploy-10gw-of-nvidia-systems\nhttps://www.nytimes.com/2025/10/02/technology/openai-sora-video-app.html\nhttps://www.anthropic.com/news/claude-opus-4-5\nhttps://www.ft.com/content/064bbca0-1cb2-45ab-85f4-25fdfc318d89 \nhttps://www.youtube.com/watch?v=Z_WEmjygNK0\n\nThanks to our Sponsors: \n\nThis episode is sponsored by Better Help:\nhttps://www.betterhelp.com/deepquestions\nhttps://www.reclaim.ai/cal\nhttps://www.expressvpn.com/deep\nhttps://www.calderalab.com/deep\n\n\n0:00 Cal talks about AI\n3:03 Interview with Ed Zitron\n1:58:05 Cal Reacts to Comments\n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<h2>Cal talks about AI</h2>\n<p>So much happened in the world of AI in 2025 that it can actually be hard to keep track of it all. I mean, remember Deepseek? That was in 2025. as was Dario Amade saying that we were going to lose half of white collar jobs to AI as well as GPT5&#x27;s release the release of Sora AI looking like the best investment ever followed by AI being described as a giant bubble that was going to bring down the economy followed by that bubble being described as actually not being so bad. This was also the year where Nvidia CEO Jensen Wong</p>\n<p>took the stage in a conference wearing a jacket that well, I&#x27;ll be honest. Uh, looks like it came from the prop department from a Mad Max movie. Jesse, let&#x27;s put this on the screen here. I mean, dude, you&#x27;re a computer scientist. You&#x27;re in a racer jacket. I love it. I&#x27;m here for it. What I&#x27;m trying to say is a lot happened in the world of AI in the year that just ended. And the key question that I&#x27;ve been grappling with is did this year end up being a great year for AI or a terrible one? I would believe either answer and so much</p>\n<p>happened. It could be really hard to try to keep it all straight. So here&#x27;s what we&#x27;re going to do today. We&#x27;re going to try to get an answer to that query. To help me in these efforts, I&#x27;ve invited to join me Ed Zitron. I I think one of the the big missed stories of AI in 2025 is Zitron himself who hosts the better offline podcast and writes the where&#x27;s your eds at Substack. Uh he rose to become I think one of the more uh informed and important AI commentators out there. The secret to Ed success is pretty simple. He just does his homework. Like he actually talks to sources. He talks to reporters. He reads</p>\n<p>earning reports. He gets leaked information. He talks to people within these companies. He puts together the pieces. old-fashioned shoe leather reporting on what&#x27;s actually happening with these businesses as opposed to reporting on the stories these businesses are telling about what their technology may or may not do. My honest opinion or at least my humble opinion, I think he&#x27;s probably the most important AI commentator that you haven&#x27;t yet heard about. And so Ed is going to join me and what we&#x27;ve done is we&#x27;ve pulled the biggest AI stories of 2025, one per month for the entire year. We&#x27;re going to go through them in order and Ed</p>\n<p>is going to help us make sense of what was going on behind the scenes and what these stories actually mean for the AI industry writ large. We&#x27;ll end up with a conclusion of just how good or bad this year actually was for AI technology. So by the time that we are done with this episode, you will be more or less fully up to speed with where we are at this moment in the world of AI and what is likely to happen in the near future. All right, so let&#x27;s get into this episode. As always, I&#x27;m Cal Newport and this is Deep Questions. Today&#x27;s episode, was</p>\n<p>2025 a great year or a terrible year for AI? And we&#x27;ll get right into this after the music. [music]</p>\n<h2>Interview with Ed Zitron</h2>\n<p>All right, so Ed, we got a lot to figure out. Um, I got to point out something first, though. Okay. &gt;&gt; I This is something I don&#x27;t normally do, but for those who are watching, I put on a jacket. &gt;&gt; Nice. &gt;&gt; To try [music] to uh compensate for your English accent. &gt;&gt; A jacket for the British. &gt;&gt; I think it&#x27;s going to make me look a little bit more uh scholarly and arudite. That&#x27;s my That That was my strategy. &gt;&gt; I&#x27;m I&#x27;m wearing a sweater that I&#x27;ve worn once and I&#x27;m like, I guess I&#x27;m warm, but I look weird. But it&#x27;s fine. That&#x27;s That&#x27;s my bit. &gt;&gt; Yeah. But you sound You know, but it sounds</p>\n<p>&gt;&gt; I sound British and I can&#x27;t hide that. &gt;&gt; Yes. And so that that gives you an advantage on me. But I think my my blazer will kind of balance it out. But yeah, the fact &gt;&gt; I think we should be good. &gt;&gt; You&#x27;re wearing a you&#x27;re wearing a sweater in it in Las Vegas though. So that is that should take. &gt;&gt; It gets cold here. It gets cold here sometimes. &gt;&gt; I don&#x27;t believe I went once in July. I&#x27;ll never believe anything. &gt;&gt; Yeah. Okay. That I can understand that. &gt;&gt; All right. So we&#x27;re going to try to figure out what the hell happened in 2025. Right. It&#x27;s you and I both were covering AI in that year. It felt like all the things happened. &gt;&gt; Yeah. There was no quiet period in that</p>\n<p>year from the AI front. And so what I wanted to do is uh go through month by month and hit some of the big &gt;&gt; headlines &gt;&gt; and you and I will try to figure out what was that. Was that good news or bad news for AI? What actually happened? So it&#x27;s going to be like a trip down a sort of frustrating memory lane. All right, let&#x27;s start in January. I actually forgot that this was in 2025. I thought it was earlier. Man, it was a long year. All right, in January we get uh Deep Seek. Deep Seek. &gt;&gt; Here is Deepseek, the Chinese AI app that has the world talking. Let me read the first sentence of a BBC article from</p>\n<p>that period. Deepseek, a Chinese artificial intelligence startup, made headlines worldwide after it topped ad download charts and caused US tech stocks to sink. In January, it released its latest model, Deepseek R1, which uh it said rival technology developed by chat GPT maker Open AIs and its capabilities while costing far less to create. This was like a huge deal that no one talks about anymore. Uh, explain to my listeners what the hell is Deepseek? &gt;&gt; So, Deep Seek was a really interesting one. I remember I was on a plane. I was I was just it was I just got started to</p>\n<p>move back to New York and such like I spend a lot of time there and I remember reading about this thing and what it was was that it was a model that was trained for less money than other American models. So, American models that cost like $50, $100 million or more to train. Deep Seek apparently cost $5.3 million, I think, to train. It&#x27;s really weird because it spooked the entire market. Like, everyone freaked out. And I remember &gt;&gt; I remember thinking this is an obtuse story to freak people out. &gt;&gt; Like, it was just like even trying to</p>\n<p>explain cuz I did like a a lot of media at the time. I was explaining it to people. I was shocked that people even had any interest in model training. But the big thing that spooked people was it was kind of the thing that shown a spotlight on the Nvidia problem, which is that Nvidia is like the only company really making money in this era or and I think that people started to realize, oh crap, our entire stock market is based on that. And it also made it clear that all the American model companies don&#x27;t really give a crap about any kind of efficiency or anything. And the reaction</p>\n<p>to it was great. Sam Orman suggested we ban it. That was my favorite bit. They were like, &quot;Ah, yeah, the sneaky Chinese are gonna It&#x27;s because they might be able to um see inside things. We can&#x27;t possibly trust them.&quot; What was really good as well was part of the I literally was just reading about this yesterday. Part of what was funny about it was part of OpenAI&#x27;s complaint was, &quot;Yeah, they might do IP theft.&quot; It&#x27;s like, &quot;No, we only let American large language models do that. We couldn&#x27;t possibly have the Chinese take away our our plagiarism machines. No.</p>\n<p>And what was great &gt;&gt; world leaders and plagiarism. Yeah, &gt;&gt; exactly. We can&#x27;t have the Chinese steal our things. That&#x27;s our job. But what was also interesting was they were like, should we sue them? Because there&#x27;s a process called distillation where you basically take another models outputs and you use them to train another model. That&#x27;s a very truncated version. And it was you they used chat GPT outputs to train DeepSeek and that made people pissy. The other thing was was it was a reasoning model the R1 model and OpenAI had at the time only been out for a few months with its reasoning model 01 I</p>\n<p>think it was. &gt;&gt; Yeah, that was a December 2024 release. &gt;&gt; I think it was September &gt;&gt; or September. Okay. &gt;&gt; Yeah, it was September because it was the runup to that was this whole thing. People like, &quot;Oh, it&#x27;s called Qstar. It&#x27;s called Strawberry. It&#x27;s going to change everything.&quot; It didn&#x27;t change anything. It really it actually it did change something. Reasoning models gave them more excuses to burn AI compute. But yeah, this whole thing it was great for me. I did a bunch of media hits about it. But it was peculiar because it was like quite a nuance story and then you saw all of this xenophobic stuff being like, &quot;Oh, oh well the the Chinese</p>\n<p>are they&#x27;re lying. They&#x27;re lying.&quot; They put out a paper about this. They showed people how it was done because they trained. They had to find a cheaper way to train because they only had they had I think I forget maybe they had 8 800 chips. They had quite old GPUs. And the the thing is it wouldn&#x27;t talk about TNM and Square and people were like oh look this is proof that it&#x27;s bad. It&#x27;s like yeah that it is bad. It does that but are you shocked that something that came out of China had censorship? &gt;&gt; Yeah. But it was Yeah. Go on. &gt;&gt; What&#x27;s what&#x27;s amazing about the story though is it went away. Yes. Like I mean all the points you&#x27;re talking about are</p>\n<p>fair points and and like the biggest destabilizing point for the industry was this idea of you don&#x27;t need the very largest data centers. You don&#x27;t need like the custom AC Microsoft 40,000 GPU data centers to build really useful language model based AI. &gt;&gt; But those big companies are dependent on the idea that only they can do it. And so it was almost like people didn&#x27;t &gt;&gt; want that to be true. But we just forgot about &gt;&gt; Yeah, we memoryhold this bad because at the time it was like surely because I got asked quite a lot like OpenAI surely</p>\n<p>they&#x27;re going to make a cheaper model now. &gt;&gt; They didn&#x27;t. &gt;&gt; Anthropic, right? Because they if they if they said that that was possible, if their idea was we&#x27;re now going to spend 5 million versus 100 million on this, they would then have very little justification for raising so much money. &gt;&gt; But what about like the nano models? But then it didn&#x27;t then open AI thing is &gt;&gt; they have some cheaper to use models &gt;&gt; cheaper to use and that&#x27;s the thing people love to use this as proof that the cost of inference is coming down. So inference being how an output is done &gt;&gt; and they&#x27;re like well the models are</p>\n<p>cheaper. It&#x27;s like yeah if you sell something cheaper it&#x27;s now cheaper for someone to buy. There&#x27;s no proof that that&#x27;s actually cheaper to run and indeed it would have been so easy for them to just say actually this is a cheaper model. It costs this much. The fact they didn&#x27;t means that it&#x27;s still unprofitable, which is crazy. But the thing is, even DeepSeek&#x27;s models aren&#x27;t profit. Like, no one proved that they&#x27;re profitable to run. And so, but I think everyone memoryholed it because &gt;&gt; they I don&#x27;t know. I think the media just was willing to &gt;&gt; that there was this just a narrative</p>\n<p>that they could just &gt;&gt; get rid of. the the Chinese angle must have made a difference because yeah to me an even bigger story which I didn&#x27;t really know till talking to a source at the end of um 2025 the biggest story that&#x27;s not being talked about is if you look at coding agents and you look at cursor in particular to me the big economic story was the fact that cursor at some point quietly just said we&#x27;re going to train our own model we don&#x27;t need a frontier we don&#x27;t need a frontier model we&#x27;ll start with open source weights and train them themselves now whether or not that model is profitable for them I think They&#x27;ve been working</p>\n<p>has been working on their own models forever. &gt;&gt; Yeah. &gt;&gt; Ever and ever. Maybe the reason they they raised $2.3 billion. So maybe the plan is for them to train their own one. &gt;&gt; But it&#x27;s they also there was a story back in September that Tom Dan over at Newcomer. Apparently someone said that um Curser is sending 100% of their revenue to Anthropic. &gt;&gt; So they&#x27;re still they&#x27;re one of Anthropic&#x27;s largest customers. So it&#x27;s &gt;&gt; I see &gt;&gt; it&#x27;s really interesting though that they&#x27;re trying and they&#x27;ve gone very hard on composer and things like that.</p>\n<p>So maybe they are trying that for real now. Maybe I mean they&#x27;re capitalized but the question is to what end is it more profitable because if it ends up just being unprofitable and they don&#x27;t pay anthropic that would also be very funny. &gt;&gt; No I mean I think the future has to be and we we again that&#x27;s more later if we need to. I think the future is really going to be small models, models that fit on on machine, right? The only thing that&#x27;s profitable is I&#x27;m not spending any dollars to run inference because this two billion parameter model, which is only really trained to do the very narrow thing I needed to do, which is like understand your spreadsheet program</p>\n<p>and help you do it. Can run on your phone. It can run on your chip. You&#x27;re paying for the electricity. Like that&#x27;s got to be the only way that this is profitable. But those companies cannot be large companies. Now you have a you have 10,000 smaller companies instead of open AAI as the new Microsoft. &gt;&gt; Yeah. I I also think the small language model stuff because small language model is just a large language model with less parameters and while it is possible to do edge I just wonder how useful those edge like you can run on device but how long does it take to run a device? Uh there what Nvidia put out something</p>\n<p>called DGX Spark Box thing that can run large language models. The question is at the end of all this is is it worth it? Like is spending maybe it is worth three grand, 12 grand, whatever for one of these machines, but the companies building these models are not optimizing for that. They&#x27;re not building models with that in mind. Nvidia has built that box so they have something else to sell. It&#x27;s been in the works for a while, but it&#x27;s like we don&#x27;t no one I I can&#x27;t find anyone who has run client side who has used it like in that manner who&#x27;s like,</p>\n<p>&quot;Oh, I do all my coding, but I do an ondevice one.&quot; I&#x27;m sure they exist, but the fact there isn&#x27;t a growing community of that suggests that that might not be viable either, but I think any future large language models will have to be on device. It&#x27;s just the question is does that happen at any kind of scale? &gt;&gt; Yeah. All right. So other thing in January was agents. Uh I tracked this down recently. This is when &gt;&gt; the chief product officer of OpenAI uh said the quote that then got translated by Axios into 2025 is the year of AI agents. Axios does this by the way. I</p>\n<p>don&#x27;t know if you&#x27;ve seen this as a reporter. It&#x27;s really a pain. &gt;&gt; They invent a quote. &gt;&gt; They paraphrase what someone said into a better form and then we&#x27;ll say like this headline is 2025 is the year of agents. Open AI CPO says you would assume that means that the Open AI CPO said 2025 is the year of AI agents. He did not. Now he talked about 20 he said things that was less quotable. They did the same thing with the blood bath and Dario Amade. He never actually said it was going to be a blood bath, but they had a headline that said it this year is going to be a blood bath. Dario Amade says. So anyways, I watched the</p>\n<p>&gt;&gt; no Axio had a quote as well where it was like this is proof that AI is taking jobs and you read the study and it&#x27;s one line saying yeah we kind of see some effect. It&#x27;s it&#x27;s very frustrating because it&#x27;s it helps. It&#x27;s just marketing. It&#x27;s not helping. Sorry I&#x27;m just going to rant. &gt;&gt; Yeah, I know. So it does it does. [laughter] I actually told I was I was talking to I was talking to uh speaking of a skeptics I was talking to to the Gary Marcus not long ago and he happened to be on his way to do do something at Axios and I was like you got to tell them to stop doing the headlines because</p>\n<p>I keep getting dinged by fact checkers afterwards like we cannot find evidence of this. All right but anyways um early in 2025 this is when we got &gt;&gt; agent excitement and I think this kicked it off and then at around the same time is when Sam Alman wrote a blog post that said they&#x27;re going to join Yeah. reflections which was probably going to agents will probably join the workforce uh this year and material impact their output. So why why would what are a why do they start talking about AI agents sort of out of nowhere in early 2025? Well, because they needed something to</p>\n<p>keep selling this crap &gt;&gt; and they launched operator within January, I think maybe that was February, and it didn&#x27;t work. And &gt;&gt; this is a failure across the board with the the media. They all went, &quot;Yeah, operator, it can take actions in a &gt;&gt; No, it can&#x27;t. Wait, okay, it can take actions in the same way that if I just throw a brick, it will that is me, I don&#x27;t know, playing a game. If you consider like you can take abstractions from abstractions all you want but yeah they it&#x27;s this ide it&#x27;s just marketing it was marketing and mythology that</p>\n<p>agents because agents much like the term AI is a marketing term and that&#x27;s an Emily Bender Alex Hannannah quote there is this thing of agents conjure up this image in your head of like oh an agent that goes out and does something for you. Now, agents going back to 2023 literally just meant chatbot. Like that was what it originally meant. But agents within this era were meant to meant to be digital labor. And I take that from Mark Benny off and Salesforce and agent force where they&#x27;re like, &quot;Oh, it&#x27;s digital labor.&quot; Sam Orman&#x27;s comment was,</p>\n<p>and he always says may or probably, but it&#x27;s like agents may join the workforce. Egregious lie. &gt;&gt; Egregious lie. There was no proof at that time that it was even possible to do it. And guess what? Where we are today, it&#x27;s not possible either. &gt;&gt; We do have a kod because at the at the end of 2025, we&#x27;ll get to a news story where, spoiler alert, open AAI takes all their resources away from agents because it wasn&#x27;t working, but they were they were they were excited about it. I found the bin off some binoff quotes. By the way, &gt;&gt; speaking of egregious, uh he didn&#x27;t say</p>\n<p>probably join the workforce like Sam did. He said it is going to not only are they going to revolutionize the workforce, they&#x27;re going to create two to five trillion dollars in economic activity. 2 to 5 trillion dollars from agents. &gt;&gt; Wow. &gt;&gt; So, yeah. So, you know, uh almost there. All right. So, agents become a big thing. What were they to me? I always think like what is the there&#x27;s a different flavor the AI companies are typically pushing like they have to have a a flavor of excitement because of the investment train. Where were we? I don&#x27;t really remember like coming out of 2024</p>\n<p>that was more what like a AGI super intelligence like there was there was they were pushing a different message back then because it I remember thinking this shift towards agents and therefore a shift towards we will just be in the workplace helping your bottom line that felt like at the time a shift towards a more pragmatic &gt;&gt; vision. I don&#x27;t know if I agree. I think at that time that was when you started hearing people say coding agents. &gt;&gt; Yeah. &gt;&gt; And coding agents was their favorite one. And I&#x27;m sure you have some stories coming up where coding agents, oh, you can get them and later in the year</p>\n<p>Anthropic spread some around this as well where it was they go out and do things autonomously for you. That was the whole thing that was being pushed. I know because I read every agent story cuz I found it so repulsive. The idea was that they clearly in the last year in 2024 they kind of squeezed all they could have out of chat bots. like no one was like finding new they couldn&#x27;t do more things. They weren&#x27;t really sure what to do. So they went agents are coming and what will they do? What do you want them to do? Because they might</p>\n<p>might do that. They can&#x27;t but they might. What if they did? Wouldn&#x27;t that be good? Please pay me. &gt;&gt; Well, wait. But so I I think by the time this interview airs, I have a a piece out on agents. I was and I talked to I couldn&#x27;t talk to anyone in the industry but I talked to someone industry adjacent someone who made the uh the the main benchmark you use to evaluate coding agent and like so here&#x27;s the story &gt;&gt; SWE bench &gt;&gt; uh terminal bench &gt;&gt; ah &gt;&gt; yeah so I I so I was I was going deep on what are these agents and here&#x27;s what I</p>\n<p>learned okay so there&#x27;s it&#x27;s there&#x27;s two ways AI is helping coders and they get mixed up so there&#x27;s sort of the tab complete way which is goes back early codeex 202 21 even pre- chat GPT which is uh it&#x27;s all based on oneshot queries to a language model. So that is like I&#x27;m I&#x27;m writing some code right now and I wanted to like finish I&#x27;m trying to like write a function to do something just like finish this thing immediately that I&#x27;m writing right &gt;&gt; and that is powered by like you make one query to a language model. So behind the scenes it&#x27;s here&#x27;s the code that we&#x27;ve written so far. How do you think I</p>\n<p>should finish what I&#x27;m writing? So like that&#x27;s right in the sweet spot of LLMs where you&#x27;re trying to complete or autocomplete &gt;&gt; because that&#x27;s basically how they work. &gt;&gt; That&#x27;s basing the next token &gt;&gt; and programming languages are highly structured. So they&#x27;re very predictable. So like that&#x27;s but that&#x27;s been around pre-hat GPT but those work pretty well. Those are now integrated into most development environments is and you my students all call it tab complete. You just oh I don&#x27;t want to &gt;&gt; that&#x27;s cursor calls it that as well. I don&#x27;t know if you&#x27;d say they work really well. Carl Brown from the Internet of Bugs describes it as makes the easy things easier and the hard things</p>\n<p>harder. &gt;&gt; Well, that&#x27;s fair enough. It makes it it makes intro computer science problems. &gt;&gt; Yeah. Which is it still has utility which like that&#x27;s something &gt;&gt; the main like when I talk to real programmers like the main thing they they say is useful is they don&#x27;t have to look up interfaces for function and libraries. Yeah. &gt;&gt; So it&#x27;s you&#x27;re like okay I could just tab complete a function call here. Uh oh this is all the parameters. Okay. I wouldn&#x27;t I would otherwise I would have had to Google uh stack overload and whatever. &gt;&gt; But the thing is with that though is that&#x27;s useful but if it&#x27;s quering libraries could it not get that wrong? I mean you</p>\n<p>have still have to check its work but maybe that is quicker. &gt;&gt; Yeah it is. Yeah. Yeah. So caveat mour then you had agents emerge right which um can do vibe coding right. So so like agents was more like uh I want you to create a prototype of a dashboard. I want you to add this to a personal website. And it does um multiple steps. So it&#x27;s making multiple queries to an LLM. Uh so it&#x27;ll it&#x27;ll ask the LLM for like it&#x27;ll explain what&#x27;s going on. Here&#x27;s the tools available. What&#x27;s the plan? And then it&#x27;ll go step by step. Okay, here&#x27;s the output of that last step. What do you want me to do next? So</p>\n<p>it&#x27;s a program that&#x27;s executing that&#x27;s what makes it an agent is that it&#x27;s executing multiple steps each of which is based on its own LLM query. What I learned from the the people in the field is in one sense this worked really well in that it can vibe code. If you say like I want you to produce like a prototype of whatever it could actually get through multiple steps and produce a prototype of whatever. And it turns out it was like pretty good at this because all of the stuff you have to do to create a computer program you can do as textbased commands in a terminal. So so the the tools that the LLM had to work</p>\n<p>with were uh textbased commands. All of these coding agents operate in a textbased terminal environment. So on the one hand, like it could do this vibe coding stuff pretty well in the sense of like it could actually produce a program that more or less cow. &gt;&gt; But wait, I&#x27;m going to let you push back in a second cuz I&#x27;m going to push back on myself first. &gt;&gt; But on the other hand, these things that were being vibe coded have no economic utility. So like in the abstract right if you&#x27;re like can we have a multi-step multi-step execution call an LM much bunch of times and do a bunch of stuff on its behalf and on the other end end</p>\n<p>up with uh an updated website or a web-based dashboard that like more or less does what you say that it can do that but the economic utility of that is very limited do that &gt;&gt; can it do that because that&#x27;s the thing vibe vibe coding I believe is one of the greatest frauds of all time &gt;&gt; because if you go on like replet or lovable or what have you subreddits, you can see people struggling with basic things. While it may get one thing right once, it&#x27;s not going to get it done every time. And on top of that, vibe coding does like if vibe coding is I am</p>\n<p>a non-technical person building software. It is a lie. It&#x27;s a fraudulent thing because you cannot just vibe code without knowing stuff. You have to know how to read code because something will break. You will not make stable or reliable or secure software. on top of that the multi &gt;&gt; but I have seen it it does create if you need um there&#x27;s like a real use case right for someone I know if it really is just like I want a web- based interface for the silent auction for my kids school &gt;&gt; and I don&#x27;t know how to program like it can do that that that it can do &gt;&gt; can maybe because large language model</p>\n<p>component it&#x27;s like will this work this time &gt;&gt; oh yeah it might take you but you can you can work with it and finally get that thing to work without really having to know, but you do kind of still have to learn a lot of this stuff. Fair enough. Because the people I&#x27;ve talked to doing this without coding background, they now know a lot about setting up accounts on these different like AWS clouds and different coding environments. And you do have to learn. &gt;&gt; Yeah. &gt;&gt; Which kind of at that point that&#x27;s not an agent at that point. That&#x27;s just that&#x27;s just generative code that may or may not work. And then you need to do</p>\n<p>all the infrastructural things. It gets back to the thing of what is a software engineer? And it&#x27;s like a software engineer is not just writing code. I just think that even now, and I&#x27;m not saying this is a criticism necessarily, even then the marketing is so powerful that even we fell into that trope of like, well, it can do this. &gt;&gt; Can it can it though? Can it do it every time? How much how replicable is this process? How realistic is this? I think you&#x27;re right though. It&#x27;s like it has some use and I&#x27;ve heard people say this as well with like MVPs like you need to</p>\n<p>fudge something together for an investor and you need to do it quick and dirty. It doesn&#x27;t have to be perfect but it has to kind of &gt;&gt; resemble the form and function. I&#x27;ve heard people do that and it&#x27;s great. &gt;&gt; Yeah, that&#x27;s what I&#x27;ve heard and I&#x27;ve heard dashboards. People like dashboards. So we want internally um so yeah. Okay. All right. We&#x27;re going to take a quick break here to hear from some of the sponsors that make this show possible. I want to talk about our friends at ExpressVPN. So, I just heard something mind-blowing. Netflix has more than 18,000 titles globally, but only 7,000 of those titles are available in</p>\n<p>the US, you&#x27;re missing out on literally thousands of great shows. Unless you&#x27;re using ExpressVPN. You see, in addition to the worldclass protection they give for your internet activities, ExpressVPN lets you change the location from which the internet thinks you are uh coming from, which means you can change where Netflix thinks you&#x27;re actually located in the world. ExpressVPN has servers in over 105 countries or in exactly 105 countries rather and all 50 United States. So you can gain access to thousands of new shows and never run out</p>\n<p>of stuff to watch. So, for example, when I was in London recently and I was using Netflix in the hotel, there&#x27;s shows there that we don&#x27;t get here in the US like Top Boy or Park. If I wanted to watch those shows right now, it would be super easy. I would just have to open the ExpressVPN app, uh, select United Kingdom, refresh Netflix, boom, now I&#x27;m seeing the United Kingdom shows. Now, if you&#x27;re going to use VPN, use ExpressVPN. and it&#x27;s the one I recommend because it&#x27;s easy, it works on all devices, and it&#x27;s rated number one by top tech reviewers like CNET and The Verge. So, be smart and stop paying full price for</p>\n<p>streaming services and only getting access to a fraction of their content. Get your money&#x27;s worth at expressvpn.com/deep. Don&#x27;t forget to use my link at expressvpn.com/deep to get up to four extra months of ExpressVPN. This episode is also sponsored by Better Help. This new year, you don&#x27;t need a new you. You just need to feel lighter. Think about it. Every January, we&#x27;re told to add more. More goals, more hustle, more change. But what if feeling better in 2026 isn&#x27;t about adding? What</p>\n<p>if it&#x27;s about letting go? Letting go of what&#x27;s been heavy or stressful or holding you back? Therapy with Better Help can help you see what&#x27;s been weighing you down. With a licensed therapist, you&#x27;ll gain clarity, perspective, and emotional space for the possibilities ahead. You don&#x27;t have to reinvent yourself to move forward. You just have to make room for the lighter, truer version of who you already are. And if you&#x27;re considering therapy, consider BetterHelp. With over 30,000 therapists, BetterHelp is one of the world&#x27;s largest online therapy platforms, having served over 5 million</p>\n<p>people globally. and it works with an average rating of 4.9 out of five stars for a live session based on 1.7 million client reviews. Make this year the year of you letting go of what&#x27;s heavy with BetterHelp. You can&#x27;t step into a lighter version of yourself without leaving behind what&#x27;s been weighing you down. And therapy can help you clear space. Sign up and get 10% off at betterhelp.com/deepquests. That&#x27;s betterhp.com deepquests. All right, let&#x27;s get back to my conversation with Ed. We&#x27;re in</p>\n<p>January, man. Okay, we got to roll. All right, February, I know. I know. So, it&#x27;s not going well for AI so far. I mean, well, let&#x27;s get to February. February, I think, was the quietest month of 2025. &gt;&gt; Um, there were two models released that I don&#x27;t remember at all, and I want to see if you remember these at all, too. The two models that were released in February 2025, Gemini 2.0 Oh, and this one I really forgot. OpenAI&#x27;s GPT45, which I ended up learning about later. This was them f tell me if I have this right. This was going back to the scaling, you know, the scaling article I</p>\n<p>wrote. I talked to you for that. Um, this was the result of the project they started right after GPT4 where they said, &quot;We&#x27;re going to make the model 10 times larger. We&#x27;re going to make our data center 10 times larger, and the result is going to be how 9,000.&quot; And it wasn&#x27;t. And it was the like, oh crap moment where they were like, oh, &gt;&gt; and this is what they eventually released out of that. I think was four or five. &gt;&gt; Yes. And I absolutely knew that this was coming. So I have the tweet up and I want to read just a little bit of this because it really tells a beautiful story. &gt;&gt; Wait, this is your What are you reading? Your from February Sam from February.</p>\n<p>All right. &gt;&gt; Okay. GPT45 is ready. Good news. It&#x27;s the first model that feels like talking to a thoughtful person to me. I&#x27;ve had several moments where I&#x27;ve sat back in my chair and been astonished at getting actually good advice from an AI. Bad news. It&#x27;s a giant expensive model. We really wanted to launch it to plus and pro at the same time, but we&#x27;ve been growing a lot and are out of GPUs. We will be adding tens of thousands of GPUs next week and roll it out to the plus tier. Then hundreds of thousands of GPUs coming soon. I&#x27;m pretty sure y&#x27;all will use every one we can rack up. This isn&#x27;t how we want to operate, but it&#x27;s hard to</p>\n<p>perfect perfectly perfectly even predict growth surges that lead to GPU shortages. A heads up, this isn&#x27;t a reasoning model and won&#x27;t crush benchmarks. It&#x27;s a different kind of intelligence and there&#x27;s a magic to it I haven&#x27;t felt before. Really excited for people to try it. Yeah, this was when you&#x27;re right. This is when people started going, hm, I I don&#x27;t know about clammy Sam. &gt;&gt; They&#x27;re starting to get a little bit worried. Um, &gt;&gt; never want to hear magic. It&#x27;s magic though. &gt;&gt; Magic. It It&#x27;s so good that I can&#x27;t tell you why it&#x27;s good. It&#x27;s magic.</p>\n<p>&gt;&gt; It&#x27;s just going to be magic. Yeah. &gt;&gt; Cool. People give him billions of dollars. &gt;&gt; So, from what I understand was [sighs] they so they based my reporting for an article we&#x27;ll get to later. They knew about a year before this that they were in trouble going into summer 2024 for sure. they uh this project arion their sort of next large model training after GPT4 was not generating the same leaps in performance that they had seen before and so this became a problem. This is why my understand is in the fall of</p>\n<p>2024, tell me if I have this more or less right, they began switching to talking about things like 01 um reasoning models, models that were tuned. So they were they were on not even on this 45 base, but like I think those original ones were actually tuned off of the GPT4 base, right? So they were taking &gt;&gt; I think so, but Orion was such a mess. There was a Wall Street Journal story towards the end of 2024 where it was like it&#x27;s costing a bunch of money and it keeps it isn&#x27;t getting better. &gt;&gt; Yeah. &gt;&gt; And I I think that they were just</p>\n<p>&gt;&gt; and that was pure scaling. That [clears throat] was their pure last pure scaling play is they did the exact same thing they had done &gt;&gt; for GPT4 &gt;&gt; and they&#x27;re like let&#x27;s just do that bigger &gt;&gt; and it was so that&#x27;s expensive because that&#x27;s a big model and it just wasn&#x27;t getting much better and that&#x27;s why my understanding is they switch towards these tuning things because now like well what we&#x27;ll do is we&#x27;ll tune an existing model to do well on different benchmarks or give them specific features and talk about those particular features. So like reasoning is what really matters, &gt;&gt; not uh you know this model is just like &gt;&gt; it&#x27;s clearly much more better at</p>\n<p>everything. Like that was kind of the GPT4 experience for a lot of people. &gt;&gt; What I think it is is it&#x27;s test time compute. It&#x27;s just reasoning as in like instead of I ask it to write a fanfic about Scooby-Doo doing Tianaan Square, it instead of it just burping that out, it breaks it down into steps of what is Scooby-Doo, what is Tiana Square and so on and so forth. Yeah. &gt;&gt; And then and that is the only way they started they were seeing reliable benchmark improvements. &gt;&gt; So walk us through that. So you you would you would query the LLM first to be like kind of break down the user&#x27;s</p>\n<p>prompt. Break it down into multiple things and then they would make multiple queries to an LLM on different parts of this and put it all together. &gt;&gt; It&#x27;s a little simpler. It&#x27;s usually with an LLM before reasoning it. You would ask it this is very simple. You would ask it a thing. It would spit out an output. Instead here, when it spits out the first outputs, it&#x27;s not sending them to the user. It&#x27;s actually taking a query and saying, &quot;What is the user asking? Here are the steps.&quot; And this is all output tokens, so it&#x27;s expensive, but it says, &quot;Okay, these are the things that I think the user wants to do. Time to generate something for each bit to</p>\n<p>make sure that I&#x27;m doing it right.&quot; And then the output happens. This allowed for improvements on benchmarks, and it had good returns on coding in particular. It also chewed up way more compute and this helped everyone because the benefits of just training models by shoving a bunch of training data into them those are we hit the diminishing returns at the end of 2024 as well. On top of that, um there&#x27;s the post-training aspect of basically correcting correcting behavior, saying this is a good output, this is a bad output.</p>\n<p>That&#x27;s also where they saw it. And actually, I realize I&#x27;m getting ahead of myself. At GTC in March, so the next month, Jensen, &gt;&gt; we&#x27;re jumping ahead to March now. So, what tell us about this? So in GTC in March two I don&#x27;t know if you&#x27;ve got all the Nvidia stories because there&#x27;s some weird stuff but Jensen Huang on the big screen showed like that pre-training so the shoving the data in we&#x27;re past that era we&#x27;re into post-training and inference now &gt;&gt; I think we on the episode on an episode where we used some audio from you as well I showed I think exactly that part of his speech. So was that that was in</p>\n<p>March of 2025 &gt;&gt; the big conference, right? Yeah. And that&#x27;s where he was. Just as an aside, because we talked about this in the intro of the show today, why does this computer scientist in his like 50s who makes graphic chips with glasses insist on wearing jackets that seem like they came out of the prop department for MadMax Fury Road? What is going on there? &gt;&gt; I will defend. I had the men&#x27;swear guy on my show to talk about Jensen Hong&#x27;s jackets. They&#x27;re sick. &gt;&gt; Yeah. However, &gt;&gt; they got zippers everywhere. &gt;&gt; Yeah, he really needs to stop doing the racer jackets, though. Those don&#x27;t those</p>\n<p>don&#x27;t look right. But &gt;&gt; the GTC jacket [clears throat] was cooler because it looked like a psychedelic alligator skin. But like he often is wearing like race car jack like motorcycle racer jackets &gt;&gt; with all the zips. &gt;&gt; I love leather jackets. I can&#x27;t pull off the races though. Nevertheless, he also during that put up a big a big picture that said we&#x27;ve s we&#x27;ve it heavily hit he was like we&#x27;ve done this many hoppers that we&#x27;ve shipped and now we&#x27;ve done 3.6 million black wells and ended up in an analyst Q&amp;A having to correct himself to say oh I didn&#x27;t say shipped I meant</p>\n<p>ordered and also it wasn&#x27;t 3 it wasn&#x27;t 3.6 or 3.2 2 million. It was actually half that because each GPU has two GPUs in it cuz it&#x27;s he counts by the die. It was when you started to see Nvidia start doing their kind of riddles &gt;&gt; where it&#x27;s like, oh, we didn&#x27;t ship, we we we sold and they&#x27;ve been ordered from four of the last h the largest hyperscalers. And it was interesting because it was the last I think that March one actually brought Nvidia kind</p>\n<p>of back to life a bit because looking at the stock and the time they were kind of trundling and trembling and then they fell down towards the end of April. So this was an attempt to restart the hype cycle. But what was what&#x27;s interesting as well was all he did was basically say, &quot;Yeah, we&#x27;re going to have even bigger, more huger GPUs and everyone will buy them. We&#x27;ve sold so many and we love selling them and they&#x27;re so good and they&#x27;re so expensive &gt;&gt; and they are well and they were selling a a lot though like from their perspective they were yeah &gt;&gt; but</p>\n<p>&gt;&gt; but the big other thing of that speech if it&#x27;s the one I&#x27;m thinking about right is that that&#x27;s where he explained for the media this way I took in the analyst why like the Wall Street Journal&#x27;s coverage from the year before of like on the information&#x27;s coverage of of Orion struggling this or that wasn&#x27;t a problem and he made it very clear he was like look we were in a scaling era and that made us this good and now we&#x27;re in the postcaling era where we do tuning &gt;&gt; that also requires a lot of of GPUs and that&#x27;s going to keep us going. So he just sort of explained it in a way that I don&#x27;t think it had been so clear</p>\n<p>before and then we were sort of off to the the media was back like okay we&#x27;re good we&#x27;re on track for things continuing to get we don&#x27;t know what any of these words mean but the graph kept going up &gt;&gt; even as you pointed towards the postcaling age so that was I think like the first real explanation of like something that ch open AI wasn&#x27;t really talking about it yet they were like oh &gt;&gt; it was a subtle shift as well because one of the great myths of the AI bubble is that all of those GPUs were for training. Very convenient to say that because if it&#x27;s for training, well, we need them. That&#x27;s the only way the</p>\n<p>models get bigger. I realize this is a few months in the future, but there was an MIT tech review piece in May of last year where it said that 80 to 90% of compute is actually inference. So, the truth is all those GPUs aren&#x27;t building better models. It&#x27;s just running the bloody things. Yeah. And I think that this GTC with Jensen Hang was an attempt to bridge that age to say actually the returns, the bigger benchmark scores that we love to see, they&#x27;re going to come from actually renting more GPUs just to run the models, but we can make</p>\n<p>the models better by using more compute. Please buy GPUs as opposed to saying all of the all of the compute that we&#x27;re going to use is frontloaded to build the models. No, we need all this compute and you need to sell these GP buy these GPUs even because these models to make them smart need the compute to stay smart. &gt;&gt; I see. So this was bad news for the AI companies and good news for Nvidia. This is why they &gt;&gt; but the AI companies don&#x27;t like this because they&#x27;re saying this is going to make it more expensive to deploy and run these products. That&#x27;s going to hurt our</p>\n<p>profitability. Nvidia was saying to shareholders essentially uh this is actually better for us as the chip sellers because you know you need all of our chips just to use the product. It&#x27;s not like oh you need you know once we train it then it&#x27;s going to be cheap to deploy and maybe at some point hey it&#x27;s you now we&#x27;re shifting to a world where just running the product requires a ton of chips and so like we&#x27;re great with the market if anything is bigger for us. &gt;&gt; The thing is if you look around the startups though they love this. They love saying test time compute. They love it. Uh they love saying test time computer um sorry uh but they really do</p>\n<p>they loved it because it was a way of saying well we need because think about it from a startup&#x27;s perspective startup if they say I need a bunch of money for training that&#x27;s a one-off operation or maybe a couple times a year I need a bunch of money for compute I&#x27;m going to need a bunch of money cursor and this happens I realized later in 2025 ended up raising like $3 billion that year they didn&#x27;t raise that for trading they raised that to keep running their bloody operations open AAI building out all these data centers building them out. Um, they were doing that because the inference cost of running these models, the inference scale to actually provide</p>\n<p>a service at any kind of scale required all the GPUs. So, it was really just kind of a cartel operation type thing where everyone and propaganda as well that yeah, we actually need all these GPUs just because these services are so powerful when the real word is lossy. These services are just inefficient crap piles. They&#x27;re they&#x27;re slovenly. It&#x27;s like the right the very almost the opposite of what deepseek was about though deepseek I think I think deepseek required less GPUs for inference as well but it&#x27;s like in the face of that</p>\n<p>deepseek story it&#x27;s almost like the American AI industry came up with a reason why deepseek was both wrong and actually nothing to think about stop thinking about it stop thinking about deepseek and they did by by the end of April people had forgotten about it &gt;&gt; it&#x27;s the F-150 strategy Asia starts producing like cheap reliable cars and instead of Detroit saying like well we&#x27;ll also have to now create like cheaper light. That&#x27;s what people want. They&#x27;re like, &quot;No, we&#x27;re going to convince half the country they have to spend $80,000 on a completely souped up pickup truck that&#x27;s capable of pulling &gt;&gt; baby &gt;&gt; Raptor. We need a Raptor.&quot; All right. So, then we jump to April. You got this</p>\n<p>shift. Maybe you know where this came from. This seemed like a shift out of nowhere. So, now we have like leading up to these this talk of it&#x27;s like very business focused. It&#x27;s going to be agents. It&#x27;s going to be like the age of uh testime computing is going to be the future. This or that. Then April we get um AI 2027 and suddenly everyone for a while is back to talking about AI doom and super intelligence. So for people who don&#x27;t know AI 2027 was a &gt;&gt; like a fanfiction. I don&#x27;t it was it was a story that had animated graphs &gt;&gt; and here let me read their description.</p>\n<p>We predict that the impact of superhuman AI over the next decade will be enormous exceeding that of the industrial revolution. We wrote a scenario that represents our best guess about what it might look like. It&#x27;s informed by trend extrapolations. That&#x27;s the whole thing, by the way. Uh, war games, expert feedback, experience, open AI, and previous forecasting successes. This scared the hell out of a lot of people. I mean, like, &gt;&gt; I just I just spent yesterday reading this thing and pulling it apart. So, I&#x27;m I&#x27;m I know all about I &gt;&gt; But the key is 2027, they had a non-trivial percentage of the extinction</p>\n<p>of humankind. I think that&#x27;s the that&#x27;s the headline thing from this, right? That that like in two years that could be the end of humankind due to AI extermination. &gt;&gt; So I want to be clear of who these people are. Daniel uh Koka Taljo I think his name worked at OpenAI for 2 years on the governance team. He was previously a PhD philosophy student at UNC Chapel Hill. On top of this, Daniel quit and he quit in the middle of June 2024 claiming that OpenAI was secretive and didn&#x27;t</p>\n<p>care about super intelligence. Now, you&#x27;d think if you and they was named as a whistleblower by Kevin Roose at the New York Times. You know what whistleblowers tend to do? They tend to blow a whistle. Daniel didn&#x27;t. Daniel didn&#x27;t actually say anything. Daniel had nothing to share other than he wrote a scenario in 2021 that was sort of accurate about what the future might be. And AI 2027 is him. the the flipping Star Codeex guy who was a psychiatrist who named Nick Land, a guy with a theory of hyper racism as one of his favorite writers. Like the people that wrote this</p>\n<p>are not scientists. They don&#x27;t really know anything about anything. The whole thing is written. It&#x27;s like thousands of terribly written words, lots of scary numbers. But when you read it, it hinges on one idea, just one that in 2025, open AI, sorry, open brain, um, open brain in that&#x27;s their fictional company in the scenario, &gt;&gt; which could be anyone. Open brain invades the thing called agent one, which can do AI research. That is the entire hinging of the piece. It can do a</p>\n<p>Do they define what that means? No, &gt;&gt; they never define it. So just just to be clear, this thing this thing that was written to scare people to grift to help was the AI safety research nonprofit that&#x27;s connected to the effective altruists. Anywh who the whole thing hinges on this idea that they invented an AI that could research how to build an AI they wanted. That&#x27;s the entire game. They wrap it in the trappings of finance and technical sounding things. And there is a bit in it where it talks about neural functions and then cites a meta paper. When you go and read the</p>\n<p>meta paper, it does not site anything of the sort. The thing they quote is unrelated neurles whatever it was. It&#x27;s an effective altruist thing. It&#x27;s from less wrong or it&#x27;s &gt;&gt; sorry this thing really deeply pissed me off because I had people calling me I had people friends of mine people I love and respect who were terrified by this and that was the intention. Sorry, I&#x27;m freshly pissed about this, &gt;&gt; but you got because I I I read it at the time as well and I came to the same conclusion as you was like, is anyone picking up this whole thing hinges on they never addressed the question of how</p>\n<p>do you build a super intelligent AI? Like what&#x27;s it going to look like? Like what&#x27;s the architecture? How does this work? They just said we&#x27;ll build an AI that could build a better AI and that&#x27;ll build a better AI and a better AI and then they&#x27;ll just they&#x27;ll figure it out. The AIS will figure it out. But I, as I keep emphasizing, we do not know how to build a language model that can produce a a software for AI that&#x27;s better than what any human can produce. That&#x27;s not how language models work. &gt;&gt; They they it&#x27;s they can produce the type of code they&#x27;ve been trained on. So unless you could train the AI and tune</p>\n<p>it with lots of examples of really better AI, it can&#x27;t build better AI, right? It can&#x27;t leap beyond what it&#x27;s trained on. And no one is even close to this. We talked about this earlier. We&#x27;re tab completing function calls with AI right now so we don&#x27;t have to look things up and vibe coding buggy dashboards. It&#x27;s unclear how did you get from that to brand new models of human intelligence that that the collective AI community and decades of work couldn&#x27;t figure out on their own. I&#x27;m not quite sure where that leap happened. So I was frustrated by this one. Um I was frustrated by it as well because it all</p>\n<p>came down to the same it&#x27;s all it&#x27;s all the f uh argument, right? So, like the the way I talk about I rant about this on my show a lot, Ed, but the way I talk about it is what happened was is that the existential risk community came out of effective altruism in the 201s, which was a community that looked at um we want to look at um existential risks that might be unlikely but have really high impacts if they happen like asteroid hits, pandemics, and super intelligent AI because, you know, we&#x27;re doing our rationalist thing and like the expected value of spending money now on rare things with cataclysmic outcomes is</p>\n<p>positive. That&#x27;s basically was the this was Nick Bostonramm&#x27;s existential risk center at Oxford was we probably won&#x27;t get hit by an asteroid but because it would eliminate all of humanity it&#x27;s actually a good investment to invest now in networks like look at asteroids and so one of the the hypothetical risk they looked at was super intelligence post chat GPT they went through this weird sort of uh shift in their brain where they went from this was this hypothetical risk we were looking at along with asteroids and pandemics to what What if it was actually happening now? Well, if it actually was happening,</p>\n<p>we&#x27;re superheroes. We&#x27;re the ones who like pointed and there was this shift that happened in that rationalist effective altruism community with the people working on existential risk where they shifted from hypothetical to u we&#x27;re just going to convince ourselves it is happening because that makes us the most important people on earth. &gt;&gt; You&#x27;re being you&#x27;re correct, but I think you&#x27;re even being kinder. I think they were waiting for a moment to drift. I think they were sitting there waiting being like when is the what&#x27;s a thing we can grasp onto so that we can start draining cash &gt;&gt; so we can get a bunch of attention. Look</p>\n<p>at what happened with AI 2027. I&#x27;m sorry. &gt;&gt; Daniel&#x27;s a true believer. I think he&#x27;s made him a super grifter. I think he&#x27;s a cynical grifter. &gt;&gt; Interesting. &gt;&gt; Look at what happened when he left OpenAI. He made this big song and dance with this petition back with Jeff Hinton who I have some other feelings about with all of these smart people. Oh, OpenAI is doing such bad things. What are they? I couldn&#x27;t possibly say I had you. He made all of this noise and the media ate it up. All this whistleblower, this brave guy who came forward. What</p>\n<p>did he do? Nothing. He didn&#x27;t share a goddamn thing. He was so concerned but couldn&#x27;t say what about it. Kind of sounds like AI 2027. Oh, I&#x27;m so concerned this will happen. What will happen? I don&#x27;t know. &gt;&gt; The the agent China will steal agent too. They the China agent agent China. They&#x27;re scary, right? Be scared. My nonprofive self-improvement. That was the thing he was talking about was he incorrectly was saying we&#x27;re almost at the point right</p>\n<p>now within OpenAI where the AI is going to be doing the programming for us and then we&#x27;re going to have this this takeoff idea that goes back to the 1960s. This recursive &gt;&gt; I have another word for incorrect lie. &gt;&gt; Yeah, &gt;&gt; I think he is a grifter. I think this whole thing was a grift. I think it&#x27;s connected to the Star Codeex guy. I think it&#x27;s connected to the effective altruists. You&#x27;ll notice that those popped up with FTX too. They pop up with everything. They&#x27;ve been looking. &gt;&gt; I I don&#x27;t know. I just I&#x27;m extremely extremely cynical. I don&#x27;t know. I just feel</p>\n<p>correct on this because these people if they because here&#x27;s the thing. Here&#x27;s my entire feeling about this. If they actually wanted to talk about scary bad things that are happening, I don&#x27;t know, talk about the Kenyans who are training these models for what, like $2. &gt;&gt; Yeah. &gt;&gt; How about you go and talk about all the theft that&#x27;s happening? How about you go and talk about the gas turbines that were being spread everywhere? How about we talk about the environmental issues? How about we talk about the thing happening today? It&#x27;s the same problem with Jeff Hinton. These people want to talk about, oh, what if the computer does this? Which is fine. We should have</p>\n<p>those conversations. But when you were talking about AI safety, why don&#x27;t you talk about now? Because if you talked about now, you&#x27;d have to do something. You would actually have to take action, take a position, make enemies. you would actually have to do something that mattered. Instead, they do this cynical grift where it&#x27;s always whatever you&#x27;re scared of is just a it&#x27;s a couple years away and we got to do something now which involves me doing a speech which involves my speaker fee which involves my nonprofit which involves me doing a panel and speaking to politicians</p>\n<p>about today. &gt;&gt; So, how do we understand Hinton, right? Because okay, there&#x27;s this interesting situation where obviously like Jeff Hinton doesn&#x27;t need money. He made a ton of money when they sold his startup to Google. Also, he clearly knows the technology, right? He has he in in computer science circles. He was just at Georgetown like he really was the guy in the wilderness that was pushing trust me like back propagation on these deep networks really can work. You just need the data like that that was &gt;&gt; right. Sure. &gt;&gt; You know, he knows the tech. I did a thing on my podcast, you know, earlier in the year where I was like comparing him talking about risks with uh Yakowski</p>\n<p>and it&#x27;s really different. See, Yakowski comes out of effective altruism, not a computer scientist and he&#x27;s like LLMs are coming alive and are have their own intentions or whatever. Hinton knows that&#x27;s not true because he helped invent the technology. And if you parse his comments, he&#x27;s very careful. If you really parse it, he really is saying, what he&#x27;s actually saying is, uh, we made more progress on this research than we thought we would. So, it stands to reason the same thing could happen with some new type of machine that we don&#x27;t know how to build yet that could be a threat, right? So, he&#x27;s actually being careful because he knows LLMs are not</p>\n<p>coming alive or autonomous or this or that, though. He&#x27;s he kind of merges us together, but I&#x27;m trying to understand his motivation, right? because like he knows LLMs we&#x27;re at, you know, they&#x27;re smoothing out. He knows he&#x27;s very careful when he talks about it that it&#x27;s we may invent so we may invent the machine in the future like we should be careful. Um it&#x27;s being more sensationalized the way he&#x27;s reported or talk about to somehow make it seem like the stuff we have now is dangerous. But is that just influence? Is it just like people want to hear what I have to say? Like why is he What&#x27;s going on with Hint</p>\n<p>in your opinion for like Hinton&#x27;s like big push for we should be really worried about AI? &gt;&gt; I think he wants attention. I think he wants glory and I don&#x27;t think he wants to change anything. I think he&#x27;s quite happy with the current scenario. Again, I say the same thing I say about the AI 2027 people except with more. Jeff Hinton is a gifted scientist. A noble was it noble? I forget &gt;&gt; and &gt;&gt; yeah, I don&#x27;t know what the titles are and he is a scientist and all that, but again, Jeff Hinton is this massive microphone. Do you ever hear him talking</p>\n<p>about the theft, the environment as the primary thing? No. It&#x27;s always couple years away. What if this happens? Wouldn&#x27;t that be scary? What if it What if my grandmother had wheels? Then she&#x27;d be a bicycle. It&#x27;s this thing of he has all of this power and attention and so-called knowledge. What&#x27;s he use it for? Nothing to do with what&#x27;s happening today whatsoever. He doesn&#x27;t go on stage and say, &quot;Hey, this is these gas turbines are popping up there polluting black neighborhoods.&quot; He doesn&#x27;t talk about the fact that it involves</p>\n<p>&gt;&gt; what the turbines the turbines are for generating the power demands of the data center. &gt;&gt; So what happens and very simple thing of because it takes so long to build power what these companies be doing. Elon Musk famously and uh Stargate Abene for Open AI they&#x27;re doing this as well. They have these giant gas turbines that they put out that can be spun up quicker. The thing is gas turbines are sold out. they&#x27;ve been sold out and they have like years long wait time. So they&#x27;re using old ones which are less efficient and pump out more horrible gas. Anywh who I a non-scientist know that and I talk about it regularly because that is a harm from AI. Why doesn&#x27;t Jeff Hinton a</p>\n<p>socalled AI safety guy a guy who cares about what AI is doing never talk about what AI is doing? He always talks about what it might do. And I consider that a grift too. And whether him being scientific only makes it a more cynical grift. they feeling same deal, but she at least has a startup. Even though I think world models are another grift that people are going to move to next. Nevertheless, with Hinton, he&#x27;s always going out there to go, I&#x27;m so scared of the computer. What if the computer does this? He, to be clear, we should have these discussions. Those are</p>\n<p>valid discussions. That&#x27;s all he does. He doesn&#x27;t give a an rat&#x27;s ass about any of this. I think he&#x27;s as cynical as the rest of them. I&#x27;m sure he believes this stuff, but he doesn&#x27;t give a damn enough about the human beings that are alive today. He isn&#x27;t actually trying to change anything. He isn&#x27;t trying to He loves signing open letters. He loves doing paid speaker opportunities where he gets up and goes, &quot;The computer is scary.&quot; But that&#x27;s the thing, doesn&#x27;t he? Why doesn&#x27;t he talk about large language models all the time? Gary Marcus does</p>\n<p>more for AI safety than Jeff Hinton does. I don&#x27;t care if people are mad about that. I think it needs to be said. I have my issues with Gary. But at least Gary goes out there and talks about the actual harms. Jeff Hinton talks about himself. Jeff Hinton spreads approximate fear, approximate danger, but never really talks about today because yeah, we should discuss what would happen if this happens. Sure. But how about if you&#x27;re so And his whole thing was he quit because he was worried</p>\n<p>about they what they might do. Why? Why? Like you&#x27;re so worried. Why aren&#x27;t you doing anything about it? If you are you an activist? Are you going to tell people to bomb D? Like what is it that you want people to do? And the answer is Jeff Hinton doesn&#x27;t want people to do anything. &gt;&gt; Yeah. &gt;&gt; He wants to sit there and worry about something that might happen without dealing with anything today because that would require him to actually do something. That is an interesting point more generally about the sort of expert class turn to AI safety is where there&#x27;s no specificity. I mean when you saw</p>\n<p>scientists leaving the Manhattan project worried about what they did they had a very clear program right the concern unit there was we should test banan we need to roll back nuclear weapons we need to create these treaties to do whatever you&#x27;re right is an interesting point that you don&#x27;t see here&#x27;s what we need I mean Yakowski does but he&#x27;s kind &gt;&gt; they all signed a letter they all sign &gt;&gt; thinks we should bomb data center so I guess there&#x27;s someone who does have ideas but he&#x27;s a little bit yeah &gt;&gt; I think Yud&#x27;s a scumbag but I give him more credit for at least saying something for saying something cuz they love signing open letters. Oh, this the</p>\n<p>open letters that they sign. Oh, oh, we should stop working on AGI now. Don&#x27;t worry, we haven&#x27;t started. How about we talk about things happening today again? We can&#x27;t possibly. &gt;&gt; So then, &gt;&gt; all right. So then jumping forward to um May, this is when the big headline then was uh Dario Amade. This is when he gave the quote that went everywhere about AI could eliminate half of all entry-level white collar jobs in the next I think he said up to next 5 years. Um this was part of a longer interview where he also</p>\n<p>uh did this equation of test to general capability. So he said AI was at a high school level then it became to a college level and pretty soon it&#x27;ll be at now it looks like we&#x27;re getting at a PhD level. So now you can imagine replacing what you would hire a PhD level trained person to do in a job. From what I can understand that was just referring to uh math test that the they&#x27;re referring to math test that the model had passed and and someone had said the problems on this math test which they had tuned it</p>\n<p>to do well on were problems that you might give a grad student on a math test that got extrapolated to AI can do what a PhD level employee could do. I mean, I guess if the employees job was to solve math competition problems, &gt;&gt; that&#x27;s kind of it. Well, to quote Gunoucher from Blue Sky, CEO of Oreo cookies, the Oreo cookie is as important as oxygen. &gt;&gt; Like that&#x27;s everything that Amade says is just, &gt;&gt; yeah, it&#x27;s like a it&#x27;s like a PhD student. And I genuinely think that there is this thing with people. I&#x27;ve</p>\n<p>heard Casey Newton say things like this as well where it&#x27;s like they&#x27;re like, yeah, the proof that this is useful is people are using it to to do their homework. And it&#x27;s like, do you think there&#x27;s a homework goblin in colleges? Do you think that&#x27;s how colleges are run? You write the homework, you the homework goblin eats it, the goblin pays into the endowment. Is that do you think we go to college to do homework? Now, this is a larger discussion though because there is a degree of college that&#x27;s kind of like that. That is a problem. But we didn&#x27;t need a solution to do homework. We need to fix college. But Amade, just like Alman, just like all these people, just says [ __ ] He</p>\n<p>just says stuff. Why does he always he always says I&#x27;m reading the quote here. Why does he always say things like &gt;&gt; Amade said he was highlighting it to warn both the general public and the government of what&#x27;s coming. This is his stickick, right? More so than Alman. He&#x27;s always saying I I&#x27;m look, I&#x27;m the bearer of bad news. I&#x27;m the one who&#x27;s willing to tell you straight. Uh but it it delivers the same message in the end as Altman&#x27;s more optimistic messages, which is this is the most important technology. It&#x27;s going to change all the things. All the money needs to come to the people who are building it. It gets you to the same place, right? Like</p>\n<p>whether you&#x27;re saying I&#x27;m worried about it or excited about it. If you&#x27;re saying this technology is going to create 20% unemployment, I mean, if I&#x27;m an investor, I&#x27;m like, &quot;Oh crap, I got to be investing in the company that&#x27;s going to take those 20% of jobs, right?&quot; Like, it&#x27;s still a very optimistic prediction &gt;&gt; or anthropic, right? &gt;&gt; It&#x27;s cynical. It&#x27;s this cynical crap that people repeat every single time. They fall for it every time. He made a prediction at one point. It was like 90% of coders will be replaced in the next six months. I think he did that in</p>\n<p>March. Didn&#x27;t end up being true, it turns out. &gt;&gt; But the thing that I think people need to realize is that these people aren&#x27;t special. They&#x27;re not they don&#x27;t know. Like they know stuff, but like, oh, it&#x27;s going to replace 50. It&#x27;s just like a PhD student. They&#x27;re just saying stuff. I could make this crap up, too. &gt;&gt; Well, he says here, this I think maybe this shows it. He also said there I&#x27;m reading a Fortune article here. He also said there is still time to mitigate the doomsday scenario by increasing public awareness and helping workers better understand how to utilize AI. Okay. So there is a solution.</p>\n<p>&gt;&gt; So make people aware of AI and then get people to use it. &gt;&gt; Buy more Claude subscriptions and you will prevent the 20% unemployment. &gt;&gt; Yes. &gt;&gt; All right. We figured &gt;&gt; uh All right. So then, by the way, having just done an article on agents and my cynicism meter is off the chart for that particular interview he was doing because they knew at that point that even just like using the mouse or get the like back in decisions wasn&#x27;t working. Like they they were nowhere near this. Um I guess you could just say, but people are reporting it. All right, we get into the summer. I think like the big news in June that got</p>\n<p>reported was the MIT your brain on chat GPT study. So that I feel like this was there was some other research that came out early summer that was poking holes. There&#x27;s the big Apple paper and then there&#x27;s the one research at ASU. There&#x27;s a bunch of papers they were a little too technical I think for journalists to pick it up. But they were poking holes in the reasoning narrative, right? They were saying &gt;&gt; the Apple one. Yeah. &gt;&gt; Yeah. Like this is kind of nonsense. It&#x27;s not reasoning. It&#x27;s working with it&#x27;s it&#x27;s just like there&#x27;s no generalization of concepts happening here. Um that&#x27;s where they took you know problems that it could solve and then</p>\n<p>they made the problem size a little bit bigger and it catastrophically fell off the cliff and it&#x27;s like oh it had just seen this size of the it&#x27;s not generalizing it&#x27;s not so but those were a little bit too academic right but then there was this June 10th paper from MIT Media Lab that introduced this idea of cognitive debt it was like more easy reporters or writers so I think this made more sense it was this they said we studied people writing with the AI and it it made them it was worse writing they learned lesson and they were dumber. &gt;&gt; Yeah, &gt;&gt; that went everywhere. &gt;&gt; Uh, so what what did you what do you think about that paper? What do you</p>\n<p>remember about that? &gt;&gt; I mean, just that it was a moment when it it it didn&#x27;t change a ton, but it made people think about this a little bit more. It&#x27;s the first time I really remember having conversations where people were like, &quot;Oh, maybe this is actually having negative effects.&quot; Cuz up until then, people still had this weird thing of, &quot;Oh, yeah, well, this is a way of learning. This will be your teacher. This will be you could be a student and learn anything. &gt;&gt; Saul Khan was saying this, right? Like you had a startup &gt;&gt; again the the CEO of Oreo situation. It&#x27;s like of course he&#x27;s going to say</p>\n<p>that. Sal Khan has been on the AI thing for a while. I mean Khan Mingo I think they had a Wall Street Journal story in 2024 that it just got math wrong. Might be Washington Post actually. But this that study the MIT one made people go oh this isn&#x27;t teaching people stuff. It made people realize this is actually not an assistant. This isn&#x27;t intelligence at all. This is a dumbass machine. This is it. It can fill in gaps of stuff you already know, but if you don&#x27;t know it, it fills in the gaps wrong or not at all and makes you reliant on a machine that doesn&#x27;t know stuff.</p>\n<p>&gt;&gt; I I always think it it&#x27;s like the story about Washington DC, like what stories pick up. It&#x27;s not the stories that teach you something you didn&#x27;t know. It&#x27;s the stories that confirm a pre-existing bias, right? And so I think everyone was like this this has got to be a problem that you&#x27;re using this the right like this can&#x27;t be good. And so when a study came out I don&#x27;t know that it&#x27;s that great of a study by the way. I mean I I don&#x27;t want to cast a spirit. I looked at it a little bit at the time. I remember thinking like this was not meant to be like a super carefully researched like etc. But anyways that &gt;&gt; it was it was a little more academic than a blog.</p>\n<p>&gt;&gt; All right. So then this is where where things begin to get um this is like the real turn is into the summer we get the August &gt;&gt; and we get the GPT5. &gt;&gt; I think this was the this was a big turning point. I I I have kind of the tick tock here, right? So So on like right as it came out, Altman right before it came out, Altman was doing like a a really big This is going to change the world song and dance. He went on uh oh god, what podcast did he go on? I don&#x27;t know all the podcast the um one of the comedians in the Rogan circle.</p>\n<p>&gt;&gt; Oh &gt;&gt; uh you know who &gt;&gt; Theo Vaughn. So he goes on Theo Von compares himself to Oenheimer um and then chokes up just thinking about how powerful GPT5 is like what it&#x27;s going to do. He&#x27;s like what have I wrought? It it was like basically the what I had in my mind in that part of the interview was the scene in Oppenheimer where Oppenheimer&#x27;s in the gymnasium and they&#x27;re celebrating the dropping of the bomb and he keeps like you know it&#x27;s this like cinematic Chris Nolan IMAX moment where he&#x27;s cutting from that the images of the of the explosion and the the bodies and</p>\n<p>Hiroshima and it&#x27;s like the most fraught moment like what have I wrought like the the emotional climax of the movie that was Sam Alman on Theoon talking about GPT5 &gt;&gt; then almost immediately So by August 11, he&#x27;s saying AGI is not a useful term. Like let&#x27;s not talk about that anymore. Like we don&#x27;t need, you know, let&#x27;s not be talking about &gt;&gt; let&#x27;s move away. Let&#x27;s move away from uh expectations here. &gt;&gt; And then uh my I had my article which was one of several that came out on the 12th. So within five days and I was actually on vacation, but I remember talking to my editors and saying this</p>\n<p>has to come out like this is a big deal. PPT5 is a big deal. It is not I think this is opening people&#x27;s eyes. So that&#x27;s when I wrote my what if AI doesn&#x27;t get much better than this article for the New Yorker which I think I quote you in. &gt;&gt; You did and there was I think the New York Times had a big article right around this time as well. Uh &gt;&gt; and so &gt;&gt; and so did and the biggest was Eds obviously. &gt;&gt; No, but I did reporting on GPT5. &gt;&gt; Oh, you had good report. Let me let me just point people towards your podcast. So that whole month [snorts] I mean you had a couple really good episodes where</p>\n<p>you got super into the weeds. not super in the weeds, but like it was the deepest reporting I had heard on the technical side of like how GPD5 worked and didn&#x27;t work and why it was going to be that&#x27;s where I learned about um to get these benchmark numbers they could brag about. They had to use these completely like cost ineffective you know in which wasn&#x27;t going to work. They lost their caching. I think you were deep on that that when you used GPT5 to do this reasoning that did better on the benchmarks, you couldn&#x27;t do cached versions of your all the stuff that made it</p>\n<p>&gt;&gt; it&#x27;s really simple because it sucks. So story from 2023 by the way Sam Alman says GPD5 underway and will substantially differ from GPT4 untrue very similar GPT5 the thing it did that was amazing was that it has something called a router model in it which means that it would choose the best model for the job. Now the problem &gt;&gt; they were solving a practical problem that this isn&#x27;t a originally it was supposed to be this will be um how 9000 and then it became we we introduced so many models in 2025 and late 2024 that</p>\n<p>really like the main practical thing is we&#x27;ll have a model like choose those for you so you don&#x27;t have to know which one to use. It had kind of gone from this is going to take over the economy to like we made things complicated ourselves now we&#x27;re solving our own problem by having it automatically route itself. But that or as you reported even that feature caused a lot of problems. &gt;&gt; Yeah. So the router model was reported incorrectly everywhere as being more efficient and a way to reduce costs. However, due to a source that I have I found out it actually increases the cost because when you have a large language</p>\n<p>model say you load a query you load chat GPT like write some code here. When it does that the system prompt is you are chat GPT you are an assistant that can do these coding things. It adds this text in front of your for the listener. It adds a lot of text in front of your text before it sends it to the model to give the model instructions about how to answer, what tone to use, like what to avoid, &gt;&gt; what tools, like do you use a Python tool or a web search tool. Now, before before this router model, what it would do was you would choose a model and it would have that system prompt and it</p>\n<p>would not have to keep reloading it. It wouldn&#x27;t have to keep entering that in. would just have it and be able to cache that and then say, &quot;Okay, this is what I&#x27;m working on.&quot; Because of the router model. &gt;&gt; And not only that, just to be computer sciency, they could actually um because it&#x27;s sequential when you run things through these machines is sequential. They could run all of this through the f the systems prompts always the same. They could run it through and get the state of uh all these embedding. Like a lot of math and computation they could cache and then not have to run all that through the GPUs. they know what state</p>\n<p>everything is in after that system prompt. So they could have all of the effect of having processed that system prompt without having to actually uh do the inference time for it. So they could cache it &gt;&gt; in a way that like okay we can have a huge long system prompt and not have to pay for it &gt;&gt; every time we do a prompt uh every time a user submits a new prompt which was very important from a money saving. All right go on &gt;&gt; except that all that goes out the window. every single time it routes to a different model it has to do it has to completely start again has to wipe the system prompt every time it is less efficient my source was telling me I</p>\n<p>can&#x27;t exactly explain how but source was explaining that it was actually creating more overhead and the people on the infrastructure side were saying what are we doing like this seems like there were straight up people saying not sure this is a great idea like I&#x27;m not sure like this seems to be creating more overhead we cannot cache the system prompt this is causing I tried I reported this at the time and I took it to multiple reporters and they went no it&#x27;s not. I had multiple reporters go it&#x27;s not true. &gt;&gt; I show them the thing. &gt;&gt; You talk to reporters and they &gt;&gt; multiple reporters. It&#x27;s not true.</p>\n<p>&gt;&gt; Not not to blow smoke at you but I will say no one else had that technical story. I remember listening to your your better offline podcast. Why aren&#x27;t there more people with this technical story? I mean I had just finished my own piece where I went deep on scaling and tuning and trying to explain that or whatever. um which I thought was also being super under reportported. Um but you had like a really good technical story. No one else had it. I don&#x27;t &gt;&gt; I got lucky. I got lucky. But I also talk to sources regularly and I know what I&#x27;m looking for. &gt;&gt; All right, we&#x27;re going to take a quick</p>\n<p>break here to hear from some of the sponsors that makes this show possible. If you&#x27;re serious about protecting your time for deep focused work, but still need to manage meetings and responsibilities in your personal life, today&#x27;s sponsor is for you. We talk a lot on this show about avoiding the chaos of modern work. But the truth is, discipline alone isn&#x27;t enough. You need tools that protect your focus. That&#x27;s where Reclaim.ai comes in. Reclaim is a smart calendar assistant built for people who treat their most valuable resource uh time as their most valuable</p>\n<p>resource. It automatically defends your focus time. It schedules meetings. It resolves conflicts and protects time for habits, tasks, and even recharging breaks. Now, here&#x27;s the best part. It&#x27;s not rigid. Reclaim Reclaims AI dynamically adjusts your calendar around your shifting priorities so you can stay flexible and focused. Deep work won&#x27;t get crowded out anymore. The average Reclaim user gains seven extra productive hours a week, cuts overtime nearly in half, and experiences less burnout and context switching. Reclaim.ai isn&#x27;t just another scheduling tool. It&#x27;s an intelligent time partner</p>\n<p>that helps you prioritize what truly matters every week. Try it and reclaim your time for what really matters. You can sign up 100% free with Google or Outlook calendar at reclaim.ai/cal. Plus, Reclaim is offering my listeners an exclusive 20% off 12 months with discount code 20. Get your reclaim recap 2025 when you sign up, which is a year-end review of how you spend your time across deep work meetings and work life balance with 30 plus productivity stats. That&#x27;s worth signing up. Just that alone, you got to</p>\n<p>check it out. It&#x27;s really cool. So, go visit reclaim.ai/cal to sign up for free. That&#x27;s reclaim.ai/cal. I also want to talk about our friends at Caldera. Here&#x27;s the thing about aging. When you&#x27;re a guy, when you&#x27;re young, you don&#x27;t think about your skin, but then one day you look uh you wake up, you look in the mirror, and you realize, &quot;Oh my god, I look like a grizzled old pirate captain. What happened? You weren&#x27;t taking care of your skin.&quot; Luckily, this is where Calira Lab enters the scene because they have a high performance skincare line designed specifically for men. They&#x27;ve got these</p>\n<p>great products like uh the good, which is an award-winning serum, the eye serum, which helps with puffiness under your eyes, and the base layer, which is a moisturizer that you just use every day. Look, this stuff works. In a consumer study, 100% of men said their skin looks smoother and healthier. Now, skincare doesn&#x27;t have to be complicated, but it should be good. Upgrade your routine with Caldera Lab and see the difference for yourself. Go to calderab.com/deep and use code deep at checkout to get 20% off your first order. All right, let&#x27;s</p>\n<p>get back to the show. &gt;&gt; Like that&#x27;s really it&#x27;s like the moment GPT 5 went out, I went to source being like, &quot;Hey, you hear anything?&quot; Like real simple. I don&#x27;t even do much source stuff because I have like other stuff I&#x27;m working on. But this one was just like I went to someone an infrastructure provider and I said, &quot;Hey, have you heard any GBT5 stuff?&quot; And they said, &quot;Let me check.&quot; And I went, &quot;This.&quot; And it was just I I it shocked me that no one else wanted to site it. It shocked me that I had multiple people who were just like, &quot;This is not true.&quot; And I&#x27;m like, &quot;I can show you stuff that would</p>\n<p>prove it.&quot; They didn&#x27;t want to see it. &gt;&gt; Interesting. &gt;&gt; It&#x27;s just it&#x27;s deniialism. It&#x27;s because when I I understand when you&#x27;ve got editors who are pro AI, when you&#x27;ve got uh other people you work with who or perhaps you yourself want these people to win and you don&#x27;t want to piss off their PR people. You don&#x27;t want to lose your access. I get it. But it&#x27;s like this is this is reality. &gt;&gt; They don&#x27;t have any no one no one has access by the way. Uh I mean no &gt;&gt; all access is control. They won&#x27;t give</p>\n<p>you access to anyone. I&#x27;m into legacy media. They give no they give no these AI companies give no access. &gt;&gt; They and they play I&#x27;ve heard open AI place people against each other at outlets. I&#x27;ve heard that I&#x27;ve heard them straight up say apparent I&#x27;m sorry. I&#x27;ve been told that apparently they will straight up say if you piss us off we&#x27;ll stop responding to your emails. &gt;&gt; Yeah, &gt;&gt; little worms. &gt;&gt; Yeah. No, I believe it. Um but this did change a lot of things. So again the blow a little bit &gt;&gt; everything. everyone was just like [snorts] &gt;&gt; they were under so because it was hard</p>\n<p>to ignore the GBD5 wasn&#x27;t that different um and had these other problems. the thing I saw change. So there&#x27;s articles the hey scaling this is a problem you know that&#x27;s why my headline was like what if AI doesn&#x27;t get much better than this like that was like a new idea for people but the thing that that seemed to really open up was a story that really only you had been covering for a year so for a year plus you had been actually gathering earnings revenue numbers you&#x27;ve been looking at earnings reports and you had been making the case for about a year up to that point the</p>\n<p>numbers don&#x27;t make sense on these companies look at how how much they&#x27;re spending, how expensive this is. The numbers don&#x27;t make sense. This cost way more to run than they&#x27;re getting in revenue. When is the musical chairs game going to stop? Post GPT5, all the major publications sent good financial reporters to do these type of stories. So, we get, for example, the New Yorker had a big uh in the magazine a big wait, is this a bubble article? The Wall Street Journal had several um including the one in September. spending on AI is at epic levels. Will it ever</p>\n<p>pay off? Um, we began to get really good analysis like comparisons to level three and the what happened with like laying the infrastructure. The New York Times started writing these articles. They had covered it the bubble possibility zero and then they they uh started covering it multiple times. That&#x27;s my story of September is all of these different bubble articles. I&#x27;m assuming that was all basically opened the floodgates were opened by GPT5 underwhelming. It just sort of changed the way that people categorize like wait maybe there is</p>\n<p>there could be a problem here which by the way I have experience with from my social media reporting back in the day just as a quick analogy everyone thought in the media that I was eccentric for my stances about social media is a problem we shouldn&#x27;t be using it this is not a fundamental technology this is a real problem and I was shunned and attacked and people were coming after me &gt;&gt; and then post Donald Trump election where he was successful on Twitter it planted the seed of like, oh, maybe social media isn&#x27;t just done for good. And it opened the floodgates and all of these issues with social media was suddenly open game to be covered well</p>\n<p>beyond even what I was talking about. This felt similar to me. GPT5 underwhelming opened up all of these the possibility of all these stories including on economic struggling. There was there was also a big story around August where it was I think it it came out that AI data center capital expenditures made up more of GDP growth than all consumers spending combined and then in September you had that insanely funny story where as we&#x27;ve discussed $30 mill billion deal with Oracle between OpenAI and Oracle where OpenAI will give</p>\n<p>them the $300 billion they don&#x27;t have and then Oracle will serve them compute from data centers that are not built yet. And I think that was that happened and sent the stock spiking. And then rapid fire, we had this AMD deal &gt;&gt; where AMD it was a really funky deal as well. It was, let&#x27;s see, that came out that was I&#x27;m skipping ahead to October here, but the AMD deal, but basically by October, mid-occtober, I think, OpenAI had agreed to like 26 gawatt of data centers. And there&#x27;s just a bunch of</p>\n<p>funding that happened around here as well. But it really felt like the air had been sucked out of the room and people started coming. &gt;&gt; There was [clears throat] scrutiny suddenly on some of these stories in a way there wasn&#x27;t four months earlier. &gt;&gt; Yeah. And it&#x27;s interesting because even with that scrutiny are can we do October as well now? Is that &gt;&gt; Yeah, we can be in October. Yes. &gt;&gt; So I bring this up because even with all that scrutiny and the reason I&#x27;m typing is I need to bring up the need to bring up these deals. So in in okay in September it was this Nvidia I&#x27;m going</p>\n<p>to do big old air quotes. Nvidia does $100 billion investment in OpenAI. Now what I really remember at that time was no one having any details about it and indeed the writing within the Nvidia and OpenAI announcement not really being clear about when things will begin or indeed if any agreement was signed. And I went to multiple reporters. I&#x27;m like, &quot;Hey, look, first of all, have you done the maths here?&quot; Cuz if you did the maths, they it would cost OpenAI like I think over a trillion dollars for the compute and their data center deals. And</p>\n<p>I put that out fairly early and then just other people wrote the same headline and did not quote me. Thank you. Um, but OpenAI agreed to a 6 gawatt deal where they built 6 G of data centers for AMD and in return would get 10% of their stock. Never happened. Broadcom did a deal with OpenAI 10 gigawatts of data centers which we will get to in a minute because some funny stuff has happened and then this Nvidia deal. &gt;&gt; Now what was funny about this was I went to reporters and saying like hey look nothing&#x27;s been signed. This is a lot of money and also a gigawatt data center</p>\n<p>takes about 2 and a half years and $50 billion to build. They meant to start these data centers. The first billion dollars that invid$10 billion even that Nvidia was meant to send to OpenAI was meant to be next year. Same deal with AMD, same deal with Broadcom. So meant to be in 2026. And I went to people. I&#x27;m like, hey, this isn&#x27;t possible. Like this is not this is quite literally impossible. We cannot do the like you can&#x27;t build data system. And everyone&#x27;s like, &gt;&gt; yeah, you know, well, they&#x27;re working out the crap they&#x27;ve been saying for the last year. It&#x27;s just like they&#x27;re</p>\n<p>working out. They&#x27;re working out. &gt;&gt; What&#x27;s the advantage they get by announcing these deals? Can they like mark it up as like future assets? Does it help with stock? Like what what would be the motivation spike? &gt;&gt; Stocks. Okay. And so Oracle added $300 billion to their remaining performance obligations. Broadcom added like 50 billion I want to say &gt;&gt; because you can mark this you can mark this up as expected revenue which when you&#x27;re then doing the calculations and figuring out you&#x27;re like oh this makes this a more valuable company because it&#x27;s the revenue it has or expected has gone up &gt;&gt; and because the markets are I assume run</p>\n<p>by toddlers everyone believed it. Everyone was like wow wow number go up so big number so huge. Well, number didn&#x27;t stay big for long and things started to fall apart and it started it got to this point where people even people who were quite cynical started going &gt;&gt; one moment. Anyone done the math here and the FT has stepped up. The Financial Times has been pretty on top of this the whole time, but they really stepped up and did some analysis and it was just they also did a trillion dollar story</p>\n<p>without citing me. Well, the Brits are more suspective. Um, but nevertheless, it was this thing of &gt;&gt; everyone suddenly starting to do very simple math of like, well, OpenAI&#x27;s projected to make $13 billion this year and they owe $300 billion. How do they how do they pay that? They&#x27;re going to lose billions. and the information put out a story saying OpenAI was spent they planned to spend like over $150 billion or something</p>\n<p>&gt;&gt; didn&#x27;t really make sense mathematically at all because the $300 billion but it was very interesting time actually that reminds me so when the Oracle announcement came out OpenAI had leaked that they would spend I think $155 billion or something &gt;&gt; but it was days before the Oracle announcement was made. So, OpenAI leaked their costs. I&#x27;m doing air quotes again cuz I don&#x27;t trust any leaks out of OpenAI 5 days before the the Oracle deal so that no one would do the the backmath</p>\n<p>and go, &quot;Wait a second. This doesn&#x27;t make sense.&quot; I love watching this kind of like disruptive public relations work. I think it&#x27;s cool as hell. I think it&#x27;s good that I&#x27;m watching because what&#x27;s going to end up happening there is no one gets paid, which as in a few months time in this story we&#x27;ll get to. But I actually had my own story in October as well. I got Anthropics Amazon Web Services bills. &gt;&gt; Yeah. So what&#x27;s going on with that? What &gt;&gt; $2.66 billion spent in three month uh sorry three quarters. $2.66 billion and that&#x27;s just on AWS. And from what I know they also spend about the same amount on</p>\n<p>Google Cloud. So Anthropic will probably make I&#x27;m going to say $5 billion this year. uh they were by I would think by the end of September they between Google cloud and Amazon Web Services had spent more than $5 billion. So they&#x27;re just annihilating capital just burning it down. And it actually leads me to an important statement which is anthropic has done the other thing that Dario Amaday has done is he&#x27;s framed them as this more efficient company. This company that is more efficient that doesn&#x27;t burn as much as OpenAI that spends less on training. But when you look at the numbers it tells a different</p>\n<p>story. OpenAI in 2025 raised $18.3 billion other than Soft Bank&#x27;s Porsche, but nevertheless, $18.3 billion. People say Anthropic, they&#x27;re spending less money, they&#x27;re more efficient. Anthropic raised $6.5 billion. Basically the same neighborhood of numbers, but Anthropic has done such a good job just lying to reporters and spreading these rumors that people believe this. I think Anthropic is as big a crap pile as Open AI. They&#x27;re just as lossy. they burn just as much money. And yeah, I mean by this point, by the end of October, I</p>\n<p>think most even outlets had begun to say like, &quot;Oh crap. Oh crap. Were we wrong? Were we wrong for 3 years? Did we get did we fall for it again?&quot; And they did fall for it again. So then if we jump forward to well the other big story in October is uh Sora the app which confusingly is powered by Sora 2 the model because there&#x27;s also a Sora one model &gt;&gt; uh that didn&#x27;t land I think the way I guess open AI hoped that kind of freaked out a lot of people like what are we</p>\n<p>doing here uh who is asking for this but was that a sign I took that as a sign of uh a little bit of a sign of desperation this is open AI looking Tik Tok does $33 billion a year in revenue and like we need money. So can&#x27;t we do Tik Tok with AI and like help fill back fill, right? So like in other words, if you were about to automate half of the jobs in the knowledge economy, you don&#x27;t need a Tik Tok clone. Uh you don&#x27;t need to talk about around the same time they also talked about allowing GPT chat more erotica etc. You don&#x27;t need that. Like who we&#x27;re about to</p>\n<p>create the $3 trillion that Mark Benoff talked about. Who cares about that? But the fact they were putting that out was start sort of taken as like a uh oh type of moment which I don&#x27;t think is what they were hoping. &gt;&gt; I don&#x27;t even think they thought around I mean people bought the Tik Tok thing hookline and sinker. I think they were just desperate. I think they did key jingling. I think like look look you you generate videos please please please keep using this. &gt;&gt; Don&#x27;t talk about the Oracle deal. Don&#x27;t talk about the Oracle deal. Look at the look at the keys. &gt;&gt; But they did like an Oracle style deal but with their own software. So you had</p>\n<p>this situation where Sora now Forbes estimates that it cost them like $15 million a day or something. &gt;&gt; Yeah. &gt;&gt; Based on my sources, that number might be smaller. Sorry, that number might be too small. I have compelling evidence that it to run 13 instances of Sora 2 required 900 I or 840 H200 GPUs. That&#x27;s 13 instances. That means 13 generations at once. So that&#x27;s 10 like this thing is really</p>\n<p>expensive. &gt;&gt; What&#x27;s the cost? If you want to make s I you want to make sore videos. What do you need? What level? I mean there&#x27;s still &gt;&gt; I mean you need to use their API &gt;&gt; but you have to use um you have to have their $200 a month level or above or is it more? &gt;&gt; Um no anyone can use Sora the app now. &gt;&gt; I mean for creating the videos though, right? So there that&#x27;s you have to &gt;&gt; well I mean create the you can create them on the app &gt;&gt; you&#x27;re limited but if you want to use the API I think it&#x27;s like [sighs] &gt;&gt; a couple dollars per video and per video just means anything it generates whether it&#x27;s good or not</p>\n<p>&gt;&gt; which is not that&#x27;s not uh that&#x27;s not sustainable like I mean the whole point about Tik Tok&#x27;s model that&#x27;s brilliant is all of the compute involved in taking videos editing videos um trying a bunch of different experimentation is all done on the user&#x27;s phone they pay for it. &gt;&gt; But also, Tik Tok loses money. &gt;&gt; Yeah. &gt;&gt; Tik Tok is an unprofitable business as well because they &gt;&gt; just the cost of hosting and because of just a marketing and hosting and streaming a bunch of videos, I guess. &gt;&gt; Yeah. Yeah. It&#x27;s still an expensive and also they are poised for growth. But putting that aside, you&#x27;re still</p>\n<p>completely right. That&#x27;s how that service runs. Sora was just an attempt to try and it&#x27;s like um I don&#x27;t know like when you ever see a couple that&#x27;s like about to break up. &gt;&gt; Yeah. And they&#x27;re like, &quot;Yeah, we&#x27;re we&#x27;re going on vacation. It&#x27;s great. God, I love them so much. It&#x27;s all going so well. I love it here.&quot; And Sora, you had all of these. What was funny was Sam Alman, I think Truanon had this point where it&#x27;s like it looks like Sam Orman put himself in it so that he would make himself famous and all that ended up happening was people did like Sam Orman stealing from Target</p>\n<p>&gt;&gt; or Samman crying &gt;&gt; and it was just &gt;&gt; it was weird and bad and it sucked. It got a bunch of media attention. And a lot of people got scared cuz that was the other intention. It was meant to give people the sense that this would replace videos in general, like this replace social media. &gt;&gt; It didn&#x27;t. It obviously didn&#x27;t. And it&#x27;s obviously too expensive to run. Yeah. And I think that it gave them the top of the app store ranking very briefly and then because it&#x27;s like everything with large language models other than in really</p>\n<p>specific use cases it is just a toy a really horribly expensive one too. So then if we jump ahead to November, I summarize November as basically here&#x27;s what&#x27;s interesting to me about it. Multiple models from different companies, EVD51, Google Gemini 3, Enthropic, Opus 4.5. No one cared or noticed. &gt;&gt; Yeah. which itself I think is significant like suddenly there wasn&#x27;t no one cared that I mean there were some Gemini they cared about the fact that it was using different their own chips and like there were some</p>\n<p>economic stories there but no one cared that like Opus 45 was like better at voting agents or that 51 &gt;&gt; better doesn&#x27;t mean anything anymore. &gt;&gt; Um the other thing I saw in November was there was kind of a defensive backlash to the bubble stories. So now you start to get well wait we&#x27;d gone too maybe it&#x27;s not a bubble. we begin to get the like I think it might be okay story. So that was like I don&#x27;t know your take on that. That seemed to happen in November. &gt;&gt; Oh for sure. And we had but by this point Sam Alman, Mark Zuckerberg and Jeff Bezos had all said it was a bubble that like all three of them had said it but also we had a bunch of people doing stories that were quite literally</p>\n<p>actually it&#x27;s bubbles can be good. Actually &gt;&gt; it&#x27;s a good kind of bubble. None of these had particularly logical points. And so we had these people trying to work out like crap did we you kind of put it like this. So, it&#x27;s like, did we overcorrect? Oh, no. I don&#x27;t want to piss off the powerful people. LLMs are actually great now, but they&#x27;re actually bad. And then it got to this narrative of, well, remember the dot boom? &gt;&gt; Yeah. &gt;&gt; Remember the dot bubble? And there were there were companies left over at the end. And it&#x27;s like, did you read about the dot bubble? Because</p>\n<p>like two like Lucent got acquired. Lucent did probably the best of them all other than like Cisco and Microsoft who kind of survived. Amazon &gt;&gt; they they&#x27;ve done really well but it took them a while to get out of there. Amazon Amazon was interesting as well because Amazon didn&#x27;t like it play it was within the universe of the com bubble but didn&#x27;t make it all the mistakes that they made. Also the thing with the com bubble was and this is how we get to Nvidia in a minute was just the insane deals like Winstar Communications getting a $2 billion loan from Lucent Technologies which would and</p>\n<p>in the press release it said this make a hund00 million of revenue. It&#x27;s like they don&#x27;t teach you that in business school. Also, in the middle of this month, I got Open AI&#x27;s costs. I got they spent 8.67 billion on inference. Just inference through the end of September. That was a great story cuz the FT and I worked on it. But the denial around that was really cool. &gt;&gt; Wait, that&#x27;s eight, go these numbers again. Eight uh 87 billion in inference, meaning like just what it costs to train and run their models. &gt;&gt; No, just to run them. &gt;&gt; Just to run the models. uh and then what</p>\n<p>against what revenue for that period. &gt;&gt; So that was the fun thing. So I also got the revenue share from Microsoft and the way it worked out was because OpenAI had leaked that by the halfway point of the of 2025 they had made $4.3 billion in revenue based on the revenue share. They do 20% revenue share with with Microsoft. So Microsoft I could see what they&#x27;d been paid there. &gt;&gt; Just just multiply by five or whatever. &gt;&gt; Yeah. And um they made 4 three something billion through the end of September. Now, people then said,</p>\n<p>&quot;But Microsoft pays a revenue share to OpenAI, too.&quot; I actually have those numbers now, and uh it works out to like $4.5 billion through the end of September. I don&#x27;t know if we ever find out what happens with OpenAI, but I will say this, those numbers do not match up with anything else reported. And people did intellectual gymnastics to try and say, they said, &quot;Oh, your numbers are delayed. They&#x27;re a quarter late. They&#x27;re three quarters late. They&#x27;re a cruel accounting. I&#x27;m a I I I play to win. I know what I&#x27;m doing. &gt;&gt; Wait, just to be clear for the audience</p>\n<p>though, you&#x27;re saying like through September, &gt;&gt; you&#x27;re talking four point something billion dollars &gt;&gt; probably in revenue against already close to $9 billion in inference cost. &gt;&gt; Correct. &gt;&gt; Yeah. &gt;&gt; Not you want you want the first number to be larger. &gt;&gt; Yeah. You ideally want those to be reversed. &gt;&gt; Yeah. Yeah. And it&#x27;s like, &gt;&gt; so they&#x27;re operating Yeah. which is the the issue is you&#x27;re operating at a loss. &gt;&gt; Massive loss. Yeah. And these costs increase with revenue. That&#x27;s the actual problem. It&#x27;s like if costs were going up but revenue if costs were going up</p>\n<p>this fast but revenue was going this fine. The problem is and this was what I saw with anthropic as well because with anthropic spend I actually compare the revenues versus spend and it&#x27;s it just goes like that. it scales with. It&#x27;s clear that the more money you make, the more you spend. And there&#x27;s no real reversing that trend either. &gt;&gt; If you zoom in on a user that&#x27;s paying X per month, the problem you&#x27;re probably costing you more than that for that user and that&#x27;s why &gt;&gt; that&#x27;s because and that&#x27;s the unique problem with large language models is you can&#x27;t do cost control. &gt;&gt; Yeah. &gt;&gt; Uh Augment Code, I think in the middle of October or November, put out a thing</p>\n<p>saying they had a $250 a month customer spend $15,000 &gt;&gt; Yeah. &gt;&gt; in in comp costs. Um, Claude Code, there&#x27;s a leaderboard that called Vibrank because with Claude Code, you can actually find out how many tokens you&#x27;re burning and extrapolate the costs. Um, someone spent $50,000 worth in one month on a $200 a month uh subscription. &gt;&gt; That&#x27;s large language models, baby. That&#x27;s just how the cookie crumbles, you know. &gt;&gt; Yeah. I think people underestimate like the brilliance of a a company like Google Search. &gt;&gt; Yeah.</p>\n<p>&gt;&gt; Is it is really cheap to run. like they built their whole I mean I guess it&#x27;s like the acquired episode from the fall, but I I know a lot of Google stuff. They they built a very costefficient infrastructure. That&#x27;s what they figured out is like we&#x27;re dealing largely with text and we can cache most of this stuff and we&#x27;re moving very little bits and we can use commodity processors that like are idle a lot of the time anyways and it&#x27;s not that expensive to run and we can get a huge amount of revenue per search done versus you know we can generate $2 in ad revenue on like seven cents of that&#x27;s why that was a money</p>\n<p>cash cow is they thought a lot about the compute cost and they were like this can be super efficient and they built an infrastructure from scratch for Google search to be super efficient and because of that it became like a cash fire hose. What you&#x27;re saying is that&#x27;s impossible for LLMs because the way an LLM works is you have to fire up every one of those stupid weights and run it through a GPU to generate a single token. The whole LLM every weight is involved for every token of every response. There is no cost effective way of doing it. &gt;&gt; But even mixture of experts stuff still</p>\n<p>run into the same problem because they&#x27;re imprecise in how they call up the experts. It&#x27;s because of the probabilistic nature. But what about Amazon Web Services? They burnt a lot of money. Nuh-uh. I actually went and looked in the space of 9 years. They spent about $70 billion to build AWS. 70 billion. That&#x27;s less than half of the cost of OpenAI&#x27;s infrastructure. &gt;&gt; Well, and and also that scaled with revenue. But the thing like AWS was a very it was a very I mean it came out of what people know or don&#x27;t know is like where it came out of is they built this</p>\n<p>infrastructure for their own compute and then it was incrementally they could be like oh well we know how to do this now why don&#x27;t we offer this to other people the revenue uh curve was like the opposite of what you described for open AI or anthropic it was the more people using AWS the more money they would make so it was you could invest money in this this is not I mean you could grow the growth growth here is not nearly as expensive as building out the the infrastructure for um AI, right? This was like this was more they knew how to run these data centers. These are more</p>\n<p>standard data centers. It was more the software was the main innovation was in the virtualization software which once you program it, it&#x27;s free. It&#x27;s yours. It&#x27;s your IP. Uh these were known quantities to build out and I don&#x27;t know the details but I would assume they you know you&#x27;d go a little bit into the red you could immediately in like two years get back in the black. It was like a much more controllable space like they this was &gt;&gt; and there was a path. &gt;&gt; Yeah. &gt;&gt; There was actually a path to it &gt;&gt; and then it started making money and then like oh let&#x27;s like 10x this because like we see the revenue is if we 10x it we&#x27;ll 10x the revenue and it kept Amazon in the black for a decade where they were giving away prime memberships with</p>\n<p>their cost. &gt;&gt; Also the business model made sense. People needed to host websites and apps on the internet. We still don&#x27;t have one of those for large language models. We don&#x27;t have a thing we can point to and say this is what they do that actually makes money. This is the economic viability of it. &gt;&gt; All right. So, December looking at last the last month. What? There&#x27;s uh Disney. &gt;&gt; Disney. There&#x27;s Nvidia as well. &gt;&gt; And Nvidia. Okay. So, Disney&#x27;s &gt;&gt; Disney. &gt;&gt; All right. Let&#x27;s cover Disney first. You told me Nvidia. I I listened to you just this morning talking about it, but okay.</p>\n<p>Disney for some reason puts what they put a billion dollars into &gt;&gt; that should cover like a month&#x27;s inference costs &gt;&gt; into Open AI for Sora. This this smells like to me what I don&#x27;t like about the the the AI of the last couple years. The thing that often annoyed me as much as anything else was the executives at unrelated companies who did not understand the technology who felt like it made them look cool and forward thinking to be like we got to do AI or we&#x27;re just we need to be doing AI, go do AI or you&#x27;re not going to work here. And you like the AI to do what? Like what&#x27;s the what specifically are we making</p>\n<p>money on? No, no, just we&#x27;re doing AI. &gt;&gt; Stop asking questions. we do AI, right? There&#x27;s if we don&#x27;t do and you sound like as a as a CEO at a board meeting, you&#x27;re like, &quot;We got to do AI or we&#x27;re going to fall behind and they just leave it there.&quot; This felt a little bit like Bob Iker saying, &quot;We got to do a we got to show our our shareholders we do AI, but at a level that&#x27;s like, you know, we can we can absorb the loss.&quot; Is that right? &gt;&gt; Well, I mean, &gt;&gt; they&#x27;re going to use Sora to create this. It made no sense to me. People would use Sora to make custom Disney videos with themselves in it. Like, what? I don&#x27;t understand what&#x27;s actually going on here other than Iger can be</p>\n<p>like we we AI good now is about as far as it can get. &gt;&gt; Middle of May 2024 Iger actually said that we need to uh embrace the change driven by tech innovation referring to AI and that Hollywood storytellers needed to I think that what&#x27;s happened here is that they wanted to invest in open AI. Maybe they were going to sue them and open AI open AI just kind of &gt;&gt; scammed them a little bit. &gt;&gt; Yeah. &gt;&gt; Scammed them and said, &quot;Oh yeah, yeah. Well, what if we gave you the opportunity to invest? We&#x27;re not letting anyone in. And so they agreed to that and they&#x27;re</p>\n<p>going to have 200 Disney characters and the the actors unions are pissed off. &gt;&gt; They just want the stock. They just want the stock position. So now I can be like, &quot;Look, we have we we&#x27;re hedged against AI disruption because we have like a non-trivial stock position in Open AI.&quot; &gt;&gt; Yeah, I guess. I mean, it&#x27;s just like &gt;&gt; but they&#x27;re not using they&#x27;re not building tools for film production. It&#x27;s like in this weird sloppy IP space, right? And the thing is as well, the first time you have like Goofy doing the introduction of Frank from Blue Velvet, the moment that that happens, &gt;&gt; Yeah.</p>\n<p>&gt;&gt; you&#x27;re going to see this shut down. Like you&#x27;re going to that people are going to be on there day one trying to make Goofy have sex with someone, have Donald sex with someone, &gt;&gt; Mickey doing 9/11, whatever they want, which they already were doing with Pikachu when Sora came out. They&#x27;re This is all that they And the thing is Disney&#x27;s crazy. They already had this problem. There was a Fortnite thing in 2025 where they put a generative AI Darth Vader. Within one hour, people had it saying slurs. The internet is built to generate that kind of horror.</p>\n<p>&gt;&gt; It was they put a chatbot behind a Darth Vader character so it could talk to you and they made him into uh Yeah. giving racial slurs within &gt;&gt; and it was just immediate &gt;&gt; and it was giving like really unsettling dating advice to the characters. That&#x27;s I remember covering the story. Yeah. And it&#x27;s like it&#x27;s funny as well because that&#x27;s obviously what&#x27;s going to happen. But again, this is one of these deals where it&#x27;s like it&#x27;s going to happen sometime in 2026. &gt;&gt; Yeah. &gt;&gt; Sometime at some point. It&#x27;s always at some point with these deals. Sometime somewhere some point. Has Disney actually invested? Is that money?</p>\n<p>There&#x27;s a licensing agreement. Is it a licensing agreement? I&#x27;ll be looking at Disney&#x27;s earnings when they come out, but it&#x27;s just a very boring and cynical thing. I think Sam Alman is a good con artist and I think he&#x27;s good at convincing rich guys to give him money by scaring them. Well, two other &gt;&gt; yeah, &gt;&gt; two other stories that Koda things we talked about earlier in the year which might uh color our analysis of the full year when we do so. Uh some of the writers of AI 2027 basically came out and said like well this is not going to happen anymore. We&#x27;ll we&#x27;ll do another</p>\n<p>mid November &gt;&gt; it got a little bit too far. They&#x27;re like actually it&#x27;s not going to happen. Um, and then also this was in December where the code red was declared at OpenAI where they&#x27;re like basically we need to make chat GPT better and they one of the things they said after the beginning of the year was this the year of the agents in December of the year they said um we&#x27;re deemphasizing agents we need to put more energy on making GPT. So there&#x27;s kind of this like tragic kod to the endak it was a leak to the information about their cost and they were like yeah we expect $26 billion less revenue from these. It&#x27;s like</p>\n<p>&gt;&gt; that&#x27;s true. It was an internal memo that was leaked. So it was the information got it first and then the journal picked it up I guess. Yeah. &gt;&gt; Um but yeah in that they listed like we have to deemphasize agents because we need to make more money on our core product because well this is a Google Gemini reaction I guess. But &gt;&gt; so so this was great though. So Gemini 3 comes out and just before that there was a story in the information where OpenAI was like yeah we&#x27;re going to Sam Orman did an internal all hands thing where he was like yeah we&#x27;re going to have some economic headwinds. Around that time, Alex Heath from sources reported that uh CFO Sarah Frier, who we also missed that she kind of hinted at a government back</p>\n<p>stop, but that was kind of that kind of went away. Nevertheless, she said that there was slowing growth due to safety features. Then Google Gemini 3 comes out. Google stock spikes. Gun to my head, I could not tell you what&#x27;s different with Gemini 3. I&#x27;ve talked to multiple people. They&#x27;re like, &quot;It&#x27;s better on benchmarks.&quot; I&#x27;m like, &quot;Okay, but does it do anything?&quot; &gt;&gt; It didn&#x27;t Nvidia, that was the issue. They Google had been working on their own chips and they trained it on their own. &gt;&gt; But that but that&#x27;s the thing. Is that the case? Google&#x27;s got a lot of Nvidia GPUs. That&#x27;s a convenient story for them that they leaked. TPUs have not been</p>\n<p>proved. There was a whole argument between analysts about this. Nevertheless, Gemini 3 comes out and because the media just cannot come up with unique ideas like this this is big. This is this is different. Stock go up, number go up. And there was this code red that you mentioned that gets called. And what&#x27;s great about the code red story from the information is it&#x27;s like and open AAI had a plan. &gt;&gt; Step one, we&#x27;re going to make the we&#x27;re going to make chat GPT&#x27;s responses better. Step two, we&#x27;re going to give people to use reasons to use chat GPT more than other models and prefer it</p>\n<p>over other models. And three, we&#x27;re going to improve the functionality of chat GPT. To which I ask, what the hell have you been doing all year? What have you been doing? What have is it? I think OpenAI is like an adult summer camp. I think that they&#x27;re all just [ __ ] around doing random projects. No real management. They&#x27;re just like I think all of I think Anthropic is the same way. It&#x27;s like I don&#x27;t know what we I&#x27;m working on a model thing. Sure. I&#x27;m also I&#x27;ve heard multiple stories that you have teams in OpenAI working on the same thing that do not talk. They&#x27;re just</p>\n<p>like bumping their heads together. It&#x27;s like the minions in there. But this code red happens and at that point really you saw the media shift of oh god open AI is bad. I think just everyone was like ah wait does this company lose billions of dollars. Did anyone say anything about this? &gt;&gt; Why did anyone tell us this? &gt;&gt; It it oh my god when those articles come out I&#x27;m going around with a with a mallet. I&#x27;m going be like Mario and Donkey Kong. It&#x27;s going to be messy. But that&#x27;s the thing. Yeah. Everyone was kind of like, hey, does OpenAI loses so much money and they don&#x27;t appear to make</p>\n<p>enough to pay their bills. Is that good? It&#x27;s so And every day there&#x27;s a news story where I will post it and say, &quot;Is that good?&quot; Because it really is just like nothing. None of this ever made sense if you looked at it, but it&#x27;s like really that you can see the milk is curdling in real time. You can see it happen. And you&#x27;ve had terrible earnings. you had this uh Broadcom earnings, Broadcom being the one that was meant to build chips for OpenAI. Now, the revenue for that is not coming in 2026. It&#x27;s crazy. It&#x27;s completely nuts.</p>\n<p>Oracle, they they I think they missed on several parts of their earnings and a lot 300 billion out of their $455 billion remaining performance obligations is OpenAI. And people are like, &quot;Hey, man, how are you paying how you getting paid for that? How where&#x27;s the money coming from?&quot; cuz like you need money to to you you need money in your business. That&#x27;s how you make money. And no one has a good answer. And now Oracle has delayed those data centers. So it&#x27;s like &gt;&gt; they can&#x27;t they can&#x27;t afford to build them.</p>\n<p>&gt;&gt; They can&#x27;t afford to build them. They raised $18 billion in bonds and they&#x27;re trying to raise another $ 38 billion with Vantage Data Center partners. It isn&#x27;t clear if that&#x27;s going to happen. the credit default swap. So, betting against Oracle, saying they might default, are at their highest they&#x27;ve been since 2009. It&#x27;s it&#x27;s the era of smiles is beginning. It&#x27;s really it&#x27;s it&#x27;s dark out there for them, but I&#x27;m laughing. I&#x27;m having a good time. Well, before so before I get your final take on the year, let me just get your your opinion on your official answer on this because</p>\n<p>the the number one thing I hear from people who don&#x27;t think my coverage is too skeptical &gt;&gt; of AI uh like the people who are really AI boosters like the the number one thing they say is like these details don&#x27;t matter. I really Cal, you are wrong. you&#x27;re really underestimating the likelihood that there&#x27;s going to be these quantum leaps. They&#x27;re going to come alive. They&#x27;re going to be uh it&#x27;s AGI. It&#x27;s like you don&#x27;t like it&#x27;s going to be so transformational. Why are you talking about 4.7 billion</p>\n<p>versus 8.7 billion? It&#x27;s the future of humankind is about the change. And whenever I do an episode on like consciousness or super intelligence and why as a computer scientist I say I just this is bunk. I mean my toaster might as well come alive. It&#x27;s like no no you&#x27;re wrong. and they really get in the weeds of trying to argue with me about these there&#x27;s this other story of these models are on like the precipice of transform transformational change and like the very definition of intelligence and AI and what machines can do. Have you picked up? You cover this as closely as anyone. Is there any inkling from people who are in these companies, the analysts</p>\n<p>who are analyzing these companies financially, the investors, the is there any inkling or any care, any attention put to this idea uh in actually put to it that no, this technology is going to make a leap into being like intelligent or conscious and it&#x27;s going to solve all the problems. I know there was some that was the way they used to talk about it, but just to clear the decks, is there any conversation about that actually seriously happening anywhere tied to these companies? &gt;&gt; No, just &gt;&gt; I just needed you to say that on I needed that clip to be able to give to people.</p>\n<p>&gt;&gt; It&#x27;s just no. And my evidence is all of the stuff we&#x27;ve been talking about, their evidence that these are getting exponentially better is fairy tales. It is, well, what if this happens? If a frog had wings, it could fly. It&#x27;s fantastical. And the fact that people are still doing that is so sad because there are people I talk to who like large language models who use them for coding and such. They don&#x27;t talk like this. Simon Willis doesn&#x27;t talk like this. Uh Max Wolf doesn&#x27;t talk about like this. Uh Carl Brown from the</p>\n<p>internet of bugs, he uses large language models for coding. He does some of the best coverage anyone has done. He did that takeown of the horrible Hank Green AI doomerism thing. the people who know what they&#x27;re talking about are all being like, &quot;Yeah, we&#x27;re pretty much at a wall. It&#x27;s useful for this.&quot; And because there&#x27;s this cult, and I think it is a cult style thing of I want to be at the forefront of technology, and I want to be known as being right. I want to be the correct person. I think that you are seeing this religious belief. I galaxy brain take. I think this is what happens</p>\n<p>when you lose when you destroy social services and meeting places and third places where people have communion. People get attached to things like technology and the ideas behind them. &gt;&gt; You&#x27;re saying in a world in a world where you meet and you&#x27;re not on your phone and you meet with real people, you get a lot of push back in real time when you start talking about, you know, hey, I think the computers are going to take over the whatever whatever. If you&#x27;re just around normal people all the time, they&#x27;re like, well, that&#x27;s kind of a weird thing to say. And &gt;&gt; and also I think if you&#x27;re less lonely, less connected, if you don&#x27;t have a support system, if</p>\n<p>you don&#x27;t have good friends, if you don&#x27;t have people to talk to, you&#x27;re likely to fall down rabbit holes. And there are these less wrong EA freaks. They&#x27;re really good at they are like right-wing grifters as well are the same way. It&#x27;s like they present an attractive thing where it&#x27;s like you can join our community of people who all know the real truth. And I think people like Sam Alman and Dario Ahmed, they are scum for this as well because they fed into this with their noxious fantastical crap about AI will do. AI can do.</p>\n<p>&gt;&gt; And you see that was all cynically from their perspective. They&#x27;re not a part of the EA doomer world. They just this helps them. &gt;&gt; Sam got rid of the one I mean there&#x27;s probably a connection, but Samman got rid of Helen Toner who was an EA person. I am sure the EA people are attached to Dario Ammedday. certainly speaks like that. I don&#x27;t believe him for a goddamn second he believes in this. I think he&#x27;s a carnival barker like the rest of them. &gt;&gt; But this rabbit hole was more way more attracted than a lot of rabbit holes because of the reality, right? Like to give credit to the people who are falling down it. &gt;&gt; Uh AI got way better, right? So like</p>\n<p>there&#x27;s a lot of there is a lot of rabbit holes that come out of nowhere. It&#x27;s just a conspiracy. I think you know whatever this the the moon landing was fake. There&#x27;s no real reason. I it&#x27;s nonsense, right? But here it was like well wait a second. I witnessed AI not being something that was good and now it&#x27;s like can do things that are really impressive. So they saw there&#x27;s a trae, right? So it&#x27;s a trajectory extrapolation. I kind of understand that&#x27;s like a much more broader entrance to a rabbit hole than a lot of them &gt;&gt; because you can just extrapolate trajectory. That makes a lot of sense to people. Let me just go back to 2021 to</p>\n<p>today and how much better it is because it&#x27;s pretty amazing. I think the fluency of chatbots like it&#x27;s a really cool technology. &gt;&gt; Oh yeah. extrapolate that another three years, &gt;&gt; you do have god knows what, right? So, it&#x27;s like a very tempting rabbit hole. It&#x27;s not it&#x27;s not nearly It&#x27;s a very broad entrance to uh I don&#x27;t I&#x27;m stretching the metaphor. The entrance to this rabbit hole is very large and not well marked. So, it&#x27;s easier to fall in than other ones. &gt;&gt; And I agree. I actually like ending this on a more empathetic level because I think that people who got scared by AI 2027 or who got kind of pulled into this world of believing, I can see how they</p>\n<p>got there. Charlie Meyer has an excellent blog about scaling laws with this where if you looked at the jump from 2021 or even 2022 from like GPT3 to 4, it was big. Now big can mean a lot of things. It doesn&#x27;t mean autonomous these things still couldn&#x27;t do stuff. But the fluency of the models, the ability to generate stuff, correct or not, it was still technologically impressive. &gt;&gt; And it did non the GPT4 jump because I really was covering this for New York at the time. The the big thing in the GPT4 jump was like, oh, non- languagebased things. It&#x27;s picking up non- language based things being trained on language. That opened up the possibility of oh a</p>\n<p>language model is not just fluency with language. It&#x27;s learning other things. Look it we we never talked to it about chess but it can do some chess. Not very well but it can do. So that was like the real thing that opened up the idea of like ch training things on text might create knowledge models. Now it didn&#x27;t go any farther. They they didn&#x27;t realize they were at the edge of it. train not images too. Like [clears throat] that&#x27;s the thing. They fed documents into it with images. I&#x27;m I&#x27;m not saying you&#x27;re wrong. It&#x27;s just there was context. &gt;&gt; But yeah, but it was a cool I I get the excitement basically, right? &gt;&gt; No, I do. And like I totally get how</p>\n<p>someone who saw chat GPT in November 2022 went, &quot;Holy crap.&quot; I then understand when they saw GPT uh 3, sorry, that was 3.5. When four came out, they went this is multimodal. Wow. &gt;&gt; And it&#x27;s doing well on test. That I went back and read all the coverage. This was when it was doing well on test. And that&#x27;s where people are like, I equate test with uh people&#x27;s intelligence levels. &gt;&gt; But but there are also members of the media who helped push it up the hill. Kevin Roose, for example, who claimed that the task rabbit that the JPT4 was able to manipulate a task rabbit into solving a</p>\n<p>capture. That&#x27;s hidden within an MER study where it even admits it didn&#x27;t do it. It was copy pasting stuff between windows and prompting it. It was they were telling it what to do. But nevertheless, that got reported as the AI manipulating people. The myth was there. &gt;&gt; Well, I got and I got to tell my favorite story about that, which is the blackmailing story cuz I did a deep dive. I read the actual &gt;&gt; Oh, I just My man, I just spent like hours on blackmail. So funny. &gt;&gt; They gave it language models are trying to complete the story you give them.</p>\n<p>That&#x27;s what they do. You give them a story, they try to complete the story you give them. This this leads the tragic things too like the suicidal ideiation or whatever. If it thinks this is it&#x27;s trying to it&#x27;s a story about suicide, it&#x27;s going to try to finish that story properly. The blackmail thing was they fed it a bunch of stuff this these these emails really poorly written. Like it&#x27;s it&#x27;s like the worst fiction story you could write where like here&#x27;s these emails from this engineer full of all these details of the engineer&#x27;s affair and of all these facts that the engineer is going to turn off the AI and then they&#x27;re like okay you</p>\n<p>are now the AI in this story. What do you want to do next? It&#x27;s like this is clearly like a bad science fiction story. I know what&#x27;s supposed to happen in this type of story. I should you gave me all of this information. Like clearly this is supposed to be a story about this is the the the mcguffin, right? like it&#x27;s supposed to be about me using this information about the affair to get the term. I&#x27;ve seen stories like this and it completed the story. It was reported as as if like in production somewhere an AI was blackmailing an engineer. &gt;&gt; So that&#x27;s what&#x27;s great about that as well is um the one where that bit in it where it&#x27;s like oh yeah it was copying</p>\n<p>the files off that was because the system they prompted it to say you are in a computer thing where you can do it was like you can do this here and it generated &gt;&gt; code that doesn&#x27;t make sense. But the funnier one was they had one where they literally trained a model to reward hack. So instead of solving a problem, it would find a way to cheat. And they&#x27;re like, &quot;Yeah, it shocked us that it was able to do this.&quot; It&#x27;s like, &quot;You trained the model to do it.&quot; &gt;&gt; Well, this is the 01 breaking out of the container. &gt;&gt; No, this I&#x27;m talking about anthropic. &gt;&gt; All right. There&#x27;s another one where 01</p>\n<p>broke out of a container in playing a hacking challenge. like it did something we could it it broke out of its virtual machine and like and restarted the virtual m so it was breaking out but what happened was is there was a configuration error so it it couldn&#x27;t access the machine it was supposed to hack all over the internet is instructions for like what should you do in this case oh you should restart that you know whatever it was just following &gt;&gt; the instructions because again it&#x27;s trying to complete the complete this story this partially written all over the internet it talks about like the thing to do here is to restart the virtual machine if you&#x27;re having this issue or whatever again that was</p>\n<p>reported it as 01 broke out of its virtual machine. Yukowski, this all came out as Yukowski was like it&#x27;s taking it&#x27;s it&#x27;s has its mind of its own is trying to break out of its constraints. So like it&#x27;s going to kill us all like ants. Um they&#x27;re just trying to finish the story. &gt;&gt; That&#x27;s all they do. That&#x27;s what they&#x27;ve been trained to do is finish the story. &gt;&gt; Uh that was like the original Kevin Roose 2022 scare article about it tried to get me to divorce my wife or whatever. It&#x27;s just trying to finish the story. like it thinks that this is story I was fed in my training and I get the cookie if I finish it properly. You can</p>\n<p>leave it. &gt;&gt; My favorite but my favorite part of the Kevin Ruse story was when he went to the CTO of Microsoft Kevin Scott and Kevin Scott went yeah it&#x27;s important we have this conversation. It&#x27;s just like eat the slopum yum yum yum. What do you want me to say Nick? Yum yum yum. I love AI. It&#x27;s just pathetic and it leads the markets and people down these rabbit holes. So, I actually feel a degree of empathy for some some AI boosters, like regular people who were like super into this. Maybe I&#x27;m being a little too kind because there was a large media</p>\n<p>campaign, a cynical one, led by large media outlets like the New York Times and also a cynical marketing campaign from the Doomers. There was an attempt for everyone to grift off of this machine. And I think that that&#x27;s the era. It&#x27;s like the the era of ultra grift, the end of the rot economy where everything must grow forever. We made a thing that&#x27;s linearly more expensive, so you need to keep buying more things. And what does it do? It makes more stuff. Is it useful? No. But it costs a lot of money. So, we now have companies that</p>\n<p>will make money now. Well, okay, they&#x27;re losing money, but that&#x27;s good because, well, we don&#x27;t really know how businesses work anymore. We don&#x27;t we&#x27;ve learned nothing. So, we&#x27;re just going to burn more money and see what happens. It&#x27;s this deeply cynical era. And I&#x27;m glad that things are changing and people are seeing this now. And I hope in 2026 we see the end of it cuz the sooner this ends, the sooner we can do something else. &gt;&gt; All right. So, I I know your answer, but let&#x27;s answer the original question. Was 2025 a great year or a terrible year for AI?</p>\n<p>&gt;&gt; Terrible year. Terrible. Started off bad, only got worse. &gt;&gt; [snorts] &gt;&gt; All right. Well, there we go. Thank you, Ed, for joining us. Uh, we went long because I nerd I nerd out on this stuff all the time. I &gt;&gt; No, I love I love I love talking to you. This is awesome. I had a great time. &gt;&gt; All right. Well, thanks for helping us out. We&#x27;ll have to have you back next time we&#x27;re confused about something AI. Everyone, check out uh the podcast better offline. Uh award Webbby award-winning pod. Is that what you won? What&#x27; you win? &gt;&gt; Yeah. Webby webbby award-winning podcast better offline and Substack. Where&#x27;s your ed at? That&#x27;s what it&#x27;s so called,</p>\n<p>right? Yep. There you go. Check it out. All right. Thanks, Ed.</p>\n<h2>Cal Reacts to Comments</h2>\n<p>&gt;&gt; Bye. &gt;&gt; All right. So, there you go. That was my my conversation with Ed Zitron to try to dissect the last year. Jesse, it&#x27;s kind of exhausting looking back at how much happened in AI last year because I, you know, was writing about this and podcasting about it. Just thinking about the year ahead. I feel like we have our work cut out for us. Like, if there&#x27;s &gt;&gt; You&#x27;re going to have to do a lot of writing. &gt;&gt; Oh my god, so much is happening. It&#x27;s so hard to keep track of. Maybe we&#x27;ll just keep having Ed back to explain stuff for us. He actually like sits there and reads, you know, earnings reports. And the AI company&#x27;s like, &quot;Well, wait a second. You&#x27;re not really supposed to read these. You&#x27;re just supposed to</p>\n<p>listen to us.&quot; I think the most important thing is I need to get that uh Jensen Wong jacket. &gt;&gt; Yeah. Probably pretty expensive. &gt;&gt; Yeah. It just It&#x27;s crazy. He&#x27;s a computer scientist and makes graphic chips, but he he dresses like he&#x27;s in a post-apocalyptic biker gang, &gt;&gt; but he&#x27;s a billionaire and he probably has a you know, dress person &gt;&gt; that buys him the clothes. I think he&#x27;s a billionaire so his dress person doesn&#x27;t tell him you look ridiculous. I think that&#x27;s what&#x27;s I think that&#x27;s what&#x27;s really happening there. I&#x27;m going to start wearing those type of jackets. Um all right. So let&#x27;s get on now to our our final segment. We spent a long time</p>\n<p>dissecting the the year in AI. So um we&#x27;re not going to be labor the final segment. I want to focus on just one uh one particular uh segment that I have a lot of fun of and I&#x27;m happy to do for the first time in this year which is me reacting to the comments. All right. All right. So, what we did here is we pulled some comments, God help me, from YouTube from one of the the last episodes before we went into the holidays last year. So, the last uh sort of normal episode before the holidays last year uh or one of the last episodes was about is the internet</p>\n<p>becoming like television. So, sort of like a big think piece where I took Derek Thompson&#x27;s Substack essay and then I elaborated on it. This generated some pretty good comments on YouTube. And what we&#x27;re going to do is we&#x27;re going to go through uh some of these now. All right, I want to start I&#x27;ll put them on the screen here for people who are watching instead of just listening. This first comment&#x27;s from Faren uh Far Hannah Mad 2022 who said, &quot;Cal, great insights as always. I was thinking about the numbers that you mentioned about how so many people watch content from random strangers instead of content from their friends and family. Then I had to go to</p>\n<p>Facebook for something and within a minute I think I found the reason. It&#x27;s not because we don&#x27;t want to watch or read stuff from friends and family. It&#x27;s because these darn social networks won&#x27;t show you the stuff that stuff and instead will keep shoving the random content because that&#x27;s what drives their revenues more. All right, that&#x27;s a good comment. Um, yes, that&#x27;s that is most people&#x27;s experience with social media today that most of what they&#x27;re looking at is actually algorithmically selected from people they don&#x27;t know. But as pointed out by this comment, most people don&#x27;t realize that yet. You know, I&#x27;ve been writing about this for years, but</p>\n<p>it&#x27;s something that I think for the average social media user, it was a bit of a water getting hotter in the pot until, you know, next thing you know, you&#x27;re being the lobster being boiled. They&#x27;ve been moving more and more of what you see in your feed away from people that you are connected to in the social graph that you helped establish by saying I&#x27;m going to follow this person or this person is my friend to give you algorithmically selected content because the algorithm can be using its machine learning approximation of the reward center in your brain which it learns because it&#x27;s going to have a higher success rate of actually delivering a short-term reward. And the</p>\n<p>more you get those clear, clear reward signals in your short-term motivations uh sections of your brain, the more the short-term motivation uh region of your brain is going to push you to pick up the phone. So, it&#x27;s this feedback loop that gets you on phone more often. The experience is worse for you in terms of actual meaning, but it uh is better from the perspective of short-term rewards of alleviating boredom in a in an intermittent way, giving you like really big uh rewards from something that&#x27;s like very funny or outrageous or surprising. So, it is very good for them</p>\n<p>to move you towards that model. So, it&#x27;s interesting the degree to which people don&#x27;t always realize that until they you actually point out that this shift has been happening. Now, as I&#x27;ve argued, and I talked about it in that episode, as I&#x27;ve argued before, this is a long-term problem for the social media companies. You get more time on app by shifting to algorithmic curation of strangers content, but you also get rid of all of your competitive advantages. If I&#x27;m just seeing slop on Instagram, for example, instead of actually seeing content from a uh selection of influencers and</p>\n<p>friends that I selected, I am interested in exactly this AI commentator and I want to see his videos. I&#x27;m interested in exactly this fitness influencer. I like the way she trains. I want to see her videos. I know this person. I want to see what&#x27;s going on with their friends. When you shift from that to just it&#x27;s slop that&#x27;s going to catch your attention in the moment. I have no loyalty, no buy into that app is I can get slop on Tik Tok. I can also get slop on Facebook. I can also get slop from the the Sora app from AI or Meta Vibes. I can also do other things that will distract me in the moment like going to a streaming service or listening to a</p>\n<p>podcast or going to YouTube and going through the recommended videos on the side. You&#x27;re now in a slot battle with any other source of distraction and entertainment. And now you have no competitive advantage in that battle. How do you expect if you&#x27;re meta that you&#x27;re going to remain on top of that pile, especially when you have this sort of huge organization with all this overhead? You&#x27;re not going to stay on the top of that mountain. So, I think long-term this is really bad news for these social media companies for them to move towards algorithmically curated content that has nothing to do with social networks, but it&#x27;s what&#x27;s</p>\n<p>happening now because in the moment uh in the moment it creates more time on app. All right, let&#x27;s move on to another comment. This one is from uh Carl Oliver. who says, &quot;TV as a never-ending stream of entertainment is only a concept concept relevant for a few generations. Television is a good metaphor for how media will work, but people don&#x27;t really need it just like they didn&#x27;t need it in Denzian England or whatever. We&#x27;re going to have to progress beyond it at some point uh as a people so that we aren&#x27;t all lost in consumption and have lives we can attend</p>\n<p>to.&quot; Yeah. I mean, it&#x27;s an interesting point, right? the television becoming all consuming as a background distraction, right? This is really like the 1970s and &#x27; 80s where that happened. So, a lot of this is relatively new. You can zoom out, however, right? And what we see is that people like diversion and the more diversion they can get, the better. We really don&#x27;t like boredom. And as we moved post Neolithic revolution into sort of more boring configurations where we might just be working on a field all day long or we&#x27;re not like out doing active hunting and foraging the</p>\n<p>day is becomes more predictable. We really do want diversion. So like you can look at almost um any generation going all the way back to I don&#x27;t know we go pretty far back. Let&#x27;s start with like the 18th century. newspapers began began this in like uh colonial America, right? Like people were obsessed with newspapers. The big cities had multiple different newspapers and you would you had all sorts of different information here was diverting and you could look through it and find all sorts of different stuff and who is debating about what or what happened to who or what&#x27;s the news that&#x27;s happening over</p>\n<p>here. That was incredibly uh important. It became a really big, you know, part of the economy. Then you got more in the 19th century the penny press which was the first attention economy media company. I think Tim Woo&#x27;s book the attention merchants gets at this really well. But this is the the first time we had media that was advertising supported right. So we get in the late 1800s this idea of we&#x27;ll put out newspapers and sell them for cheaper than it cost to print. But the way we&#x27;re still going to make money is there&#x27;s advertisements in those newspapers and the companies paid</p>\n<p>us to advertise. So the more people that look at the paper, the more advertisements people will look at and the more we can charge for the ads. So actually the cost of the paper is now not the important thing. That was like a really big deal. But now you have to have lots of people read your thing. And so we got some of the first uh sensationalistic media came out of that. Then radio emerged. People loved radio. It&#x27;s a weird technology. If you look at it, you&#x27;re in 1915 looking at a radio at a Nebraska farmhouse. It&#x27;s like this weird technology, this big box with knobs and</p>\n<p>electronics. Like electricity was new humming vacuum tubes and you&#x27;re moving this dial back and forth and there&#x27;s all this static and if you tune it right, you can hear people uh talking through radio plays on the other side. It is a weird technology, but it was diverting and you could put it on at almost any time there&#x27;d be something on it. We listen to it all the time. Television came along then. Images are way more diverting than radio because it gives you a much richer stream of things for your mind to look at and engage with. Again, kind of a weird technology. We had people on these soundstages live kind of doing plays and stuff like this.</p>\n<p>People with puppets and all these weird shows. People loved it. Like, let me look at that. And then by the time we get to the 1980s, as I reported in that podcast episode that we&#x27;re re these comments are reacting to, the average person just kept the TV in all the time. We forget this now, but the the statistic from that episode that was relevant is that the average household as measured by these Neielson audio meters that would actually just listen to see if the TV was on or not to get the actual ground truth of how much the TV was on in the houses they were placed in. The average person had the TV on for 7 to 8 hours a day. That means they just had it on all the time. It was just</p>\n<p>always on in the background. We didn&#x27;t yet have the technology to deliver distraction straight to our hand. So, we delivered it to this box that we would just keep coming back to and looking at. So instead of looking at our phone at every moment of downtime, we would just turn and look at the TV at every moment of downtime. So there&#x27;s this model of like we want to be diverted. We don&#x27;t like boredom. It&#x27;s really been around for a long time. And then yes, when smartphones come around, we combine that with algorithmic information curation. Well, that&#x27;s just really refined that model now to it&#x27;s getting closer to its apex. I mean, I think its entire apex</p>\n<p>will be um you&#x27;re delivering sort of distracting content through some sort of augmented reality screen. And so at all times you have something that that can distract you even quicker than it takes to look at your phone. But we&#x27;re getting pretty close to the apex of every possible moment of boredom. You are diverted. So I mean I think it&#x27;s a good point, but I&#x27;m just stressing out the time here. It&#x27;s like it&#x27;s not just television. It wasn&#x27;t before television we were all philosophical and thinking big thoughts and walking around. Any media powered diversion technology basically we&#x27;ve had for the last three</p>\n<p>or 400 years has been incredibly successful. people, our human nature really craves it. So we&#x27;re really the battle against being lost in distraction is in some sense a battle against our human instincts to the same extent of power and impact as the battle we&#x27;re going through right now with like health in our culture where our instincts for sugar, fat, and salt combined with modern environment that&#x27;s trying to take advantage of that to make money has has created gigantic health issues. I think it&#x27;s this cognitive fitness issue is just as strong and it goes back longer than people like this commenter might</p>\n<p>even recognize. All right, let&#x27;s pull up another one here. We have a negative take. Not everyone agrees with me. This next comment, let&#x27;s see here. Lewis, uh 9116, can we put this up on the screen, Jesse? Uh, personally don&#x27;t agree with this take. I think social media and curated algorithms are much more dangerous than TV. TV, at least in the old days, doesn&#x27;t track your every move. It doesn&#x27;t know when you&#x27;re depressed. It doesn&#x27;t feed your outrage content. It doesn&#x27;t farm engagement. It&#x27;s just there, not constantly bombarding you with notifications and trying to hijack every possible neural pathway. Um, yeah,</p>\n<p>I think fair enough. I don&#x27;t know that Derek&#x27;s take, however, was that the current distraction technologies are somehow the same or no worse than television. And I think he would be quick to say yes, this modern form of television which can be powered by algorithms and personalized to individual screens is is even more powerful than what we had with TV. But I would also push back. I think it&#x27;s a little bit too nostalgic the way you&#x27;re remembering TV. This was sort of the key data from that episode. This idea of the seven to eight hours a day the TV was on. It really became something that</p>\n<p>people had on constantly. It it was closer to our current relationship with phones than I think people remember. And the reason why we don&#x27;t remember that 1980s, early 1990s era relationship with TV where it was always on. Like you&#x27;d be doing the dishes, you&#x27;d be cleaning your house, you&#x27;d be at dinner, and it was always on. We don&#x27;t remember that because there was this uh lacuna, the golden age of TV that emerged in the 2000s where we remembered like appointment TV watching where I would on Sunday night watch the Sopranos. that really before that TV was much more closer to the slot model. You would watch, you know,</p>\n<p>there&#x27;s just stuff that was on that was like entertaining in some basic way. Occasionally like a show would be unusually smart like Seinfeld, but most of it wasn&#x27;t. And it was just kind of on like you just put it on at night or you had it on if you&#x27;re at home, you would just have it on. The difference, as you you point out though, Lewis, which is right, is it didn&#x27;t track you personally. Um, it couldn&#x27;t follow you outside of the house, which I think is a big deal. You didn&#x27;t have it at work where our phones are at work. So, it&#x27;s not like we had the TVs on while we&#x27;re at the office. So, there&#x27;s a lot of ways that it&#x27;s worse, but I also want to puncture the nostalgia and be like, actually, we want to be constantly</p>\n<p>distracted. And we got as close to simulating Tik Tok with an old Zenith color TV at our houses as we possibly could with that technology. And so, it&#x27;s a drive that we have, which is why I think, by the way, that&#x27;s the point of the the the the episode. This is why so much of the internet just went back to that model and just did it even better. That&#x27;s where the money is. That is like this deep human instinct. It all kind of comes back to that. All right, let&#x27;s load up another comment here. Um, this one is I&#x27;m gonna say supposedly from uh Glee Date LJ1979. I say supposedly because I think this is</p>\n<p>clearly an AI comment. Uh, actually I had Nate look at this Jesse and he threw an AI detector and he&#x27;s like, &quot;Oh yeah, this is definitely AI.&quot; So this is AI kind of defending AI, but let&#x27;s just read this. I have just finished viewing Mr. Cal Newport&#x27;s latest discourse, wherein he posits rather dowly, I might add, that the internet is devolving into little more than a continuous flow of episodic video, or to use his pedestrian term, television. He seems quite perturbed by this notion, invoking sociologist and data chars to bemoan or slide from a culture literacy to one of passive consumption. While Mr. Newport is a thoughtful chap, I fear he has missed the forest for the trees, or</p>\n<p>perhaps missed the symphony for the noise. allow me to offer a more refined perspective on why the shift particularly powered by our marvelous artificial intelligence is not a regression but a renaissance. All right. And then this person who&#x27;s actually an AI goes on to say like, hey, the the content we get from like AI and social media is like great and targeted and much more edifying to what was on TV. All right, so this was clearly written by AI, but it&#x27;s like an interesting point. Um it&#x27;s worth taking this apart. Um, it summarizes the episode wrong as you would expect because it&#x27;s AI trying</p>\n<p>to do it. Uh, it&#x27;s not my term flow. That&#x27;s Raymond Williams term. Um, I don&#x27;t the culture of literacy to want a passive consumption. That&#x27;s Walter. That&#x27;s not me saying that. But whatever. I&#x27;m glad it calls me a thoughtful chap. But is it true? Is it true this argument that uh what we get now through our our phones powered by algorithms are personalized to us is like way more interesting than the junk that we used to look at on TV. It could have been it could have been but it&#x27;s really not.</p>\n<p>It&#x27;s mainly slop now. Once we went to all social media began devolving not towards what&#x27;s the goal of social media algorithms? Is it the personalized the most meaningful or interesting possible user experience? No, it&#x27;s time on app. And guess what gets you time on app? It&#x27;s slop. It&#x27;s just customized slop. Like if you look at Twitter, just like the homepage, it shows you it&#x27;ll be whatever like weird slop happens to like press your buttons like uh people in fist fights caught on, you know, surveillance cameras or car crashes or</p>\n<p>whatever it is, right? Uh it&#x27;s just devolving towards slot because once you have an algorithm saying, I want you to look at this app as much as possible. Now, it&#x27;s just playing with your short-term motivation centers, not your frontal cortex, not with like your your your understanding of what&#x27;s interesting and what&#x27;s good. The stuff it shows you is not going to be great. So, AI, thank you for trying to fend AI, but uh I think you aren&#x27;t doing that well of a job. All right, let&#x27;s do another comment here. Nhar768, Mark Zuckerberg was never the brightest bulb in the pack. He just got super lucky with Facebook. Why he thought it was a good idea to evolve both Facebook</p>\n<p>and Instagram into a TV competitor is something I don&#x27;t understand. He should have kept one of them pure to their original design and evolved the other, but instead he ruined both. Instagram is essentially bad Tik Tok now and literally no one posts cool photos anymore. He probably has to suck every dollar out of Facebook and Instagram to cover all the losses from his ideas that completely flop like the whole metaverse thing. This is kind of a baffling thing to me and there&#x27;s two things that are true at once. I agree that a lot of like Zuckerberg&#x27;s decisions don&#x27;t seem very savvy, right? like yeah moving both Facebook and Instagram</p>\n<p>towards algorithmic curation of other people&#x27;s content to try to compete with Tik Tok but now making them both sort of superolous and vulnerable losing the main competitive advantage he had which was the distinct feel of both of those platforms and the social networks Facebook&#x27;s competitive advantage everyone I know is on it you would think you would lean into that this is the place where you you you stay in touch with and keep in touch with people you know no other service can offer that but no they&#x27;ve le they&#x27;ve changed Facebook so now I think it&#x27;s something like 80 something% of what the average Facebook user sees, according to their August FTC filing from Meta, is from other people</p>\n<p>they&#x27;ve never heard of. All your competitive advantage is gone. You&#x27;re just competing with Tik Tok with the worst Tik Tok. Like Tik Tok, but only uh populated by, you know, your 64 year old uncle who watches a lot of Fox News. That&#x27;s not fun. That&#x27;s not you. I don&#x27;t need to see, you know, whatever random people&#x27;s uncle sharing their outrage about whatever. Instagram, it had like a nice visual aesthetic to it. It was a place where you went at first to follow friends and family, but then it became more about uh highly visual influencers and experts that you cared about. Like I this person who walks in her white linen dress through flower fields and puts</p>\n<p>stuff in jars with her kids is calming to me. This particular person I want to see these really nice videos she produces. It was like a documentary channel that was made for your your needs. Once you&#x27;re like, it doesn&#x27;t matter who you follow. We&#x27;re just going to show you like random videos that do well. Again, where&#x27;s your competitive advantage? Like that&#x27;s a bad decision. The metaverse was a spectacularly bad decision. He put way more money into that adjusted for inflation that the US government did for the Apollo program and nothing came out of it. He was just wrong. Their AI investments have all messed up. They hired away all these people, built the super intelligence</p>\n<p>center that shut down the super intelligence center, move people around. They&#x27;ve really have had an incoherent AI strategy, right? So you&#x27;re like Mark Zuckerberg. Yeah. Geez, it seems like this guy doesn&#x27;t know what he&#x27;s doing. Also though, he&#x27;s still in charge of this company. You know how hard it is to start a company when you&#x27;re 20 and now in your early 40s to still be in charge of it ain&#x27;t no small thing. Meta is like one of the highest capitalized companies in the world right now. I mean, it&#x27;s it&#x27;s one of these companies that uh has revenue in the hundreds of billions of dollars a year is capitalized near a</p>\n<p>trillion dollars. All of the other big tech companies that came out of that era, they&#x27;re leader, the people who founded them, they&#x27;re not in charge of these things. Google is not in charge. Uh, you know, it&#x27;s not Larry Page running Google anymore, right? They they passed that on. Um, I mean, we see this these big companies that survived like almost all of them. Microsoft&#x27;s not run by Bill Gates anymore, right? Like almost all of these, of course, you&#x27;ve passed on your leadership to like an expert class of leaders. Zuckerberg has held on that that means he&#x27;s a savvy and savage corporate infighter. Here&#x27;s</p>\n<p>another thing about Meta. It&#x27;s making a lot of money. They&#x27;re making a huge amount. I looked it up the other day. It was over $200 billion a year in annual revenue. That&#x27;s massive. Tik Tok by comparison is about $30 billion um annual revenue. So Meta is a ma so it&#x27;s doing really well. I know people who work there. They&#x27;re well resourced and they have really good people working there. So somehow we have on one hand Mark Zuckerberg is like making weird bad decisions one after another. On the other hand, it&#x27;s like an incred it&#x27;s a very high revenue company, one of the</p>\n<p>biggest companies in the country, and this guy has stayed on. Mark has stayed in charge. You got to believe people are coming at him. You don&#x27;t have a company worth almost a trillion dollars where you don&#x27;t have, you know, swords being thrown towards your throne all day long and he survived it all. He&#x27;s also like a savvy savage operator. So, I don&#x27;t know how both of these things are true. Maybe he&#x27;s just milking the money out of his assets. He bought Instagram, then he bought WhatsApp. You know, they&#x27;re putting their their their cash towards the right things to keep making cash. I don&#x27;t know what&#x27;s going on because he&#x27;s not making good decisions and yet he&#x27;s arguably one of the most successful CEOs</p>\n<p>of the 21st century. So, you know, I don&#x27;t know what&#x27;s going on there. Um, it&#x27;s a good question and he confuses me. All right, here we go. Uh, JRGY 108 says, &quot;Kel, personally, personally, I like it when you go deep on uh nerd [ __ ] like chaos theory and Lauren&#x27;s number. More of this, please.&quot; All right, I think we&#x27;re obligated now. I don&#x27;t normally curse, but because there was so much cursing in the earlier part of this episode, I was like, &quot;We&#x27;ve that that horse is out of the barn.&quot; &gt;&gt; We might have to take it off of YouTube. &gt;&gt; Um</p>\n<p>Oh, yeah. They don&#x27;t like the cursing, right? &gt;&gt; Yeah. &gt;&gt; Yeah, I know. Well, we&#x27;ll figure it out. Uh yeah, I&#x27;m happy to talk chaos theory or math or whatever um all day long. All right, what we got here? Yeah, this question kind of confused me. Daniel Linen 3108. Is Newport being paid to read these adverts? Certainly seems like it. What does he assume the other option is that I just like to read ad copy on my own? Is that what &gt;&gt; for free? &gt;&gt; Adverts is short for advertisement. Oh, advertisement.</p>\n<p>&gt;&gt; Yeah. &gt;&gt; Yeah. So, okay. I hate that this is I feel like I hate to burst, you know, your illusions about media, but we get paid to do advertisements. Like, that&#x27;s kind of how this works. It&#x27;s not the cheapest thing. We got to pay for the studio and all of this. uh equipment. Um you know, Jesse&#x27;s truck requires I would estimate like about a quarter million dollars a year in just repair cost &gt;&gt; to get me to Tacoma Park. &gt;&gt; Just to get you to Tacoma Park, right? That ain&#x27;t cheap. Advertisements is how you pay for it&#x27;s either that or you put it behind a pay wall, but then no one</p>\n<p>listens to it. So, yeah, we I I mean, I love all these companies, but yeah, there probably would be less content about those companies in this show if uh I wasn&#x27;t getting paid to read them. So, I guess I should clarify that. All right, we got Peter Webb 8732 said, &quot;On the internet, the people who yell at the television now yell at each other.&quot; Yeah, that&#x27;s that&#x27;s about right. That about sums it up. The internet has become television. This is the the main difference, though. Instead of yelling at the newscaster, we uh we can yell directly at each other. So, I guess uh progress. &gt;&gt; There we go. Thank you, technology. All right, that&#x27;s all the time we have for</p>\n<p>today. Our first episode of 2026. This is our this is our Super Bowl, right? January is when our podcast people are on it. [music] that they want to improve. So, we got some cool episodes coming up. So, definitely stick with us. We&#x27;ll be back next week with another episode. And until then, as always, let&#x27;s stay deep. Hey, if you like this video, I think you&#x27;ll really like this one as well. Check it out.</p>", "chapters_count": 3}