{"video_id": "Kds492UqO3I", "title": "Pam Bondi IMPLODES Over Epstein Bombshell as Shutdown LOOMS", "link": "https://www.youtube.com/watch?v=Kds492UqO3I", "published": "2026-02-13T09:00:24+00:00", "summary": "Immigration enforcement suddenly halts in Minneapolis as Democrats push to disrupt ICE funding and shut down DHS unless major reforms happen. At the same time, Pam Bondi’s House hearing turns into a four-hour Epstein showdown — with survivors in the room and Democrats accusing the DOJ of stonewalling. Jessica Tarlov and Aaron Parnas (@aaronparnas1) break down whether Bondi just handed the opposition a powerful midterm talking point. Cracks are also forming inside the GOP. House Republicans defy Trump on tariffs, triggering primary threats and raising a bigger question: is the party truly starting to break ranks — or is this just symbolic rebellion? And with 130,000 jobs added in January and unemployment ticking down to 4.3%, is the labor market shaking off the trade war drama? Plus: RFK Jr.’s pivot from vaccine skepticism to “healthy eating,” Pelosi’s endorsement of Jack Schlossberg, Prince Andrew’s reported settlement money, and an Olympic controversy that has everyone talking.\n\n\n00:23 Pam Bondi’s disastrous testimony \n11:06 Cracks in the GOP’s support for tariffs \n16:40 The end of immigration enforcement in Minneapolis\n\n\nFollow Jessica Tarlov, @JessicaTarlov\nFollow Prof G, @TheProfGPod \nFollow Raging Moderates, @RagingModerates \n\nSubscribe to our YouTube Channel: https://www.youtube.com/@RagingModerates", "transcript_html": "<h2>&lt;Untitled Chapter 1&gt;</h2>\n<p>Welcome to Raging Moderates. I&#x27;m Jessica Tarliff. &gt;&gt; And I&#x27;m Aaron Parnes. &gt;&gt; And in today&#x27;s episode, we&#x27;re discussing Pam Bondi&#x27;s disastrous testimony, cracks in the GOP&#x27;s support for tariffs, and the end of immigration enforcement in Minneapolis. If you aren&#x27;t already, please make sure to subscribe to our YouTube page to get up-to-date coverage. All right, Aaron, let&#x27;s get into it.</p>\n<h2>Pam Bondi’s disastrous testimony</h2>\n<p>This week&#x27;s House hearing with Attorney General Pam Bondi turned into an allout Epstein match as she stonewalled Democrats for four hours and refused to apologize for the DOJ&#x27;s handling of the files, even with survivors in the room. Let&#x27;s watch a clip. &gt;&gt; How many of Epstein&#x27;s co-conspirators have you indicted? &gt;&gt; You showed it. You I I find it. &gt;&gt; How many have you &gt;&gt; Excuse me. I&#x27;m going to answer the question. &gt;&gt; I answer my question. &gt;&gt; No, I&#x27;m going to answer the question the way I want to answer the question. Your theatrics are the way I asked it. Chairman Jordan, I&#x27;m not going to get in the gutter with these people. &gt;&gt; You can let her filibuster all day long,</p>\n<p>but not on our watch. &gt;&gt; Not on our time. No way. And I told you about that, Attorney General, before you started. &gt;&gt; YOU DON&#x27;T TELL ME. &gt;&gt; OH, I did tell you because we saw what you did in the Senate. &gt;&gt; Lawyer, not even a lawyer. &gt;&gt; Was the president aware of Secretary Lutnik&#x27;s ties to Epstein when he chose him to lead the Department of of Commerce? &gt;&gt; Chris Men was a border patrol agent. &gt;&gt; Okay. So, I&#x27;m going to conclude that the president in fact did know about his ties because he was the next door neighbor. &gt;&gt; Shame on you. &gt;&gt; Oh, for goodness sakes. This is not a</p>\n<p>game. Secretary, &gt;&gt; I&#x27;m attorney general. &gt;&gt; My apologies. I couldn&#x27;t tell. &gt;&gt; [snorts] &gt;&gt; So, I was on an airplane while this hearing was going on and consuming these clips from the sky and I feel like if anyone was watching my face, like they would never figure out that I was watching a hearing cuz that was like some insane movie where I was like, &quot;Oh, no, she didn&#x27;t.&quot; And then like, &quot;Oh, is that really happening?&quot; and then almost crying when she wouldn&#x27;t even turn to look at the survivors, which seems like the lowest level of</p>\n<p>basic decency uh that you could give to people. What were your big takeaways? &gt;&gt; Yeah, I felt like I was watching the five. I mean, it was just it it was kidding. &gt;&gt; I I was about to be like, I wonder if it was lower or higher rated cuz that that&#x27;s what Trump is looking for. He&#x27;s like, did we get a big number? [laughter] &gt;&gt; Um my big takeaways kind of are twofold. Number one, she didn&#x27;t answer a single question. Like she didn&#x27;t about the Epstein files or really anything that Democrats threw her way. I think number two, and people may be mad at me for this, but I thought that the Democratic</p>\n<p>plan going into it was horrible. I mean, like I I I think like yes, you have a very combative witness, but also like do better in terms of cross-examining her. I think a lot of the members on the Democratic side just used it as a way to talk rather than like some of the for five minutes. Sometimes they spoke for four and a half minutes and didn&#x27;t ask a question, right? I mean, I thought it was ineffective. So, there were real opportunities to kind of press her on some key things. Like, for example, if I were up there, I would have brought up the 86page indictment with the three co-conspirators and forced her to answer</p>\n<p>whether or not certain names were in there and then force her to go on record saying, &quot;I can&#x27;t answer whether or not Trump is in there.&quot; Right? Like, there are ways to kind of get some information out. And I didn&#x27;t feel like it was that productive, unfortunately. And unfortunately for the survivors, I I tweeted out yesterday that [snorts] the real losers in the hearing, I mean, are the survivors. Those are the ones who lost. Like, at the end of the day, at the Democrats will move on, Republicans will move on, like Bondi will move on, but the survivors, they&#x27;re stuck. &gt;&gt; Absolutely. I And I think the point about the line of questioning could</p>\n<p>almost be applied to any hearing. I mean, we so rarely get anything of substance out of these. And because of the way the algorithm is designed, the way media is today, fundraising, etc., everybody&#x27;s just looking for their moment in the sun and their takedown. I mean, every fundraising email that I got was like, &quot;Did you see me with Pam Bonnet? I had members of Congress who I&#x27;m big fans of, you know, texting me their viral tweets.&quot; And I get it like some of it was impressive for sure, but this story does feel different because we are talking about a sex trafficking</p>\n<p>ring, right? like it&#x27;s not your regular or average story that we would be talking about in one of these hearings. I would say and I&#x27;m not a lawyer but I have consumed a lot of TV and both my parents are lawyers. Um, Pam Bondi was not going to answer any questioning, like even if she had been cross-examined properly, like you said, to push her on the 86page indictment, that that woman would respond, you know, well, the Dow is at $50,000 or whatever. The level of disrespect for the importance of this</p>\n<p>story was so apparent. And I just I felt like at a certain point that people should get their grand standing in because this woman, whether it was a directive from on high or just that she actually is that soulless, had no intention of actually having a conversation about the contents of the Epstein files or how the DOJ had handled it. &gt;&gt; Well, I think yeah, I mean I I agree with you. I think some members did a good job at that. like Crockett at the end, Jasmine Crockett. I thought her uh she just spoke for 5 minutes. And typically, I would say like, &quot;No, you should ask her some questions, but she</p>\n<p>wasn&#x27;t answering anything. You were the last person.&quot; And she pretty much read her to filth. Like I I fully was like, &quot;Okay, great. Good. Good work, Congresswoman.&quot; I think for me, looking at Pam Bondi, and I&#x27;ve I&#x27;ve seen Pam Bondi in action for a long time. I&#x27;m from Florida. She was my attorney general uh growing up for eight years or so. She seemed really rattled up there. Like I don&#x27;t I don&#x27;t know why. &gt;&gt; I thought so too. &gt;&gt; I I did not it she didn&#x27;t come across as super composed or super measured. The burn book idea really to me I I get why she did it, but it didn&#x27;t really land</p>\n<p>much. And she seemed as to me I think she&#x27;s on the hot seat internally. I think that Trump is putting pressure on the DOJ saying why are we still talking about Epstein 2 weeks after you release the files? They can&#x27;t get away from this story no matter what they&#x27;re trying to do. And so now you&#x27;re in a situation where it&#x27;s like you have a kind of lame duck AG up there in a way. But also I was kind of surprised and I I would like to get your take on this. No one asked about the six Democratic lawmakers who were almost indicted. Like to me that was kind of crazy, right? Like you don&#x27;t even bring that up at all. Steve Con</p>\n<p>asked about Memphis um and National Guard deployment or ICE deployment there, but nothing about the fact that you almost indicted six lawmakers for sedicious conspiracy &gt;&gt; or how often a grand jury who typically will indict a ham sandwich was not interested in your indictments. And uh from what I&#x27;ve read, uh Judge Piro, I&#x27;m like blanking on her title cuz she&#x27;s just like Janine to me, uh brought in two prosecutors from Westchester County um that she used to work with to do this, which screams that there were probably a bunch of career folks who</p>\n<p>were not interested in bringing this forward, but it definitely is a big story. And I didn&#x27;t connect those dots that that should have been at least a conversation when you have the attorney general in front of you as it continues with the vindictive streak of this administration and that frankly the courts are the only way that we&#x27;re getting any legitimate push back about them. So I like that point and I agree about Bondi being rattled. There were a few times where she actually like paused and you could see her mind working like what level of insane should I go now? and then the way that her voice was</p>\n<p>unleashed. And I&#x27;ve heard her give a lot of interviews at this point. I mean, she wasn&#x27;t my AG, but I&#x27;ve I&#x27;ve consumed a lot of Pam Bondi um in the content sense. And she&#x27;s usually pretty authoritative. &gt;&gt; Yeah. &gt;&gt; Like I don&#x27;t like what she&#x27;s saying, but there was a reason that there were Democrats that voted to confirm her, right? Like this is a woman who has shown herself to be of substance in the past. Um don&#x27;t attack me in the comments. I get it. I even said there was things that Pete Hexth could bring to the job. Not that I said that he</p>\n<p>should uh be confirmed, but she seemed to genuinely not know what direction to go in. And I&#x27;m curious about this cuz I&#x27;ve been asking some people that I&#x27;ve talked to about like why wouldn&#x27;t the DOJ just throw some indictments out there? No one&#x27;s super close to Trump, right? But now you have those six co-conspirators, right? whose names were redacted and then Thomas Massie went crazy and he got the redactions out there like pick any I mean there are a bunch of people in these files it</p>\n<p>globally speaking you know you&#x27;re indicting Russians for the Mueller report like just indict some people that don&#x27;t really matter that don&#x27;t even have Donald Trump&#x27;s phone number to at least say we&#x27;re taking action and you can throw that back in people&#x27;s faces because the frustration at this point is you&#x27;re doing absolutely nothing we&#x27;re not about Donald Trump or Howard Ledneck, who I&#x27;m not accusing of doing anything with underage women, but like &gt;&gt; there are really bad dudes in these files and you could get a win with your base cuz the MAGA base who&#x27;ve been</p>\n<p>talking about the Epstein files for years, they&#x27;re still really mad and they&#x27;re getting madder like people like Tim P. &gt;&gt; I also think something that I mean you don&#x27;t have to indict people for sex trafficking or anything related to underage girls or um women or any of that. You could there are easy ways to indict people in these files for money laundering, for tax evasion, right? Like financial related crimes because there&#x27;s a whole host of lot so much money moving one way or the other. And so that&#x27;s that&#x27;s &gt;&gt; go after the banks. &gt;&gt; Go after the banks. Go after the banks. &gt;&gt; That&#x27;s popular with everybody.</p>\n<p>&gt;&gt; Go after the banks. I mean, and also like Les Wexner is lowhanging fruit in my opinion. Like that that is to me. &gt;&gt; He&#x27;ll be in to testify, right? &gt;&gt; Yeah. He&#x27;s going to play the fifth. Um, I wouldn&#x27;t be surp I mean, he has no nothing no reason not to. It&#x27;s not a criminal proceeding by any means. It&#x27;s not a grand jury proceeding. They had enough to label him a co-conspirator internally. They did. And if they have enough to do that, they have enough to secure an indictment in my opinion if they want to. And the fact that they haven&#x27;t kind of says everything you need to know about this justice department.</p>\n<p>And it&#x27;s not just this justice department. I think I do want to say four justice departments. every Justice Department since Bush, every single one. So, &gt;&gt; yeah. I mean, I think it&#x27;s a it&#x27;s a little bit different. And I want to see Alex Aosta again. This is like to me a political layup in that it is bipartisan. How much inappropriate behavior there has been and voters are willing to take off their team jerseys about this in general. There are some who are dug in and are like, &quot;Well, the Clintons blah blah.&quot; I&#x27;m like, &quot;I don&#x27;t care. like let them defend themselves.</p>\n<p>&gt;&gt; Not I mean I think it&#x27;s absurd that Hillary is getting hauled in for any of this &gt;&gt; labeled in the fals twice indirectly. It wasn&#x27;t I mean &gt;&gt; I think she last saw him in the &#x27;9s but anyway not new for her to be blamed for things uh going on in her husband&#x27;s life. It&#x27;s it&#x27;s wildly frustrating. So</p>\n<h2>Cracks in the GOP’s support for tariffs</h2>\n<p>Epstein&#x27;s not the only topic that&#x27;s defining Republicans at this point. And after more than a year of dodging tariffs, House Republicans defied Trump in two back-to-back votes with three Republicans blocking a procedural shield and six joining Democrats to roll back tariffs on Canada, prompting Trump to threaten to primary um each of them on True Social, which is his favorite move. Um this is mostly symbolic, Erin, but why do you think it&#x27;s actually happening at this point? I mean, they&#x27;ve been talking a big tariff game for a while, but it&#x27;s the first time that we&#x27;ve seen an actual vote on it. Well, they want to</p>\n<p>stay employed. I mean, that that&#x27;s why, right? Like, I think the six Republicans who broke from Trump, other than Don Bacon, who&#x27;s not running for re-election anymore, I mean, like, these are frontlininers. Like Kevin Kylie&#x27;s a front liner. Brian Fitzpatrick, a frontliner. &gt;&gt; They want to kind of go on record ahead of November to say, &quot;Listen, I never supported some of the crazier stuff coming out of this administration. When I could vote against tariffs, I did vote against tariffs.&quot; I don&#x27;t think Trump is actually going to primary someone in a 50/50 district. I mean, I don&#x27;t think he&#x27;s crazy. He&#x27;ll say it, but I don&#x27;t think he&#x27;ll do it. I don&#x27;t know that</p>\n<p>he&#x27;ll offer his fullthroated support for Brian Fitzpatrick. But I also don&#x27;t know that Fitzpatrick will &gt;&gt; I don&#x27;t think that helps Brian Fitzpatrick. I&#x27;m sure he does not want him anywhere near him. &gt;&gt; Exactly. So, I think that&#x27;s why it&#x27;s happening now. It is largely symbolic. I was actually surprised that more Republicans didn&#x27;t break from Trump on these tariffs because it kind of, in my opinion, if I was Johnson and Trump, like we know tariffs are unpopular. Give them the ability to vote against them. they&#x27;re never going to override this veto because you&#x27;re never going to get two/3 as we&#x27;ve seen over the past year, but give them some some leeway to vote against tariffs. That didn&#x27;t happen. So, I mean, I think that&#x27;s why it&#x27;s</p>\n<p>happening now, though, is because we&#x27;re nearing the midterm elections and Trump&#x27;s agenda is historically unpopular right now. His approval ratings not above 40% in most polls. Like, I mean, [snorts] it&#x27;s it&#x27;s just bad all around. So, any way that they can get away from him is they&#x27;ll they&#x27;ll take it. his approval rating so low that Gallup had to stop polling approval ratings. &gt;&gt; Yeah, that&#x27;s a whole other discussion. No, I mean it is very expensive to do it, but I cannot get it out of my head that it has to be related to watching what happened to Anne Selzer um from the De Mo Register uh with her presidential</p>\n<p>poll. I agree with you on the tariffs. It seems like a layup, especially when you look at the data on this. Tax Foundation calculated $1,000 per average family last year because of the tariffs. this year it&#x27;s going to go up to $1,300. Um, but we did have a better thanex expected jobs report. So, it was kind of dueling days on this. So, there was the massive revision from 2025 that I think only like 181,000 jobs were added over the course of the entire year, which is dismal um beyond imagination. Um, and then the report was what was it like 166,000 or something like that</p>\n<p>&gt;&gt; but I mean it could end up being revised down. It was mostly due to healthcare jobs which has been consistently the sector that&#x27;s hiring a lot. Do you think that this is all part of the plan and like whatever Kevin Hassid and Peter Navaro have been talking about like they&#x27;re really cooking with gas. It&#x27;s just we needed to get into 2026 for it to happen. &gt;&gt; Well, my question is I was told that I shouldn&#x27;t believe the bad job numbers over the past several months. So, do I have to believe the good ones now? I&#x27;m just I don&#x27;t I don&#x27;t know what to believe and what not to believe when you&#x27;re telling me half the time it&#x27;s not your not Trump&#x27;s economy. It&#x27;s Biden&#x27;s</p>\n<p>economy and it&#x27;s bad numbers that were cooked by a liberal activist and now you have good job numbers coming out which these job numbers aren&#x27;t even that great. They&#x27;re just &gt;&gt; No, I&#x27;m sorry. [laughter] Yeah, let&#x27;s be clear. So, an average month of Biden was about 350,000 jobs. So, it&#x27;s just not zero or negative, which it&#x27;s the participation trophy of the jobs number. &gt;&gt; Yeah. Listen, I&#x27;ve never seen a that I think this is actually pretty historic. It&#x27;s the first time in history that a FIFA prize winner also won this participation trophy as well. So, this</p>\n<p>is very new um to a lot of &gt;&gt; and a Nobel winner by extension &gt;&gt; by extension. And I think I think he got the best coal miner award this week too actually in the White House. &gt;&gt; So, he&#x27;s he&#x27;s getting a lot of awards which good for him. Um &gt;&gt; yeah, &gt;&gt; but no, I mean &gt;&gt; more than my four-year-old. &gt;&gt; Yeah. I I don&#x27;t know where this economy is going to go. I really don&#x27;t. I think that all of this is also the writings on the wall for the White House in the sense they know that if the economy is kind of in the dumpster in November, it&#x27;s not going to be good good for them. So, they&#x27;re going to try to figure out a</p>\n<p>way to turn this around before the midterms in a way. Prices are still high. Wages are still stagnant, right? Like, yes, we had some decent job growth in one month, but ultimately you ask the average American, can you get a new job? And the answer is no, right? like you have very few openings and thousands of applicants for each opening. So ultimately the Dow can hit 50,000 all they want and they can say they&#x27;re adding all these numbers all they want. But if the average American isn&#x27;t experiencing support and and help in the job market, then it&#x27;s all for not. As I</p>\n<p>always say, learn from the Democrats mistakes because we went out there talking about our great GDP growth and our jobs numbers and our, you know, fastest recovery in the G7 and nobody cared and [clears throat] went out and voted for Trump. So, &gt;&gt; because who knows what GDP stands for? I barely know what that stands for, right? Like, &gt;&gt; like like you want me to tell you? &gt;&gt; No, no, no, no, no, no. I&#x27;m I&#x27;m just I&#x27;m just saying that like I was playing I thought I thought we were being funny with each other. Okay, &gt;&gt; let&#x27;s take a quick break. Stay with us. [music]</p>\n<p>&gt;&gt; Welcome back. On Thursday, Tom H.</p>\n<h2>The end of immigration enforcement in Minneapolis</h2>\n<p>Homeman declared the end of immigration enforcement in Minneapolis. Let&#x27;s watch a clip. &gt;&gt; I have proposed and President Trump has concurred that this surge operation conclude. We have a lot of work to do across this country to remove public safety risk who shouldn&#x27;t even be in this country. And to deliver on President Trump&#x27;s promise for strong border security mass deportation, law enforcement officers drawn down from this surge operation will either return to the duty station or be signed elsewhere to achieve just that. ICE is a legitimate federal law</p>\n<p>enforcement agency. We&#x27;re not out scouring the streets to disappear people or deny people their civil rights or due process. We&#x27;re going to force the immigration law. We&#x27;re going to have a mass deportation. President Trump promised that and we&#x27;re committed to that. &gt;&gt; That was fast, right? It was just what, two weeks ago that Homeman showed up. Then last week we had the scaling down of the 700 and now the surge is over. Were you surprised? I was surprised that it was this quick. &gt;&gt; Yeah, me too. I mean, what do they always say? They say Jessarlo is always right. I mean, you did say that they</p>\n<p>bring in &gt;&gt; like literally no one says that. &gt;&gt; No one says that. But okay, Jessarlo is sometimes right. Um, you did say Tom Hman was going to be brought in and they were going to bring some normaly and potentially do this draw down. So, you kind of were talking about it. I mean, I&#x27;m kind of still in the I&#x27;ll believe it when I see it mode, right? Like it&#x27;s going to take some time for them to move out. And he did say at some point that there was still going to be some presence on the ground even though it&#x27;s going to be much smaller. Unless you are for no no ICE enforcement at all, right? Like the hardcore abolish ICE people who don&#x27;t even think that the people who are</p>\n<p>here illegally, yes, but have committed crimes in the US and are eligible for pickup and deportation back to their own countries shouldn&#x27;t be here. ICE is going to exist. There were, I think, 150 agents in Minneapolis before the surge, which went up to 3,000. But, you know, it is when he says it&#x27;s a legitimate law enforcement force, like so says government documents and they&#x27;re funded through 2029, no matter what people want to believe. That&#x27;s the that&#x27;s the reality. &gt;&gt; It is. Um, but there&#x27;s going to be a government shutdown uh for a little</p>\n<p>while. &gt;&gt; 100% 100%. And I think I think it&#x27;s going to last through Trump&#x27;s State of the Union. Um, I think it&#x27;s going to be a prolonged shutdown. And I think that it&#x27;s worth a prolonged shutdown because I don&#x27;t think that any new money should be going to ICE in this time even if they&#x27;re drawing down uh forces uh in Minneapolis. Like I get that it&#x27;s funded through 2029. But for me, I didn&#x27;t I never liked the moniker abolish ICE. I actually preferred abolish Trump&#x27;s ICE, just this version of the department in the sense that like I don&#x27;t think this</p>\n<p>department this version of the department should exist. I think that violent criminals who are here illegally should not be here, but your average everyday undocumented immigrant who is here contributing to society should be here. Um, if they want to be, there should be a pathway to citizenship. I can go on my soap box all day. We&#x27;ll see what happens in Minneapolis. I just I worry that they&#x27;re going to draw down in Minneapolis and then what? We&#x27;re going to go to Springfield, Ohio, right? Like we&#x27;re going to go to Philly. Where are we going to go next? Because that that&#x27;s kind of Or are we just going to put a pause on this? put a pin on immigration</p>\n<p>until December, until after the midterms, until people so people forget about it a little more. What&#x27;s going to happen next? &gt;&gt; Well, that would be smart of them since, you know, Donald Trump took his most popular issue and flushed it down the toilet with all of this. I don&#x27;t think Steven Miller will be able to survive waiting that long. But if Susie Wilds has any control, I I&#x27;m sure that she&#x27;s saying we can&#x27;t afford to do this. Allah Susan Collins was going to get a surge of ice uh to Maine. there were, you know, a few hundred that showed up and then she was like,</p>\n<p>&gt;&gt; &quot;No, not &gt;&gt; DH [clears throat] secretary. No one, please get them out of here.&quot; &gt;&gt; Um, there was also a So Todd Lions, the acting ICE director, he was with uh congressional in a congressional hearing, then he was with the Senate and something that he said, well, he said a bunch of interesting things. I I think he&#x27;s very good in these hearings. I called him like a cool cucumber on the five. I don&#x27;t agree with a lot of what he&#x27;s saying, but he has the demeanor of someone that you would expect to be in that job. And uh Alyssa Slaken, Michigan senator, was pushing him about ICE to</p>\n<p>polling places. &gt;&gt; Did you hear his follow-up answer to that? &gt;&gt; Do you believe that ICE has the authority to be deployed to US polling places around the country? &gt;&gt; So, ma&#x27;am, we&#x27;re a civil obviously we do civil enforcement and criminal law enforcement. There&#x27;s no reason for us to deploy to a polling facility. Homeland Security investigations, we do investigate voter fraud, which we&#x27;ve had made several arrests, most recently a high-profile one in Massachusetts. Like I say, ma&#x27;am, there&#x27;s no reason to use ICE officers in that. &gt;&gt; Great. Well, I hope that in the privacy of that meeting when that comes down and</p>\n<p>the president feels like he&#x27;s going to lose the midterm elections that you don&#x27;t buckle &gt;&gt; and if like the president calls, who knows what&#x27;ll happen essentially. &gt;&gt; Okay. All right. So elections still in danger, but on the record that I should not be monitoring the polling places in the way that Trump wants. He basically admitted that there are people who are getting like 42 days of training and are out there. I mean, a lot of the things that Democrats had been saying that are going on. &gt;&gt; Uh he acknowledged. So you think we&#x27;re heading to this shutdown? Do you think there&#x27;s any give on the list of demands</p>\n<p>that the Democrats put out there um that Republicans will go for or it&#x27;s full stalemate? They&#x27;re not gonna go for anything. &gt;&gt; Full stalemate. They&#x27;re not going for anything. I mean, I don&#x27;t know. I think the latest reporting was that they&#x27;re going home. Like, they&#x27;re gonna they&#x27;re gonna vote the bills are going to fail and then they&#x27;re going to go home for a week. So, like shut down all our guaranteed for a week and then we&#x27;ll see how long it goes. But if I&#x27;m Democrats, shut it down until the end of the Trump administration. Shut it down for as long as you want. I am not funding ICE and DHS in its current form. and you hold</p>\n<p>out as long as you need to until they cave because you don&#x27;t do what you did last time 50 days later just cave after 50 days. You shut this down. &gt;&gt; How will life function if you shut it down until December? &gt;&gt; It&#x27;s only one agency. Um &gt;&gt; I know, but DHS also covers FEMA. They cover the TSA. &gt;&gt; I hear you. But I mean, we&#x27;re at we&#x27;re at the point where the Democrats have all of the leverage for the first time, I really think in a long time. They have all of the leverage. If you&#x27;re not dealing with a full government shutdown, you&#x27;re dealing with an issue where you have twothirds of the country on your</p>\n<p>side. Use it. Use the leverage that you have and force at least Donald Trump to give a state of the union during a government shutdown. Force some of these things to happen and then and then we&#x27;ll see. I mean, yes, it is a shitty position to be in. [snorts] But ultimately, what are you going to do? You&#x27;re just going to give them what they want and then what? And then continue to do this for 3 years and then just say like talk a big game and and not actually act on it. Democrats have been saying they&#x27;re not going to they&#x27;re not going to vote. They&#x27;re not going to vote. They&#x27;re not going to vote. If they turn around and vote, they&#x27;re going to lose a lot of support. &gt;&gt; I&#x27;m sure they&#x27;re having uh panic about</p>\n<p>that. It&#x27;s always like you get to the top of the mountain, right, and you&#x27;re like, &quot;Oh, this is what it feels like.&quot; And then you&#x27;re like, &quot;I&#x27;m going to walk myself down the other side.&quot; Um &gt;&gt; John Federman told this to &gt;&gt; they may lose uh their favorite raging moderate at some point. like at this point [clears throat] like &gt;&gt; I&#x27;m in and I&#x27;m out, you know? I&#x27;m like always supportive but also always critical um based on the text messages that I get. Well, why&#x27;d you have to say that? I&#x27;m like, well, cuz I thought it was shitty. I want to talk about RFK for a second. So, his vaccine program,</p>\n<p>&gt;&gt; you see, he said he was snorting cocaine off a toilet seat the other day. &gt;&gt; I did see that. Anyway, so the vaccine stuff is not going well for him. So, he&#x27;s going out on this eat real food tour. Yes. And I have always been very concerned about this aspect of the platform and this was going on when he was running in the Democratic primary too that his positions on things like food dyes and getting healthy and redoing the food pyramid and talking about, you know, big food companies and</p>\n<p>processing and like all the stuff having to do with taking care of your body, not the medicine part cuz that he&#x27;s totally crazy on. Um we just like we don&#x27;t message well on it. Biden banned a few food dyes, never talked about it, right? Like if you ask the average Maha mom, she has no idea that Biden cared about yellow dye. So what do you make of him being out there in this respect? And do you think that Democrats have a real problem with the Maja voters? &gt;&gt; No, because I don&#x27;t really think people care or even know that he&#x27;s out there doing this. Like I I I really don&#x27;t. I</p>\n<p>mean, yes, Democrats could have messaged it better, but I don&#x27;t think they&#x27;re messaging it that well either right now. Like this new food pyramid, like I don&#x27;t think it&#x27;s kind of falling off the planet. Um, the dye is great. I mean, that&#x27;s a bipartisan issue, but no one&#x27;s really talking about the dyes because the issue that Democrats have is that they don&#x27;t know how to message their wins. The issue Republicans have is that they muddle their messaging with their wins. So, like he talks about the dye bands and then goes and snorts and &gt;&gt; then he&#x27;s like, &quot;Don&#x27;t have Tylenol, &gt;&gt; right?&quot; And then or don&#x27;t have snorts cocaine &gt;&gt; or snores cocaine or whatever this is. So it&#x27;s like the stuff that he wants and it&#x27;s same thing with Trump with Trump.</p>\n<p>The stuff that they want publicly doesn&#x27;t actually get there because all the viral clips are of the BS that they spew and so I don&#x27;t I don&#x27;t know how much this is actually reaching the average Maha voter or the average voter anyway. &gt;&gt; All right. Uh did you see that Nancy Pelosi is backing Jack Slober in the in the New York 12 race? What do you think about that? &gt;&gt; I f it&#x27;s fascinating. I&#x27;ve I I &gt;&gt; like a lot &gt;&gt; that woman is loyal. &gt;&gt; I like a lot of the people running in that race. I don&#x27;t know. &gt;&gt; Well, cuz literally everybody in New York City is running in that race.</p>\n<p>&gt;&gt; Are you running? &gt;&gt; Except me. No, [laughter] &gt;&gt; I&#x27;m not. I&#x27;m interested in the race. No, I would be a terrible candidate. I am &gt;&gt; I&#x27;m ready too much. The oppo file is [laughter] ready. &gt;&gt; I mean, our text messages you&#x27;re going to be like, look. &gt;&gt; Um, no. I mean, I think Pelosi&#x27;s I I wonder I&#x27;m curious to see how much her endorsement actually matters. That that is what I&#x27;m curious about. We&#x27;ll see. But she&#x27;s a prolific fundraiser, but I also don&#x27;t know that he needs it. &gt;&gt; No, it&#x27;s I mean, it&#x27;s interesting. Obviously, they had a big family tragedy again with his sister Tatiana passing</p>\n<p>away, and so he hasn&#x27;t been as visible. Um, but it&#x27;ll be very interesting to see how seriously he takes this. Wonder if Pelosi had a conversation with him that was like, &quot;Is this real or is this a thing that you&#x27;re going to do for a little bit and then you&#x27;re going to go back to Vanity Fair and Tik Toking from the laundry room in your building?&quot; My friend lives in the building and says he sees him in the laundry room and he&#x27;ll be like, &quot;You want to be in the video?&quot; And he&#x27;s like, &quot;No, just want to do the laundry.&quot; Did you see I&#x27;m now looping back to</p>\n<p>Epstein world um that Queen Elizabeth reportedly gave then Prince Andrew $7 million to settle with Virginia Juy and avoid a court fight over her sex abuse allegations. &gt;&gt; I did not see that. &gt;&gt; Well, here I am breaking the news to Aaron Parnes myself. Does that surprise you? &gt;&gt; I don&#x27;t know that it surprises me. Um, I think the royal family is very much like incubators and want to protect their own as much as they can, but at this point, I mean, you can&#x27;t protect Andrew. I mean, he&#x27;s all these files and he lied.</p>\n<p>He lied about Virginia Dufra and his relationship with her. So, the truth is slowly coming out. &gt;&gt; So, I have two thoughts about this. One, this feels very bad for the monarchy. like way worse than Prince Andrew actually existing because you had this image of everybody else within the royal family being on solid moral ground when it came to this. Like when they found out they were like you don&#x27;t get your title anymore. You don&#x27;t get to live here anymore. Go off in the countryside and figure your way out. And I have felt like Prince Charles has had such a a</p>\n<p>Prince King now, your your excellency has been so like it must be so hard to have to turn on your brother like that, but he&#x27;s been so by the book and saying, you know, investigate to the full extent of the law, etc. And then you see something like this and it feels like such a stain on the monarchy. I mean, obviously Queen Elizabeth is not around anymore uh to defend what happened, but it did surprise me. It didn&#x27;t it didn&#x27;t feel like a move that she would have made. Last thing I wanted to ask you about the Ukrainian skeleton racer who was disqualified from the Winter</p>\n<p>Olympics after refusing to remove a helmet honoring 24 of the 500 plus Ukrainian athletes killed in the war. Violation of the IOC&#x27;s rules on political statements. Um I was really bummed. I always am bummed when stuff like this happens, especially when it&#x27;s so black and white as to who the good guys and the bad guys are and it doesn&#x27;t seem like a political statement to honor uh people who have been killed. Um, but do you think it&#x27;s a bad move for the Olympics to legislate on something like this or it&#x27;s like</p>\n<p>&gt;&gt; I just I don&#x27;t I don&#x27;t get how the Olympics can say that this is a bad political statement or whatnot when they banned Russia from competing. Is that not the same thing? Like the Olympics did that, right? Like they banned Russia. They said that you can&#x27;t compete under a Russian flag. And so when a Ukrainian wants to support those who died at the hands of the Russian government, like &gt;&gt; come on. &gt;&gt; Come on. &gt;&gt; Come on, &gt;&gt; IOC. Come on. Um on a whole host of reasons. All right. Uh what are you raging about? Um, it&#x27;s not like super raging about, so I don&#x27;t get like super hate for this, but like I hate the fact that the Amtrak schedule from DC to New</p>\n<p>York cuz I&#x27;m going this weekend uh does not run after like 11:00 p.m. or 10:00 p.m. Like I want to take a late night frame back and I have to stay the night now &gt;&gt; in New York. &gt;&gt; Yeah. &gt;&gt; Oh, well, I&#x27;m not there. We could have hung out otherwise. [clears throat] &gt;&gt; Yeah. Well, &gt;&gt; um, but also no one wants to be on like a 2, three hour train ride in the middle of the night except you probably. &gt;&gt; I do. I do. I would love you alone in the train a 1000 p.m. train ride back and also or a plane ride. DCA has weird airport restrictions so nothing can land after 10 p.m. &gt;&gt; because of the rich people in Georgetown</p>\n<p>which is annoying. &gt;&gt; Maybe it&#x27;ll be different when it&#x27;s [clears throat] Trump International. Okay. What was Should we calm down about? &gt;&gt; Not much. &gt;&gt; Yeah, it&#x27;s pretty bad. Okay. &gt;&gt; All right. &gt;&gt; It was great to see you. I&#x27;ll see you next week. &gt;&gt; See you next week.</p>", "chapters_count": 4}