{"video_id": "CYwQDpT6Ah4", "title": "The Failed Attempt to Silence Stephen Colbert", "link": "https://www.youtube.com/shorts/CYwQDpT6Ah4", "published": "2026-02-17T17:10:45+00:00", "summary": "After CBS pulled his interview with Texas Rep. James Talarico from the air, Stephen Colbert had some words for Trump’s FCC Chair Brendan Carr. Scott Galloway and Jessica Tarlov discuss corporate media “bending the knee” to the Trump administration, on Raging Moderates.", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/shorts/CYwQDpT6Ah4\">https://www.youtube.com/shorts/CYwQDpT6Ah4</a></p>\n<h2>Transcript</h2>\n<p>James Talarico, the charismatic Texas state representative, was scheduled to be interviewed by Stephen Colbert on his show this past Monday night. But at the last minute, CBS told the hosts that the interview would not air and that he shouldn&#x27;t talk about it on the show. Colbert doesn&#x27;t appear to be complying. He called out FCC Chair Brendan Carr by name. On January 21st of this year, a letter was released by FCC chairman and smug bowling pin Brendan Carr. Well, sir, you&#x27;re chairman of the FCC, so FCC you. It appears to be another example</p>\n<p>where corporate media is responding to the Trump administration’s policies, or... desires, if you will. They&#x27;re just ghoulish at this point, and they&#x27;re more interested in the tiny fights, I feel like, than the big ones. Or maybe they feel like if they do the tiny fights, then we won&#x27;t notice the big ones. But I feel like this is just going to be another L for them. It&#x27;s a really bad look for these networks to constantly be bending the knee, and you don&#x27;t get anything in return. That is the lesson we have seen thus far. You are not better off by doing this. You&#x27;re just losing money</p>\n<p>or brand value, which translates into money. I think it&#x27;s important we&#x27;re clear on what actually happened here. Paramount is trying to get regulatory approval for a merger, and the FCC chair sends a letter, not even a rule, but a letter about equal time, which is a ruse for censorship. And CBS lawyers immediately spike a guest booking on a show. That has three months left on the air anyway. That&#x27;s not regulatory or legal caution. That&#x27;s a protection payment. And here, in terms</p>\n<p>of that payment, the currency is editorial independence, and they spent it on the cheap. Meanwhile, Colbert does exactly the right thing, defies the order. Talks about the defiance on air, posts the interview on YouTube, and the interview that CBS tried to kill will get more views in any interview they actually aired this month. They&#x27;re not silencing speech, which is their objective. They&#x27;ve accidentally turbocharged it. The folks working on the Talarico campaign for Senate are like, “who do we send the flowers to?”</p>", "chapters_count": 0}