{"video_id": "oUSWtLu2RCE", "title": "Ben Thompson from Stratechery on AI ads, the end of SaaS, and the future of media", "link": "https://www.youtube.com/watch?v=oUSWtLu2RCE", "published": "2026-02-12T10:00:00+00:00", "summary": "Ben Thompson, the internet’s premier tech analyst, joins John for a wide-ranging conversation on the mechanics of the internet economy. They discuss the origins of Stratechery and the \"1,000 true fans\" model, why Taiwan is the most convenient place to live (and the best Uber Eats market), and why the public markets are wrong to think SaaS is \"canceled.\" Ben also explains why the US failure to control the TikTok algorithm is a disaster, why he’s a \"crypto defender\" in an age of infinite AI content, and gives John some very direct feedback on Stripe’s ACH implementation.\n\nFull transcript on Substack: https://cheekypint.substack.com/p/ben-thompson-from-stratechery-on\n\nSubscribe to Cheeky Pint\nSpotify: https://open.spotify.com/show/2IHbGJJMpiFoz5YrvRfTFw\nApple Podcasts: https://podcasts.apple.com/us/podcast/cheeky-pint/id1821055332\nSubstack: https://cheekypint.substack.com/\n\nKey moments\n00:00:20 Visiting Taiwan\n00:04:59 Aggregation and AI\n00:23:53 TikTok/Bytedance\n00:29:58 Aggregation and AI redux\n00:35:31 Agentic commerce\n00:45:08 Is SaaS canceled?\n00:52:21 Stratechery\n01:03:36 How Ben uses AI\n01:06:06 The TSMC break\n01:13:53 Rapid fire\n01:20:53 Feedback on Stripe", "transcript_html": "<h2>&lt;Untitled Chapter 1&gt;</h2>\n<p>Ben Thompson is the founder and author of Strategy, the newsletter that everyone in tech reads to make sense of what&#x27;s happening. He&#x27;s also heirly to the premium newsletter model that&#x27;s become very popular in media nowadays. For many years, he ran Strategy as a solo founder in Taiwan. Cheers. Good to see you. Cheers.</p>\n<h2>Visiting Taiwan</h2>\n<p>&gt;&gt; It feels like people in San Francisco have not properly discovered Taiwan as a tourist destination. Like, do you agree with that characterization? What&#x27;s your recommendation? People always ask me about Asia and the way the way I always characterize Taiwan is there&#x27;s lots of great places to visit in Asia &gt;&gt; and I would also put Japan on the list. But I, you know, I like to think I went to Japan before it was cool. &gt;&gt; Yeah. Nothing against Japan. It&#x27;s just &gt;&gt; Well, the whole thing with Japan is going to Japan pre-smartphone was a completely different experience than going there post smartphone. &gt;&gt; Like you think, oh, the subway system&#x27;s amazing, the trains. Try navigating that with no smartphone and nothing&#x27;s in</p>\n<p>English. Like like Japan used to be very low on English. Uh it&#x27;s still lower than places like Taiwan. &gt;&gt; It&#x27;s surprisingly low. &gt;&gt; Yeah. And Japan it just has the the way to visit Japan is you just walk like don&#x27;t go to like set destinations. &gt;&gt; Um where but the way I would talk about this is places to visit but the best place to live is undoubtedly Taiwan. &gt;&gt; The one word everyone says for Taiwan sounds not that impressive but the word is convenient. &gt;&gt; Like it is the most convenient place to live. So part of that is actually &gt;&gt; 7-Eleven has really good food.</p>\n<p>&gt;&gt; Well, it&#x27;s actually downstream from the Japanese cuz Taiwan was a Japanese colony for the first uh 50 years of the 20th century. And it&#x27;s laid out a lot like why is it great to walk around Tokyo? Cuz Tokyo is all mixed use, right? That&#x27;s how Taipei is as well. You have these big blocks where the exterior will be commercial and the interior of these big blocks is all residential and the first floor is all like small shops or restaurants, things like that. So, wherever you live, you basically have access to everything all around you. But the the I think the downside as a</p>\n<p>tourist is it&#x27;s kind of an ugly city. Like Taiwan&#x27;s kind of notorious for just these dumpy, dilapidated buildings and you go inside and they&#x27;re like palatial on the inside. Like Taipei is very very rich. It&#x27;s like in the top 10 I think as like number of billionaires in the world or something like that. All downstream from building out China, things like that. It&#x27;s a very beautiful country. from Taipei, 30 minutes to the ocean, 30 minutes to the mountains, East Coast is amazing. &gt;&gt; But if people listening to this are visiting, like I feel like one thing they should do is it&#x27;s a mistake to try and use Yelp or anything like that too</p>\n<p>much cuz like you should maybe just try and go to a night market and follow your belly and see see what looks good and like a lot of excellent street food. And so that&#x27;ll be one thing is to don&#x27;t try to over plan. Well, here&#x27;s a problem though where tech tech has made it worse, I would argue as a tourist, which is uh Taiwan is arguably the greatest Uber Eats market ever &gt;&gt; because there there&#x27;s amazing options. It&#x27;s all delivered by scooter, so it&#x27;s always like 10 minutes to get to get dinner and things along those lines. I think you were going to ask me about difficulties moving to the States. Not having access to that is definitely one</p>\n<p>of them. But the problem is that it&#x27;s such a huge market now that I think there are fewer and fewer restaurants &gt;&gt; in that a lot of these places actually just straight up close their storefronts are just ghost kitchens basically &gt;&gt; and all they do is just make Uber Eats orders all day. &gt;&gt; I see. So I mean famously yeah the um the restaurant economy in places like Taipei would have been really good but it&#x27;s gotten worse because people are eating in more with Uber Eats and stuff like that. &gt;&gt; I think so. I think so. As far as the like walking around and just like stuff on No, there&#x27;s still plenty of places. But there are like a number of</p>\n<p>restaurants I used to always take in the wall beef noodles or something like oh you can&#x27;t actually go eat there anymore but there are still Uber Eats. &gt;&gt; That&#x27;s a bummer. It&#x27;s like a separate problem. The the San Francisco problem at restaurants is that nobody drinks anymore and so the restaurants can&#x27;t you know uh they&#x27;ve lost a major. &gt;&gt; It&#x27;s so bad you you had to get a your own office. &gt;&gt; Exactly. We&#x27;re trying just firsthand to uh uh to to fix it. &gt;&gt; Be the change you want to see in the world. Should people visit places beyond Taipei or they &gt;&gt; Oh, for sure. Yeah. No, Taipei is great. It&#x27;s great to walk around. Uh, Taipei 101, uh, which is obviously very much in</p>\n<p>the news these days with with the the scaling, &gt;&gt; but you can go up the elevator on the &gt;&gt; You go up there because there&#x27;s a massive ball at the top, &gt;&gt; the mass temper. Yeah. &gt;&gt; Yes. Which is amazing. It&#x27;s like like I if you&#x27;re into like engineering, uh, that&#x27;s actually a very underrated thing. National Palace Museum is amazing. &gt;&gt; But the whole the East Coast in particular is is incredible. You like you drive there is a train but the driving you can drive like you&#x27;re driving on the coast like &gt;&gt; coast of Hawaii kind of. &gt;&gt; Exactly. Uh the problem there&#x27;s an incredible gorge called Turokco Gorge &gt;&gt; that was really Yeah. messed up by an</p>\n<p>earthquake a couple years ago. So I don&#x27;t know if it&#x27;s even reopened yet, but I used to take people to that all the time cuz it&#x27;s it&#x27;s world class. &gt;&gt; Yeah. Yeah. It is impressive that they said we&#x27;re going to build the tallest skyscraper in the world in like a very frequent earthquake region. So &gt;&gt; yeah, it&#x27;s a big skyscraper. It worked out well for the Netflix. &gt;&gt; Yes. So you&#x27;ve talked a lot over the</p>\n<h2>Aggregation and AI</h2>\n<p>years about aggregation theory and really popularized this idea where pre-in often power would live with the supply whereas on the internet because of the different you know marginal cost dynamics and things like that. Uh power will rest with the demand aggregators. And so Booking.com is a much bigger company than any hotel chain, you know, something like that. &gt;&gt; And Booking.com is the particularly interesting one because they aggregate all the hotels, but they are also aggregated by Google. &gt;&gt; So they&#x27;re like Google&#x27;s biggest</p>\n<p>customer even as they&#x27;re also on the other side. &gt;&gt; I feel like Booking.com is a very underappreciated success story in tech. you know, they&#x27;re a European company, kind of much quieter in a lot of ways, but like if you invested a dollar in Booking.com and a dollar in Google 20 years ago, you made much more money as a Booking.com shareholder. And I think people don&#x27;t uh appreciate that fact. It&#x27;s a very well-run business. &gt;&gt; Um, but where I was going with this is how does aggregation theory apply to AI? How does one need to update the framework? TBD to a certain extent. I mean this is part of the huge probably</p>\n<p>the the the one of the most angsty debates that I have internally generally which is open AAI&#x27;s sort of welfare going forward. I put forward a few years ago that actually OpenAI could stop making models and be one of the most valuable companies in the world just because of chat GPT. That&#x27;s their most that&#x27;s their most valuable asset. And part of the problem issue that they have is that was definitely the case in 2023 and 2024. Um, but they never, you have to actually build the business model around that.</p>\n<p>And I&#x27;ve, you know, I think fairly famously, at least based on all the tweets that I got when they announced that they&#x27;re going to launch ads, I&#x27;ve been losing my mind about this fact for a long time. And I think this is interesting. I&#x27;d actually be curious your view of this, which is there&#x27;s this mindset in the valley of this skepticism of advertising and people have sort of like internalized that it&#x27;s it&#x27;s bad and evil. Do do you do you sense that? Do you feel that? &gt;&gt; I agree. There&#x27;s kind of a knee-jerk skepticism of ads and like look, you know, when I I&#x27;m a YouTube Premium</p>\n<p>subscriber. When I see someone uh you know, uh watch a video without premium gas. It&#x27;s like what are you what are you doing with your life? And so like I get the knee-jerk reaction and at Stripe at some level as kind of the the anti-advertising company and like we&#x27;re the opposite uh uh form of monetization, but I don&#x27;t know. I have no particular um issue. I think it&#x27;s like a very efficient form of monetization. It makes a lot of sense for certain products. Um and so I think it&#x27;s just different strokes for you&#x27;re I think you&#x27;re with Stripe.</p>\n<p>You&#x27;re you&#x27;re on the you&#x27;re on the skepticism side. I think ads are amazing and uh and you know I&#x27;m talking my book a little bit. Trae trajectory has gotten tremendous traction just by not hating ads even though I&#x27;m not an ad model myself. &gt;&gt; Exactly. But you&#x27;re a paid model. &gt;&gt; Uh well it&#x27;s actually it&#x27;s funny. I actually think I got a lot of traction over the years by talking about ads when no one else was despite the fact it&#x27;s the most important business model in tech. &gt;&gt; And I look back and all my early writing about ads was terrible. I had no idea what I but I just by virtue of talking about it was it was helpful. Uh the the reality of advertising is</p>\n<p>number one people if you&#x27;re making a product in the world like strategy is very fortunate like it is definitely a new model or a new internet native model in that I have subscribers in like 200 countries right like I&#x27;m literally the whole world is my market uh and Stripe obviously helps helps make that possible &gt;&gt; a few in the Vatican you know they&#x27;re following along with &gt;&gt; I could go check you know I I would put the odds are very high that I do have at least one one subscriber to the Vatican. Um, and but where I benefited from is I was a massive beneficiary of social</p>\n<p>media, particularly Twitter. &gt;&gt; And that back in the early days, good days of Twitter, if you want to say whatever it was, uh, there was currency in sharing smart links. &gt;&gt; And so if I was a regular provider of links that people felt made them smart, so they would share them and talk about them and be sort of back and forth. And so that solved my customer acquisition issue. Yeah. &gt;&gt; Uh the reality though is most because the other thing about about content actually is a point I issue to come back to &gt;&gt; is it&#x27;s a something to talk about. It&#x27;s it&#x27;s something it&#x27;s commonality sort of</p>\n<p>sort of between us that we can both read the same thing. We can both have opinions on it, sort of react to it. the sort of product that I buy on Instagram is not what I&#x27;m I&#x27;m not going to like post about it or talk about it, but it could be tremendously beneficial. And they in theory have this those these small businesses or whatever they might be um or Chinese suppliers or whatever, they have the same opportunity which is sell to everyone in the world. They just need a way to tell people about it. As someone who buys way too many products off of Instagram, and by the way, one of</p>\n<p>the great things about moving back to the US &gt;&gt; is the Instagram ads are unbelievable. Like, I thought they were pretty good in Taiwan. They&#x27;re so much better in the US. Like, oh, this is the best part of living in the richest country in the world. &gt;&gt; Advertising. &gt;&gt; It&#x27;s amazing. Like, I&#x27;m like, what what&#x27;s this native content? Give me more ads. Um, which by the way, Facebook is very happy to do over the last 6 months. Um, lots of ads these days. But, uh, I get stuff that I never would have thought of. I didn&#x27;t even know about. And it&#x27;s great. It&#x27;s amazing and it&#x27;s a real benefit to me as a consumer who subscribes who for sure subscribes to YouTube premium and looks down on people</p>\n<p>who don&#x27;t but finding things that I didn&#x27;t know about that make my life better. So, as a user, I&#x27;m benefiting. As a rich user, I&#x27;m benefiting. As the world is six billion people, most of whom do not have the disposable income that I have, much less you have, much less anyone else in San Francisco has, they get the same experience I do. and something for AI like when you think about particularly when it&#x27;s so costly to provide and the free product is so much worse than the paid product &gt;&gt; of course it&#x27;s a win for them to be able</p>\n<p>to get access like so to have a mission of believe that AI makes the world better &gt;&gt; and to not embrace ads no I I agree with ads being an efficient form of monetization what do you think is the right way for consumer AI apps to do ads like uh you know chat just announced that they&#x27;re doing ads and they&#x27;re doing well. No, they&#x27;re doing them as the very separate experience to the answer. &gt;&gt; No, this is why it&#x27;s so bad. This is why I&#x27;m so frustrated with them. So, what they&#x27;re doing is the bare minimum easiest solution &gt;&gt; like banner ads basically. &gt;&gt; It&#x27;s banner ads, but it&#x27;s based on the</p>\n<p>context of the conversation. &gt;&gt; And the problem is that like they release like their ad principles, right? Which is our ads do not influence your answer. If you&#x27;re using the easiest possible way to target ads, which is based on the context of the conversation, we&#x27;re going to show you a roughly relevant ad. Number one, your market&#x27;s way smaller because you have to hope someone starts a conversation that matches the inventory you have. Number two, you&#x27;re getting into a my t-shirt answers questions that my t-shirt is raising sort of situation where if the ad is clearly connected to the answer, you&#x27;re going to raise suspicion in the</p>\n<p>users&#x27;s minds about about what sort of the connection is. So I I would prefer if the ads had nothing to do with the answer. The way you get there is you build a meta style understanding of the user and show them stuff that&#x27;s relevant to them. Like in Instagram, the best Instagram ads don&#x27;t have anything to do with the stuff I&#x27;m surfing. It&#x27;s from Meta&#x27;s understanding me broadly. &gt;&gt; So are you saying that like the AI ads should be more like Facebook ads than Google ads? And you know, right now the focus is on doing targeted ads that are</p>\n<p>related to the prompt, whereas instead it should all be profiling the user and who this person is and what their interests are. &gt;&gt; Yes, I think that would be better. It would it would present less conflict of interest, less uncertainty amongst the user, and it&#x27;s a it&#x27;s a model that I think I&#x27;m I&#x27;m not the world&#x27;s biggest fan of search ads precisely for the reason why they work so well. I think there&#x27;s a lot of confusion between organic, no, they&#x27;re cannibalization. Like why is it that I have to buy my own name in search ads, right? because someone else will like go go in there and you&#x27;re getting a harvesting a click on the ad that would have been there sort of organically which is fine it</p>\n<p>works the search is providing a lot of value but the the the challenge obviously is they only have one space for inventory which is in chat GPT well sorry is the defense of Google ads that um everyone complains about the branded search and yeah you&#x27;re paying for cannibalization but Google pays so much attention to search quality that the sponsored listings themselves have a uh a ranking of them, like a relevance ranking of them. And so it&#x27;s really just like the yellow pages where, you know,</p>\n<p>you need to pay to be listed in the yellow pages. &gt;&gt; That&#x27;s fine. I I I I don&#x27;t I&#x27;m not I don&#x27;t again I&#x27;m the ad lover here. Uh I just think that meta ads are more broadly valuable because they&#x27;re showing me stuff I didn&#x27;t know that I wanted. &gt;&gt; But if the AI apps are to generate a profile of you, does that profile include the content of all your conversations? This is the thing. Isn&#x27;t that the same? &gt;&gt; So, this is the thing. So, Deus is out there saying, &quot;Wow, I can&#x27;t believe they&#x27;re adding ads. We&#x27;re not going to do that.&quot; Which is hilarious because the entire Gemini Deep Mine apparatus, what is it funded by?</p>\n<p>&gt;&gt; Sure. Yeah. It&#x27;s a Google ad machine. &gt;&gt; It&#x27;s funded by ads. And that actually is probably the ideal model. So, it&#x27;s actually very funny. I was actually in New York City last year. Um, I was meeting actually I was meeting with someone in the office in in the shared office or across the hallway was like a was a hedge fund or someone and they came over and he&#x27;s like, &quot;Oh, long time reader. Um, you&#x27;re responsible for our worst decision ever.&quot; And I&#x27;m like, &quot;What?&quot; He&#x27;s like, &quot;Putting money in Twitter.&quot; I&#x27;m like, &quot;I&#x27;ve never said to put money in Twitter.&quot; Like, that&#x27;s always been a terrible company. Like, I I stopped covering them because it was</p>\n<p>such a bad business. And uh, and I&#x27;m like, &quot;Oh, no. I remember what it was. It was when they bought Mopub.&quot; And my theory, my problem with Twitter advertising has always been that it especially was very textual. I think text doesn&#x27;t work as this a problem for the all this applies to the chat clients. Text isn&#x27;t the best interface for ads. Obviously, visuals are are generally better. And there&#x27;s also a posture. &gt;&gt; If I&#x27;m on Twitter, I&#x27;m like I&#x27;m ready to do battle. I&#x27;m locked in. I&#x27;m I&#x27;m searching for information. If I&#x27;m on Instagram, the whole point of like seeing an ad is I don&#x27;t really care what I&#x27;m seeing right now. I&#x27;m wasting time.</p>\n<p>you&#x27;re actually in a much better posture I think to absorb just like TV like you&#x27;re sort of absorbing can absorb the ad &gt;&gt; and Twitter is like bad for that. So but but Twitter because it&#x27;s an interest based network at least in theory it should be able to understand a lot about you above and beyond theoretically having pixels and and SDKs sort of all over the web. And so my theory with the MOPub acquisition I thought it was a great acquisition &gt;&gt; because like oh they can harness signal from Twitter and manifest it in other apps through this sort of Mopub Mopub network. Now Twitter was incompetent so</p>\n<p>they did nothing with Mopub gave it to Apple who&#x27;s now written Mopub to like like the top of the world &gt;&gt; but that was sort of my thesis and I think that could apply to to AI as well. I think the ideal outcome for Google is they never put ads in Gemini, but they understand so much about you because of what you do in Gemini that they can then manifest that through ads on YouTube, through ads on Google, through ads on their other properties. And the challenge for Open Eye is they only have one place to put inventory which is which is in JPT. &gt;&gt; Okay. So, you&#x27;re saying that Google</p>\n<p>could use uh Gemini to just improve the targeting of the ads across the Google properties and then maybe if you want to have ads in Gemini, uh &gt;&gt; I don&#x27;t think you need to ever put ads in Gemini, &gt;&gt; but but just if you did, you would also have the profile that Google has for sure &gt;&gt; of you from across the web and you could &gt;&gt; Yeah. And you don&#x27;t need to have ads that are like making the user feel weird because why are you showing the ads about what I&#x27;m asking about? &gt;&gt; Okay. But in the scenario you&#x27;re just describing for Google, wouldn&#x27;t that have the same just like the, you know, meta is listen to your microphone conspiracy theories where when the targeting is too good, people get</p>\n<p>concerned like wouldn&#x27;t you get similar issues? &gt;&gt; I think it&#x27;s a madeup concern. &gt;&gt; No, it is. But sure, but like people people have it and wouldn&#x27;t you have a similar issue where if you&#x27;re using the Gemini data to make better ads, won&#x27;t ultimately the targeting be too good and people will find it weird? I mean, I think that that&#x27;s a bridge that every tech company would be happy to cross if they came to it. &gt;&gt; I see. It&#x27;s a thing that people say when you have very good target. &gt;&gt; I think there&#x27;s a lot of like I honestly I think a lot of the the there&#x27;s a real stated versus revealed preference about a lot of this stuff. The reality is is</p>\n<p>people like even the US think oh you could pay for Facebook or you could show people would rather see the ads. &gt;&gt; Yeah. &gt;&gt; I think most people don&#x27;t care in this &gt;&gt; a lot of tech and this sort of ties into the skepticism of ads. &gt;&gt; It&#x27;s sort of an elite town. There&#x27;s a wheat regulators. Everyone&#x27;s thinking about these very theoretical things. &gt;&gt; Isn&#x27;t it a bit of the challenge banner blindness where Instagram advertising works so well because it&#x27;s a picture feed and it&#x27;s showing you pictures. &gt;&gt; I think some of the pictures are like commercials. &gt;&gt; So this is where Facebook &gt;&gt; with an AI app you&#x27;re like looking for</p>\n<p>an answer and you don&#x27;t want to look at the banner. No, it&#x27;s a huge concern and this is one of the great ironies of MetaF Facebook is the extent to which they of course Mark and everyone hates Apple for lots of I think very justifiable reasons but Apple saved Facebook from itself like back in the day remember Facebook platform and there&#x27;s like Facebook payments and all this sort of thing and Mark has always wanted to build a platform and if you&#x27;re just an app on a own. You can&#x27;t build a platform. And the</p>\n<p>problem is that I think being an advertising based model is generally incompatible with being a platform. The whole point of a platform is you&#x27;re letting something else shine, something else bring to the surface. You&#x27;re just un you&#x27;re you&#x27;re the support structure for something to take over. So an operating system is not about the ideally it&#x27;s the application on top of it that that you&#x27;re using. When Facebook was forced to not be a platform but just be an app, suddenly they could be fully lean into being an advertising thing. And think about a Facebook ad. Even back in the day was a feed ad or a story ad.</p>\n<p>&gt;&gt; Literally your entire device &gt;&gt; is all an ad. &gt;&gt; And somehow it&#x27;s not a banner, it&#x27;s a little thing on the edge. They literally have achieved permission from users &gt;&gt; to take over your entire device to show you a full screen ad &gt;&gt; every 5 seconds. It&#x27;s amazing. Yeah. And they they were forced into it by Apple. &gt;&gt; Do you Okay, this reminds me of and I want to come back to the eye um dynamics, but this reminds me of a view I&#x27;ve had that I&#x27;m curious for your thoughts on, which is often when tech companies become really big, they become</p>\n<p>really big just because the core idea works better than even the founders could have realized. And so Meta is a really uh big company because they uh have a feed and the feed got really big and they like were very smart along the way where they bought Instagram and they&#x27;re like incredibly targeted good monetization but it turns out people spent a lot of time and many people you know the P times Q of that with the feed and they monetized it very well and that&#x27;s what got really big and same with Nvidia. It just turns out that the GPU market got really big and they</p>\n<p>sell a lot of GPUs and so maybe founders because they&#x27;re often like high-powered individuals who want to have lots of new ideas, they&#x27;re often thinking about the next thing or like what the second act or the third act is and everyone wants to in invent AWS. But I&#x27;m curious what you would say to the idea that just &gt;&gt; generally it&#x27;s making the core thing really big and there&#x27;s more orders of magnitude at the top than you thought. Yes, I think that&#x27;s always the case. And I think that sometimes people end up making something that they didn&#x27;t want to make and they continually push back.</p>\n<p>I think Meta is the perfect example. I I my impression is Mark&#x27;s not very interested in ads. He&#x27;s had very good people along the way that have helped him build these ad products. I think Meta has suffered from that because he has not been front and center fighting for actually ads are good. They are societal good. They get they are the driver of all the consumer surplus that tech throws off. Like the president uses the same search engine as the guy on the street or the same AI or sort of</p>\n<p>whatever it might be. That&#x27;s because of ads and the uh &gt;&gt; probably not. The president probably used like a palunteer search engine or something. &gt;&gt; Yeah, it&#x27;s probably worse. Um Google Google has left a lot to be fair. Um there&#x27;s so much junk online, but the um does Donald Trump ever search? I don&#x27;t know. That&#x27;s a good question. But uh but he&#x27;s not made that case. And I think Meta has suffered because of the failure to make that case. And then you get things like we&#x27;re going to do the metaverse. We&#x27;re going to do XYZ. It&#x27;s always coming back. We be a platform. Be a platform. And Meta is an entertainment company. I wrote this like years ago</p>\n<p>about the like I think this is actually it was simultaneously a good call and a bad call. Do you remember that Paul Krugman quote uh the internet&#x27;s not going to be very big or the fact machine because people don&#x27;t have much interesting to say? &gt;&gt; I actually defend that quote &gt;&gt; and because it&#x27;s actually true. Most people actually don&#x27;t have that much interesting to say. And the I brought up that quote around 2015 by saying this is a fundamental limiter on Meta&#x27;s long-term potential. As long as they think of themselves as a</p>\n<p>social media company, they&#x27;re going to run into a problem with their feeds becoming insufficiently interesting over time. Now, &gt;&gt; uh, the move from kind of peer content to, um, &gt;&gt; well, so that was that was a, if I might say so myself, a very brilliant insight. The bad insight was my prescription, which was they needed to do more with professional content makers, like more funding of like the Buzzfeeds of the world and share revenue, all that. &gt;&gt; Userenerated content. &gt;&gt; The actual answer is what Tik Tok did, which is &gt;&gt; Tik Tok is not a social network at all.</p>\n<p>It is a &gt;&gt; harvesting and YouTube, you know, the same sort of idea. &gt;&gt; It&#x27;s like personalized TV. Yeah, &gt;&gt; what actually matters and this is a key thing people get hung up on relative numbers and what matters is absolute numbers. So it is better to have.1% of your content is good if your content is like in the billions or trillions as opposed to oh 10% of our content is good but you only have a 100 pieces of content. That&#x27;s actually worse even if you have a better hit rate. And so spurring lots of creation, writing the algorithms to to capture the good stuff,</p>\n<p>put it up there, that actually solves the Paul Groomman fax machine problem. &gt;&gt; And Facebook was blindsided by that. They were so stuck on their identity of being a social network that they let Tik Tok take this huge chunk. It was their blind spot. Speaking of Tik Tok, I feel</p>\n<h2>TikTok/Bytedance</h2>\n<p>like you don&#x27;t write about Bite Dance that much, and I&#x27;m curious just what your thoughts are on Bite Dance from here and the Tik Tok sale and everything. &gt;&gt; I mean, what a what a what a mess. Uh, I had to make a decision a long time ago. I I wrote about Chinese companies more previously and I think there&#x27;s &gt;&gt; uh it&#x27;s too number one, I have to decide what what I&#x27;m going to be able to cover and what I&#x27;m not. Uh, I&#x27;m not in China. I was in I was in Taiwan. it is a different internet and there was too much sort of uncertainty and unknowns just in general about a lot of Chinese</p>\n<p>companies. I would write about them occasionally in the context of US tech companies. So I think I wrote about like WeChat and what it meant for the iPhone&#x27;s relative competitive position in China, how it&#x27;s different than sort of other countries. I think that sort of held up pretty well. Wrote about Tik Tok in the context I mean more about Tik Tok I think uh in the context particularly this context of meta. Um, Tik Tok came up around the same time as the uh was was it Quibby, &gt;&gt; which Quibby was the example of that. Quibby was like it was actually right that there was room for a mobile entertainment product. Yeah, &gt;&gt; it was totally wrong about the content acquisition strategy. So even if they</p>\n<p>had hit rate was higher, their total volume was way too small. I follow them but not super closely. It&#x27;s just a hard market to understand and the uh &gt;&gt; like Tik Tok&#x27;s very relevant to the US market. So Tik Tok Tik Tok I so I wrote the Tik Tok war basically making the case that the problem with Tik Tok and back then everyone was talking about user data. &gt;&gt; Mhm. &gt;&gt; Who cares? Like the the whole user data thing people have this view of like the East German Stazzy and like folders like going through people&#x27;s datas like these</p>\n<p>are like vector databases with like numbers that no human can parse. like they&#x27;re they&#x27;re it&#x27;s really quite anodine. It&#x27;s just related to target ads and um I was very skeptical about that being a forcing function in terms of forcing divesture or whatever it might be. The issue I had was the algorithm and I noticed I think it was when the Hong Kong protests happened and Daryl my then GM of the Houston Rockets tweeted like free Hong Kong or something like that and</p>\n<p>there&#x27;s a huge meltdown the NBA games have canled and I noticed that on Tik Tok and this was from I tested it from Taiwan and via VPN from the US. Uh, if you search for every single NBA team, you got NBA clips. Except for Rockets, you got nothing. &gt;&gt; Oh, that&#x27;s funny. &gt;&gt; And I&#x27;m like, &gt;&gt; they got demonetized. &gt;&gt; There is there is a thumb on the scale here. And I started talking about it then and my I did support the ban of Tik Tok or the force sort of divesture from China &gt;&gt; because it seems fairly insane to have a primarily information source controlled</p>\n<p>by your chief geopolitical adversary. &gt;&gt; Yeah. saying like there&#x27;s rules over TV station ownership and it&#x27;s like not wildly different &gt;&gt; and so I I you know everything&#x27;s a trade-off of course I&#x27;m pretty well known for being a pretty stark defender of free speech and against censorship and my issue wasn&#x27;t Tik Tok per se was &gt;&gt; tech the reality of China is &gt;&gt; the founder of Tik Tok of bite dance is long gone &gt;&gt; because he got called to the carpet for bite dance showing a little too much of what people liked which is mostly like hot girls dancing</p>\n<p>and being insufficiently like showing the right things that the party wanted. It&#x27;s in China&#x27;s like the reality is China has the price of doing business is they get you know they&#x27;re on somewhere on the the control structure they can tell you what to do and this just seemed like a very foolish thing to tolerate. Uh unfortunately um the US political process or fortunately maybe the reality is is the US process and system is such a mess. Can anyone really truly impact it over time? Uh the way that it shows</p>\n<p>up messily is we somehow do pass the law banning Tik Tok and it didn&#x27;t get banned and now it is sold but China still controls the algorithm. So I think it&#x27;s a big disaster. It&#x27;s also like what what can I say about it? I said my piece. &gt;&gt; Yeah. Yeah. &gt;&gt; Um, we ended up in the worst possible case, which is we violated property rights and we did all this stuff that&#x27;s ridiculous and we probably bartered XYZ for ABC and we didn&#x27;t get the most important thing which is control the algorithm. &gt;&gt; Has that not happened as part of the sale? &gt;&gt; No, back then still controls the algorithm. &gt;&gt; I didn&#x27;t know that.</p>\n<p>&gt;&gt; Yeah. &gt;&gt; Good job by us. &gt;&gt; That does seem like it was the point of the spin out. &gt;&gt; Well, the data was always the was always the most uh salient political point. And so when I wrote about it, that was my point. like I don&#x27;t care about the data. The issue is the algorithm &gt;&gt; and um unfortunately that did not care. Maybe I should have wrote about more but anything like all the politics stuff there was a period &gt;&gt; I mean thank god for AI there was a period I wrote like when I wrote aggregation theory a couple weeks later I wrote like something about regulation. I&#x27;m like this is going to drive a bunch of regulatory issues and antitrust things and and all these bits and</p>\n<p>pieces. when that actually happened, the late end of the last decade. Of course, I was writing about it. I was watching congressional hearings, all sort of thing. And that is the close I came to quitting and burning out. &gt;&gt; I think burnout&#x27;s not a function of how much work you&#x27;re doing. It&#x27;s doing work you don&#x27;t enjoy. &gt;&gt; And at one point, I&#x27;m like, either I quit or I stop covering congressional hearings. &gt;&gt; So, I decided to stop covering congressional hearings. Uh, I only wrote about antitrust stuff was super prominent and I&#x27;ve been much happier ever since. And maybe that&#x27;s part of the price of just not writing about that is</p>\n<p>maybe I should have pushed on the Tik Tok thing more. &gt;&gt; That&#x27;s interesting. &gt;&gt; I said my piece. So &gt;&gt; yeah. Is strategy very widely read in DC? &gt;&gt; It is. &gt;&gt; Uh yeah, it is. Uh sometimes it&#x27;s gratifying. Uh it&#x27;s great when you get called and asked for your opinion. Um or you know you get certain responses or you see impact. It&#x27;s less gratifying when you get yelled at and people are are mad at you. But fortunately, the key thing to succeeding on the internet is something I have in spades, which is a very high level of disagreeableness. So,</p>\n<p>you can yell me all you want. I&#x27;m not going to change my mind. &gt;&gt; Okay. But getting back to aggregation</p>\n<h2>Aggregation and AI redux</h2>\n<p>theory as it pertains to AI. Like a simplistic view you could have is that the AI apps are the new aggregators and so a huge amount of economic value will acrue to them and that&#x27;s it. You could also say that that&#x27;s too simplistic in a bunch of ways because one of like we&#x27;re saying the you know booking.com you expect it to return you hotels that you should book uh but you expect a little less of a commercial incentive from the AI apps and this is like a little more of an abstract technology where it&#x27;s actually not trivial to insert all of</p>\n<p>the you know commercial uh incentives in the right way and any you come up with various objections and so do you &gt;&gt; well I think the ad model is is is probably the way to start &gt;&gt; which is I just talked about before sort of the lean in versus lean back. ads are very tied into human psychology and like what you&#x27;re sort of tapping into and people&#x27;s response to that and how do you make something creative and in the short term &gt;&gt; you know technology often makes old business models even more powerful &gt;&gt; before it kills them &gt;&gt; right so you have something like uh you know suddenly you&#x27;re a newspaper I used</p>\n<p>to be limited to my geographic area right &gt;&gt; now I can reach the whole world &gt;&gt; yes &gt;&gt; oh wait a few years later everyone can reach the whole world yes &gt;&gt; I&#x27;m in pure competition I&#x27;m screwed. And that is certainly a concern about this model. If you get to a world of say agent commerce and the agents are just buying the right thing like and this is I think this is also something that has driven a lot of tech skepticism of ads. &gt;&gt; People in tech tend to be fairly nerdy, fairly obsessed. Uh they&#x27;re doing a ton of research to find sort of the exact</p>\n<p>right thing. &gt;&gt; Yes. Why would anyone tell me what to buy when I&#x27;ve, you know, researched it for two hours? &gt;&gt; That&#x27;s right. &gt;&gt; Yeah. But and so like ads have no effect on me. Well, what if that sort of obsessive deep dive approach is now trivally available to everyone because AI is the one actually doing it? &gt;&gt; Now where where do ads sort of function? And I think this is definitely a bit of a be careful what you wish for scenario &gt;&gt; because what this entails is of course more transparency,</p>\n<p>more details, more understanding sounds good. What it actually entails is sort of perfect competition which is a very sort of brutal game that can just wipe out entire categories. That&#x27;s you know that&#x27;s basically what happened to newspapers uh in many respects. So that&#x27;s that that&#x27;s number one. Number two, in a world of this sort of world, you&#x27;re sort of by definition anchoring on whatever specifications or whatever can be measured, can be put down. And you had the old sort of Steve Jobs adage about feeds and speeds versus</p>\n<p>like the feel of something where the intersection of liver what the what the does that mean? And it&#x27;s just like well uh what it actually means is there&#x27;s things that can&#x27;t be measured and that don&#x27;t go on an Excel spreadsheet and everyone you talk to acknowledges this say yes there&#x27;s things that can&#x27;t be measured and the way it actually plays out in practice is only the things that measured sort of matter. I think this has happened to a this a huge problem with sports analytics is a great example of this where there I think basketball is my favorite sport. There&#x27;s a lot that goes into basketball and winning that is somewhat hard to wrap your hands around.</p>\n<p>&gt;&gt; Like baseball&#x27;s very measurable. I do think there&#x27;s aspects about clutchness and stuff that I&#x27;m I&#x27;m that I don&#x27;t know that are properly measured. But around basketball for sure, the interaction and way teams play together and how your effort on or your involvement on offense can affect defense or sort of back and forth and and you see again and again like to take my you know I like Daryl my um I think there&#x27;s a reason his teams haven&#x27;t won. they&#x27;ve overoptimized at the expense of some of these these other issues and if you can&#x27;t measure them they tend to</p>\n<p>get devalued and in a world of AI mediated everything how many things that can&#x27;t get measured fall by the wayside because we end up with it&#x27;s very utilitarian sort of goods that have no soul to them. um sort of a silly sort of thing to worry about in some respects. It&#x27;s like or it sounds silly, but I&#x27;m a human and I anticipate liking and preferring the humanity of things of all sorts in the long run. But you could say</p>\n<p>that um like e-commerce aggregators like Amazon and lots of others have led to you know fairly anonymous manufacturers of lots of everyday goods uh the kind of Amazon basics type stuff and a much lower price point than they you know were at previously at still perfectly good quality. Isn&#x27;t that Isn&#x27;t that fine? This is where you throw my ad argument in my face, which is like actually it brings up the base level for everyone.</p>\n<p>Like your basic consumer, the access of items they have to in the like &gt;&gt; there&#x27;s no soul in an Amazon basics and that&#x27;s fine. &gt;&gt; Everyone thinks back to like, oh, my washing machine was so much better in the 1960s. And it&#x27;s like, yes, that&#x27;s true. And also far fewer people had wash machines. &gt;&gt; And so I&#x27;m now like making the opposite argument sort of I will leave and you can have a one person. &gt;&gt; Switch back and forth. &gt;&gt; Yeah, exactly. You can change sides of the booth. Um you mentioned agent</p>\n<h2>Agentic commerce</h2>\n<p>commerce where you know we obviously are are big into that and had our announcement uh with OpenAI um uh back in October. Where do you think that goes? Like how do you see agent commerce playing out? &gt;&gt; I mean the the contrast between uh your own open announcement and sort of Google&#x27;s announcement I think is is pretty interesting and speaks to what the companies are driving for. Openai wants to be the place you do everything. They want to be like the aggregator. I think a critic would say people compare them to Netscape. I think the better analogy if you&#x27;re an open AI skeptic would be AOL uh where they want to be</p>\n<p>sort of like the interface for everything that you might do and it goes through their channels and Google just as they were relative to AOL is like actually we want to we want to make equip everyone knowing that if everyone is capable we are the greatest beneficiaries because we still marshall sort of the the sort of front-end demand sort of in that regard. Now, how does that actually manifest in terms of commerce? The funny thing about tech is I don&#x27;t think it will manifest in terms of uh airplane tickets, which is everyone&#x27;s example like everyone can</p>\n<p>never think of a better example than that. Uh but what what is the AI going to buy? What is it going to get? I don&#x27;t know. I think I would like to think people will want to have agency in their buying decisions. But then again, I you know, we have like assistants whether it be like, you know, for work or whatever it might be and they make buying decisions that we&#x27;re necessarily not involved in. And that I think is a good predictor precursor of what people will ideally like, do I really need to know? Actually, I have very strong paper towel ideas. That was going to be my that was</p>\n<p>going to be my but once I once that&#x27;s set, &gt;&gt; can that be sort of monitored and done? Um, so I don&#x27;t know. I think this is a very unsatisfying answer other than to say it has big implications on things like advertising and on things like like is that going to be a viable business model going forward. Uh what margins are going to be available? Is there going to be perfect competition? Things along those lines. &gt;&gt; Okay, let me try this on you for agent of commerce and I&#x27;m curious to have you critique it which is sort of how I see things playing out. I think some skepticism is triggered by people pitching a very</p>\n<p>far-end state with a lot of agentic autonomy. And so it&#x27;s like please book me a honeymoon in Japan and all the activities or like no one actually does things that way. Whereas actually you should go from the bottoms up in some very basic building blocks where um step one is just replacing filling out web forms. That&#x27;s an activity that sucks. No one likes it. And so imagine you find the winter jacket you like and you copy the URL into chat GBT and just say please buy this for me. And that&#x27;s a much better experience than going</p>\n<p>clicking around a site you&#x27;ve never been to before. And so there&#x27;s just the agents doing kind of tool use on your behalf and everyone can create that. Maybe it clarifies there&#x27;s multiple colors. Which one do you like? Uh but it&#x27;s just replacing filling out form fields. This is by the way one thing that I am very a lot of people are skeptical of this but I I am very optimistic about which is I call like just in time UI &gt;&gt; exactly the the like &gt;&gt; it&#x27;s a better UI. &gt;&gt; That&#x27;s right. Okay. So that&#x27;s like level one is a better UI for for kind of doing an action you want to know. Okay. Then level two is better discovery in search.</p>\n<p>It is crazy that we&#x27;ve gotten this far in e-commerce with keyword-based search. like keyword-based search works really well when you&#x27;re buying a book that you know the name of. It&#x27;s like I want to go by this particular title. &gt;&gt; Um for a winter jacket, it&#x27;s like I don&#x27;t know, I want it&#x27;s like a puffer, like what&#x27;s it called? And so instead, you want to be able to say I&#x27;m looking for a jacket, this kind of I&#x27;m going to this place, it&#x27;s going to be this cold. Uh you know, I like these kinds of things, whatever. And so step two is just better search and the ability to search with parameters that like no</p>\n<p>existing search UI lets you specify the temperature of the place you&#x27;re going to actually get you know a jacket of appropriate warmth. But that&#x27;s obviously with a jacket one of the core things and so better search UI is kind of level two from our point of view &gt;&gt; right which I think is already sort of manifesting. &gt;&gt; Exactly. you&#x27;re already and like in the early usage of the kind of chat GBT buying experience I think that&#x27;s one of those like super cool features and then level three which we haven&#x27;t really seen play out yet is this idea again of a persistent profile of the user &gt;&gt; that anticipates their needs &gt;&gt; exactly it&#x27;s like I want to be able to</p>\n<p>just pin things I like as I go along or maybe you know if I can share my browser history or maybe if I can just like you know share a Pinterest board of just like these are some styles I like give me a good winter jacket for the cold based on that here are photos of me uh you know based on uh this and so starting &gt;&gt; well I have even better I have even better idea imagine if you were using chat GPT and it&#x27;s circa October 1st and there is an ad for a great winter jacket that is perfectly suited to me because they&#x27;ve been understanding my interests they understand the context of where I</p>\n<p>am not searching for winter jackets because I don&#x27;t plan well it&#x27;s going to get cold and then I&#x27;m searching winter jacket I&#x27;m &gt;&gt; but what if it could anticipate that and show me an ad at the right time when I need to see it. &gt;&gt; Okay, maybe that&#x27;s level four is like the uh &gt;&gt; that&#x27;s what I&#x27;ve been wanting them to build. This is my whole myth before. Like this is like this is why they&#x27;re so late. They they should be shipping that this year. You&#x27;re only shipping that this year if you started your ad product two or three years ago. This is doable today. &gt;&gt; This is what meta ads are. You need to be on more you need to watch more reels. I &gt;&gt; like like just the I&#x27;ve bought more ski equipment this year that I don&#x27;t need</p>\n<p>just because it just shows up. I&#x27;m like I&#x27;m moving back to Wisconsin so I I&#x27;m buying stuff for the house. And I get, oh, those ski hangers. I bet those would be great. That sounds very useful. They&#x27;re still in a box. I would actually put them up. But &gt;&gt; yeah, so there&#x27;s a limit to kind of with just um kind of banner ad type experiences to what you can do where I think the search thing is is very powerful. But yeah, I&#x27;m curious what you think of kind of step one just the very act of checking out uh and then or level one, the very act of checking out, level two, better search, and then level three defining your own embedding space of</p>\n<p>preferences. No, I I I completely agree with that approach. I just think you underrate the extent to which level three has already been built. &gt;&gt; Actually, one of the thing that that um Mark Zuckerberg said on a couple earnings calls ago that I thought was very astute &gt;&gt; is uh we get hung up on technological definitions for like what is an agent? And he&#x27;s like actually the largest and most successful agent in the world today is Facebook advertising &gt;&gt; which is exactly right. Facebook advertising, people have it in their head that you go and you put in like demographics and your targeting and stuff.</p>\n<p>&gt;&gt; No, no, it&#x27;s very autopilot. &gt;&gt; Yeah. What you do is you go in and you say, uh, this acquiring a customer for this is worth $10 to me. I&#x27;ll spend up to $10 and they will deliver you a customer for $10. Yes. &gt;&gt; They&#x27;ll their margin will actually increase because they will make sure they deliver it at exactly $10. They can do it for more and they actually make more money. You get exactly what you asked for. Uh it&#x27;s I think the extent to how powerful this already works. They&#x27;re just stuck on the 50% of my ads work don&#x27;t I don&#x27;t know which ones. &gt;&gt; No on Facebook &gt;&gt; they all work.</p>\n<p>&gt;&gt; Yes. &gt;&gt; I feel like a bunch of new very big successful companies will be created in AI powered e-commerce. It just feels like a different enough product space. But what what you&#x27;re talking about retailers, merchants or dis or a &gt;&gt; I was talking about discovery and um kind of the demand side though also probably retailers. &gt;&gt; Yeah. I mean I certainly think I I think that the the part that I think would be new which is a bit which you maybe talking about is this real anticipatory aspect which is right now what is amazing about to go back to meta ads is</p>\n<p>it helps merchants who have a very specialized product find customers that they never would have found otherwise but there is the inverse of I need a very specialized product how do I find what it is which I think you were referring to before &gt;&gt; but to what extent can that not just being in the moment. I need this specific I remember I needed a uh a server a piece for my a rack to mount like this router cuz I had like an extra I didn&#x27;t want to buy a whole new thing or whatever. I had this extra router and of course there&#x27;s some guy in Australia that does 3D prints that perfectly matches this on Etsy or something and it</p>\n<p>was great. I found this random guy I&#x27;m sure he made a bunch of money selling me a $40 piece that cost him $2 to make. Good for him. Uh but what if an AI should be capable of anticipating that need? &gt;&gt; So it&#x27;s not I oh I have a need let me go find it. &gt;&gt; Yes. &gt;&gt; It&#x27;s like I know you&#x27;re going to need this and let me acquire it. And that would be very powerful. &gt;&gt; Mhm. &gt;&gt; In his excellent newsletter strategy Ben often argues that whoever controls the customer relationship shapes the entire ecosystem. And in mobile apps, there&#x27;s</p>\n<p>always been this interesting tension here with inapp purchases where historically app developers had an intermediated relationship with their customer through app store policies. Over the past year, that layer has started to open up. Mobile developers can choose what they use for inapp payments. Developers now have more freedom. But with that freedom comes new challenges. App Store payments were previously handling a whole bunch of different tasks like payments, tax, fraud, disputes, all bundled together. Stripe manage payments is built for this new world, handling all that operational complexity for you with Stripe as the</p>\n<p>merchant of record. And with our new app to web flow, customers can check out in seconds in an experience that feels native. It converts like inapp payments, but it runs on Stripe.</p>\n<h2>Is SaaS canceled?</h2>\n<p>The public markets indicate as of January 2026 that SAS is canled. Are they right? I think it&#x27;s probably a mix. Uh the I think the one of the brilliance of American business is actually this is one of my theories about why the Europeans are so gung-ho about data privacy and regulation is because they so often interact with European companies. Yeah. &gt;&gt; So, like I was in Paris a couple years a</p>\n<p>couple years ago and of course going on a tourist trip going to going to the Lou going to the museum or wherever it is like or not whatever it was seeing a bunch of museums. &gt;&gt; They all have their own homegrown registration systems &gt;&gt; and they&#x27;re collecting so much data &gt;&gt; and they&#x27;re like it&#x27;s like yeah what&#x27;s your age? What&#x27;s your pet? What color is like it&#x27;s like why do you need to know all this information? They&#x27;re all non-standard forms. they need this is where you need AI to fill all this sort of thing in like what like there&#x27;s like this theoretical idea in their head if we capture this data it could be useful so</p>\n<p>they built these homegrown things in like the 2000s that are horribly insecure and I use them I&#x27;m like where&#x27;s the regulator can someone put this is ridiculous so I get I get the mindset &gt;&gt; US companies don&#x27;t do that like US companies are so good I think one of the big strengths of of US business culture is understanding and I think about this personally. This is what I give life advice. What&#x27;s the number one mistake people make uh when they&#x27;re young in particular? They focus on their weaknesses. Like I have to amiliate my weakness. Like no, what you do is you</p>\n<p>double down on your strength. You get richly rewarded for that and then you hire someone to take care of your weaknesses, right? Like I&#x27;m I&#x27;m a big believer in the getting things done system. Like great book, Getting Things Done. Even if you don&#x27;t use the system, the book is really good. Lots of great insights. There&#x27;s this whole thing like tickler files and like all these sorts of things. It&#x27;s an amazing system. I&#x27;m completely incapable of managing the system on my own. So there&#x27;s a Mac app called Omnif Focus that is completely built around the system that I don&#x27;t have a license for. My assistant has a license for and I text him stuff and his job is to maintain my getting things</p>\n<p>done file because I can&#x27;t do it. What I what do I do? Actually my wife is very very optimized around I write three pieces a week. I do an interview and I do three podcasts and all my focus and energy needs to be on that. And if I do that, that will make a lot of money and I can pay to fix all my problems sort of elsewhere. And I think American business does this very well. They don&#x27;t waste time and energy on stuff they&#x27;re not good at. They double down on what they&#x27;re good at and they&#x27;re focused on the upside, not on their cost centers. &gt;&gt; Probably a result of the very large market in the US.</p>\n<p>&gt;&gt; I think so. And just the the competition, it would be in a very large uh common market. So you you like you you don&#x27;t have your like you go back to like newspapers, they have lots of homegrown stuff. Like if you&#x27;re a publication on like online, if you&#x27;re if you&#x27;re like me on the internet, &gt;&gt; I get paid to comment on the big tech companies. It&#x27;s probably the most competitive market on earth, right? Like lots of people have takes on the big tech companies. Uh and so you have to be super focused given that that speaks to the enduring value of just paying someone to manage these these business functions from a software perspective.</p>\n<p>Now, there&#x27;s a lot of SA like there&#x27;s a there&#x27;s a lot of SAS applications. Not sure they&#x27;re all sort of strictly necessary and and worth the price. Uh I like to think people talk tech. I would say there&#x27;s a big six. &gt;&gt; The six was Silicon Valley Inc. which is basically this cookie cutter &gt;&gt; VC goes to this founder addressing this specific business case with the SAS business model. Everyone likes to they get to talk about changing the world. It&#x27;s actually the most predictable thing yet. That&#x27;s why VC returns compressed, but because they&#x27;re also very predictable in terms of like the sort of</p>\n<p>engine going. &gt;&gt; A big problem there is they&#x27;re all seat based. Like anyone&#x27;s seat based that some of that just there&#x27;s going to be probably fewer seats. Uh and then if the replacement is more smallcale, uh ideally there&#x27;s lots of, you know, the internet in general has writing or content is a good example. There used to be sort of you want to be in the big pond and everyone in the big pond sort of ate. If you if you had a job at Kday Nast and one of their magazines, like you lived life well, even if you wrote like four four</p>\n<p>magazines today, if you want to be a writer, I give advice to people that that want to be content producers all the time. &gt;&gt; And I&#x27;m like, look, you don&#x27;t want to be you don&#x27;t want to be in a pond with me, right? Uh Bill Simmons is like the like first internet sports writer and you don&#x27;t want to be doing a Bill Simmons impression on the internet because he got there first. And what what you want to do is you want to make your own pond. The internet enables the creation of a million different ponds. So you to get to define your own pond, be the only biggest fish in that pond. That&#x27;s how you succeed. To the extent AI makes that I think this</p>\n<p>is the upside case is AI makes that possible for more than just content for all sorts of businesses to be lots of smaller scale individual entrepreneurs or small teams all of whom don&#x27;t really fit in the Salesforce driven seatbased model for a lot of these companies. So there might be a big return to self-s serve um you know the uh or maybe they&#x27;ll just roll their own because their their needs aren&#x27;t that large. &gt;&gt; Um so that&#x27;s more a larger structural change but the problem is it&#x27;s fine to say</p>\n<p>businesses will be okay as they are. If you&#x27;re eliminating the growth that&#x27;s the big problem I think that that&#x27;s the biggest issue for all the compression &gt;&gt; by headcount growth &gt;&gt; just growth in general. like what&#x27;s if if these are just stable businesses with astronomical stockbased compensation &gt;&gt; that is predicated on we&#x27;re going to be very large &gt;&gt; I can see two critiques you might have uh of uh kind of the software space and why everything&#x27;s traded down one is we&#x27;re you know everyone&#x27;s just going to use cloud code to rebuild their own</p>\n<p>version in house and so uh the software mode is less and the second is actually just that many of these products price on a per seat basis and so if you&#x27;re growing Headcount less on the first shrinking. Exactly. Yeah. On the first like anthropic just installed workday famously. &gt;&gt; Exactly. So I don&#x27;t think um I don&#x27;t think uh you know we&#x27;re cla &gt;&gt; systems of record are are are is that that&#x27;s the category. &gt;&gt; People do not seem to be um you know we see this with tribul as well like I don&#x27;t think anyone&#x27;s cla coding one of those systems of record anytime soon. Now we use workday. I don&#x27;t know what to</p>\n<p>make of the second criticism, but again, it just feels like for a very broad and deep system of record, it&#x27;s kind of hard to make the argument that the business is somehow impaired versus a year or two ago, &gt;&gt; right? But but I think but I think that that&#x27;s my point though is people saying they&#x27;re going to zero are wrong. But if the assumption is you&#x27;re fine &gt;&gt; Mhm. But you&#x27;re not going to be growing indefinitely. Like that shift from thought of as being a growth company to being a stable &gt;&gt; I see</p>\n<p>&gt;&gt; that&#x27;s a haircut and again it&#x27;s combined with these whole compensation structures. &gt;&gt; Yeah. You&#x27;re now valued on EPS rather than revenue or something. So yeah. Um</p>\n<h2>Stratechery</h2>\n<p>can we talk about your business and check? &gt;&gt; Sure. So you were very early to the I mean the sovereign writer um concept. Uh I think you were one of the first premium newsletters. &gt;&gt; Uh I think so. &gt;&gt; Yeah. &gt;&gt; Well well so there&#x27;s two predecessors to talk about. One is just on Wall Street in general. There&#x27;s a long history of faxed out newsletters and things on like grants. &gt;&gt; Uh the difference there is those were very expensive and a very small addressable market. So, uh, the</p>\n<p>difference for Shaki is it&#x27;s much cheaper and the market&#x27;s much larger. &gt;&gt; Uh, the other person that deserves a call out, which I think was the first person to do it before me. Otherwise, I think I was the first, &gt;&gt; was Andrew Sullivan, who did uh &gt;&gt; I didn&#x27;t realize he had a paid news. &gt;&gt; He did for like a year. &gt;&gt; The problem is he did it all wrong. &gt;&gt; You&#x27;re doing it wrong. &gt;&gt; Uh, he was like he would turn out like 50 posts a day, right? just about a gazillion different things. He totally burned out and like all this sort of stuff.</p>\n<p>&gt;&gt; But um that was happened to be a great fit for the advertising model back in the day cuz you would always go back there just always be new stuff and I&#x27;m sure he had a gazill I&#x27;m sure he drove a gazillion impressions for the Atlantic especially when he was with them. He went independent. He was pretty successful. I think he he did like around a million dollars or something like that. But it was a this very leaky pay wall. It&#x27;s like after like 35 posts then you&#x27;ll hit like a payw wall and there&#x27;s a bit where you&#x27;re like you&#x27;re punishing your your worst users. It&#x27;s very easy to get around. Um, and so, but he was actually very inspirational in how I thought about the model in that he was hailed as a failure because he like</p>\n<p>burnt out and then quit. But I&#x27;m like, he made a million dollars, right? It&#x27;s pretty good. Uh, I wanted from the and just think about the psychology of this. When I started Trajectory, he had a gazillion ideas of things to write about and I limited myself to writing a max of two times a week. And the reason is I had the subscription model in mind and when I added the model I didn&#x27;t want it to be I&#x27;m taking stuff away and now you have to pay. I&#x27;m like you like this so much if you pay you can get more and so I always wanted to be you&#x27;re paying to</p>\n<p>get more sort of sort of aspect &gt;&gt; and I think that probably mattered more at the beginning especially because the model was new. Uh, you know, I had I had my metric I looked at was people who visited Shakri on days I didn&#x27;t post &gt;&gt; because they were people that were going there hoping I had posted that day and they were leaving disappointed. &gt;&gt; And so in this case, usually previously a payw wall would disappoint people that they hit it. &gt;&gt; In this case, the payw wall would &gt;&gt; leave their disappointment cuz they they they could now get what they wanted. And so I&#x27;m like, if I can capture X percentage of these visitors, it&#x27;ll be</p>\n<p>very good. um one day goal, one week goal, one month goal, failed to reach all of them. Uh what happened was I I I actually thought it was not going to work. I was going to have to go back to like teaching English or something like that. Uh the but it sort of grew and grew and grew and at 6 months actually hit my one year goal which was 1,000 subscribers, thousand true fans, you know, was $100,000 run rate and I posted a little &gt;&gt; take you how long to get to a thousand subs? &gt;&gt; Six months. &gt;&gt; Okay. And I posted a little note saying, &quot;Hey, you know, model works. Reach, you know, my goal is a thousand for a year.</p>\n<p>I&#x27;ve already reached it.&quot; And this is the only step change in subscribers I&#x27;ve ever had. In the next 24 hours, I got 250 new subscribers. 25% increase. What they were was I had identified those people who wanted to be subscribers. They just didn&#x27;t trust that it was going to work. I was going to go out of business and take their money. And so once they realized I wasn&#x27;t going anywhere, then they all they all signed up. And those people signed. So I actually had my my metrics were right, but I didn&#x27;t properly calculate the uncertainty and people&#x27;s fear of</p>\n<p>losing their money. Uh so I&#x27;m very grateful that now people just sign up for stuff all the time, right? Uh you know, &gt;&gt; I of course I&#x27;ll probably, you know, go to my grade being most wellknown for Shakery, but I am equally proud of the model and that lots of people make a living doing this. How far do you think this model can go? Like again it the the defining characteristic to me seems like the unbundling like you know maybe 30 years ago you would have been writing for a publication whereas now it&#x27;s unbundling. It&#x27;s the direct relationship with your subscribers. It&#x27;s direct</p>\n<p>monetization and generally paid. I mean there might be some ad supporting component as well paid. Obviously, kind of Substack has proven that this is a very broad applicability, but how far do you think this goes versus traditional media bundling &gt;&gt; there? I think there&#x27;s a couple interesting angles to this. Uh number one, I think people including people in tech seriously underrate how large the internet is. And like some of the biggest push back I got when I announced like the check your paid product was from &gt;&gt; VCs. I won&#x27;t say who. It&#x27;s like love you Ben &gt;&gt; just doesn&#x27;t not going to work on the</p>\n<p>internet. Um the uh so and my bit about ponds before I don&#x27;t know that we&#x27;ve scratched the limit of how many ponds &gt;&gt; Mhm. &gt;&gt; can be sort of built in the world and you can sort of occupy and and the other part of this the critical piece of this and AI is actually an important factor here is the key to the model is your costs. So you need just as technology enables you to reach everyone you need to leverage technology to keep your costs very very low. And so for the first several years, for sure it was</p>\n<p>just me. So as long as I could feed my family, &gt;&gt; I was I I I was fine. And this is this is the problem for the traditional like media companies. Their cost structures were were not internet cost structures. They were they were predicated on on much higher revenue. And there, you know, and this is it&#x27;s interesting to think about and talk about this because a lot of this it is like not really applicable. It&#x27;s like before I write about ads a lot and I&#x27;m not an ad business. In this case, I write about VC highcalable companies, but my actual business is very sort of boutique and</p>\n<p>small and artisan in that. Yeah, that&#x27;s right. In that regard, and this is a super important point is managing your costs. &gt;&gt; If you manage your costs appropriately, then the possibilities, but that also means there&#x27;s some things that don&#x27;t work with this model. &gt;&gt; Like your traditional &gt;&gt; classic investigative journalism six-month sort of piece. Yeah. it it did it&#x27;s not well supported by this. &gt;&gt; What did support that was the bundle &gt;&gt; having lots of different writers in one publication altogether and the thing I worry about I wonder</p>\n<p>about is bundles are good for everyone involved and no one wants to be a part of it. So TV is the classic example. Why did we have a TV bundle? Because you had like so in I think it started in Pennsylvania. So you have like a television station in Philadelphia and you have the Alagany Mountains and you have a bunch of towns there that want to get the signal from Philadelphia but they can&#x27;t get a good signal. So they band together. They put up a big tower to get the signal. They run actual cable from that tower to all their houses. And all of cable television started in small</p>\n<p>town rural America to get TV from the big cities. And Ted Turner comes along like I could just broadcast directly to these towers. this would be amazing and you get the model and suddenly every but you had a for geographic forcing function and you ended up with all these companies with the best business model in the world. They everyone paid them whether they watched you or not and they made a ton of money &gt;&gt; and what happened the moment they could do something different. &gt;&gt; Let me I could also go directly I could I could stream directly and there&#x27;s just something about business and like cuz it&#x27;s it&#x27;s a it&#x27;s almost like you have to</p>\n<p>be forced into the game the optimal game &gt;&gt; from like a game theory perspective and the moment you can desert everyone always desserts even if it&#x27;s the best thing. &gt;&gt; Yes. And I so I wonder so I do wonder can bundles &gt;&gt; how does this apply yeah to your world &gt;&gt; because in theory there should be bundles. Substack should be a bundle. Uh like you should be able to pay one fee and get everything. But they you know they started I think a mistake Substack made and I&#x27;m a huge Substack fan just to be clear. I made this creep before mad about it, but is they characterize themselves as being totally writer</p>\n<p>friendly. &gt;&gt; And I think that was a mistake cuz it&#x27;s impossible for them to be ultimately writer friendly cuz the most writer friendly setup is running an open source software like on your own server like then no one could do anything to you. And uh by definition &gt;&gt; I thought you were going to say like the most writer friendly thing is to have like a humming consumer business. It would be but the problem is so they they all their initial terms let &gt;&gt; made the bundles impossible and all the individual publishers owning their own subscribers having their own Stripe account and all these sorts of bits and pieces. &gt;&gt; But hang on isn&#x27;t there like a I feel like there&#x27;s a welltrodden path in tech here where open table started as like</p>\n<p>entirely it started as onrem purely software for restaurants and then they added the customer discovery layer on top of it. Shopify started as a solution just for merchants and then they added the shop pay kind of network layer for consumers on top of this. &gt;&gt; Yeah. But what what actually ma even with those business though like the shop pay bit is nice. It&#x27;s not the driver of the business. &gt;&gt; It&#x27;s a pretty cool part of the business. I like it but it&#x27;s but at the end of the day the vast majority of shop interactions are I see an ad on Instagram and I go there and I get shop the shop button which is incredible</p>\n<p>things. &gt;&gt; No. Yeah. But then it makes the Shopify offering to merchants so much more compelling because you get the shop pay network and there&#x27;s &gt;&gt; I&#x27;m skeptical that&#x27;s the driver of the business. I think it&#x27;s a nice to have. I think the &gt;&gt; but can&#x27;t Substack just add a Substack Prime bundle on top of it and merchants can or writers can choose &gt;&gt; the problem is yeah the problem is the merchants who will drive make that bundle valuable have no incentive to join the bundle because they could make more just monetizing users directly. So imagine I&#x27;m on Substack. How much more revenue does Substack have to give me</p>\n<p>for me to trade $15 a month from all my subscribers for a smaller amount from all whoever is part of this this so the problem is they have to really pay me off to be a part of it meanwhile everyone who doesn&#x27;t have any subscribers of course they love to be in the bundle so so this is why the geographic forces &gt;&gt; feel solvable to me &gt;&gt; I I think it&#x27;s solvable at the beginning &gt;&gt; no sorry it feels solvable now &gt;&gt; yeah I think a counter example is something like Spotify. Spotify is arguably the best bundle on the internet. But the reason why they were able to assemble the bundle is because</p>\n<p>they only need to negotiate with like four four entities. &gt;&gt; And so it&#x27;s interesting because on one hand that limits Spotify&#x27;s upside because those entities are able to &gt;&gt; negotiate such a large share of Spotify&#x27;s revenue. On the other hand, that&#x27;s also why Spotify was possible because they only need to negotiate with four. &gt;&gt; Yeah. Yeah. And if you&#x27;re trying to to like get every artist on earth &gt;&gt; Yeah. &gt;&gt; where you Well, of course I got to get Taylor Swift. Okay, good luck with that. Oh, all the small fry will sign up. But and the music&#x27;s unique in particular because you music the moment a song</p>\n<p>comes out &gt;&gt; is now part of the back catalog. It actually people only ever listen to back cataloges. Uh so that it&#x27;s a particularly unique industry in that regard. But that is a bundle that formed. But I think it&#x27;s because there&#x27;s only four players. &gt;&gt; Mhm. Okay. And how do you use AI in</p>\n<h2>How Ben uses AI</h2>\n<p>writing strategy these days? &gt;&gt; I think it probably replaces what I used to do a lot of on it&#x27;s much more efficient Googling like so I really um the most gratifying articles I write is when I write about a topic that I usually don&#x27;t and then someone from that industry is like wow I did that&#x27;s that was good cuz you&#x27;re always working &gt;&gt; you have this imposter syndrome. Oh, I mean fortunately I don&#x27;t really have imposter syndrome but like if you all work what&#x27;s the uh what&#x27;s the mechanism where you&#x27;re reading something about</p>\n<p>your air yeah that&#x27;s right it&#x27;s like this is totally wrong and then you trust everything else uh I am yeah I don&#x27;t want to trigger gum&#x27;s uh amnesia amongst anyone so &gt;&gt; I will and people ask me like I hate the book question like what books do you read &gt;&gt; I read a lot of books but they&#x27;re very targeted like I will I&#x27;m a very very fast reader so sometimes I&#x27;ll write an article I know there&#x27;s a pertinent book and I will just read the whole book in the morning and like really context in there. &gt;&gt; Um &gt;&gt; and but but in general I really want to make sure I fully understand a space it&#x27;s new that I&#x27;m writing about. This is</p>\n<p>partly though why I have a big competitive advantage. &gt;&gt; I&#x27;ve been thinking about tech since I was in junior high school and I&#x27;ve been writing about tech for 13 years. Yes. &gt;&gt; So I&#x27;ve already done so much preparatory work that anyone starting from scratch it&#x27;s like uh it&#x27;s hard but something so I want to dive into it. I&#x27;m one of the world&#x27;s greatest Googlers. I&#x27;d like to think I know every sort of parameter and how to find and it and so I think I can say pretty authoritarily Google has gotten worse. And I don&#x27;t think it&#x27;s Google&#x27;s fault. I just think they just it&#x27;s harder. One thing is Google&#x27;s fault is they got so biased towards recency</p>\n<p>&gt;&gt; and so you have to be super like diligent. But um AI is so incredible for this like just sort of getting background making sure you understand an issue the ins and outs of it um how things work. you can query stuff, dive deeper. So that is by far my number one use case. I do not always but I will sometimes ask it to this is where I like chatbt like I type in BBedit as an integration. This is also I I&#x27;m very annoyed by and am very sensitive to the coin nature. &gt;&gt; Oh this is really great. No, that&#x27;s not what I&#x27;m asking for. I want you to</p>\n<p>actually go in and find stuff. uh so I do not use it to actually generate any any exact content but &gt;&gt; okay so targeted research and then critique &gt;&gt; yes &gt;&gt; those would be the the two biggest use cases um you&#x27;ve written a lot about the</p>\n<h2>The TSMC break</h2>\n<p>TSMC break this idea that the limiting factor on all AI expansion is basically the rate of TSMC capacity expansion because all most AI all AI chips are fabbed at uh at TSMC. It seems like as you look at the AI space and everything interesting going on, uh so you know for mostly chip constrainted right now, which would not have to be the case, you could be power constrainted and stuff,</p>\n<p>but if you&#x27;re um uh chip constrained, uh there&#x27;s a population of people who want to expand very quickly, the AI labs, Nvidia, people like that. And then yeah, famously, which uh you know TSMC, which is more conservative in how it expands. Why is that? Like why why does the market signal not cause them to build out fab capacity faster? &gt;&gt; Because the risks for fabs are basically larger than for anyone else. You&#x27;re you&#x27;re spending billions and billions of dollars on a fab that if it&#x27;s not fully</p>\n<p>utilized, if you end up with too much capacity, number one, those all those all your costs are locked in. Like basically 99.9% of the cost for a fab is depreciation, which you&#x27;re paying the depreciation. No m like you already showed you&#x27;re paid in cash flow obviously but it&#x27;s on your accounting statement no matter what. &gt;&gt; Uh so the fabs can be extremely profitable. TSMC&#x27;s margins are higher than ever but they can very quickly tip over into having a huge problem. And then once it&#x27;s already built these fabs can run for a long time. So that excess capacity is depresses prices for years to go. I</p>\n<p>mean we see this in memory all the time. memory famously goes through these cycles like what&#x27;s going to happen we&#x27;re going to believe it or not we are going to have too much memory capacity in a few years because we have such a shortage right now like Micron just announced like uh there a huge new fab in Singapore like right and everyone&#x27;s going to do that and which is and so but why has this happened to memory &gt;&gt; there&#x27;s three competitors in memory if Micron doesn&#x27;t do it SKH will if SKX doesn&#x27;t do it Samsung will and so you have a dynamic where a healthy dynamic which is the fabs know better but they</p>\n<p>can&#x27;t help themselves and so they take on the risk and they build these fabs. The problem we have with logic is that TSMC doesn&#x27;t have that pressure and so they&#x27;re actually behaving rationally. TSMC is giving up potential long-term revenue. Yeah. &gt;&gt; But the downside for a fab in particular is so large that they don&#x27;t want to realize that downside. Can they not pass the risk on to the customer where it&#x27;s like you are going to pay for the entire fab? &gt;&gt; That&#x27;s probably what they need to get to. And so Apple famously uh did a lot</p>\n<p>of this uh sort of prepaid and particularly when TSM was sort of expanding hugely in the 2010s and they maybe need to get even more explicit about that. But I think the better solution and the cheaper solution for the hyperscalers in the long run would be to do what is necessary for TSMC to get better. Then you get it for free. Yeah, &gt;&gt; you don&#x27;t need to prepay it. So there&#x27;s this risk that&#x27;s out there this risk of overbuilding. &gt;&gt; Right now TSMC is shifting all that risk to the hyperscalers to Nvidia to Apple.</p>\n<p>And the way it m and the reason why they get away with it is because the risk is foregone revenue. &gt;&gt; Yeah. &gt;&gt; It&#x27;s money you don&#x27;t make. And worse than that, it&#x27;s money you don&#x27;t make four or five years down the road. And everyone like what does every company say on their earnings right now? We could have made more but we don&#x27;t have enough supply. Y &gt;&gt; and if you think it&#x27;s bad and why is it bad right now? Chat GPT comes out. Every hyperscaler starts investing like crazy. What does TSMC do? They actually decreased their capex year-over-year. two years in a row &gt;&gt; they did they there was no market</p>\n<p>response from TSMC to the chat GPT moment now they increased to 41 last year they&#x27;re going up to like 60 this year but even that increase to 60 is a less percentage increase than than last year I think we&#x27;re looking at a massive short shortness in chips in 2029 uh or or so and particularly as the other thing the compute density of AI is so much larger right if you have an agent outdoing stuff it&#x27;s doing so many more computations in a limited amount of time than me and my googling is even humanly possible to do and all these lookups. So</p>\n<p>we have a CPU shortage too and Intel Intel &gt;&gt; shut down some of their CPU plants, right? Uh so it&#x27;s it the whole semiconductor the uh I just think it&#x27;s a it&#x27;s it&#x27;s a big problem and we&#x27;re shifting to for a long time like how can we get an alternative to TSMC for geopolitical reasons &gt;&gt; and the truth is it&#x27;s kind of like the bundling thing. It&#x27;s really hard to get companies to buy insurance particularly when the insurance is uh number one you have uh like everyone else wants someone else to do it right who&#x27;s going to be</p>\n<p>the one to go go and make the sacrifice but also it might not happen China might not attack Taiwan &gt;&gt; and also &gt;&gt; as long as it doesn&#x27;t happen it&#x27;s super suboptimal to go somewhere else cuz TSMC is better right &gt;&gt; and their customer it&#x27;s not just their their fab&#x27;s better their customer service is better and they have all the IP blocks you need and they&#x27;ve done this before and you have existing relationship and they&#x27;ll punish you cuz they women, they have control because they like they&#x27;re they&#x27;re not going to fulfill all their orders right now because there&#x27;s so much demand and so they can pick and choose sort of who and so people are scared. They don&#x27;t want to</p>\n<p>go anywhere else. Uh and and the uh so uh how are we going to solve this problem? And I think I actually wrote on the front page of Shery about this this week even which is basically the same thing I wrote in update but this was a like &gt;&gt; this someone needs to wait. Yeah. Someone needs to the hyperscalers in particular need to appreciate I think a massive crunch is coming &gt;&gt; and it&#x27;s now on them to get Intel up to speed to get Samsung up to speed to get a credible alternative. Yes, in theory you could pay</p>\n<p>&gt;&gt; for political geopolitical reasons or for shortages. &gt;&gt; No, we&#x27;ll get the geopolitical reasons for free. Okay. I think there&#x27;s massive economic reasons to do so, &gt;&gt; which is all the revenue you&#x27;re going to be forgoing in 2029 if you don&#x27;t do it now &gt;&gt; and then we&#x27;ll happily get geopolitical uh insurance for free. &gt;&gt; But if TSMC are the best, like isn&#x27;t rather than like stand up Intel, which seems hard, isn&#x27;t the answer to just again prepay for an extra fab build out for &gt;&gt; this is like how do we feel in tech about ongoing operational costs as opposed to putting in some money up front and fixing the problem permanently? the the market structure is</p>\n<p>a problem. You&#x27;re dealing with a monopolist &gt;&gt; and like not a like a mean monopolist. &gt;&gt; They&#x27;re very nice, right? And they actually have not arguably not raised prices nearly as much as they should have, right? But the the reality is there&#x27;s this market structure problem that is going to impact the hyperscalers and it behooves them I think to fix the structure otherwise the costs of ensuring they or overcoming that are just going to be be larger and larger. &gt;&gt; This seems like the topic you have felt strongest about in the past year or two.</p>\n<p>&gt;&gt; I felt pretty strong with Apple Vision Pro. &gt;&gt; Okay, fair. What was your take with Apple Vision Pro? &gt;&gt; They finally showed an NBA game and they kept changing cameras. They&#x27;re applying 2D television production techniques to an immersive technology. Just let me say courtside. &gt;&gt; I know the TSMC break seems like a bigger deal. Um &gt;&gt; Oh, probably. &gt;&gt; I have some rapid fire questions or I&#x27;m not going to say rapid fire necessarily, but um uh more uh a collection of disconnected uh questions for you. &gt;&gt; I&#x27;ll connect them. That&#x27;s that&#x27;s what I</p>\n<h2>Rapid fire</h2>\n<p>&gt;&gt; Great. Um how should schools do homework now that AI exists? I think they should incorporate it and they should probably do in-person exams like uh or in like the &gt;&gt; Yeah, I mean you you it&#x27;s silly to try to crush it out. I&#x27;m very opposed to these like AI detectors which don&#x27;t work is more I mean probably I&#x27;m particularly sensitive to it because obviously a lot of my pros is in these models. Um no one like my thing was I wasn&#x27;t an MD user but um I&#x27;m a world&#x27;s biggest semicolon</p>\n<p>user. Yeah. &gt;&gt; Uh, which &gt;&gt; I was a big M user all. &gt;&gt; Oh, unfortunately the models don&#x27;t seem to have really incorporated the the semicolon mayo. I haven&#x27;t been that influential, but um but yeah, no, you you want kids to use it &gt;&gt; cuz whoever can use AI most effectively in their jobs going forward is going to have a big advantage. &gt;&gt; Um, so there&#x27;s probably some return to, &gt;&gt; you know, more in-class being more important. I think the this my this is my view on content generally. This is I I just uh I think there&#x27;s a world in which not all content but some content</p>\n<p>is more valuable than ever because AI is a perfectly individualized experience. What you read is not necessarily what I read. So stuff that we both read &gt;&gt; is actually compelling and I&#x27;m very interested in &gt;&gt; figure out how to leverage that to be sort of beneficial to people in the long run. And what can you get from school that you can&#x27;t get elsewhere, right? like I can read the notes, I can read XYZ, but there&#x27;s being in class having a discussion about it, like actually interacting, being pushed on these sorts of things. All this is a sort of a</p>\n<p>beautiful theoretical depiction of what school might be that is probably very far removed from the reality. But identifying things that are common experiences are going to be more and more valuable. Yeah. &gt;&gt; Common content, common classroom time, live events, like shared experiences because anything that&#x27;s individualized is just going to be completely swalled. &gt;&gt; Yes. Do sports teams become &gt;&gt; more valuable than an AI abundance. &gt;&gt; Everything live becomes more valuable. &gt;&gt; That&#x27;s something I&#x27;m thinking a lot</p>\n<p>about as far as my business, right? Like the &gt;&gt; there&#x27;s some aspect of tens of thousands of people reading the same thing every day. Yes. That is actually really powerful. There&#x27;s something interesting there. the possibility of doing live events where people can come together. Uh you I think a lot about community. I think no one&#x27;s ever really solved community around content like a message board or comments or not. You have to get very bad dynamics. There&#x27;s a few people that dominate it. &gt;&gt; Totally. &gt;&gt; Uh but what is great is &gt;&gt; if we&#x27;re in a group chat and you share an interesting article and you have a discussion about that. Yes. &gt;&gt; Uh so there there&#x27;s a lot of stuff around that I think is really</p>\n<p>interesting and that I&#x27;m thinking a lot about. &gt;&gt; What do you think of what&#x27;s going on in crypto these days? &gt;&gt; What&#x27;s crypto? No. Uh, I&#x27;ve always been a crypto defender. Like, uh, just because digital scarcity is fundamentally interesting, &gt;&gt; it&#x27;s probably even more interesting to this point in a world of infinite content, which you thought we had infinite content before. Now we have infinite content on steroids. &gt;&gt; Uh, not just a six billion humans typing away, but agents generating stuff sort of constantly. &gt;&gt; And in that world, I think crypto as an identifier of authenticity is going to be more and</p>\n<p>more important. Like the at the end of the day, I want the original. I don&#x27;t want a reproduction. &gt;&gt; And I&#x27;m optimistic about humans ability to create value where it seemed impossible it would ever exist. I&#x27;m literally a professional like podcaster and content creator and get paid a lot of money to do it. Uh imagine explaining that to someone on the farm worried about the the automation. Speaking of that, you mentioned that a majority of strate uh consumption is now in the audio form</p>\n<p>rather than the written form. &gt;&gt; As far as I can tell, I don&#x27;t do like but the more than well more than half my subscribers are subscribed to &gt;&gt; I consume the audio form. Yeah, it&#x27;s quite interesting. I added the pod this is actually where I started building my own software. I was begging everyone to support paid podcasts. There was dedicated paid podcasts and there was like writing ones and no one would do it. So, of course, I had to just hire engineers and build it myself, at which point it obviously was the right thing to do. Now, everyone does it. Um, whatever. That&#x27;s my fate in life, I guess. But the uh Yeah, people love it. Like, the interesting thing is I&#x27;m not</p>\n<p>sure it&#x27;s been good for my business. &gt;&gt; Why? &gt;&gt; Oh, cuz people &gt;&gt; The good news is is I think it drives retention cuz people would build up emails cuz it&#x27;s like it feels like a lot of work &gt;&gt; and they say, &quot;I haven&#x27;t read this in ages. I unsubscribe.&quot; Whereas it they just consume seven minutes or eight minutes. The problem is they don&#x27;t share. Yeah. Audio content is not shared. &gt;&gt; Totally. I listen to it in the car on the way home from work and uh that&#x27;s great. And then I &gt;&gt; never think about it ever again. &gt;&gt; Exactly. &gt;&gt; But it&#x27;s great for me because I can write the same I can say the same thing the next day. You&#x27;re like, &quot;Oh, that was a very insightful comment. You even know</p>\n<p>I said it yesterday.&quot; &gt;&gt; Yeah. We if we reason about what sectors are going to be important down the road, you know, for the AI buildout, energy is um is going to be a big a big deal and the ability to actually power the data centers that are coming online. Uh that may be a bigger constraint going forward than even chips. Uh robotics are clearly going to be a big thing. It seems like China is doing better on energy and better on robotics and is catching up on chips, doing okay on, you know, the AI</p>\n<p>models. But does that mean China&#x27;s potentially very well positioned for the coming wave of tech trends? &gt;&gt; I mean, I think any country that is capable of actually building things is well positioned. But then again, the counterargument uh if I could sort of put a silver lining on it is the challenge, the trick going forward and to sort of defy the doomers as it were is actually creating new sorts of value, new sources of value in a way that humans are uniquely capable of. And that is by definition a sort of an innovation</p>\n<p>story. It&#x27;s a freeing up resources from things that can be done by machines &gt;&gt; to more productive. It&#x27;s it&#x27;s having a consumer market that pulls out that sort of innovation that makes it possible to write a newsletter or a podcast and actually pay for it. &gt;&gt; And so there is a scenario where China is well positioned to win the total commodification of everything which doesn&#x27;t have much margin. &gt;&gt; Mhm. and the actual value creation and what makes humans humans and</p>\n<p>generates the value that I think people in AI are skeptical can be created &gt;&gt; despite the fact 90% of us use working agriculture and like 1% do uh for some reason that&#x27;s not going to repeat uh &gt;&gt; if you want to be optimistic that&#x27;s the sort of thing that America has always done well</p>\n<h2>Feedback on Stripe</h2>\n<p>&gt;&gt; what&#x27;s your stripe feedback for us &gt;&gt; oh where to start Uh, I mean I am obviously it&#x27;s hard for me to write about Stripe because I&#x27;m not biased because I was very early. I think you you introduced the billing API in 2011 which is a direct spur for wanting to do thinking this was a business model that was possible. So very very big thumbs up on that. &gt;&gt; The you didn&#x27;t warn me about this. I should have thought about this. Uh actually you do have you have one huge issue that I was just dealing with. Oh yeah. a &gt;&gt; your a implementation is a is someone can go in and if I try to add on to an a</p>\n<p>plan so we&#x27;ll say I have a team cuz that&#x27;s where you use a like large companies and they want to add someone on &gt;&gt; if that add-on fails the entire plan gets canceled &gt;&gt; so we have to build a bunch of logic to handle that independently &gt;&gt; okay so &gt;&gt; so that&#x27;s a very detailed specific problem that we&#x27;re facing &gt;&gt; buggy a subscription interactions okay that&#x27;s a good one &gt;&gt; uh there&#x27;s there&#x27;s definitely more I&#x27;d have to go back and think about it. But I mean, I do think the, you know, we didn&#x27;t talk about stable coins in this sort of area of of I&#x27;ve always been a big skeptic of like microtransactions &gt;&gt; because the problem it goes to the</p>\n<p>investigative reporting thing. You can&#x27;t build something sustainable if you&#x27;re only monetizing in the back end. &gt;&gt; And the only way to do that is to have a very large market, which this is what YouTube is. YouTube is a bunch of speculative video makers hoping that they&#x27;ll get enough views that the ads will pay for it. and they&#x27;re such a large scale and they monetize their ads so effectively that it works. There&#x27;s no market like this for written content or like podcast content and you can&#x27;t people are like oh pay for one article like no what you&#x27;re paying for when you &gt;&gt; when you pay for me is you&#x27;re paying for my ongoing production. I&#x27;m making a</p>\n<p>promise to you I&#x27;m going to write something every day and you&#x27;re paying for that promise. You&#x27;re not paying for the actual content. The content is is a byproduct of that. The question for AI and microtransaction is you have all these labs paying people all over the world to generate data and like you know if you&#x27;re like a radiologist you get paid $300 an hour. I saw an article about it and all these sliding scales &gt;&gt; and they&#x27;re all duplicating work. This is because they&#x27;re all you know everyone feels a sense I can get differentiation. What we clearly need is some sort of market mechanism</p>\n<p>for data generation that in the long run will replace what we&#x27;re getting from journalistic enterprises which are even more doomed than ever before. So how do you generate uh like you&#x27;re paying directly for content and then AIs can get it and can you can build a large market like YouTube &gt;&gt; that people will speculatively do it trusting that they&#x27;ll get paid because the market is large enough. That&#x27;s what needs to happen. Like a lot of things, there&#x27;s this massive valley of how do we get from here to there? Um, but we&#x27;ll see. I know Cloudflare is trying to push</p>\n<p>on that. So, we&#x27;ll see what happens. &gt;&gt; Yeah. Last question. How would you rate the execution of the major tech companies &gt;&gt; like the big five? &gt;&gt; Yeah, sure. &gt;&gt; Uh, Apple traditionally very strong. Their manufacturing remains amazing. Like the iPhone Air that just the alarm went off and make sure I turned the snooze off. Uh, the greatest smartphone ever made. &gt;&gt; Really? &gt;&gt; Oh, yeah. &gt;&gt; I never even seen one. &gt;&gt; Oh. &gt;&gt; Oh, it&#x27;s it&#x27;s thin. Is the battery life good? &gt;&gt; Good enough. &gt;&gt; Yeah. Like it&#x27;s bad. &gt;&gt; What&#x27;s that? &gt;&gt; It sounds like it&#x27;s bad then. &gt;&gt; No, it&#x27;s fine. I mean, I actually forgot</p>\n<p>my external battery and it&#x27;s doing okay now. And I&#x27;m back in Wisconsin. I have to wear jeans cuz it&#x27;s cold and it slides right in. Uh, it&#x27;s f actually I love it. Okay. &gt;&gt; I&#x27;m very devastated to hear they might not make it regularly. &gt;&gt; Uh, &gt;&gt; obviously Apple&#x27;s Apple&#x27;s software has gotten pretty rough. their relationship with devel I mean the Apple is so interesting because the reality is when it comes to platforms you have to build the price of becoming a platform is making a great product so Apple gets platforms so they make great products and they&#x27;re terrible stewards of the platforms Microsoft is a great platform steward but they can&#x27;t make good</p>\n<p>products so they never get the permission to sort of have big platforms uh which is sort of a tragedy there um &gt;&gt; but Apple it&#x27;s some you know it&#x27;s an old company driven managers, not founders. And maybe they, you know, the AI Siri got as bad as it was is obviously really bad. But at the end of the day, we still need devices. They&#x27;re still better at them than anybody else. So, they&#x27;ll probably be okay. Um, Google, I&#x27;ve had the hardest time understanding Google in part because I think Google does a lot</p>\n<p>of stuff suboptimally. almost everything I feel like they do suboptimally, &gt;&gt; but I think that lack of like Apple can be super optimist, &gt;&gt; but I think it&#x27;s their lack of optimization that actually makes them maybe the most resilient of all the tech companies because they never they never get so exactly doing what they should do and they have all this extra fluff and doing things and gazillion science projects, but because their their their core business model is so good, it throws off so much cash, they can just</p>\n<p>sort of be sort of &gt;&gt; Yeah. Yeah. &gt;&gt; very flexible. And I&#x27;ve come to appreciate that about them. Everything that frustrates me and analyzing them actually has this hidden benefit of resiliency and strength and adaptability. &gt;&gt; And you know, they&#x27;re like the the the amorph what&#x27;s this? what&#x27;s the the slime that just will like and if they&#x27;re coming in your direction like you&#x27;re actually in big it might take them &gt;&gt; a really long time to get there but when they get there you&#x27;re doomed. Um, so</p>\n<p>Microsoft, Microsoft is always I&#x27;ve gotten a lot of mileage right about Microsoft. Everyone is especially in the SAS era. All these companies are like, &quot;Oh, the Microsoft sucks. We&#x27;re going to make the best of breed product.&quot; &gt;&gt; And guess what? Uh, startups in Silicon Valley, they want to buy all the best of breed products and they have the capabilities to send them together. &gt;&gt; Joe in managing the tire shop doesn&#x27;t care about he just wants this crap to work and to work together. And if it&#x27;s all mediocre, but it kind of works together, that&#x27;s better than best of breed. And right just just squashing</p>\n<p>these companies would grow and just hit the hit that Microsoft wall again and again. Is that going to persist in an AI world? It&#x27;s probably tied to the SAS question sort of before in some respects. &gt;&gt; They their distribution and and power there, you know, remain sort of substantial. &gt;&gt; Meta&#x27;s probably in my experience &gt;&gt; been the best execute. There&#x27;s I mean you usually see stuff like interacting with PR or executives like they just run such a tight yeah that that&#x27;s always been very impressive to me. I think the again I think their ad model is underrated. The trick with them is keeping engagement like that that&#x27;s what</p>\n<p>makes the whole thing go. They&#x27;ve done a decent job of that. hours spent in chat GPT hours not spent on Instagram or not spent and I think that that&#x27;s an underrated area and I think they&#x27;re kind of betting that look that&#x27;s all fine and well today but in the long run this is an infrastructure game we have cash flow to fund it and &gt;&gt; open AI doesn&#x27;t I think open might be a bigger threat to Facebook than Google something worth considering &gt;&gt; but uh Facebook is obviously clearly spending to to meet it so now Amazon</p>\n<p>Amazon. There&#x27;s a lot of there&#x27;s a lot of fab capacity and power being spent on tranium that um one wonders could be better spent on on other chips. But we&#x27;ll see what happens. &gt;&gt; Aren&#x27;t people happy with the trinium chips? &gt;&gt; The degree to which Amazon optimized uh cloud computing I think is underappreciated when you&#x27;re operating in a commodity market. So there&#x27;s two ways to succeed, right? You could have a differentiated product where you can charge a high margin &gt;&gt; or you can have a lower cost structure in a commodity market where the the price floor is the market price but your</p>\n<p>cost structure is lower than your competitors. So that&#x27;s where you make your margin. That was how Microsoft that was how Amazon dominated the cloud. They their their their cloud was way more optimized than anyone else&#x27;s. The whole Nitro architecture like just the way they architected everything doing a lot of their own chips shifting to Graviton. I think the thing with graviton their sort of their ARM CPU is they could who&#x27;s the number one customer for graviton Amazon itself and so they can move all their loads to that optimize it build all the software libraries and then start offering it on a cost basis to others that&#x27;s the playbook that</p>\n<p>they&#x27;re trying to run with trrenium where the number one customer trrenium in the long run is Amazon but then they develop all the capabilities around it for other people for it to be attracted to other people at lower prices and they they have that structurally smaller cost structure. The problem is that works when you sort of leveled off in performance, right? Amazon executed this model between 2005 and 2025. Of course, processors got faster in that time, but not it wasn&#x27;t like the 80s or 90s when every leap was massive.</p>\n<p>&gt;&gt; Does that does that work in a relatively new market when there&#x27;s massive leaps to be made generation on generation and they have Nvidia servers? Do they have as many as they could? &gt;&gt; Yeah. &gt;&gt; Uh because they&#x27;re on this strategy. Um I see &gt;&gt; probably not. &gt;&gt; Ben, thank you. &gt;&gt; Thank you.</p>", "chapters_count": 12}