{"video_id": "kGNoSYQchS8", "title": "Oxide and Friends 12/15/2025 -- OxF 2025 Wrap-Up", "link": "https://www.youtube.com/watch?v=kGNoSYQchS8", "published": "2025-12-21T00:19:02+00:00", "summary": "Bryan and Adam reflect on Oxide and Friends in 2025--favorite moments, episodes, and images. Happy new year and see you in 2026!\n\nNotes: https://github.com/oxidecomputer/oxide-and-friends/blob/master/2025_12_15.md", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=kGNoSYQchS8\">https://www.youtube.com/watch?v=kGNoSYQchS8</a></p>\n<h2>Transcript</h2>\n<p>Hello, Adam. &gt;&gt; Hello, Brian. How are you? &gt;&gt; I&#x27;m going well. How are you? &gt;&gt; Pretty good. Pretty good. Lots going on in the world, but glad to be here. &gt;&gt; Well, is there anything going on? Is there any anything of note? Anything? &gt;&gt; I wouldn&#x27;t You know what? If you&#x27;ve missed it, I wouldn&#x27;t bother looking. &gt;&gt; Exactly. Please don&#x27;t. Uh yeah, this is I&#x27;m excited for this episode. You know, I I&#x27;m I&#x27;m excited for this for this tradition. Uh the our our annual wrap-up. Uh, actually can before we get there because we honestly if we if we hadn&#x27;t already planned this episode, we might be talking about this RFD that I wrote um a week and a half ago, the</p>\n<p>RF576 on using LLMs at oxide. I have been shocked at the Am I stupid to say this? &gt;&gt; No, I feel really &gt;&gt; people feel really excited about it, I think. Is that what you&#x27;re saying? &gt;&gt; I am amazed at how hot this issue is just in general. I mean, I felt like I was saying something that was very like very neutral in the many ways, like very like reasonable, middle of the road, not too extreme. And but I this thing got a huge amount of of pull. I mean, I I made the RFD public because I thought like</p>\n<p>one or two people on Blue Sky might like find a spelling error, which actually they did. So, thank you, Blue Sky. The spelling is something. But and then I was like, we&#x27;re going to a dinner party this last week and it&#x27;s the top story on Hacker News. the number one story on hacker news. &gt;&gt; That had escaped my attention. I would say and I mean this with all respect like I read it and I think my feedback was like yeah okay &gt;&gt; milk toast. &gt;&gt; I mean I don&#x27;t I mean no disrespect just like &gt;&gt; no no no no. This was my view like my view is like very like just like punching a clock doing you know like yeah like just just making sense. It&#x27;s</p>\n<p>fine like nothing like not a number one story on hacker news. So, that was a a a shock. And then I was going to be like, &quot;Okay, we&#x27;re about to go to a dinner party. It&#x27;s the number one story on Hacker News.&quot; And the comments are just like I&#x27;m like, &quot;I have to like turn my phone off.&quot; I&#x27;m like, &quot;God&#x27;s plan.&quot; What you whatever happens at this point, you know? Uh and uh fortunately, it was it was it was all fine basically. I mean, more or less, you know, the haters eventually they once you get to a certain amount of traffic, like the haters are always going to show up, &gt;&gt; for sure. But I feel like I mean your point of like you know you should spend</p>\n<p>as much time writing a thing as you expect people to spend reading the thing. I can understand it as being like I don&#x27;t know like perhaps not obvious but like &gt;&gt; I feel exactly the same way. Like I guess I was splitting the atom on that one. Didn&#x27;t feel like it really. [laughter] Um, but a lot of people like that in particular that really resonated with a bunch of folks who I think were kind of feeling the same thing and struggling to kind of put put words to it. So, so all of that kind of put me on like we I wanted to to flesh it out a</p>\n<p>little bit and I got some great feedback and and I I updated a bit and then I wanted to go back and listen to something I&#x27;d started listening to which is Evan Ratliff&#x27;s Shell Game podcast. Have you listened to any of this? &gt;&gt; I&#x27;ve started it. Yeah, I started this weekend. It is very good. It is outstanding. I guess so if you are especially, you know, kind of in the holiday season here, there a lot of menial tasks that need to be done where, you know, maybe a a podcast and some spiked eggnog might help you get you through it. &gt;&gt; Uh you you you want to be putting on shell game. &gt;&gt; There you go. That&#x27;s halfway there. Then and then pull up the eggnog, right?</p>\n<p>&gt;&gt; And pull up the eggnog. Uh it is. So have you are you on season one or season two? &gt;&gt; I skipped season one and went straight to season two, &gt;&gt; which is I think like that&#x27;s that&#x27;s a good idea. Although I think Susan season one is excellent. The one thing you get and I think you should listen to season one even after having listened to season two. The and in season one he creates a persona of himself that he unleashes into the world and it is really fascinating. But season two is absolutely unhinged because he creates a startup with these</p>\n<p>personas that he creates. And I I mean I I don&#x27;t know. Have you are you I just find it mesmerizing. I think it&#x27;s amazing. &gt;&gt; I I think it&#x27;s great. I think uh I actually played ultimate frisbee with Evan for many years in San Francisco and I think I recall correctly in Wired probably like 15 years ago he like tried to delete himself from the internet and that&#x27;s right he did and he was found after a month. &gt;&gt; Um he challenged the internet to find him and the internet found him. &gt;&gt; Um &gt;&gt; which well you know that you definitely recall correctly. So the fact So we we&#x27;ve got to I mean I know I know this</p>\n<p>is supposed to be a wrap-up, not a preview of next year, but we we got to get him as a guest. &gt;&gt; Yeah, for sure. &gt;&gt; Yeah. And Morris Chang too, right? &gt;&gt; Morris Chang. Um yeah, I mean I think I played ultimate Morris Chang. So maybe I&#x27;ll go after you know actually the fact that you played Ev ultimate with Ev does that mean that I should be asking him or you should be asking? I mean [laughter] you can you can you can hear this in the spirit which it&#x27;s attended right. I mean this is &gt;&gt; very astute question and I can ask him in this case only. &gt;&gt; [laughter] &gt;&gt; Okay, that&#x27;s good to know. You&#x27;re on the same team. That&#x27;s good. The that&#x27;s that&#x27;s good to know.</p>\n<p>&gt;&gt; Um, and so anyway, highly recommended it. Uh, highly recommended podcast. Really really good listening. And I&#x27;m like, uh, next episode of season 2 drops on Wednesday. I can&#x27;t wait. Um, and perhaps in fitting with that, uh, well, actually before we talk about like wrapping up 25, I feel like there&#x27;s a there&#x27;s some headlines of 25 from an oxide and friends perspective. &gt;&gt; Okay. Uh I mean actually one kind of surprising thing do you and have you already done this about the number of episodes and maybe you know just automatically know this maybe your brain</p>\n<p>is just hardwired in the transistor. &gt;&gt; You mean like how how many we&#x27;ve done this &gt;&gt; how many we did in 2025 versus 2024 versus 23. &gt;&gt; Uh I don&#x27;t know that off the top of my head. My guess is &gt;&gt; what&#x27;s your intuition? &gt;&gt; My guess is more than last year and probably more than the year before but maybe less than the year before that. &gt;&gt; That is exactly right. And it but the numbers this year, last year, and the year before are all basically the same. I thought we did a fewer episodes this year. I really did. I thought we you know, like I had to go I was down in Mexico with my mom and I just felt like we we did less episodes, but we didn&#x27;t.</p>\n<p>We actually were going to do like one more episode this year than last year. &gt;&gt; Yeah, I I I I did know that we were like ahead of pace. I think we had some like hiatus where it wasn&#x27;t working out for you and me and I I had seen that that we were ahead of pace. So why why you know, we can skip it. We can give ourselves some time off. &gt;&gt; Yeah. No, it&#x27;s good. All right. So, that was that was a little bit of a surprise to me, but um I thought that was interesting. Um but I feel that the uh the big the big news if the big reveal last year was the all of the sweat on the brow with the images. I mean, I thought that was a big reveal last year.</p>\n<p>&gt;&gt; I think I think I think that people, you know, they they knew they appreciated it, but they didn&#x27;t know why. And now we&#x27;ve got And so, how do you feel cuz now I mean that obviously changed everything. We kind of broke the seal on that and now, you know, we pulled back the curtain. Um, and &gt;&gt; I mean, a lot of pressure obviously. I I was looking back at the year of images &gt;&gt; and they were like, &quot;Good. &gt;&gt; I don&#x27;t know.&quot; Like I feel like are we [laughter] &gt;&gt; No, I I understand what you&#x27;re doing and it&#x27;s fine. You want us to walk out? No. Let walk us up to it so we we so we call out some ones that are really special.</p>\n<p>Although I will I will say there were a couple that I really liked. &gt;&gt; A couple I really liked and I bet you and I are going to we should write it on a card and flip it over. &gt;&gt; I think we need to do that. I think we know what it is. &gt;&gt; Okay. But &gt;&gt; absolute confidence. &gt;&gt; Okay. On three. One, two, three. No. &gt;&gt; Oh, wow. Okay. &gt;&gt; Hey. &gt;&gt; Oh, wow. &gt;&gt; What was the What was the AIDS discourse? &gt;&gt; This is with Clabnick, right? I think it&#x27;s AI discourse. &gt;&gt; Yeah. Yeah. Yeah. &gt;&gt; Um I&#x27;m trying to remember what the image was. &gt;&gt; Oh, come on. Yeah. Yeah. I just wish &gt;&gt; Oh, yeah. I did love that one. This</p>\n<p>&gt;&gt; I knew it. I knew I knew it. So, what you were thinking of was second place, which is fine. I didn&#x27;t know we were doing second place. I thought I thought we were doing in order from first to second, not to second to first. &gt;&gt; This was an image. I mean, I don&#x27;t know. The reason I think I I think I I think I didn&#x27;t pick that one because um because the thing I loved most about it, like only I love about it. So, the images of you &gt;&gt; That&#x27;s not true. I love about it too. I love it about it too. It&#x27;s you sharing a milkshake with a robot, &gt;&gt; which which I really enjoyed. &gt;&gt; But then the thing that I had me tittering and I think basically nobody</p>\n<p>else is if you watch if you watch the YouTube episode, it pans over the span of like literally 20 minutes. It pans over to me like checking my phone next to you like I&#x27;m third wheeling it with you on a date with a robot and then it pans back and and you had told me that there was something very spect and we&#x27;ll talk about the second as a segue to something else I want to talk about but the there are two very special things in that episode. One of it is this kind of panning thing you had but</p>\n<p>not been as specific. You say I really want you to listen to this episode. I think you&#x27;re going to like it. And I was I was grocery shopping listening to the podcast as one does. And it was it had its desired effect where I was just kind of like I looked down on my phone like what when did when did that pop up? Like when did it&#x27;s now Adam and it wasn&#x27;t Adam wasn&#x27;t here and then it so no [laughter] it I wish you could have been I wish I should have been wearing you know the the helmet cam when I was in the grocery store &gt;&gt; the the the selfie cam. You would have really de you would have really it hit the mark. It you could not have asked</p>\n<p>for anything more. &gt;&gt; Uh I it was it was confusion and then it was delight and then it was oh what whimsy what what what a whimsical what a whimsical co-host I have and there how delightful. It was really it was all these feelings. It was really great. &gt;&gt; I love that it&#x27;s for all of those folks who are like staring at the unmoving YouTube video, right? The people who are like no no I&#x27;m going to listen to Oxide and Friends and stare at the image for an hour and a half. &gt;&gt; It&#x27;s kind of like up in a window or whatever. No, this is what makes it even better because it&#x27;s just like off to the side and then you&#x27;re like, wait, has it</p>\n<p>changed? &gt;&gt; It&#x27;s like it has. It has. I&#x27;m glad you asked the question. So, I thought that was great. &gt;&gt; The one I picked uh the the the episode that we had done that you titled I believe you picked came up with the title Hela&#x27;s other networks or maybe collaboration &gt;&gt; for the networks but uh maybe but give it to you. &gt;&gt; Yeah, fine. I&#x27;ll take But then but then uh having having the uh you know you using the the the complaining on no exit making a no egress just felt like I I love that one. &gt;&gt; It was genius and it should be said that</p>\n<p>was a chat GBT or that was an LLM suggestion. &gt;&gt; That&#x27;s right. Chat GPT joke but really good. &gt;&gt; That was like the the first and maybe only Chat GBT joke that I actually like laughed at. &gt;&gt; Yes. &gt;&gt; That was funny. funny. That&#x27;s like No Egress is just straight up funny. Which tells me that it&#x27;s just like cribbing the joke from someone else. Has someone else already done Noess? &gt;&gt; Surely. &gt;&gt; We have We checked the mail bag recently. We probably have some a letter from an angry podcaster who&#x27;s like, &quot;You you stole not just my gag, but my image.&quot; Like, look, the LLM did it. We did. We</p>\n<p>&gt;&gt; Well, I made the image. The LM just gave me the idea in in &gt;&gt; Well, it is a great image. It is. It is. It is a I mean, I thought that was genius. I mean that was really No, I mean I thought that it also like it&#x27;s a level of seriousness that you often don&#x27;t find in in all I mean it&#x27;s like really getting into existential thread you know deep the deep cuts. Yes, &gt;&gt; the the deep cuts. Um so no I thought that was uh are there other images that we want to call and how has it been to have now to kind of democratize this and have other people aware of this? Has it has it helped you? Has it kind of like I</p>\n<p>need people to kind of get out of the workshop while I&#x27;m working? This is just like you know Uh, no, no, no. I think it&#x27;s like I mean I was looking back at the images from this year. A bunch of them I was kind of counting like how many were just AI cuz I I don&#x27;t know that I love that a fact and actually not that many were just &gt;&gt; Yeah, but almost all of them I&#x27; have some AI assistance which which is sort of telling &gt;&gt; it is like &gt;&gt; like aspect ratio this the aspect ratio is wrong is the thing I get from you a lot. Aspect ratio is wrong. Can you fix</p>\n<p>this? Never mind. I&#x27;ve got it. I feel like I&#x27;ve got [laughter] that exact dialogue in the several I guess several times over. &gt;&gt; Yeah, that&#x27;s right. But like, you know, just having it again, not the subject of the image, but the surround um just like great for the lazy man&#x27;s photoshopper. &gt;&gt; Um and then we did hit I I would say we hit the Simpsons a little harder this year. &gt;&gt; 100%. This was &gt;&gt; really tacked into it and it&#x27;s just like we&#x27;re let&#x27;s just mask off. We&#x27;re just going to really Let&#x27;s see if we can get that cease and desist.</p>\n<p>&gt;&gt; No, totally. It&#x27;s like Fox like Disney, please. Like the cease and desist. We&#x27;ll just post the uh the address right right on the images. Yes, &gt;&gt; please. We&#x27;re kind of begging for it, but uh so I thought a bunch of good ones. I mean, I thought a bunch of like good I mean you can look, you can rely on us that like if you&#x27;re going to get a a Simpsons reference from us, I mean there&#x27;s certain things you know about it. know it&#x27;s going to be certainly in the first 12 seasons, probably in the first eight. It&#x27;s going to be something that you should be aware of that a Simpsons scholar and I we&#x27;ve got to like talk about the grown-up CFSA corruption bug image because I feel like that&#x27;s a</p>\n<p>deep cut. That is a Simpsons deep cut. That is a Simpsons deep cut. Yes, this is Crusty the Clown holding up a contract and this was like a reference. I mean, even within the episode, it&#x27;s a deep cut. It&#x27;s it is &gt;&gt; I mean cuz it was a reference to like Matt Arens founder like creator of ZFS giving us a email which we have refer to instead as the affidavit as though it is some binding contract [laughter] which was news to him. &gt;&gt; I mean it was funny because we have</p>\n<p>referred to the affidavit so frequently inside of Oxide that it hadn&#x27;t really occurred to me that we had never really told Matt about this and Matt&#x27;s like what? Yeah. Yeah. Yeah. Sorry. You were under oath when you sent that email. Are you unaware? Yeah. Well, I thought anyway. Anyway, you were. So, uh, [laughter] &gt;&gt; so, so you know, that&#x27;s what&#x27;s up. Yeah. &gt;&gt; But then you, it is, but it&#x27;s it&#x27;s a deeper cut than that because wasn&#x27;t that trimmed from the broadcast? &gt;&gt; Oh, that&#x27;s right. That&#x27;s right. That I forgot about that. Yeah. Right. So, that was a scene that you were familiar with because you have been watching streaming and I only watched like in college and</p>\n<p>broadcast TV, you know. Uh and uh and they cut scenes from syndication. So this is from one of the scenes that was not in syndication. &gt;&gt; Yeah, we are we are out of undergrad. We are deep into grad school here when we&#x27;re talking about the Simpsons. This I thought that was really that was that was an impressively deep cut and you had a couple of I thought and then also like I mean some very just important you know you&#x27;ve got like clearly Sai Bob stepping on the rakes. I mean, it&#x27;s just this is I mean, if you&#x27;re not if you haven&#x27;t watched that scene, I you just these are</p>\n<p>things that you should be, you know, we&#x27;re trying to help you out in your education. &gt;&gt; That&#x27;s right. That&#x27;s right. Uh Homer uh designing a car pointing to it. I felt a little bad implying that like Dave, our esteemed colleague who gave a great talk was [laughter] &gt;&gt; pointing pointing at a doodle. &gt;&gt; You can&#x27;t take these apart too much. I mean, like the AI and higher education with Michael Litman had Homer again. Um, while the while the nerds are are are busy at work, and I&#x27;m not even sure who&#x27;s what in that metaphor. So, you can&#x27;t take this apart. &gt;&gt; You have to pour yourself into it. Like, I think we can all see ourselves in that picture somewhere.</p>\n<p>&gt;&gt; Exactly. Exactly. You&#x27;re all in that picture somewhere. &gt;&gt; We are all the nerds and we are all Homer. &gt;&gt; We all Homer. Uh, reflect. Please, please write a nonlog generated essay, okay? cuz I we &gt;&gt; um here in in Simpsons 301 or whatever course this is. Um another image image I love. Uh so &gt;&gt; I&#x27;m hoping you&#x27;re going to go there. I always &gt;&gt; episode the episode long time in the making. This is the TLB speculation data corruption bug &gt;&gt; that I had been pestering you about &gt;&gt; for two years. Like literally.</p>\n<p>&gt;&gt; Yeah, literally. And the image is just you head in hands like reacting to output that made no sense. Like literally could not happen output. Uh it is a great image. It is a really really good image. No. And that and that one is just like a screen grab from a meeting basically. That&#x27;s just that is just like literally me in my basement trying to like grapple with tears in the fabric of reality. Um and that was &gt;&gt; uh that was really good. No, I thought you were gonna say um AI materials and fraud with Ben Shindle um on the Where</p>\n<p>in the World is in San Diego. And &gt;&gt; that was fun. &gt;&gt; That was I thought that was a great image that you that you um &gt;&gt; Yeah. scrapped together. Yeah. &gt;&gt; Yeah. Was that not I mean am I am I overplaying that one? &gt;&gt; No. No. I like I like that that that took a little bit of you know artistry of form and um that was a fun episode and you sent me an article recently from the Wall Street Journal where they had been apparently listening to the podcast [laughter] &gt;&gt; I think it&#x27;s a little &gt;&gt; let&#x27;s say let&#x27;s say let&#x27;s say for purpose yes uh yeah and what&#x27;s going to happen if I drop in that gift link into</p>\n<p>the Discord I think it&#x27;ll be fine um we&#x27;ll put the gift link at the Discord and then the Wall Street Journal can send me a cease and desist now you know the Wall Street Journal unlike Fox I feel I can rely on them to send me a cease necess you could really learn a thing or two from the Wall Street Journal. Um the um but uh that was like it would because it was an update on you know because you know I relisted to you listen to that episode. I relistened to that episode somewhat recently. &gt;&gt; Um first of all I&#x27;d like to apologize for my bad audio while I was in Mexico. So I know I know the apologies not accepted for many people but I just want to put that out there that I am I&#x27;d like the record to reflect that I am</p>\n<p>apologizing. It really was kind of bad. So &gt;&gt; it was as I recall it was like echoey right? &gt;&gt; It was echoey. Yeah, it was I was in a I mean my mom&#x27;s place down there is a very you know it&#x27;s a lot of tile. &gt;&gt; Yeah, it was like tile. You was like you were you know sitting in a tile cube. It was like &gt;&gt; I was sitting in the tile cube. I was though I but I feel like that&#x27;s that&#x27;s a bit of an excuse. I feel I could have done better. So I apologize for that. &gt;&gt; Well, um look, apology not accepted. And to the haters who are like your audio sucks. It&#x27;s like yes, our audio sucks where we&#x27;re sitting. Like no amount of taking out a Discord is going to improve</p>\n<p>Brian sitting in a six-sided cube of tile. &gt;&gt; Like that&#x27;s not Discord&#x27;s fault. &gt;&gt; This you you can&#x27;t hang out on Discord. That&#x27;s on me. &gt;&gt; Wait a minute. Hold on. &gt;&gt; That&#x27;s [laughter] what I &gt;&gt; Dies and Fire 100%. &gt;&gt; Um that is, you know, that&#x27;s like Ducks and Fire. Is that a reference that that travels? &gt;&gt; No way. &gt;&gt; Really? &gt;&gt; Not Not a chance. really &gt;&gt; like I feel like I mean Bugs I feel like Bugs Bunny &gt;&gt; is like</p>\n<p>&gt;&gt; maybe overtly racist. &gt;&gt; No. &gt;&gt; Oh, you can&#x27;t make Has Bugs Bunny been cancelceled? I can&#x27;t make a Bugs Bunny reference. &gt;&gt; I&#x27;m not sure. I I you know what? I&#x27;m just not going to. Maybe Chad can can weigh on in on this one. I&#x27;m just not I like 100 100% there are some impersonations that Bugs Bunny done has done that were not okay at the time and certainly are not okay now. Well, dear listener, if you are hearing this in the podcast feed, we have decided that Bugs Buddy is insufficiently not cancelled to leave it in [laughter] or we couldn&#x27;t find it.</p>\n<p>&gt;&gt; That&#x27;s right. We forgot to look for it. We forgot to look for it. Um but um okay, so you know, the other thing that that was obviously a very big deal this year um was the the introduction of the chime. &gt;&gt; Ah, yes. &gt;&gt; Okay. So, and actually I just kind of a meta question. Um, on the the the the chime, are we ringing the chime in this? Have you decided? &gt;&gt; No. No. I think we I think it would be &gt;&gt; Are you not kind of been I&#x27;ve I&#x27;ve kind of Okay. Can Can we workshop it a little</p>\n<p>bit? I So, you said no chime in this episode just because you think the chime would be going off all the time. &gt;&gt; That&#x27;s right. That&#x27;s right. I think the whole the whole thing is a retrospective &gt;&gt; and to to chime I mean the the the chime is actually intended &gt;&gt; God I I can&#x27;t believe I&#x27;m saying this as like a gift to listeners right to know more [laughter] &gt;&gt; to know more &gt;&gt; oh that&#x27;s great that I definitely was going to say that I uh dear listener let the record that is Adam who believes that is a gift I know for you &gt;&gt; is for you &gt;&gt; uh you&#x27;re like can I did you keep the receipt is it you have a gift receipt</p>\n<p>can I &gt;&gt; was it this I think it was this season that we did the JJ air horn. &gt;&gt; Okay, that was the second thing I was going to say from that the AI discourse episode was the I say so you had introduced the chime. I think the chime is delight I think the chime is so delightful that I think that that we should potentially have it be in this episode. I I will say I I I I think it&#x27;s for your consideration because I think that the because it will make it very clear noted uh it will make it very clear what the chime is for which apparently some people are confused the time is for what the time is to make reference to previous episodes. uh in</p>\n<p>the and we I think we only kind of do it for once per episode. Like we bring up an episode we haven&#x27;t talked about, we hit the chime, we don&#x27;t like we don&#x27;t nail it on every sentence you&#x27;re talking about. &gt;&gt; Yeah. And dear listener, I have been reducing the volume of the chime with each episode to the point where it&#x27;s fainter and fainter. &gt;&gt; Oh, really? You big chicken. I didn&#x27;t notice that. A little uh a little inside there. A little insider information for folks that that the volume it&#x27;s like, you know, I was an Oxide fans fan back when the chime used to be abrasive. Now you can barely [laughter] hear it. How much I when you Yeah. used to be oxide listeners that you had to know it was</p>\n<p>coming and take off your headphones lest you be deafened. Yes. &gt;&gt; Yeah. Exactly. You would duck and covered the um No. So I think the chime is is delightful. I was relisting to I was relisting to the AI discourse episode and I truthfully had forgotten about uh when cuz we would always joke with Clabnick that whenever you know whenever he hit you know JJ whenever he mentioned JJ you know you got to kind of ring a bell and he hit JJ and boy you did a lot more than ringing a bell. That was a what do you even call that? What does that sound that kind of &gt;&gt; that I know that as MLG air horn?</p>\n<p>&gt;&gt; MLG air horn. &gt;&gt; Do you know what MLG stands for? No, no, &gt;&gt; my understanding is it stands for Major League Gamer. &gt;&gt; Major League Gamer. &gt;&gt; Yeah. &gt;&gt; Oh, interesting. Is that okay? Uh, where are we? Are we like Millennial, Gen Z? Where are we on that? Obviously not Xers. &gt;&gt; I I think it&#x27;s like Gen Z creeping into millennial and like &gt;&gt; we sound like boomers to be clear like right now we are we are giving boomer. &gt;&gt; Don&#x27;t care. We are giving we are giving old people which is as as Susanna described the change lock [clears throat and snorts] music. Uh</p>\n<p>yeah, don&#x27;t care about that one. I that one is um the uh I&#x27;m I really just you know I&#x27;m I&#x27;m just trying to to expand my knowledge, man. Um so &gt;&gt; I think I only did one other sound effect this season &gt;&gt; which was another gift to you &gt;&gt; um more recently. Do you remember this was for the episodes not done? &gt;&gt; The episode&#x27;s not done. So, you were talking about Yeah, we were we were you were talking about like an episode I think we like we we didn&#x27;t do an episode on uh but we should have probably on one</p>\n<p>of the Rust async bugs that Rain had encountered. &gt;&gt; Okay. And you were like calling for the chime for an episode that didn&#x27;t exist and I gave the uh prices right failure uh like wampwamp wamp I you know I think I I had remembered that but forgotten it &gt;&gt; there was the wamp wamp in there that&#x27;s a so when was that must have been well I don&#x27;t know go dick &gt;&gt; the one most recently when rain like just a couple weeks ago I think when we were talking about Yeah maybe future &gt;&gt; future lock yeah yeah</p>\n<p>&gt;&gt; uh future lock a great episode. Um, so we uh I did so I love the chime. I thought I think that the the chime was a great ad. It&#x27;s a deep poll. I think it&#x27;s um you know the fact that it&#x27;s a sound from a visceral sound from from your youth, but our our kind of shared youth. I thought that was great. &gt;&gt; Um and I I I love kind of having that call back to previous episodes. And I know people online hate it. And I guess I mean it is what it is. I don&#x27;t know what&#x27;s I think the &gt;&gt; agree to disagree. &gt;&gt; Agree to disagree. I want I&#x27;m like this like we we have no ads like you you literally never have to fast forward</p>\n<p>through anything other than our banter and like yeah you get the occasional chime like that&#x27;s think of it as a subsecond ad. So that&#x27;s that&#x27;s what I got to say on that. &gt;&gt; Um okay so I also did the experiment you did too of um you know that&#x27;s kind of like it&#x27;s been super busy and I just didn&#x27;t have a huge amount of time to prepare for this. So, you know, as you do, want to see what our little LLM friends would how they would do a wrap-up for this year. Did you do this? &gt;&gt; No. &gt;&gt; Oh, it was fascinating. So, I did a wrap-up with both uh Gemini um and with Chachi. So, this is Chach 52 uh and</p>\n<p>Gemini 3 with deep thinking or whatever, you know, everyone&#x27;s, you know, deep research um 35 anyway, whatever. Uh pretty interesting. So, one I will say this the on the I asked them to like taxonomize it and uh both of them really nailed it. I mean because one of the things that we you know the the episodes did have a different tone this year and I don&#x27;t know that it&#x27;s deliberate. I think it&#x27;s I it&#x27;s a consequence a couple different things but I mean would you what would you say is a big theme for this year?</p>\n<p>&gt;&gt; Bugs. &gt;&gt; Bugs. Yeah, bugs are &gt;&gt; I was delighted. You know, you know what was less of a theme that I anticipated was uh AI. &gt;&gt; AI was less of a theme. AI was less of a theme and I think the I think it&#x27;s because it&#x27;s like less on the horizon and more like in the business now. You know what I mean? Like it&#x27;s more like it&#x27;s like kind of everywhere now. feels. Um, so we did have a couple of AI episodes um, including the one on material the AI materials and fraud which again I I and</p>\n<p>I that was really uh, a delightful episode and conversation. Um, just cuz I feel that that fraud I it&#x27;s okay. Can we just actually maybe we should talk about this for a second? Jokes that we think our jokes it&#x27;s go to laugh your own jokes but that&#x27;s never prevented us. jokes that we thought are funny that our own jokes like I&#x27;m sorry the Aiden Toner Rogers if I did it that that killed me. I every time I relisted to that it killed me. Um I just I I thought the the OJ Simpson Aiden Toner Rogers mashup was &gt;&gt; um I loved. &gt;&gt; Yeah. Um</p>\n<p>&gt;&gt; did you have any that you um &gt;&gt; um any any joke jokes of my own that I want to like relive? &gt;&gt; Yeah. Yeah, exactly. Now is the time when we can we you know we get to laugh at our own jokes right now. &gt;&gt; Yeah. You know what? I I I none really come to mind. Uh I know that I know that you doubt that completely, but uh I don&#x27;t think I retain them well enough. Um yeah, I&#x27;ll need to I&#x27;ll need to think that one through. Uh but I I do like when I am listening to our episodes, I am embarrassed by like sometimes needing to pull over and like titter at a joke that I told to myself 5 months ago. So</p>\n<p>at least I know my audience, which is &gt;&gt; Exactly. Exa Exactly. So that that&#x27;s good stuff. Anyway, um so um the so I I but we had a lot of of episodes on debugging um and a lot on bugs. I mean just we did not have uh including some really interesting stuff. So I mean it&#x27;s like both LLM picked up on this as a pretty big theme and both kind of properly taxonomized. It didn&#x27;t elucidate episodes which is you know a nice thing about having all of the the I God only knows if it&#x27;s getting it out of the GitHub repo or out of the out of the RS feed or the transcripts. I mean, I am not so sure about the transcripts for</p>\n<p>reasons I&#x27;ll get into in a second. I [laughter] I think the LLM may be studying on the train on this one. I don&#x27;t think that like we&#x27;ve done a whole lot of deep work on the um because the very very good superficially and then things kind of fell apart. um but properly kind of taxonomized all these episodes and we had I I I mean I count we&#x27;ve got certainly the debugger driven development um with Dave um and then we had really uh what five different gnarly bugs that we did an episode on each of</p>\n<p>those bugs. So when async attacks &gt;&gt; actually I think I have six. Yeah. Okay, you go. &gt;&gt; Okay. When async attacks, uh, adventures in data corruption, &gt;&gt; future lock, uh, a grown-up CFS data corruption bug, uh, death by uptime. Am I missing one? &gt;&gt; Uh, hell is Other Networks. &gt;&gt; Hell is Other Networks, of course, &gt;&gt; cuz that I mean that was &gt;&gt; Yeah, that that was absolutely. Yeah. Yeah. That and actually that bug in many ways is like actually an even better I mean, the thing I love about that bug is that is something we actually saw in the field. &gt;&gt; Yeah. &gt;&gt; Um, which I thought was great. So I Yeah. No, we got a lot like really um</p>\n<p>those are all great episodes and actually it&#x27;s funny because we did so many of those that uh our colleague Laura has a great blog entry up last week and on a a bug that we had uh in the service processor in bringing up Cosmo and there was like it didn&#x27;t quite get the traction on hacker news that deserved um you know next time I guess write a milktoast RFD on LMU [laughter] as opposed to like really deep technical work apparently. But I actually probably need to get that one in the second</p>\n<p>chance pull on Hacker News. But there was one comment on Hacker News which is like, &quot;Oh yeah, you know, I loved the podcast episode on this.&quot; And I&#x27;m like that we actually didn&#x27;t do a podcast episode. This is actually a different I mean I know I know it feels I know I know it feels like every bug we possible and we probably should do a podcast episode on this but you&#x27;re actually thinking of a different SP log than I think of death by uptime. Um, but the &gt;&gt; um I uh I I I loved I was so great I think to have on each of those having the team on and being able to to to kind of and because each of those was a</p>\n<p>really gnarly problem like I I don&#x27;t feel like any of those was a a simple problem. Um and it was great to get people in their own words talking about. So I love that. I mean, I don&#x27;t know what you&#x27;re I mean, clearly I know that you&#x27;d be you&#x27;d be right to to levthol me right now because you&#x27;re like, &quot;Oh, really? Oh, this is interesting.&quot; Oh, people like an episode that where we talk about an interesting pug that we debugged. Oh, I wonder if anyone had ever made that observation before. No. Oh, okay. Thanks. I know. I know. I mean, in in the spirit of best of us and the airing of grievances, even though I know I&#x27;ve already aired these</p>\n<p>grievances, like do you remember the I I I think I pasted into chat in in during that episode all of the all the DMs I had sent you wanting to do that episode [laughter] and they started to be like, &quot;Hey, I really loved that idea you had, Brian, to do an episode about this.&quot; I was trying to kind of intercept you. [laughter] &gt;&gt; Yeah. Yeah. You&#x27;re trying to accept me. It&#x27;s like, no, I like it. It was the end of the Hey, look. And one of those worked. We can&#x27;t say which one, but but one of those worked. &gt;&gt; Um, &gt;&gt; yeah. &gt;&gt; No, that that was even the dog loved it. I mean, I think it was the And those were So, yes, of course, we know the dog</p>\n<p>is like I&#x27;m not saying I loved it. No, sorry. I&#x27;ve got [laughter] &gt;&gt; I&#x27;m saying I was here for it. Yeah, I had to listen for it. Exactly. &gt;&gt; Um, [snorts] don&#x27;t put barks in my mouth, please. Um, but I uh I thought they we The thing I love about this I mean this is what you and I like I think love about these just in general too is that when these systems fail they reveal themselves and every one of these failures which are actually pretty different. I mean with the exception of death by uptime sounding a lot like the the bug we described in the plug entry even though it&#x27;s totally different but each of these is a kind of in a different aspect of</p>\n<p>the system. Um so I thought it was and there&#x27;s a lot to learn from it. So I thought anyway I thought those were were great. Um, and I I just wish you had told me sooner that we should be talking about adventurous data corruption. I mean, if only if you had said it sooner or more frequently. &gt;&gt; That&#x27;s on me. [laughter] &gt;&gt; That&#x27;s right. [snorts] &gt;&gt; Right. There&#x27;s only one person to blame and that&#x27;s me. Uh, no. I love that there&#x27;s a theme, too. I mean, I just feel like uh, you know, I think sometimes we we talk about um, you know, junior engineers reading this, college student I mean, listening to this and or college students listening to this and I think that those are all such terrific episodes and and uh, such terrific</p>\n<p>learning experiences like &gt;&gt; I learned from those episodes. Um, certain certainly as we&#x27;re debugging, &gt;&gt; no one person &gt;&gt; is is debug. I mean, maybe with the exception of Cliff last week, but uh, by and large, it&#x27;s not just one person figuring it out. Um, and uh, and a lot of great techniques, a lot of great sort of um, you know, guidance for just how to take incremental steps on those things. So, I think those are always super fun. &gt;&gt; Totally. And Cliff would be the first to say that very much the baton was passed that there bunch of folks who&#x27;ve done a lot of work on that problem that allowed him to really take the kind of the next</p>\n<p>step on that. So, no, I I agree with you. Each one of those was a real team effort. Um, and it was I So, the um so I asked the I I asked our our LLM friends how 2025 contrasted to 2024 and the the the presence of these episodes on debugging has it drawing some big philosophical conclusions that I&#x27;m not like I&#x27;m not sure. &gt;&gt; You guys write garbage code now like 2024 your code was tight. No, they both said that like no 20 the 2024 was about</p>\n<p>the the philosophy of building systems and 2025 was about the pathologies of those systems when they&#x27;re built. This is about the the uh I believe it was chat GBT that called 2025 relative to 2024 quote painfully concrete unquote [laughter] which I&#x27;m like again I don&#x27;t know if this is like &gt;&gt; did you like is it reviewing us on like Apple podcast cuz like no thanks on that one. &gt;&gt; Yeah I know painfully concrete is I feel like something I I mean I feel like this is feedback I may have gotten more than</p>\n<p>once in my life. So, um, the, uh, but I thought that was, you know, then I got to think about it like, well, maybe that does actually kind of reflect, I mean, cuz we&#x27;re talking about a couple of these things that we are that you only do get in a bit, in a system that is a bit more mature or is in a is in the field. So, I think there&#x27;s some like slight accidental truth. I think we&#x27;ve been debugging really gnarly problems all along and I think we&#x27;ve been talking about them somewhat all along. Um, and I would in particular like I think that if one is interested certainly on the hardware side like the bring up episodes, all of them and we had</p>\n<p>bringing up Cosmo this year. Um, really get into all the nasty issues we see in bringing up a new board. um the um so I I think we&#x27;ve been talking about it all along, but I think it&#x27;s also true that like yeah, we actually definitely talked about more in 2025 and maybe it does reflect um you know the uh and again all of the LM suggestions on this are are you know they want do and would you like me to write a one-s sentence paragraph on on each of these years and do you want me to do this? I mean it&#x27;s always like it always ends with this like do you want me to take it much further kind of question to you? Do you know what I mean? like do you want me to like should</p>\n<p>I go tattoo this on my knuckles and you know strip of the waist and run through the streets I&#x27;m like no no no none of that would be necessary right now thank you [laughter] very much &gt;&gt; you know I I think I am a victim of like the the memory that chatpt has because I have told it to be tur so many times &gt;&gt; that I&#x27;ve I in fact I&#x27;ve told it to be tur to the point where I am asking it for more information like if I&#x27;m not asking for more information it&#x27;s not being tur enough that it now just gives me wonderful responses like very frequently. So I I think I may have over</p>\n<p>fit that one. &gt;&gt; May may have overshot the mark on that one. Yeah. Like chatp is like look frankly I&#x27;m walking on eggshells with you. So I am trying to use the fewest words possible. I and I I&#x27;ve got a bunch of ideas of things that I want to do, but I&#x27;m going to go save all them for for can. He&#x27;s he seems to love them. I&#x27;m like which I don&#x27;t. I don&#x27;t want any of these. But you know I I &gt;&gt; I&#x27;m not going to tell you that. That&#x27;s fine. Yeah. I get it. &gt;&gt; Yeah. So I um so that was a big theme. I mean of course wasn&#x27;t they weren&#x27;t all debugging episodes but there were more that were just about uh engineering at Oxide. I think we had more on and fewer</p>\n<p>hot takes, right? I think which is like probably good, right? I think &gt;&gt; yeah I think I counted like eight or nine or 10 like oxide &gt;&gt; kind of like hanging with the oxide crew what it&#x27;s like to build at oxide you know bringing up something you know having Robert on Dave on talking about some of the kind of structure around how we build stuff. &gt;&gt; Yeah that I that episode with Robert was great. &gt;&gt; Yeah for sure. &gt;&gt; I really really enjoyed that conversation with Robert. Also can you talk about the AI work on that one? That was great AI work on the image. [snorts] [laughter]</p>\n<p>&gt;&gt; Yeah. So that that was like an AI assisted image. It was an image of Robert at a whiteboard drawing. The original image had like five other people in it that I thought were extraneous. &gt;&gt; Yeah. Just like we&#x27;re actually going to we&#x27;re going to airbrush these people out of the we&#x27;re going to you know channel our inner Soviet and it&#x27;s like yep nope not you. You&#x27;re now &gt;&gt; it was just Robert designing everything in a whiteboard by himself with no audience. Yes. &gt;&gt; And I mean admittedly to be fair it&#x27;s like these are actually people that were</p>\n<p>all like broadly so familiar with the company. It was just like it&#x27;s just like their legs or what I mean it&#x27;s like it wasn&#x27;t it wasn&#x27;t a flattering. &gt;&gt; It was just the framing. It was right. It was framing. &gt;&gt; Right. &gt;&gt; Yeah. So anyway, I thought that was that was an excellent image and I love that conversation. I thought that conversation was was really great. Um, I think that the uh I mean obviously we&#x27;re all feel very I&#x27;m very lucky to work with all of our colleagues, but um Robert&#x27;s disposition was one that really I mean it really was a a a great kind of one episode synopsis of our engineering ethos and approach. Uh it really merits</p>\n<p>merits a relist. I thought that was very good. &gt;&gt; Yeah. &gt;&gt; Um because someone mentioned it in chat they they they talk about uh you know we talked about running into Dennis Richie trying to give a drace demo. Apparently, we talked about it this season, but but we in fact episode, right? &gt;&gt; Yes. But we had in fact told that story maybe two years previously, but so I I but I&#x27;m delighted that for somebody it was a highlight of the season, even if for somebody else it might have been a highlight of a different season and maybe we&#x27;ll tell it [snorts] again next year. And you know, I think that people</p>\n<p>should take some solace in us retelling a story that we&#x27;ve already told because you&#x27;ll find that the details tend to line up. &gt;&gt; You know, I mean, &gt;&gt; I was going to say it really emulates the Brian and Adam like IRL experience as well. &gt;&gt; It does. Which really emulates I think you&#x27;re much better at this than I am. I mean like and I uh I so pride myself on like I mean I really try pride myself. I live in fear I should say of just like endless endlessly repeating. What&#x27;s the opposite of pride? Oh, yes. Living pride myself, right? Like, excuse me. Hold on. I&#x27;m being just being handed this. Um,</p>\n<p>no. I the um and I and then of course like you relisten to the podcast like oh my like it&#x27;s like it&#x27;s the you know where were you when MCA died which I think we&#x27;ve referred to like eight different times over the history of the podcast. Just like okay I need to wind that down. Uh so these things that I thought I hadn&#x27;t repeated but I was able to actually surprise you with things about me that you had not heard. &gt;&gt; Yeah. &gt;&gt; Uh which I thought was um in particular my my own the the first $5 I made as a software engineer. I you not heard that story. U so uh um so that was good but</p>\n<p>that was that was earlier in the year than when we were all at the ballers game together um as when we we met up as a company. Uh, and I was I was telling a story that I was convinced you had never heard and you literally identified it from a single syllable. You&#x27;re like, &quot;Wait a minute. I know this one. This is &gt;&gt; too.&quot; Yeah. &gt;&gt; Yeah. And I&#x27;m like, and I&#x27;m that&#x27;s I&#x27;m not going to give people more context. That&#x27;s the That&#x27;s the only thing I&#x27;m going to I&#x27;m going to tell people. Uh, but I So I Anyway, I am always worried that we&#x27;re that we&#x27;re repeating these</p>\n<p>things too much. But the Dennis Richie story, I&#x27;m glad that we have told that. um twice apparently &gt;&gt; so far. &gt;&gt; Um uh we got some other favorite moments. Um so this is Tyler in the chat dropping in some other f favorite moments. Uh the uh the books in the bonfire. Uh I love books in the box. &gt;&gt; I really love books in the box. I I I um and um I uh I&#x27;m reading um and I believe a recommendation we got from Books in the Box. I know this is like an off like offcycle books in the box, but the</p>\n<p>eccentric orbits, the aridium story that we got that was a recommendation we got in Books in the Box and um I&#x27;m really I&#x27;m loving that. It&#x27;s very good. So I um I really love the books in the box episodes. &gt;&gt; Yeah, same. I I uh listened to actually the Neil Stevenson book uh Terminal Shock uh started that like the kind of the day after and and really enjoyed that and it felt very much previous Neil Stevenson I&#x27;d read. Um uh and it felt very similar to like you know experience from 20 years ago but it&#x27;s great. &gt;&gt; Uh that yeah that is I I do you recommend it? I need to go I I&#x27;ll go</p>\n<p>check it out. Yeah. Yeah. I have not not read any Neil Stevenson. &gt;&gt; Am I a safe space? &gt;&gt; No I think I think uh I think you may have already do I say that in every podcast episode it&#x27;s happening again. Are we going to get like what what&#x27;s the chime we&#x27;re going to ring when I for my early onset dementia? Are we going to have one for that? &gt;&gt; It&#x27;s like it&#x27;s your good night and good luck. &gt;&gt; It is. God damn it. All right. [laughter] Um well, I &gt;&gt; usually trim that in the sign off just cuz I feel like it&#x27;s a little repetitive, but you say it every single episode. Look, I still haven&#x27;t read any Neil Stevenson. I know. I just I feel</p>\n<p>that that&#x27;s like I feel that that&#x27;s an aberration a little bit that I um that&#x27;s &gt;&gt; right. &gt;&gt; And this um is now the time to uh No, this is not the time to mention this, but I&#x27;ll mention it anyway. You know, I&#x27;ve been kind of fantasizing about a Mad Men, but for Fairchild Semiconductor. No one needs to make that. And like I guess ring the early onset dementia chime because it&#x27;s got nothing to do with anything we&#x27;re talking about, but I wanted to get that out there and now it&#x27;s out there. So &gt;&gt; to get it off your chest, &gt;&gt; it&#x27;s off my chest. I think it&#x27;d be amazing. &gt;&gt; I think it&#x27; be amazing. [clears throat]</p>\n<p>&gt;&gt; I&#x27;m in. I&#x27;m in. &gt;&gt; It&#x27;s like a period piece. &gt;&gt; A Kickstarter. I&#x27;m I mean, I&#x27;m in. &gt;&gt; It&#x27;s a Kickstarter. It&#x27;s a Kickstarter for a period piece about Fairchild. Super large demographic kind of a show. So, &gt;&gt; speaking of poor segways, one of the things that I was hoping for this season that or predicted, no pun intended, was more about Intel &gt;&gt; and um and we had our [clears throat] predictions episode where you made a great prediction about Liutan. Uh, amazing prediction. Uh, &gt;&gt; well, my prediction was that the co-CEOs would still be in place.</p>\n<p>&gt;&gt; No, it was sort of uh, but you you talked a bunch about Lip Boutan &gt;&gt; about Libo. Yeah. Yeah. Yeah. &gt;&gt; So, and [snorts] then Lip Boutan joined and then we haven&#x27;t had much to say since then. &gt;&gt; No, we sort of I sort of thought there would be more to say. That&#x27;s all. &gt;&gt; Yeah. Yeah. It&#x27;s uh I&#x27;m I&#x27;m less surprised that there&#x27;s not more to say, but we&#x27;ll you know who who &gt;&gt; who knows what the future holds in one. Yeah. big highlight for me. Uh John Holloway dropping the Oxide Bingo. &gt;&gt; Uh for those not familiar, &gt;&gt; very good, right? It feels like we&#x27;ve</p>\n<p>always had that, but that has actually that Yeah. Yeah. &gt;&gt; Oxide.Bingo. Um amazing. &gt;&gt; Really amazing. That been delightful. Uh, and you know, I think um, you know, we&#x27;ve got I you need to to ask um the, uh, ask the the LLM what they kind of think of the oxide bingo card. See what they Okay, because this gets into the um, I as I was like, so they they&#x27;re kind of cutting these big themes of 2024 versus 2025 and and I thought that was kind of interesting. Uh, and then I</p>\n<p>asked for some fan favorites &gt;&gt; in and this is where things got a little started to get a little funky. um where cuz and this is you know the um the the Shell Game podcast gets into this but the I mean the big challenge with these things still is they really struggle with like I don&#x27;t know &gt;&gt; and they they still like will go just absolutely bonkers if they feel that that&#x27;s what you&#x27;ve asked them to do and so like they&#x27;re just happy to make up</p>\n<p>what they think are popular episodes and they like make up reactions and Uh it was and you know like some of it is like this like could I mean this is like not an unreasonable thing like yes the death by uptime could be a favorite episode but we also only cut that two weeks ago is that like this is what chatbt has convinced has become a touchstone episode &gt;&gt; [snorts] &gt;&gt; uh as what one that people you know has test of time and um I mean it was it&#x27;s like okay uh that and chat GPT amusingly is like well I obviously don&#x27;t have</p>\n<p>access to any of the the view counts for this stuff. So, it kind of acknowledges that I I will ground this in observable audience signals that you do have repeat references, community chatter, longevity of discussion, and how often episodes become shorthand, eg the async episode or the ZFS bug one, etc. Which sounds like a great idea, but then it doesn&#x27;t do any of that. Like all the I mean like I don&#x27;t know how has Death by Uptime become shorthand. It&#x27;s our most recent episode. That doesn&#x27;t make any sense. H I I this I mean I feel like this intern has like started their internship very</p>\n<p>strong but then then [laughter] they kind of drifted off. Exactly. This I feel this is what often happens with the LLM intern. Um what what emerges says Chad GBT is that audiences favor favorites skewed heavily towards painful specificity and earned insight. It&#x27;s like okay come on &gt;&gt; tone it down. Um the um and I mean then it kind of goes on like every episode like why it landed and you know why it&#x27;s a favorite. It&#x27;s like you&#x27;re just making all this stuff up. So um the anyway then like things are</p>\n<p>beginning to drift. I go over to Gemini and ask it the same question. Gemini kind of interestingly is like does not have any of the same reticence about going into view counts. &gt;&gt; Gemini is like oh YouTube&#x27;s a property. I can actually go. It&#x27;s kind of interesting right? I actually well sorry I actually do know all your view counts by the way. I also know your bank account balance by the way so I can kind of factor that in. Um and uh &gt;&gt; he knows like our demographic breakdown and it probably knows &gt;&gt; exactly like I know all sorts like I know exactly what kind of ad to put in</p>\n<p>front of you right now. By the way, a word from our sponsor. Um so it has the what it calls the undisputed heavyweight. Gemini does of its undisputed undisputed heavyweight heavyweight of the year. It has one that&#x27;s just like this one is got it&#x27;s got the highest view counts of the year which as far as I can tell is actually true. &gt;&gt; Huh. &gt;&gt; Um &gt;&gt; I&#x27;m going to guess it&#x27;s system software on the large with Dave. &gt;&gt; Bingo. Bango. That&#x27;s it. &gt;&gt; Yeah, that was a great episode. &gt;&gt; Really good episode. And I I do know</p>\n<p>that the view counts were high and uh you know the the the chatter uh such as it was was you know was was pretty good. So I think it was people people took a lot away from that. &gt;&gt; Um and I I I do see it referenced from time to time &gt;&gt; and you know as usual like Gemini like wrote one sentence too long on this. So it was like you know it bridged the gap between code and reality d you know and then its final sentence on this is it resonated with every engineer who has ever had to push a scary update button. It&#x27;s like yeah strike not [laughter] that one&#x27;s not yeah um and then uh and</p>\n<p>then it kind of goes into and then again it kind of makes up the popularity of the others. Um, I mean it I think right I mean it&#x27;s like the they talk about scing manufacturing that&#x27;s the how it&#x27;s made favorite and I&#x27;m like I think it&#x27;s a great episode. I&#x27;m just I mean I would love to think that um I don&#x27;t know. Um &gt;&gt; you have the home labers who are trying to to ramp up &gt;&gt; ramp up the scale. [laughter] Exactly. &gt;&gt; Um it does it does call out founder versus investor as the as the crossover hit. Um I I did I really Exactly. Sure. Why not? Um I really did I I love that</p>\n<p>episode. I thought that was fun. Um, and the um, I also loved the fact that Liz&#x27;s current startup has an LLM based on that one has kind of with one&#x27;s own voice and expertise and then we could actually go to that and people were during the episode going to the LLM that features Liz and Jerry as LLMs and like positing things about the episode and then they were replying in kind and it was it was pretty good. So, um, pretty sassy. It&#x27;s funny. &gt;&gt; That was good. Uh we haven&#x27;t talked about I think the episode that was not the most popular but like I think that we were most excited about which was uh</p>\n<p>character limit. &gt;&gt; Character limit I is is outstanding. &gt;&gt; Kunger and and Ryan Mac on I think we kind of were both very excited about the book and really excited to have them on and audio is just abounded as they do. Uh but it was a really fun conversation with those guys. &gt;&gt; Biggest get your get biggest get. I thought that was the that was a great get of the year. Yeah. I I thought it would that was and it was a great conversation. I love that book. &gt;&gt; Yeah. &gt;&gt; Um I I made [snorts] the arguable mistake of like I left my physical copy</p>\n<p>with my mom in Mexico. I&#x27;m like, &quot;Mom, you have to read this. This is so outstanding.&quot; Um she hasn&#x27;t. And now I&#x27;m kind of got the awkward thing of like, I want the book back. Like you&#x27;re obviously not going to read it. So just like you&#x27;re going to Anyway, &gt;&gt; I mean that&#x27;s a book I I like I referenced last night. That&#x27;s a it&#x27;s something that I I talk about frequently that um along with careless people go those go kind of hand in hand &gt;&gt; and you know I also there there&#x27;s a there&#x27;s a joke that we that to jog your memory about about jokes that you have that we laugh at is they they kind of the uh the Tinkerbell character um for</p>\n<p>[laughter] Sarah Win Williams &gt;&gt; Sarah Williams that&#x27;s our frequent guest [clears throat] &gt;&gt; like I think you think I&#x27;m kidding but like I do want to do that episode like I want to have Sarah Darwin Williams in the in the office with us. &gt;&gt; In the office with us. Absolutely. &gt;&gt; Not saying anything per the court order or whatever &gt;&gt; and just us pretending to have heard something. I &gt;&gt; I think it&#x27;d be great if like in addition to Meta issuing a restraining order against Sarah Williams, Sarah Williams issues a restraining order</p>\n<p>against us from using her as a like I&#x27;m not I&#x27;m not on your podcast. I&#x27;m like, well, that&#x27;s what you&#x27;re just abiding by this restraining order. We understand that we know you are never on the podcast. &gt;&gt; Signal is seriously like this is disturbed and I like you&#x27;re actually not abiding by the restraining order. So, you need to stop, please. Um [snorts and clears throat] &gt;&gt; I [laughter] you know I I think that 2026 needs to be a year like we got to get a CND from someone. I I just feel that like stretch goal. &gt;&gt; It&#x27;s a stretch goal. We just haven&#x27;t arrived into We haven&#x27;t got the lawyers</p>\n<p>involved yet. Clearly Fox is not going to send it to us. Like &gt;&gt; we&#x27;re not I I we I don&#x27;t know how much harder we can be trying. &gt;&gt; The estate of Jean Paul Sartra isn&#x27;t going to like [laughter] like when are we going to get this letter? &gt;&gt; When we get this letter, come on. Um but that book is so so so good. Um I would love to also have her on um if and when she can uh she can join us because I thought those are really the book is obviously stunning. No, I thought that that episode was great. I bet you know another um an episode that I Okay. What are episodes that you have sent to</p>\n<p>people if any I don&#x27;t um &gt;&gt; um I sent the one the one with Michael Litman the the AI and higher education. Uh &gt;&gt; love that one. &gt;&gt; Yeah. Like I sent that one to my folks. I&#x27;ve sent that one to um my both my technical and technical college friends. I think it&#x27;s like it Michael is so terrific. I I thought he had such a uh thoughtful take on AI and and um you know not to throw out my shoulder patting us on the back but um you know I was I was pleased that you know we came up with this way there. I thought this</p>\n<p>was a very good guest to have a a a better conversation about AI. I think we had had a lot of conversations about AI that were that were good but I think this was an area where it&#x27;s easy to be simplistic and reductive. And I think Michael had had a had such a thoughtful, considerate conversation with him. I really enjoyed that. &gt;&gt; I really enjoyed that, too. And I I also sent that to I sent that to my 18-year-old, my my college freshman, um, to get his perspective on it, cuz this is something that everybody is grappling with. And it&#x27;s a really important subject, especially in higher ed. And I</p>\n<p>thought Michael was great. I thought it was really, it was that was a terrific conversation. Another great get for you, by the way. Thank you. Um, we are keeping score and and you&#x27;re and I I know that this is all about getting me getting Morris next year and I trust me I am feeling the heat. I am feeling the heat because you guys good. Especially if I get Evan, forget about it. You&#x27;re like way behind &gt;&gt; Evan. I I get Yeah, I&#x27;m still going to be like, &quot;Wait a minute. That guy I played ultimate with that guy. I don&#x27;t know.&quot; No, no, no. I didn&#x27;t play ultimate with you. You can come. It&#x27;s fine. Um the um No, but that was a that was a really great conversation and I So</p>\n<p>I sent I I have definitely sent that one. Um, and then another one that I&#x27;ve actually sent a decent amount is, and I I know it&#x27;s off our demographic, but diving in with Robert Bogart. Um, and uh, the because I&#x27; I&#x27;ve had a decent number of parents of athletes reach out to me after my blog post um, about college baseball, venture capital, and the long baby. Um, and uh, that and then that listening to that episode as well. Um, so I was really grateful for Robert for joining us. And again, I know it&#x27;s I</p>\n<p>know it&#x27;s a little bit we but we got to take you off the beaten trail a couple times. You know, I feel like I it I just doesn&#x27;t bother me that like we&#x27;re going to have things that are that people aren&#x27;t necessarily expecting from us. &gt;&gt; That&#x27;s right. I mean, we did have like 100% fewer baseball episodes this season. &gt;&gt; Yes. I mean, if you&#x27;re calling I mean, but we we also had a million% or more. I&#x27;m not sure what you&#x27;re coming up from zero, but on NCAA swimming. So, I&#x27;m not sure like I I mean, sure. I mean, like, you know, out of the frying pan into the fire. Um, but &gt;&gt; that&#x27;s fair enough. &gt;&gt; Um, but I thought that was that was another great one. And so, and that one</p>\n<p>I I I&#x27;ve sent to a bunch and of course we I also end up, as you can imagine, sending episodes to folks that are contemplating becoming oxide customers or becoming oxide, want to apply to oxide. So, it&#x27;s been a great factor for that. And I&#x27;ve sent a bunch of them out for that. But those are episodes that I&#x27;ve sent to to more personal folks. So, &gt;&gt; yeah. Yeah. Yeah. Same. But but that but kudos to you for bumping the uh the listen count for everyone applying to Oxide being sent a bunch of podcast episodes to listen to. &gt;&gt; Yeah, exactly. &gt;&gt; Good strategy. &gt;&gt; Yeah, you got to game this somehow and</p>\n<p>you might as well do it with applicants. You know, you got to go I actually would be curious to go because you know we do point every Oxide applicant to our conversation with with Gayoros. &gt;&gt; Yeah. &gt;&gt; And from uh from 2024. from 2024. Uh, is that when that was 2024? Okay. Yeah. &gt;&gt; God, they it&#x27;s all I That one should have much higher view counts, listen counts [laughter] if it but I&#x27;m not convinced it does cuz we we definitely get plenty like if you&#x27;re going to apply to oxide, please do listen to this thing by the way cuz</p>\n<p>it&#x27;s like it does have there&#x27;s there&#x27;s a bunch of stuff in there that is is helpful and der. &gt;&gt; That was 2023. Jeez, I&#x27;m &gt;&gt; Yeah, I know it was late 2023. Now, you&#x27;re right. &gt;&gt; Yeah, that makes sense. No, I know it was late because it was like dark and cold in the office. Uh late in terms of like late in the year um in the winter, but yeah, that&#x27;s it. Um so, um but then does that one have higher view counts? I mean, listen, are you on the transistor looking at the transistor there? &gt;&gt; I&#x27;m not I should What am I doing here? Why am I looking at transistor? As long as you&#x27;re looking at transistor, we got you know, we we get country downloads.</p>\n<p>Um and you know, we uh I it&#x27; be interesting to know how we&#x27;re doing. I think you know, last year we called out like our downloads in Namibia. We&#x27;ve got, you know, 20 downloads in Namibia this year. So, not sure where that that kind of that counts. Um, we do still have some countries with it with with zero downloads. &gt;&gt; Um, several of which are war torn. One of which is like Papa New Guinea. I feel like Papa New Guinea. If you&#x27;re if you&#x27;re in Port Moresby, I feel that you can listen to Oxide and Friends like Papa New Guinea. I &gt;&gt; think you can just like up it a little bit. I feel like you know. &gt;&gt; Yeah. Just grab the baseball episode and send it to your buddy in Papa New Guinea and we&#x27;d really,</p>\n<p>&gt;&gt; you know, I will. I think I think Port Morsby can really I think it will that&#x27;ll resonate with them. &gt;&gt; The Gurg episode hiring processes is top six. Top six. &gt;&gt; Okay. Of all time. &gt;&gt; Yeah, &gt;&gt; that does make sense. So, that one that stat you can definitely view as gamed because we are &gt;&gt; we are asking people that&#x27;s that is uh that&#x27;s wild. Um what are some of the other are there any this year that are in the the top episodes of all time? Okay, so the stats are a little &gt;&gt; funky. So the reason the stats are funky</p>\n<p>&gt;&gt; on transistor in particular is and the reason why the while United States is our the most common uh country that has downloaded it the most common state Arizona baby [laughter] Arizona where in somebody&#x27;s basement they were like downloading the most recent 10 episodes over and over again for a year and a half and then it stopped. So, thanks for not downloading them anymore, but uh it means that our 2025 stats are not like we we have fewer downloads because that</p>\n<p>computer in Arizona has been turned off. &gt;&gt; Yeah. Okay. So, then the when you&#x27;re look what are you looking at for are you looking at all time &gt;&gt; or are you looking at for the Okay. Not for the first Yeah. Interesting. &gt;&gt; Yeah. So, um, yeah, if I look all time, actually, our predictions episode this year was our most popular episode this year, &gt;&gt; and then after that was the one with Robert Holistic Engineering. &gt;&gt; Yeah, that&#x27;s great. Yeah. Nice. Um, well, good stuff. I the um and I guess all time I think that&#x27;s funny that our second alltime lease now I&#x27;m looking at</p>\n<p>it is Crucible. &gt;&gt; Yeah. &gt;&gt; That you promised that Allan Allen you can come join us because don&#x27;t worry, no one will listen to it. It&#x27;s like actually everyone will listen to it as it turns out. &gt;&gt; That&#x27;s right. &gt;&gt; Uh and good to see the RFD episode right up. I that was that&#x27;s that was a great conversation. &gt;&gt; Yes. &gt;&gt; Um so I&#x27;m really glad to see that one up there. Um yeah, some some some good stuff. &gt;&gt; Um &gt;&gt; the All right. So um the uh we that was a great episode. Are there others that we before we we get off of this because there&#x27;s another thing I want to hit.</p>\n<p>Yeah, &gt;&gt; those were the episodes that I that I had called out in particular. Yeah. So, okay. So, then I But with the fan favorites, you can feel the LLM&#x27;s wobbling a little bit, like they&#x27;re beginning to move into [ __ ] I mean, this is just like, okay, this is not um and uh then I I asked it for uh I in part because I actually was genuinely curious about what it would find. I say to my prompt being the podcast infamously makes Gen X references. Were there some notable ones this year?</p>\n<p>And this is where all LLMs just went straight into the wilderness and lost their confidently with absolute confidence completely lost their mind and just started absolutely making up [ __ ] and making up references to oh like yeah the uh they make they make a bunch of office space references which I think we basically don&#x27;t make like maybe Maybe a little bit. Not I mean the only I mean I feel like I I the office base reference that I make I would say the</p>\n<p>most frequently is like a Michael Bolton M dash mashup of like &gt;&gt; you know that right right he&#x27;s changed his name he&#x27;s the one who sucks. Yeah &gt;&gt; that&#x27;s right. That&#x27;s right. And so I like that I feel but I don&#x27;t think I made that here but I don&#x27;t know then then again &gt;&gt; um so like no uh that then it says like they make references like we definitely &gt;&gt; 100% don&#x27;t bunny don&#x27;t know like that could go either way &gt;&gt; that goes one way one way only goes straight there will be no references on</p>\n<p>this podcast and if that quip makes it into the recording I&#x27;ll be amazed because that&#x27;s how canled is as far as we&#x27;re concerned like that is that is a 0enter we not making references. Uh, and then it&#x27;s it just went it&#x27;s like oh they make Nirvana references and Grunge era references and they they started like these are the ones that they made a Nirvana reference in. It&#x27;s like uh I mean it was just I mean absolutely unhinged. At one point, uh, Chat TBT says when summarizing all of this up,</p>\n<p>uh, says, &quot;This isn&#x27;t nostalgia. It&#x27;s epistemology.&quot; [laughter] &gt;&gt; I mean, that&#x27;s got to be the most LLM thing ever generated. &gt;&gt; Oh my god, that&#x27;s crazy. [laughter] I mean, I I I just don&#x27;t know the cognitive dissonance that you would have to make. I I mean, hopefully that doesn&#x27;t sound like me. I mean, my god. And then it&#x27;s like [laughter] they&#x27;re uh they&#x27;re making like &gt;&gt; um they think we make a bunch of talking</p>\n<p>heads references. &gt;&gt; I don&#x27;t know that I would confidently even know how to do that. &gt;&gt; I don&#x27;t know. Oh, I would I if you ordered me if you if you if you put a bayonet in my ribs and ordered me to make a D talking head reference talking head reference. I don&#x27;t even know like how I would start on that. I mean, I like I &gt;&gt; I did see David Burn live talking to uh Dave &gt;&gt; stabbed in the Revs. Nope. Not good enough. I mean, it&#x27;s just like Sorry, we&#x27;re not asking for facts about Talking Heads. I want you to make a Talking Heads reference. It&#x27;s like, &gt;&gt; okay, I will I will say that he he he</p>\n<p>did get on stage and do they had a karaoke machine from Japan that had uh talking heads [laughter] with like the lyrics messed up and he was just going along with it. So that was fairly delightful. &gt;&gt; Okay, that counts. You know, [laughter] we want that. My ribs are going to get it though. I I think that that is uh so um and then they and then they actually this is kind of I mean this is where you you do wonder about the power of these things to kind of induce a sense of dementia</p>\n<p>where they&#x27;re like oh then they make war games references I&#x27;m like okay maybe we might like go on expand &gt;&gt; did we talk about Dave Hits this season &gt;&gt; okay that&#x27;s good &gt;&gt; I think it was last season wasn&#x27;t that I think that was &gt;&gt; um &gt;&gt; good yeah someone says last season they said uh Dave headset had had come up in in uh as another source of cease and desists. &gt;&gt; Um &gt;&gt; yes, that&#x27;s right. That&#x27;s right. Um and then uh and then it calls out the meta Gen X humor of weaponized weariness.</p>\n<p>&gt;&gt; Perhaps the most on brand Gen X reference of 2025 wasn&#x27;t a specific artifact, but a tone dry fatalism. Humor without [snorts] hopeing. Laughing at complexity, not away from it. It&#x27;s like what? Where are we? We&#x27;re just We&#x27;re just making [ __ ] up at this point. &gt;&gt; That one That one feels more personal to me. I mean, I&#x27;m exhausted, but yes, &gt;&gt; but it can&#x27;t know that. No, it [laughter] can&#x27;t know that. We Sorry. &gt;&gt; Yes. Yes. But we not That&#x27;s not what we&#x27;re doing here. We&#x27;re not I don&#x27;t We got dry fatalism here. Like, no. I mean, &gt;&gt; that&#x27;s just a lucky guess. That [laughter] That&#x27;s not</p>\n<p>&gt;&gt; a lucky guess. &gt;&gt; That&#x27;s got nothing to [clears throat] do with the actual podcast. &gt;&gt; Yeah. Um, and then I I asked it for like, no, okay, I want the Gen X reference in the content itself. So, do you know what I actually Well, I mean, this is I was just kind of curious to see if they would pull it, but one of my I got to say favorite moments was when we had Oliver had join us on the stage. &gt;&gt; Mhm. &gt;&gt; In the books in the box episode. &gt;&gt; Books in the box episode. and start he like is come either we&#x27;re making a Night</p>\n<p>Rider reference and he&#x27;s rolling with it or maybe he even he made a Night Rider reference whatever it was he was rolling with Night Rider &gt;&gt; and I&#x27;m like doesn&#x27;t add up it doesn&#x27;t add up like that does not make sense because I know for sure that thing did not leap the generational chasm to the contrary kit is lying at the bottom of a ravine the like it absolutely did not and so I pushed on like how do you know about night records? I know that Oliver is like not of not an excerpt, not of the vintage and I&#x27;m like there&#x27;s got to</p>\n<p>be something and then he revealed that like actually it was they were they represented in the Spongebob movie. I just felt like that was a moment of just like maximum triumph for me. That was my that was my biggest triumph of the year. &gt;&gt; Okay, good good to hang your hat on that one. &gt;&gt; I just felt like I kne I called it. I knew it. I knew that. So, I wanted to see if it would actually pull that out, which is just like a ridiculous hope because like obviously the it&#x27;s like it&#x27;s good, but it&#x27;s not an actual like magician. Um, and so it I asked it for like explicit like what about Gen X</p>\n<p>references in the content itself? And it just again it it&#x27;s just off into the absolute weeds and more just like and like so it&#x27;s like saying oh like the the episode in which it referenced was system software in the large and shoot out of the CNCF corral and then it&#x27;s got like quotes from that that are references that we didn&#x27;t make. Huh. It&#x27;s like wow that is uh okay. Yeah, that is so Gemini, you&#x27;re chatbt just just lit itself on fire. So,</p>\n<p>you&#x27;re up, pal. Uh, are you going to do any &gt;&gt; I&#x27;m amazed you didn&#x27;t just make a Top Gun reference. I felt like I felt like I saw that one coming. &gt;&gt; That I didn&#x27;t make a Top Gun reference right now. &gt;&gt; Right now. Right this moment. &gt;&gt; Right now. That, you know, I that I should have that Cougar was number one. Lost his edge, turned in his wings, and now you&#x27;re number one. &gt;&gt; You know, I should That is &gt;&gt; that Gemini. I I can&#x27;t believe I gotta do this, Gemini. I gotta send you [laughter] to Myiramar. &gt;&gt; LLM, thank you. Good luck, LM. &gt;&gt; That&#x27;s right. All right, that was good.</p>\n<p>Thank you. Thank you for the prompt on that one. I am kind of losing my edge maybe a little bit. Yeah, that [laughter] does feel like a bit of a layup for myself. As long as we&#x27;re on Gen X references, you think that like you all those synapses would be hot, but I guess not. Uh, okay. No, that&#x27;s a great reference. Um, the um so I asked Gemini the same thing. Um, and I this got a little bit like weirder and a little more like both more accurate and less accurate. So, first of all, it&#x27;s like, well, first of all, you got to talk about the Fox reality TV throwback in When Async Attacks, a clear reference to When Animals Attack, which I guess it</p>\n<p>kind of is. &gt;&gt; Mhm. &gt;&gt; Um, but it&#x27;s like not an explicit homage. [snorts] &gt;&gt; No. &gt;&gt; Yeah. I mean, I Yeah, not an explicit homage. I think like riffing on a theme. I think we would also like we would make a if we&#x27;re going to make an explicit homage, it would be to Man versus Beast. Did you ever watch any of those? &gt;&gt; This is like like Kobayash or like Joey Chestnut versus a bear. Yeah. &gt;&gt; Yes. Did you watch those? They are so good. [laughter] &gt;&gt; Like this is like a Olympic sprinter like Usain Bolt versus a horse or</p>\n<p>something. &gt;&gt; A zebra. A zebra. &gt;&gt; Yeah. I just felt like that was extremely educational about that about I mean I think that and I mean you know I&#x27;d also like to say for my own children you know what has cast a long shadow is Wildrats. &gt;&gt; Do you guys watch Wildcats &gt;&gt; on PBS? &gt;&gt; That thing is like super informative hits kids at an age when they&#x27;re impressionable and they watch a lot of it. So there&#x27;s an entire generation like drifting around with some super weird like animal knowledge about like you know a loris or whatever or you know um &gt;&gt; Octonauts too. Octonauts 2 embeds a lot</p>\n<p>of like esoteric marine knowledge &gt;&gt; that is you know and I look forward to these Gen Z broadcasters of the future like casually dropping Wildcrats references and I&#x27;m going to I&#x27;m going to roll with that is is is what I want to say. So the um so um yeah anyway man versus basic and then also the orangutang versus the sumo wrestler. It&#x27;s super educational like it just like the orangutang is like much smaller. It looks small I mean lighter and it like effortlessly defeats the sumo wrestler in a tug of war. I mean it is effortlessly. You do</p>\n<p>not want to mess with a chimpanzeee. I mean or rang tongue rather. Anyway, deep thoughts um man versus beast worth checking out. Um it it turns out like we are slower and than we are slower than absolutely everything but also smarter than absolutely everything. And as it turns out like that&#x27;s a that&#x27;s a big difference. Um did you know that that humans are the only animal that use wind direction to hunt? &gt;&gt; I did not know that. &gt;&gt; Is that amazing? &gt;&gt; It is amazing. &gt;&gt; Now you&#x27;ve learned um you&#x27;re like where are where are we right now? Are we on are you just like stop generating? Are we on like a just like are you on a</p>\n<p>chat? [laughter] You&#x27;re still reading the transcript. You&#x27;re still reading the transc [laughter] Oh my god, that&#x27;s actually you. Okay. Jesus. Like I&#x27; I&#x27;ve told it to be as tur as possible. You&#x27;re like, just just go. &gt;&gt; Just go. &gt;&gt; Like just go rip. &gt;&gt; Just whatever&#x27;s on your mind. &gt;&gt; Whatever. Just let it rip. &gt;&gt; Just let it rip. Absolutely. So, uh All right. So then it so that is like kind of barely holding on and then it just gets like super weird. Um the Fincher nod. I&#x27;m not even sure if that&#x27;s a</p>\n<p>reference. Oh, he thinks they&#x27;re making a a reference to seven with Brad Pitt. &gt;&gt; Oh, I don&#x27;t think I&#x27;d make a a seven reference like in public. I I I definitely I just think that would be a very weird reference to make and and I&#x27;m like so okay let&#x27;s actually go into like what about the content itself and again it just uh actually it kind of like with more specificity um but absolutely wrong goes through all the the references we made to Logan&#x27;s Run again with quotes to Space Balls again with quotes to the Princess Bride</p>\n<p>again with quotes to Glengary Glenn Ross to Clarks to Spinal Tap and all just like making up quotes. &gt;&gt; Um, and like wow. Okay. So, &gt;&gt; yeah, I feel like we&#x27;re insufficiently like cultured and literary and we should drop more references to to these important works. &gt;&gt; No, I actually don&#x27;t feel we should. No, I feel that the the I feel that we drop I no cuz I think that like we do drop references that travel less than these. &gt;&gt; That&#x27;s definitely true. which is like I mean arguably undermines the point</p>\n<p>because it&#x27;s like well okay then [laughter] people they just think it&#x27;s like they should be ringing their onset dementia time. They actually don&#x27;t think that this is don&#x27;t realize you&#x27;re making a reference to something. I do like it when you and I make a reference to only our shared history that no one can possibly know. Um which we do try to explain but we don&#x27;t always do that. &gt;&gt; Probably fail. Yeah. &gt;&gt; Um I mean I feel like we would make a casual reference to Adam Lemonthal hardware engineer and not just like I think a lot. I think uh &gt;&gt; you do that a lot doing a lot. Well, I think in my life I I I mean in my life at Oxide I do hear about Adam Lethal hardware engineer which is even more</p>\n<p>awkward since we work with a lot of hardware engineers who definitely don&#x27;t necessarily get the joke. Yeah. &gt;&gt; We joke is doing a lot of work on that one. I&#x27;m not sure. But yeah, &gt;&gt; also a fair amount of discussion about Adam Lethal uh uh tax expert or &gt;&gt; tax adviser or &gt;&gt; absolutely. Yeah, absolutely. No, I I mean Adam Levthal mob accountant. I mean I feel like there&#x27;s &gt;&gt; Yeah, I wear many hats here. Yeah. &gt;&gt; Many hats. Absolutely. &gt;&gt; Talented. Many hats. Yes. [laughter] &gt;&gt; Many hats. Yes. I mean that&#x27;s kind of</p>\n<p>what you&#x27;re getting here at Lumpo Esquire. you&#x27;re getting a um yeah uh so at that point I&#x27;m like okay these guys are just kind of off the um so I think they kind of lost they but it was interesting like the cultural resonance does not actually um they have a harder time on the cultural rese &gt;&gt; um all right were some other um oh I also loved our uh the the Richard Scary conversation bananas gorilla finally making a cameo Yeah, Matthew. Yeah.</p>\n<p>Yeah. Talking about uh you know all all the folks in Busy Town making oxide work. Um yeah, that that was one of my favorite images as well. Even though I mean especially because it took no work, but &gt;&gt; but the best kind. But I mean &gt;&gt; the abstract Yeah. &gt;&gt; Well, he also just like busy town is like if if busy town resonates with you like you know you&#x27;re you&#x27;re our people. I just think that there&#x27;s something great about Busy Town. &gt;&gt; Yes. &gt;&gt; Everyone&#x27;s uh everyone. So I thought I thought that was uh that was really great. Oh, then the other the other thing that the uh that Gemini identified is like and then they did an April</p>\n<p>Fool&#x27;s joke with raiding the Mining Bar. I&#x27;m like, what? &gt;&gt; No. Okay, that episode was in March first of all. Second, &gt;&gt; right? &gt;&gt; I think it was actually it was in March. You&#x27;re right. It was recorded in March. It was released on April 1st, so it &gt;&gt; was Oh, okay. It just took me a while to edit. All right. Well, jokes. &gt;&gt; Exactly. Um, but it&#x27;s also like not it&#x27;s like it&#x27;s a great episode, but it&#x27;s not there&#x27;s nothing deadly serious that episode. So, there&#x27;s no no April Fool&#x27;s Day about that one. There&#x27;s no laughing matter. No. &gt;&gt; Um, and then I also It should be um Oh,</p>\n<p>we also had our first what do you call a podcast that is about an entity that is unnamed? Do you know what I mean? Like it&#x27;s a subweet but it&#x27;s a podcast. &gt;&gt; That&#x27;s funny. You know as as I was categorizing the episodes I was I was also reflecting on this sub tweet of an episode uh that was very important to you. &gt;&gt; It is very important. So this is transparency in hardware software interfaces. &gt;&gt; Yes. Yes. &gt;&gt; Which is on the one hand about every hardware vendor and on the other and the other in another more specific way about</p>\n<p>exactly one. &gt;&gt; Yes. And and you know, dear, you know, dear listeners, if you if you think, you know, if you think it&#x27;s you, you&#x27;re probably right. Um, so, &gt;&gt; and had you written an RFD on that subject as well? Am I remembering this correctly? Okay. &gt;&gt; Yeah, I&#x27;d written an RFD. &gt;&gt; So, so you had the the long form subweet the subweet. Yeah, exactly. &gt;&gt; And I&#x27;m not sure what we call that. I mean, is there another name? There&#x27;s got to be another name for like a a kind of a cultural subweet. &gt;&gt; That&#x27;s right. Like like Twitter cannot</p>\n<p>have invented the sub tweet. &gt;&gt; Surely &gt;&gt; that&#x27;s a good question. &gt;&gt; You feel like Alexander Hamilton like subweeted [ __ ] everybody. &gt;&gt; Yes, I do. That our our first blogger too. I feel that guy that he invented so much Alexander Hamilton. You know, I remember reading I think I was with you when I was reading Chernos Hamilton before the musical. Uh could you actually do you remember why I was doing this? Uh, did it have to do with like eliminating the $10 bill? I mean, the the like removing Hamilton from the $10 bill.</p>\n<p>&gt;&gt; That&#x27;s an excellent guess. No, that happened afterwards. Uh, it was because I we were contemplating naming Alexander Alexander and I just wanted to do like a quick So, I read a bio of Alexander [laughter] Hamilton. &gt;&gt; Let me do a quick 700page read to make sure there&#x27;s nothing nefarious. [laughter] &gt;&gt; Just like I mean, you&#x27;re not going to name the kid Adolf. You want to just like make sure let me just like I I want to go in eyes open. You know what I&#x27;m saying? Like it feels like you know I&#x27;m saying this [laughter] out loud pretty peculiar. &gt;&gt; Like imagine you slamming the book shut</p>\n<p>and saying Bridget. We&#x27;re going with the Adolf. &gt;&gt; We&#x27;re going with Adolf. Let me tell you, I read about the Whiskey Rebellion and I don&#x27;t know. This Adolf character just can&#x27;t be as bad as this guy. uh this this uh affair that he had. I just can&#x27;t I just think we&#x27;re back to our our place. [laughter] &gt;&gt; I just think we we can&#x27;t God. I know the Well, so okay, the affair is not great, but I I also do love the I mean, you know, what he cuz what he said about Aaron Burr is still kind of like not known, but people kind of like historians basically think</p>\n<p>like he had it coming. Like what he said was really like he knew what he said and it was really bad. I think that they they they uh believe that, you know, uh Aaron Burr lived with his daughter Theodosia. &gt;&gt; Yes. &gt;&gt; And Al Alexander Hamilton was, I think, pretty explicit about his idea that that that they may have been uh that there may have been something untored in their relationship. &gt;&gt; Yeah. &gt;&gt; Which like, hey, got a hand to that guy, you know, real uh real taser tongue. Um but no, so that&#x27;s why I was reading Alex. No. And I came then I also read a bio on Alexander the Great. Alexander of</p>\n<p>Mastadon [laughter] &gt;&gt; of I I feel like I just said Alexander of Mastadon which is why I &gt;&gt; Right. Right. Got to be Now we got to check if that guy&#x27;s been cancelled. Yes. &gt;&gt; Right. Exactly. That that&#x27;s Alexander the upset. That&#x27;s that&#x27;s a different uh Okay, Mastadon, settle down. I know Mastadon gets super upset when we say that they&#x27;re upset. So the [laughter] &gt;&gt; you&#x27;re fine and you have a great sense of humor. You&#x27;ve got a great sense of humor. I do. Okay. On my LLM piece, mass and this was kind of only on massedon. One of the things that RF opens with</p>\n<p>LLMs have been indis have been indisputably one of the breakthroughs of the last 5 years and people are like that&#x27;s not true. Like you can come on you cannot say an LM is not a breakthrough. Mastadon people are saying &gt;&gt; not a breakthrough &gt;&gt; in in in the flavor of this um actually is it that it &gt;&gt; actually in our chat as well people are like all right you want people to say it I&#x27;ll say it right now it&#x27;s not a breakthrough okay well I&#x27;m going to say I&#x27;m going to say it is a breakthrough it is you can disagree with everything about it but it is a breakthrough &gt;&gt; was it was it that it happened not within the last 5 years or was it that</p>\n<p>it was not a breakthrough at all &gt;&gt; not a breakthrough not a breakthrough at all you just can&#x27;t I mean come on it&#x27;s a breakthrough you can disagree with everything about it, but it&#x27;s a uh it&#x27;s breakthrough. &gt;&gt; Um but the uh and Alexander the Great was also uh you know super interesting. I&#x27;m not sure you know we should really be naming children after Alexander the Great or Alexander Alexander of not Mastadon of Macedon. Um but um the uh you know he died incredibly at an incredible young age like in his early 30s of chalera. Isn&#x27;t that amazing? Anyway,</p>\n<p>&gt;&gt; it is amazing. &gt;&gt; Um I I we named the kid Alexander. So there you go. Um, you know, it all, you know, I I&#x27;m not sure exactly [laughter] not really sure what what the outcome, but um and and highly recommend Cherno. You read Cherno&#x27;s biography. Very very good. And if you Yeah. &gt;&gt; And I I remember you were going to see Hamilton and I think I told you like the the the musical and I think I told you uh be prepared for the greatest thing you&#x27;ve ever seen in your entire life and</p>\n<p>I&#x27;m in no danger of overselling. And you did not oversell. It was amazing. &gt;&gt; You did not oversell. It really was outstanding. I It was It was very good. No, I The and Cher&#x27;s biography is so good. The one of the things I remember from Cheron&#x27;s biography is reading about something like the Whiskey Rebellion um which I I absolutely agree with the way Hamilton handled the Whiskey Rebellion by the way. But um reading about something like that where he had dedicated kind of three pages to it and thinking to myself, &quot;This person Alexander Hamilton is so fascinating. I should read a biography of and my other</p>\n<p>part of my brain is like jackass you are reading a this is like a you know whatever it is a 900page biography of him like this is not but that&#x27;s how how kind of fascinating his life is so &gt;&gt; you know come for the year wrap-up stay for the free book in the box I guess um the um oh also a half century of Silicon Valley with with the ready shop that was great &gt;&gt; that was fun that that inspired me to read a book about Xerox um fumbling the future Fumbling the future. Yeah. &gt;&gt; Which I know I&#x27;ve like dumped on your desk or whatever.</p>\n<p>&gt;&gt; No. And I I need to read that because that that is um I really and I thought that I thought that aside from the fact that that had a built-in image for you. So that part easy. &gt;&gt; Perfect. Right. &gt;&gt; Um that I thought that was that was an amazing conversation. &gt;&gt; Really fun. And actually, you know, was when I when we went down to the computer history museum more recently, I was thinking about that episode because I think it put a lot of that stuff in context for me. like a lot of the uh Xerox Park work and just like the the stuff that um of that era. So, you know what I liked about that episode and I</p>\n<p>may be the only one um that but I think an important point that we made in that episode is that this was this kind of extraordinary time. We&#x27;re talking about how lucky Ry&#x27;s dad was and then also reflecting on the fact that that time like more broadly was kind of a terrible time like 197 1973 was a was bad um in a lot of ways and I just think it was a good reminder that like that you can find there&#x27;s a golden age happening right now somewhere um and probably many golden ages happening.</p>\n<p>&gt;&gt; Yeah. So, if you happen to be listening to this at a shitty time. &gt;&gt; Yeah, exactly. No, I&#x27;m serious that like that you can that you that you should not be overwhelmed with despair and and find the find the interesting bits because there are interesting bits that are out there. I thought that was &gt;&gt; that was really good. Um, all right. [snorts] &gt;&gt; I think I think it would be remiss if we didn&#x27;t talk about the uh big oxide milestones of which raising hundred million dollars this year was pretty big deal. &gt;&gt; Pretty big. The the LMS are definitely big on that one. They they feel that way. This is an extremely important</p>\n<p>episode. I I mean, I obviously enjoyed getting that out there. We got the &gt;&gt; uh the bingo card out there. Um that was that was a lot of fun. &gt;&gt; Yeah, it&#x27;s fun. I you know, I I like these ones where I get to to pluck uh comments from social media and read them at you and Steve. I think that&#x27;s a &gt;&gt; I love this. Yeah. Which is this what do you call this this Passover tradition, right? Because it&#x27;s Passover, right? That&#x27;s right. With the wise turnover, wicked child. Yes. Yes. &gt;&gt; The four children. What do you call that? Is there What&#x27;s the name for that? &gt;&gt; I think it&#x27;s just like the four children. Like the</p>\n<p>&gt;&gt; Is it really great and insightful and kind of wise tradition? I really like it. &gt;&gt; Yeah. The wise, wicked, simple, and the child who doesn&#x27;t know how to ask, &gt;&gt; right? &gt;&gt; Yeah. And um but I thought no I I and I like reading hacker news comments in those different again I think we talked about this like we should have a tag on hacker news where you can like tag it wicked simple wise doesn&#x27;t know how to ask &gt;&gt; um and I think it&#x27;d be you know the world would be better &gt;&gt; and like respond in kind too too right like cuz because sometimes you get like what seems like a rude question but it&#x27;s actually a simple question and it&#x27;s an</p>\n<p>opportunity to like respond in a simple way as opposed to a wicked question where you can respond in a more testy way. &gt;&gt; Yes, this is where we have this is like, you know, where Dave has very short responses on Hacker News and you know that it&#x27;s like wow, Dave spent a lot of time on that response. Um yeah, uh I I I email uh and I think it was the future lock RFD that made it to Hacker News and with some comments that were less than productive. I thought Dave Dave did an excellent job as always. &gt;&gt; I also we had Dave Dave was a frequent</p>\n<p>guest this year. Um and I mean know Rain was a frequent guest. Eliza we had a bunch of folks that are frequent guests but &gt;&gt; um &gt;&gt; you know um there someone on social media uh on on that episode about future lock had you know in the com in replies said you know before listening to the episode or maybe as we teased the episode talked about future lock as like really just you know sometimes you&#x27;re a bad programmer and you make bugs and you know it doesn&#x27;t mean it&#x27;s somebody else&#x27;s fault or or whatever. And then after listening to the episode, I think softened that position and uh you know had some contrition on the things they</p>\n<p>had said previously. So you know one person at a time on social media. What can you do? &gt;&gt; One person at a time. You know what else can you do? I think that&#x27;s pretty great. That&#x27;s you know we&#x27;re just doing our part here. &gt;&gt; Yeah. &gt;&gt; Uh very and then I think very very grateful for listeners. I&#x27;m sure you um I mean I I I feel I get a lot of positive feedback about the podcast. Um and it&#x27;s really terrific. really appreciate people people calling it out. Um and you know I I got spotted in the airport a couple of times this year wearing an oxide shirt. People calling out Oxide and Friends references I</p>\n<p>thought was pretty great. So um &gt;&gt; that&#x27;s awesome. In kind of more small town news, I&#x27;ve sometimes uh parents at my son&#x27;s school have said, &quot;Oh, are you do you do you are you that Adam?&quot; Uh, so that that&#x27;s been fun, too. You know, just uh in the local community, finding um like-minded tech nerds. &gt;&gt; That&#x27;s great. Yeah, that it&#x27;s been uh so that was that was really nice. I thought I thought we had uh Sounds like that was happening to you a decent amount this year, too. &gt;&gt; Yeah. Yeah. No, it&#x27;s great. Very very grateful that like folks are tuning in, recommending it to folks uh and and</p>\n<p>tolerating us for all our foibless. &gt;&gt; [snorts] &gt;&gt; I do feel that I want a like a chime that I can carry in my pocket that I can ring when in conversation I make a reference to a podcast episode. Um &gt;&gt; yeah, &gt;&gt; you do it a lot. &gt;&gt; I do it a lot. I do it a lot. And maybe h I do it a maybe maybe that like Yes, I&#x27;m glad. In fact, we&#x27;re thinking you should be a shot collar, not a chime. Um we actually been in the chat that includes everyone except for you. Uh we&#x27;ve been talk we&#x27;ve got a lot of ideas that you as well. Yeah, exactly. &gt;&gt; Exactly. [laughter]</p>\n<p>got a got a bunch of good ideas on that one. Um but uh well, good stuff. It&#x27;s been a great year. I&#x27;ve really enjoyed it. Again, thanks for all the listeners. All of our guests have been terrific. Um really enjoyed folks being willing to join us. Um and uh looking forward to another great year, honestly. &gt;&gt; Yeah. &gt;&gt; Um and this be it for the year for us. So this is um this idea to 2025. We&#x27;re out for the next two weeks. Um and then uh we will be back with a predictions episode.</p>\n<p>&gt;&gt; Yeah. &gt;&gt; So, which all of the LLMs did rightly call out as a as a as an annual favorite. So, uh this is going to be &gt;&gt; uh it&#x27;ll be a good one. I think this is going to be a hot year. It&#x27; be a good year to go back to uh we can go do some checkups on some three-year predictions. Um we got some six-year predictions that don&#x27;t have very long to run at this point. Uh it should be fun. Yeah. &gt;&gt; So, uh be thinking about those. Uh hope everyone has a great holiday. Um and thank you again very much for all of</p>\n<p>your support of the podcast and uh ofide. We really deeply appreciate it. All right. And thank you, Adam. I would be remiss not to thank you. Thank you. &gt;&gt; Oh, thank you, Brian. Thanks for thanks for doing this. This is always fun. &gt;&gt; It was great. This is I really enjoy I do really really enjoy it. So, thank you very much for Yeah. for everything you do. Um, and a pledge to get better audio and Morris Chang. I&#x27;m gonna start to play. You know, I&#x27;m I&#x27;m gonna get to Morris. I like what you&#x27;re doing um with uh with Evan. I&#x27;m going to try to get to Morris Chang. I bet a guy plays pickle</p>\n<p>ball. I&#x27;m going to go play some pickle ball. And &gt;&gt; if he plays pickle ball, I&#x27;ll do that one, too. &gt;&gt; Oh, you&#x27;re going to pick him. &gt;&gt; I need to go to Taiwan to play pickle ball, but that I I will do that. &gt;&gt; Okay, there you go. Take one for the team. Uh, that&#x27;s what it is.</p>", "cleanup_applied": false, "cleanup_reason": "legacy_or_disabled", "chapters_count": 0}