{"video_id": "L2OPYYthw4c", "title": "Satya Nadella describes how lessons from Microsoft’s history apply to today’s boom", "link": "https://www.youtube.com/watch?v=L2OPYYthw4c", "published": "2025-11-18T09:50:00+00:00", "summary": "Satya Nadella, CEO of Microsoft, sits down with John to discuss the diffusion of AI inside the enterprise. He explains why “all your data at your fingertips” is the evergreen pitch, why this AI CapEx cycle is different from the .com bubble, and his vision for \"agentic commerce\". They also cover Microsoft's product bundling strategy and how he \"wanders the virtual corridors\" of Teams to run the company.\n\nShow notes\n• [Read] Softwar: An Intimate Portrait of Larry Ellison and Oracle, Matthew Symonds | https://www.amazon.com/Softwar-Intimate-Portrait-Ellison-Oracle/dp/0743225058/ \n• [Try] Superwhisper | https://superwhisper.com/ \n• [Read] The Internet Tidal Wave, Bill Gates | http://news.bbc.co.uk/1/shared/bsp/hi/pdfs/18_06_08_internet%20tidal%20wave.pdf \n\nFull transcript on Substack: https://cheekypint.substack.com/p/satya-nadella-describes-how-lessons\n\nSubscribe to Cheeky Pint\nSpotify: https://open.spotify.com/show/2IHbGJJMpiFoz5YrvRfTFw\nApple Podcasts: https://podcasts.apple.com/us/podcast/cheeky-pint/id1821055332\nSubstack: https://cheekypint.substack.com/\n\nKey moments\n00:00 AI adoption in the enterprise\n08:58 How Satya runs Microsoft\n14:51 New UIs\n21:49 Microsoft tackling the early internet\n27:03 Are we in a bubble?\n32:40 Data sovereignty\n39:10 Excel\n43:26 Agentic commerce\n54:10 AI brand loyalty\n01:01:09 Product bundling\n01:09:42 Microsoft’s culture\n01:13:36 The law of very large companies\n01:17:33 What’s in the water in Hyderabad?", "transcript_html": "<h2>AI adoption in the enterprise</h2>\n<p>Bill was always obsessed. I remember him distinctly saying this in the &#x27;90s, he said, &quot;There&#x27;s only one category in software. It&#x27;s called information management. You got to schematize people, places and things, and that&#x27;s it.&quot; The problem is people are messy. Do people have loyalty to a model or do they have loyalty to an AI brand? You want an ensemble of models. You have agents intermediating that ensemble so that it meets your needs. Will everyone&#x27;s preference not just be for more intelligence? Like, I&#x27;ll go into the picker and manually select o3 for like, &quot;Where should I go get ice cream,&quot; query? It&#x27;s like a rite of passage for certain software companies</p>\n<p>to try to take on Excel. Why is it so durable? We sort of don&#x27;t give it enough credit. It&#x27;s like, &quot;I can make it do anything.&quot; I think the world&#x27;s most approachable programming environment. 100%. And Pieter here is who? Pieter is Pieter Levels. He&#x27;s like an indie— Oh, yes, I know him. Yeah, you know Pieter Levels. I know him, yeah. Course yes. You&#x27;re so online. See, Satya knows who Pieter Levels is. This is why Microsoft is like an $14 trillion company. Was there anything good to see at the data center? Or is like— There&#x27;s always— &quot;That&#x27;s a lot of racks.&quot; It&#x27;s the most fun place to go, man. Yeah.</p>\n<p>Satya Nadella took over as Microsoft CEO in 2014, but he&#x27;s been with the company for more than 30 years and has seen a lot. Microsoft has grown by 10X in the time that Satya has been running it. And he&#x27;s credited with Microsoft&#x27;s success first in cloud and now in the AI boom. Cheers, John. This is great. So what should people be excited about at Ignite? The Ignite Conference for us, more than anything else, is about making sure that AI is getting diffused inside of the enterprise, right? I mean, if there is one thing,</p>\n<p>it&#x27;s more about, hey, what does it mean not to just admire somebody else&#x27;s AI factory or AI agent, but how to build your own AI factory. So organizing the data layer turns out to be probably the most complicated thing, which spans the enterprise such that it can meet the intelligence. And so that&#x27;s the stuff that I think we&#x27;ll probably do a lot of. We still don&#x27;t really have Deep Research in a corporate context. We do, that&#x27;s what Copilot is about. But most people day-to-day do not have this. So are they just underusing AI that exists?</p>\n<p>Yes, and in fact, it&#x27;s interesting you brought that up because to me that is the killer feature, right? So the biggest thing we did was we took this graph that is underneath what is what I think is the most important database in any company, right, which is underneath your email, your documents, your Teams calls, what have you. It&#x27;s the relationships that... By the way, people are not working in an ad hoc fashion in an unstructured way, but you know, they&#x27;re all doing it in relation of some business event. Yes.</p>\n<p>That semantic connection is in people&#x27;s heads and it&#x27;s lost. And for the first time, there&#x27;s much better recall of that. Why do you think this is underpenetrated than the enterprise? Because I feel like people are using lots of, you know, LLM tools. They are uploading individual documents maybe, but I don&#x27;t think most companies have the all singing, all dancing, all of the company&#x27;s context is plugged into their everyday AI. Yeah, in fact, I would say there are two sets of things. One, it&#x27;s starting, right? I mean, you know, what I always say, at least compared to anything we have done</p>\n<p>in terms of all the office suites over our history, this is the fastest in that sense, because it&#x27;s change management, right? At the end of the day, you&#x27;ve got to get it in, people have to use it. Oh, by the way, in the enterprise setting, it has got to mean all the discovery has to work. All of the data governance has to work. We have had to plumb this purview into Copilot such that anytime I&#x27;m trying to retrieve something that&#x27;s confidential, it&#x27;s labeled confidential, it&#x27;s IRM&#x27;d and so on. So there&#x27;s been significant amount of work, and that I think is where we&#x27;re starting to see the uplift.</p>\n<p>The other thing I&#x27;d say is, you know, it&#x27;s one thing to have it work across the Microsoft 365 graph, right? But then the next thing is, oh, what about your ERP system? The connectors kind of work, but they don&#x27;t really because they&#x27;re two thin straws, right? You just need a much better data architecture where you have to essentially semantically embed all of these into one layer. Okay. There&#x27;s been a vision for decades of your company&#x27;s data at your fingertips. My favorite example of this</p>\n<p>is I read like the book &quot;Softwar&quot; on, you know, the history of Oracle, and it talks about Larry Ellison doing EBCs, I think they&#x27;re talking about one in Japan, in the 1990s. So it&#x27;s the late 1990s. And he is pitching executives on all your company&#x27;s data in one place. Part of the reason this is an evergreen pitch is because companies don&#x27;t actually have all their data at their fingertips. Companies do not eat their data infrastructure vegetables. And, you know, the pitch to executives is always, &quot;You can go answer your questions yourself at the touch of a button,&quot; as opposed to sending a request to an analyst who goes and does an investigation for you.</p>\n<p>Will we finally this time eat our data plumbing? You can push back on the premise, but that&#x27;s my question. No, I think that, in fact, I think, if I&#x27;m not mistaken, Bill coined this term, information at your fingertips, at a COMDEX speech, I think in the &#x27;90s. I think that&#x27;s right, yeah. And that is kind of where it, you know, and for the longest time, Bill was always obsessed about, like, he felt, in fact, I remember him distinctly saying this in the &#x27;90s, which I picked up in one of the reviews I was in as a junior guy sitting around, and he said, &quot;There&#x27;s only one category in software. It&#x27;s called information management. You got to schematize people, places and things,</p>\n<p>and that&#x27;s it. You don&#x27;t have to do anything anymore because all software...&quot; And that was the dream Bill always had, which is he wanted, like for example, he hated file systems because they were unstructured. He would&#x27;ve loved it if everything was a SQL database and he could just do SQL queries and program against all information. Like, that to him was like a elegant solution to information at your fingertips. The problem is people are messy, and even if data is structured, it sort of is not truly available in one index, right, or one SQL query that I can run against all of that. So that has been the fundamental challenge</p>\n<p>of the old world, I would say. I would&#x27;ve not thought, none of us thought that somehow this AI thing and a deep neural network at some scaling will suddenly become the thing that figures out the patterns, right? Not some schematized data model, right? In fact, for the longest time we used to always obsess about, oh, how complex do the relationships have to be, or the data model needs to be to capture the essence of an enterprise, right? And it turns out it&#x27;s lots of parameters in a neural network with a lot of compute power.</p>\n<p>Dwarkesh talks about this really smart remote employee who started five minutes ago, getting at the point that the models can be arbitrarily smart and they can do RAG and they can have access to everything in your enterprise, but it&#x27;s not quite the same as the model actually knowing something as a model. And so the models, unless you train custom models inside your company, cannot actually get smarter at what it is that you do and, you know, the thousandth query is not any smarter than the first. Where do you think that goes? I think there&#x27;re two things there, I mean, I think if I understand his thing, it&#x27;s all about in context learning</p>\n<p>or continual learning, right? I mean, that&#x27;s sort of the ultimate thing. And it sort of speaks to the thing I was saying, which is if you kind of have the models cognitive core separated from its knowledge, then you have essentially the continual learning, you know, formula, so to speak, or the algorithm, and then you just unleash it. At least there are three things to me that are outside of the model at runtime that I think you kind of have to crack, right? One is memory, and all forms of memory, right? Short, long, right? Even like these big challenges of, you know,</p>\n<p>humans are great at long-term credit assignment, right? Which is how does intuitively, like somebody said to me, &quot;Hey, the day, you know, AI models can both reward and remember that you, you know, how to punish for some mistake because they have the ability to do long-term credit assignment, that&#x27;s when you&#x27;ll know that you have real memory.&quot; But in any case, memory is one. The second one is entitlements, right? So, which is they have to really respect all of the permissioning system at runtime, right? Because this is where we put their roles,</p>\n<p>what access do I have, and so the model needs to meet that. And then the action space all has to work. So if you bring those three things, because after all, that&#x27;s the environment. So if I have actions, entitlements, and memory with these models, and they by definition have to be outside of the model, but be built into the model. And so for example, in Copilot today, you use OpenAI models, you use even Claude, right? I need the system to work across both of those. And that I think is where the frontier has to move to. Yes, yes.</p>\n<p>I have many more AI questions, but I want to ask you some questions about your way of working.</p>\n<h2>How Satya runs Microsoft</h2>\n<p>So, what does your day-to-day look like? And in particular, how are you managing by walking around? What virtual corridors are you wandering, to just get a sense for what&#x27;s going on in Microsoft? What do your customer engagements actually look like? Just for a normal day, not earnings or not a board meeting or something. Interestingly enough, my normal day, it&#x27;s the two ends of it, right? Which is the customer stuff, so there&#x27;s not a day that I would say I&#x27;m not having... Many of them are remote. I mean, there&#x27;s Teams calls for me most of the day,</p>\n<p>at least two or three of them with some customer. It&#x27;s sort of the most helpful way for me to stay most grounded, I would say. So I have at least one or two of those each day. And then I would say there is a lot of meeting time. You know, as a CEO, one of the things I&#x27;ve recognized is there are two types of meetings, right? One meeting is where I&#x27;m just supposed to convene and, you know, keep my mouth shut because convening was the real thing, right? It is like, don&#x27;t over perform and just sit,</p>\n<p>because all the work would&#x27;ve either happened or will happen after. So that&#x27;s kind of one. And then the other meeting, which are the important meetings where I do need to learn or I need to make a decision or communicate something. So meetings is another spot. Then I must say, it&#x27;s kind of like all over for me, Teams channels, right? I am lingering around Teams channels and they&#x27;re most helpful. In fact, if anything, I learn the most there, I meet most people that... So wandering the halls, I wish I could tell you that, you know,</p>\n<p>that is the form. No, but I think Teams is the new wandering the halls, right, you know, lurking around those channels. 100%, and then I meet... So the most beautiful thing is for me to be able to... That&#x27;s where I make the most connections, right? I get to know, wow, here&#x27;s the person working on Excel agent, or that&#x27;s the eval that they&#x27;re looking... I mean, I learn so much out of it than anything else I&#x27;ve done. So are Teams at Microsoft just working away on their product and then Satya pops up and, you know, has a question on their product? Some of it, like, I wish— They give a little yelp. I wish— Yeah, well, I wish, you know, sometimes I feel like we are way too permissioned too.</p>\n<p>You know, I wish I had more access sometimes. In fact, my biggest complaint is that I can&#x27;t drop in everywhere I want to. But, yes, it&#x27;s fun to be able to just go in there and it sort of normalizes it. And then people are also, like today&#x27;s workforce is not shy of sharing their opinion with you. I&#x27;ve noticed, yeah. You are famous, at least in small corners of the valley, speaking of being methodical, for staying very connected to what&#x27;s going on in tech here. And I remember you came and visited the Stripe office.</p>\n<p>Remember that one in the Mission, yeah, when we were a pip-squeak company. I mean, it was probably right after you took over as CEO, I&#x27;m guessing. But Stripe was very small and Microsoft was very big. Actually before, I think the first time I came to your offices was when I was running Azure first. Okay. Yeah, yeah, yeah. Okay, so it was even before that. So that would&#x27;ve been very early in Stripe&#x27;s journey. Why do you think you do this much more than most other CEOs? Because other CEOs should want to meet all the startups too. I&#x27;ve always grown up, in some sense, I grew up, even in a Microsoft, which had... I have that developer relations evangelism</p>\n<p>sort of gene in me, I kind of approach, I think a lot of it as, hey, if you don&#x27;t follow developers... There are two sort of things that are ingrained in me. One is if you don&#x27;t follow where developers are going, it&#x27;s hard to sort of be relevant in terms of tech platforms. And then you really need to understand the new workload in order to build a tech platform. Those are the two things that at least I&#x27;ve kept. And so therefore, the only way, if you&#x27;re not following startups, it&#x27;s very hard to know what is either the platform or the workload. So that&#x27;s sort of a thing that I&#x27;ve indexed towards. The other thing is it&#x27;s just, you know,</p>\n<p>I derive so much energy out of it, right? I mean, I&#x27;ve always thought founders are just magical people who create something from nothing. I mean, it&#x27;s just sort of feels like a magic trick. So I always like, &quot;How the heck does one do that?&quot; Yeah, no, it is funny you say that about following what the startups are doing. We always conceived of what Stripe was building as it was important to build for startups both because today&#x27;s small startups are tomorrow&#x27;s public companies. And we&#x27;ve seen that again and again on Stripe. But we just felt at an intuitive level and we felt this before we could prove it, that what the startups were interested in</p>\n<p>were often better product experiences. And so if the startups want stablecoins or usage based billing or what have you, we should build for those needs. Not just &#x27;cause we&#x27;ll have a good startup business, but the enterprises will come around. And it took us, I would say, many years to kind of prove out that model. But now we&#x27;re really seeing— Yeah, in fact, I think you guys are a bit of a gold standard on that. In fact, one of the things that I learned from you guys was rediscovering at some level what Microsoft was very good at, which is following the developer,</p>\n<p>being where the startups are. And so that&#x27;s what sort of led me even to GitHub and NAT and all of the rest, which is to some degree the GitHub asset, right? Obviously it is a great asset. We needed to, one, be good stewards of an open source ecosystem. But it also the place where every startup, like the one thing that everybody does have is their repos in GitHub. And I felt like, hey, being in that loop was important for us. Not just &quot;oh it&#x27;s strategically great to have some position there,&quot; to learn simply</p>\n<p>and to build better product, I think, is sort of well said. Because you lose sometimes the aesthetic of what is required, what&#x27;s that friction-free way to deliver because the least amount of patience is there and the time to value, for example, has to be maximized.</p>\n<h2>New UIs</h2>\n<p>Is Microsoft thinking about generated UIs that are personalized to... Like, when you think about it, software is stuck in the old paradigm of, you know, we write a bunch of software and it goes to Gold Master and as you know, goes out on discs and now that same kind of software, it&#x27;s delivered in the cloud, but the UI you want is probably, you know, we can render that exact UI in real time. Is that a direction you guys are going? I think that, for sure, like at some level what&#x27;s happening is on one side our ability to generate. I mean, if you sort of say you can generate all code, so therefore you can generate some UX scaffolding</p>\n<p>around anything that&#x27;s a lot more custom, right? So especially, in fact for the longest time, one of the things at Microsoft was what&#x27;s the difference between a document, a website and an application, really? And so, to some degree, yeah, exactly. So you can generate any one of those at any time depending on what format you want to present it. But, interestingly enough for all the talk of, hey, all these apps go. Take even our good old IDEs, in some sense IDEs are back, right?</p>\n<p>Whether it&#x27;s Excel or VS Code. Because the reality is AI generates output, I need to make sense of that output. In fact, I need a fantastic editor that lets me do diffs and iterations on it with AI. So I think the IDE, I think in fact one of the most exciting things is new classes of highly refined IDEs that have even a sort of a telemetry loop with the intelligence layer, but also they kind of act more like heads up displays, right?</p>\n<p>I have thousands of agents going off. How am I going to make sense of the micro steering of thousands of agents. And that is what IDEs/inboxes and messaging tools will be, right? Which is, I&#x27;m not messaging one, you know, or dealing with triage the way I deal with it today, but it&#x27;s going to be different. Okay, interesting. So you think right now programmers spend all their time in an IDE, but they&#x27;re one of the few professions that does that. And your vision is the accountant IDE, the lawyer IDE, and— What is the metaphor</p>\n<p>of how I will work with agents, right? So it&#x27;s kind of like massive macro delegation, right? So there&#x27;s lots of agents I go give a bunch of instructions to and they go off and work sometimes for hours, days, let&#x27;s say, you know, as the models get better, but they are checking in and so it&#x27;s macro delegation, micro steering. So if you take that, how does one do micro steering with context, right? It can&#x27;t come back like my... It can&#x27;t be in the next notification hell, right? Which is, it sort of notifies me. It has like five words. I don&#x27;t know exactly what the real context is or what have you.</p>\n<p>That I think is where, and that has to be multi app like, right? So that&#x27;s where I feel like all software finally, when it grows up, it looks like an inbox and a messaging tool and a canvas with a blinking screen. Except this time around a lot of work got, you know, went and happened. Is that one app, is that 10 different apps? Like, it&#x27;s kind of interesting if you think about the productivity suite that emerged, there was, you know, three big apps in Word, Excel, and PowerPoint. But it&#x27;s interesting that that number</p>\n<p>was not 1 and was not 40, it was 3. And so how do you think about this in the— I think that that&#x27;s right. I mean, to me, it will be a few, I think. And in fact, the reductionist, you know, in me, it says, &quot;Man, they&#x27;ll be the same things.&quot; Except the job they do is going to be different because I think, you know, a table, at least at the human level, right? Because we can all talk about, like what tools will agents use to communicate with each other, right? That&#x27;s a different thing, right? Right now for the RL loop, they are simulating our production environment,</p>\n<p>but they will ultimately be more efficient in creating their own production environments to kind of RL themselves, so... But let&#x27;s just leave that aside. But in order to communicate with us, I feel like we have discovered some good things that we like. We like spreadsheets and tables and we like documents in sort of linear form. We like inboxes or messaging tools. So these are like reasonable UIs, except the question I think you asked is how does this thing have, when it shows up in an IDE with like a set of changes,</p>\n<p>you have to help me more than just say, &quot;Okay, now here is a file, go to that file.&quot; Like, that directed plan, not just to execute, but for me to do my workflow. And like, one of the things that we are experimenting with is mission control and GitHub Copilot is that. The idea is you go have five, six different branches in which you fire off all these autonomous agents. They all do their work, they come back and then your ability to do PR triage is where I think the next IDE is born. I&#x27;m struck by in technology</p>\n<p>how frequently you see the pattern of excitement for, and a vision around a technology being so much earlier than the technology actually being ready. Like the movie &quot;2001: A Space Odyssey,&quot; which is in the &#x27;60s, like that was a voice activated AI with tool use, you know, capabilities. It&#x27;s true. And, you know, it just took 50 years and then, you know, people were excited about the idea that you could speak to your computer and, you know, text to speech, speech to text. People were excited about that in the &#x27;80s. And like only now, I don&#x27;t know if you use superwhisper or anything like that, but it&#x27;s finally really good.</p>\n<p>But like it wasn&#x27;t good three years ago, you know, 40 years after the vision. Yeah, it&#x27;s crazy that you bring that up. In fact, I used to have an apartment right next to the Microsoft campus, that old campus, and I was working on Interactive Television. This was in &#x27;94. The information superhighway. That&#x27;s right. You know, and there were multiple things that were stunning. My management chain was Rick Rashid and, you know, who reported to Craig Mundie, who reported to Nathan Myhrvold and there was Bill Gates and I was saying, &quot;Man, that&#x27;s a lot of IQ . And of course we all missed the internet.</p>\n<p>That was the only thing that happened. But I had interactive television, switched ATM, I think, to my home in my apartment. So I remember doing this demo, one of the high stakes things I did as a young guy at Microsoft was a demo of our first redundant file system, which was a video server where John Malone was the one who came and Bill was sort of saying, &quot;Hey, here&#x27;s the future of interactive television.&quot; And guess what? It&#x27;s even great because the disc can go, you know, haywire and still stream.</p>\n<p>And so my job was to remove the disc drive and have the stream continue. But we built essentially a distributed file system and a streaming server and had an ATM switch network to the house. And I had like five movies I could watch.</p>\n<h2>Microsoft tackling the early internet</h2>\n<p>And I watched them all multiple times. Okay, so I want to ask you about this, &#x27;cause I&#x27;ve thought a lot about this and you&#x27;re the perfect person to ask, which is, Microsoft saw the internet future that was coming in the &#x27;90s, and in particular the famous Bill Gates Internet Tidal Wave memo said, &quot;The internet is the one big thing Microsoft needs to focus on.&quot; It wasn&#x27;t like, &quot;We&#x27;re not thinking about the internet.&quot; It wasn&#x27;t that it was priority number 7 of 15. It was like, &quot;Hey, guys, listen up. The only thing Microsoft should be thinking about is the internet.&quot; But the vision for the internet at the time</p>\n<p>was this information superhighway, which was subtly different from the internet because the thinking was, and it was very sensible thinking, no one has internet to the computer in their home. Like, a lot of people don&#x27;t have a computer in their home. So what people do have is a TV and what they have is cable, which is a high bandwidth connection. And so we&#x27;re going to do these set top boxes on the TV and that is how people will use the internet. Like, paying a huge amount of attention to this coming wave. Pretty sensible, well thought out solution, and yet not the right approach. And so obviously bring that up in the context of the giant AI. Like, what should one take away from that?</p>\n<p>It&#x27;s great one. See, if I look at even my interpretation, it&#x27;ll be actually interesting. I&#x27;ve not spent as much time talking to Bill about that era. But I felt there were at least... As someone, as a sort of an entry level employee at that time even, my reading of history was that we kind of got the internet, but we didn&#x27;t. Because we wanted to deliver, remember the quality... Like, I don&#x27;t think we believed that TCP/IP would work. I mean, at some level the information highway, when I look at what we were trying to do</p>\n<p>was, man, this quality of service is a thing. This TCP/IP just is not going to work. And so therefore we were competing against AOL, on dial up and even that sort of... You remember like MSN was an X.25 network. Yes, yes. The first version of it. Yes. And so then... But that&#x27;s when Bill like pivoted, right? So the thing that Bill did was in &#x27;95, I guess... In fact, it&#x27;s funny that, right, Windows 95 was launching, and then he says, &quot;You know what?&quot; It&#x27;s all going to change.&quot;</p>\n<p>So I feel between &#x27;92, which is when I think all of us, maybe who&#x27;d got our first demo, right, &#x27;93, November is when Mosaic... Right? Yeah, that&#x27;s right. I think something like that. And so we all, you know, were kind of dancing around it. So from &#x27;93 to &#x27;95, there was that two year period where it was unclear whether this was going to be the protocol and the stack emerged. And by &#x27;95 it was clear, and then we pivoted. Interesting. Okay, so just at that time it wasn&#x27;t actually clear that the open internet would win.</p>\n<p>Yes. And in fact, there&#x27;s one more lesson that... You know, the interesting thing that I&#x27;ve always watched, and because I think we can parlay this into AI, one is to get the paradigm right. Then, it&#x27;s not clear, even if you get the paradigm right, that you may not get what is the killer app or even the business model, like, that&#x27;s always been the case, right? Which is, you know, with the internet, who would&#x27;ve thought that, you know, for the open web, an organizing layer would be one proprietor or one network effect search engine, right? Because the organizing layer of the web,</p>\n<p>you know, I always say like, &quot;There&#x27;s no such thing as the open web, there&#x27;s the Google web.&quot; And just because they just dominated it. Should one reflect on the fact that maybe there was some motivated thinking around our proprietary solution, you know, the Liberty Media, Microsoft joint venture will win? Whereas the open web is what won and you should maybe caution organizations where if they&#x27;re following two possibilities, you know, our information superhighway proprietary system</p>\n<p>or the open web, companies will somehow have happy thinking towards the proprietary solution. It&#x27;s an interesting one, I think the way, you know, when I look back again, it&#x27;s interesting, right? So AOL and MSN kind of, you know, lost out, let&#x27;s call it, to the open web, except they were replaced by new forms of AOL and MSN. They&#x27;re called search engines. They&#x27;re called app stores. Like, the mobile web in fact is fascinating. Yeah, the open web was a moment in history. A moment in history, and then...</p>\n<p>And so the thing that, maybe the meta thing for me is organizing layers will always emerge even in an open ecosystem and a lot of the category power moves to that organizing layer. And it&#x27;s always unclear, like the last paradigm or this last time it was search engines, today it&#x27;s chat bots. How long lasting is that? No one knows, but it&#x27;s definitely, today, I mean, ChatGPT&#x27;s success cannot be denied in terms of what it means as an aggregation point. Marketplaces/app stores have been a thing.</p>\n<p>What comes next, you know? What happens to e-commerce in an agentic marketplace or an agent e-commerce? I think these are the interesting things</p>\n<h2>Are we in a bubble?</h2>\n<p>that need to be litigated. Well, I want to talk about that and I want to talk about commerce, but actually first, while we&#x27;re on the topic of, while we&#x27;re still in the &#x27;90s, everyone is making comparisons to the dot-com bubble right now, it&#x27;s almost a cliche. And I think it&#x27;s actually a reasonable comparison. You know, it&#x27;s a cliche for a reason, which is, it is a very CapEx intensive build out for a new paradigm that is in fact a big deal and yet there&#x27;s an awful lot of CapEx. You were there at Microsoft during the 2000 dot-com bubble and it really was, you know,</p>\n<p>Microsoft&#x27;s share price peaked in the late &#x27;90s, early 2000s, and then didn&#x27;t surpass it until 2016, I want to say. What did it feel like in 1999? In particular, did you know you were in a bubble? Or was it like, &quot;Oh, this time it&#x27;s different.&quot; It&#x27;s interesting. Yeah. Yeah, in fact, I remember, I think, you know, we probably became the largest market cap company in 2000, we crossed GE, I remember that. Yeah, we were capital-light, let&#x27;s say, right? That time around, it was like... I guess I was more like Sam at that time,</p>\n<p>which is somebody else&#x27;s capital was being spent. It is, quite honestly, when I look back at it, at that time too, the financial cycle aside, it was clear, the secular trend was clear that this is going to. Because even by then, the business models were also emerging. Even for Microsoft, the biggest lesson at that time was, oh, my God, like even our first order play, or, oh, we got to build a browser,</p>\n<p>we got to build a web server. We&#x27;ve got to, you know, have internet protocols everywhere. You know, we had a website builder inside of office with front page. We did all the obvious things, but we realized that just doing the obvious things didn&#x27;t make sense. We needed to reinvent what we were doing, plus what are the new business models, was clear. So in an interesting way, that cycle kind of came out of nowhere. I mean, it came out of, you know, what was just, you know, whatever rational exuberance or what have you, but the correction in some sense</p>\n<p>washed away a bunch of stuff. But I would say the ideas persisted. Totally. Right? And so, to me, I think about what&#x27;s happening here. I mean, there are two things, right? The infrastructure itself that&#x27;s getting laid out, I think it&#x27;s got a lot more immediate. Like, it&#x27;s not like even the, you know, the gestation period of okay, I built up, you know, dark fiber, and you know, some internet company will first scale to a billion users and use. This time— There are lines out the door to buy this stuff. Exactly, and so this time around, quite frankly, we are behind, right?</p>\n<p>Like when I look at our infrastructure build, right, and demand today. That&#x27;s the thing that when people say it&#x27;s all a, you know, there&#x27;s a bubble. Like, when I look at my earnings, I can have... Like, I mean, that was the last time I was so supply constrained on PowerShells. I haven&#x27;t heard that comparison before, which is, let&#x27;s not forget that the dot-com bubble, which again was a telecoms bubble, it was a fiber bubble in a big way. Like, it was dark fiber, the clue&#x27;s in the name, it was dark, it was not lit up yet. And this is anything but dark fiber. Yeah, it&#x27;s not like any one of us is sitting there</p>\n<p>and saying, &quot;Hey, I have all the GPUs wired up and nobody&#x27;s using them.&quot; I don&#x27;t have a utilization problem. I may have a PUE, like, I mean, I want higher utilization because it&#x27;s mostly because it&#x27;s memory bottleneck or what have you, but that is a different... But like there is not a thing that I have that&#x27;s not sold out. In fact, my problem is I got to bring more supply. And in that, will we perfectly get it? No one does, right? There&#x27;s no supply chain operation that perfectly matches demand and supply. But this time around the build out, you know, given the long lead, like for example,</p>\n<p>one of the things we study a lot is, even when we talk about our capital, we try to describe it even to the Street. Hey, you got to remember these assets. Some of these assets are 20 years. Some of these things are four years or five years. And in fact you kind of have to make the decisions on those things differently, right? Having a cold shell that&#x27;s unused is nothing, right? Yeah. it&#x27;s kind of like having a campus with five buildings. It&#x27;s not sort of going to be a problem on Microsoft&#x27;s balance sheet. What is a real problem would be,</p>\n<p>hey, not having warm shells that we can kind of light up. Where is the bottleneck these days? Like, is it electricians, is it shells? Is it turbines. Yeah, I mean, so... Yeah, the product that is the bottleneck is just a bunch of powered up shells. So if I don&#x27;t have enough shells that are powered, that I can then roll in my racks and then make them operational. And that&#x27;s the long lead part, right? Which is you kind of have to have the land permits, the power permits, get all that done in time.</p>\n<p>And by the way, location, right? So I think one of the things that&#x27;s glossed over, of course stateside, United States, we are building a lot, but we have to build all over the world. And there are data regulations, in fact, more every day. People care about sovereignty in a major, major way. And so therefore for us, we have to make sure that the fleet is a global fleet, a fleet that kind of can deal with all types of workloads, training to DataGen, to inference. And so it&#x27;s sort of a complex, multi-variable thing.</p>\n<h2>Data sovereignty</h2>\n<p>Who should care about data sovereignty? Where, you know, Ireland has a bunch of data centers but is not particularly wound up on the idea that, you know, data should only be in Ireland. And I don&#x27;t think it should be super wound up about that fact, but, well, I guess, do you guys just go with whatever the country wants or do you try to advise on whether you should want data sovereignty or not, and who should? Yeah, so I think it&#x27;s obviously a topic that&#x27;s top of mind for pretty much every country, every policy maker, and they care. And there&#x27;s obviously real legitimate reasons. The thing that I would say, in the AI age,</p>\n<p>I&#x27;m now thinking a little bit differently even about sovereignty. What I mean by that is the ultimate sovereignty question is more of what&#x27;s the future of a corporation, right? Like, I mean, if you sort of start by, you know, if you go to the core of the Coase theorem, you say, &quot;Wow, what the heck? You know, if the model is the thing that knows everything, why do I even... Like, I&#x27;m supposed to have some tacit knowledge that makes the transactional costs inside my organization lower than just being in the marketplace.&quot; So that&#x27;s a mind bender.</p>\n<p>So in fact, one of the ways I think is the sovereignty that matters is your company&#x27;s sovereignty in a age where there are continual learning, increasing returns to a model. So I&#x27;m increasingly thinking that hey, company&#x27;s ability to have that intelligence layer that&#x27;s a scaffold or even weights embedded in the model. Like, so it&#x27;s not somebody else&#x27;s foundation model. It&#x27;s about do you have sovereignty in your foundation model? So my new concept is the future of a company is that company has its own foundation model that captures essentially that passive knowledge</p>\n<p>that makes the transactional costs of how knowledge gets accrued and diffused inside the organization faster. So that&#x27;s sort of a long speech on sovereignty. Well, there&#x27;s two versions of... That&#x27;s very interesting, the idea that AI maybe just changes the nature of companies. And you are saying that if companies, some companies are already collections of IP, right? You know, Disney, we just had Dave Ricks from Eli Lilly here, that is an IP company in a big way. And some companies are already collections of IP.</p>\n<p>But right now that IP is in all the emails and documents and people&#x27;s heads most importantly. Whereas maybe the IP could be in a single model over time. Where I thought you were going to go with that is just maybe the, you know, people point out a lot that current companies are modeled after, you know, manufacturing companies and Alfred Sloan type stuff, despite the fact that, you know, we&#x27;re doing knowledge work today and not running a little manufacturing line. And do you get more just weird looking companies,</p>\n<p>do you get the, you know, the famous, really tiny billion dollar company? Do you get more highly distributed internet companies? Do you get some DAOs? I thought that&#x27;s where you&#x27;re going to go with that. I think that those are also possibilities. So the structure itself could change and it&#x27;s going to be more possible for, you know, whatever the few, you know, the one person billion dollar company, what have you, right? Make that happen or DAOs could happen. But the interesting question, at least for me is, where does tacit knowledge reside, right? Clearly it resides in people&#x27;s heads and it&#x27;s the classic knowhow that accrues in compounds.</p>\n<p>I think it will also reside and compound as weights in some LoRA layer that is unique to your company. So that&#x27;s kind of my... So in fact, I feel like, hey, you know, the new intellectual property at Eli Lilly or at Microsoft or at Stripe at some point can be also be besides all the humans, besides all the other artifacts we have, I think we&#x27;ll also say, &quot;Oh, they are in some embedding.&quot; Yes. Well, okay. It&#x27;s funny you say this because Stripe,</p>\n<p>Stripe is interesting &#x27;cause it does not really have strong network effects as a company. You know, when we started building up Stripe, it was very much a single player API experience and we make it easy to start using Stripe, but ultimately you&#x27;d never know that anyone else was using Stripe. What&#x27;s happened as we&#x27;ve scaled up is we now just have a trust network where we can prevent fraud by virtue of the fact that we&#x27;ve seen most internet users. And so we have a knowledge for what good and bad looks like. And even the fact that we haven&#x27;t seen you before is inherently a little bit suspicious</p>\n<p>because we&#x27;ve seen most people and so it becomes a reputation network, kind like reCAPTCHA for Google simply became kind of a reputation network. Anyway, what we&#x27;re now doing is training a payments foundation model where we&#x27;re using all the data that we have in the Stripe network and you have a much larger, more capable model taking into account... So anyway, we are trying to do exactly what you&#x27;re saying. And so one of the questions for all of us, then how do you protect that from sort of essentially leaking over to the base foundation model? Is it just like one capability hop away because it learned how to even do fraud detection?</p>\n<p>Is it just some other multidimensional or not? And that I think is the key question, right? To me, I think, there are two arguments, right? One argument is it&#x27;s that, you know, argument that, hey, the models are going to eat the world. You can kind of easily see, oh yeah, after all, everything is just a pattern and I&#x27;ll learn it all and what have you, so. But then the thing though is, you could, to your point about Stripe can take multiple models, build this unbelievable sort of, I&#x27;ll call it fraud detection layer that is, you know, model forward. And then there is this memory and tools use</p>\n<p>and action space that&#x27;s all unique to Stripe. That to me is the future of a corporation. Whether it&#x27;s a pharma company, a payments company, or a software company. That I think is the work that we all are doing and will do, and I think that that&#x27;s, to me, that is sovereignty, right? Alright. Oh, man. Alright. Woo. Wow. Okay, this could be a new high score. And 4, 74. So, new high score. There you go.</p>\n<h2>Excel</h2>\n<p>I&#x27;m still thinking about this discussion we&#x27;re having about the IDE for people who aren&#x27;t software engineers. And again, I feel like there could be a product in the next 10 years for finance people where, in hindsight, it is obviously the correct UI, but just like the spreadsheet kind of came out of nowhere as a UI, it may feel like it came out of nowhere at that time. I&#x27;m really struck by that. Speaking of the spreadsheet, it&#x27;s like a rite of passage for certain software companies to try to take on Excel and it&#x27;s seems to be doing pretty well</p>\n<p>40 years in or what have you. Why is it so durable? Yeah, it&#x27;s unbelievable, right? I mean, at some level, you know, the idea that a tabular for... I mean, I think it&#x27;s the power of lists and tables. It&#x27;s just a perfect, and the malleability of software, right? That was I think the combination. So I think that&#x27;s where the, what&#x27;s the durability of a, that&#x27;s why a blinking canvas, right? It&#x27;s sort of like it&#x27;s always going to be there.</p>\n<p>We may add lots of bells and whistles to it. And the same thing with spreadsheets. The other thing about the spreadsheet is, it&#x27;s Turing complete, right? I mean, that&#x27;s the other, you know, Yeah, We sort of don&#x27;t give it enough credit. It&#x27;s like I can make it do everything. I think it&#x27;s the world&#x27;s most approachable programming environment. 100%, I mean, it&#x27;s kind of like, you know, and you get into it without even thinking your programming. And that is the other beauty, right? Which is like, you know, like AI still, we&#x27;re mystified it. You and I talked about, oh, my God, we need change management. When spreadsheets came, nobody talked about change management.</p>\n<p>They were just using it. And that to me is the other thing which is... You know, like somebody was describing to me, I was meeting the CEO of Generality, he joined Generality during the fax machine era and he was managing all their insurance agents and he said to me like, &quot;Look, I still remember the day when emails showed up, Excel showed up and the entire workflow of how things happen completely were upended and evolved and changed ground up.&quot; And so to me, I think that that&#x27;s, to your point,</p>\n<p>what are those things of this era that will discover, that&#x27;ll allow the ground up relitigation of the work, the work artifact and the workflow. It&#x27;s such an interesting time to be in software. I mean, compared to, you must feel this, like, it&#x27;s just a much more interesting time now than 5 or 10 years ago. You know, it is interesting, right? Which is what happened was we were like, you know, Cloud, Cloud, Cloud. And, you know, if you had to ask me what is the hottest thing in, you know, 2019, we had built this fantastic multi region or regionless database that was multi-format, right</p>\n<p>Cosmos DB, which was like, ah, we had, you know, basically a JSON database. We had a SQL in there, it was the everything database and we were thinking, oh, and it&#x27;s regionless and blah, blah, blah. And then the pandemic happened and then Cloud went into another hyper drive. I mean, Teams, thank God, just became like the thing. So that was the exciting thing, and lo and behold, you come out of it and you sort of say, &quot;Oh, I thought, oh, after the pandemic we&#x27;re going to get to some stable state.&quot;</p>\n<p>In fact, I remember a forecast of the Cloud, you know, we were saying, &quot;What do we do? We overbuilt during the pandemic,&quot; and there was a good eight months where we were, &quot;Oh, what...&quot; And then this thing now has come to. There&#x27;s a lot of charts of the shape at Stripe. I don&#x27;t know if it was this way at Microsoft, where obviously March 2020 you saw this discontinuity, right? Much more eCommerce activity happening and we saw the rate of online business creation. &#x27;Cause, you know, you had businesses that were offline only saying, &quot;Oh, you know, we got to switch to selling online.&quot; And it just stayed at that elevated level forever</p>\n<p>obviously since, it&#x27;s gone up from there. But there was no matching decline as people went back to, you know, into physical offices and things like that. It was just a step change and then it stayed at the elevated level forever. I&#x27;m sure you saw some of the things</p>\n<h2>Agentic commerce</h2>\n<p>in Azure and things like that. Yeah, 100%. It never came down. We&#x27;re talking about commerce, so we might as well talk about what we&#x27;re working on together. So we are very excited about it. I mean, I think the idea that has always been there is, which is what&#x27;s the best way for a merchant friendly set of rails and what is a customer friendly set of rails, right? Is there a perfect matching? Conversational sort of commerce is a thing that people have talked about. And now I think with the work that you all have done and others have done,</p>\n<p>we kind of can really bring the merchant and the end user and have this agentic sort of experience. So it&#x27;s early days, it has to be tastefully done, it has to be done in a way that you earn the user&#x27;s trust. And so I&#x27;m very excited about it. Yeah, we see two differences here because there have been previous attempts as, you know, buying on Twitter, buying on Instagram and, you know, these kinds of things. But what&#x27;s different here is one, you have AI, so all the integrations for the merchant are much easier. It&#x27;s much less of a lift than previous times when things like that just have been tried.</p>\n<p>But then secondly, I just think the experience is so compelling as an end user. We&#x27;re already seeing this in the early data from the super early customers that we have. You know, we launched a few weeks back in ChatGPT as well that just, it has to work. And again, the data&#x27;s already bearing that out, because it&#x27;s so much easier as an end customer. Yeah, I&#x27;ve been talking about it like, you know, I&#x27;m a bit of a cricket nut so I kind of, I&#x27;m always searching for something and, you know, the problem is, you know, whether it&#x27;s Amazon or Walmart or what have you, the search experience sometimes is hard on the site.</p>\n<p>So interestingly enough, these chat experiences first are fantastic, right? And the fact that they point back to the catalog, I mean, the catalog is still king. But now if I can marry the checkout and the catalog and that to me is where I think the seamlessness. Well, and do you have any experiences, I&#x27;ve found versions of this, I&#x27;m curious if you&#x27;ve had experiences where for product research, using an AI app is so much better than, you know, keyword based search. It&#x27;s amazing that up to last year we thought keyword based search was an acceptable way to hunt for anything. Yeah, in fact, that&#x27;s...</p>\n<p>Yeah, and the seller, like the bottom line is it&#x27;s kind of like it is creating a custom catalog for you, right? I mean, the response is not like a SERP, right? No, we were buying furniture in our house and we were just saying, &quot;Oh, yeah, we have this much space available in this spot. What do you think is a good, you know, piece that would look good in that spot that meets these dimensions,&quot; and things like that. But it&#x27;s crazy that we weren&#x27;t doing that previously, you know what I mean? And so all this kind of customization, being able to give vibes, general aesthetics,</p>\n<p>&quot;I&#x27;m looking for like something slightly higher end but not super fancy.&quot; You know, it&#x27;s crazy that you weren&#x27;t able to... By the way, that&#x27;s just the other crazy, crazy thing. I know my wife&#x27;s who&#x27;s an architect and so she sort of has this notebook, you know, Copilot notebook in which she has all these architectural pictures and so on. And you can ask it quite high level reasoning questions on what I should put in there. It&#x27;s able to take an architectural sketch, a drawing, and then take a public catalog of furniture and put those things together and reason about it. And that type of stuff is pretty magical.</p>\n<p>Like, our view on this, we are, as you know, really AI pilled when it comes to commerce at Stripe. And we think a huge amount will move here. And all the merchant conversations we&#x27;re having are bearing that out. And the way I think about it is that if you are doing open-ended discovery, &quot;Oh, I&#x27;m interested in an outfit to buy for this occasion, don&#x27;t know exactly what I want,&quot; AI will be so much better at helping you with that than the current experiences where, you know, you&#x27;re clicking through a list of search results or something like that.</p>\n<p>And then if you&#x27;re doing targeted search where I&#x27;m looking for a specific object that meets these needs, &quot;I want this component for my bike.&quot; Then also being able to specify with AI the exact parameters of the search you have, will be much better. You&#x27;re like, &quot;Wait, if you&#x27;re taking all of the undirected discovery and if you&#x27;re also taking all of the highly directed search, isn&#x27;t that just like all the commerce that happens on the internet?&quot; I think the only thing that&#x27;s left that&#x27;s out of that is like recurring staples. &quot;I need to order more pet food.&quot; That feels to me like the least affected. Though, of course you have to discover the brand</p>\n<p>of pet food at some point originally. But yeah, that&#x27;s kind of how we&#x27;re thinking about it. And again, Etsy has been an awesome first partner because all the products are custom, right? There&#x27;s no... Yeah, that makes a ton of sense to me. I mean, the discovery part, which obviously people like Instagram and others have done a great job. So the question is what&#x27;s the discovery layer. We have, like, that&#x27;s one of the, you know, obviously personalized discovery layer inspiration for a product, you know, what Pinterest has done is interesting. So some layer like that</p>\n<p>married with this conversational interface. Well, and of course it&#x27;ll be a rising tide that lifts all boats where part of what we&#x27;re doing with this is making merchant&#x27;s product catalogs remotely discoverable and inventory and everything like that. And then remotely purchasable where you don&#x27;t necessarily have to go through the whole flow on their side and everything like that. You can just do it inside the magic wand Copilot experience. And so that is at like the raw nuts and bolts level what we are doing and what we&#x27;re wiring up. I think then what&#x27;s exciting is that, again,</p>\n<p>Pinterest played with commerce quite a few years back, maybe 10 years back. It hasn&#x27;t taken off as a huge thing. But now if you have all the merchants who are offering their product catalogs as part of this protocol, then social sites like, you know, Pinterest and Instagram and Twitter get another run at this kind of commerce experience because you&#x27;ve way more merchant support and adoption for it than you had the first time around. Yeah, and we have a project called the NLWeb and the idea is that, and which is to really take every catalog of every merchant and give it like essentially a website,</p>\n<p>an NLWeb interface, that then an agent can talk to, to be able to interrogate and get the deep search, so to speak. Yes, yes, yes. Because today in some sense, one of the biggest challenges is the quality of the catalog and the ability to use reasoning to do a deep search. And if you can solve that, then to your point, every product will find its query. Yes, so we&#x27;re building out this platform in agentic commerce where we have, you know, some open source protocols</p>\n<p>like our agentic commerce protocol. We obviously have the regular Stripe products, you know, people are using us for, you know, and it&#x27;s particularly kind of tricky from a payments point of view because you&#x27;re looking to have an AI app do payments on behalf of other people across all these different sites on the web without probably sharing all your payment details like all across the web. It&#x27;s interesting payment things that we&#x27;re doing. Anyway, we&#x27;re looking to build a platform business in agentic commerce. You guys seem to know a thing or two. What advice would you have for us as we build in this very nascent space, but when there clearly is product market fit?</p>\n<p>I mean, I think... I mean, you have done that, right? Which is one of the things that I would think is what does it mean to participate in this agentic workflow, right? For every merchant, right? Like, so every merchant now will have to sort of come to someone like Stripe and say, &quot;Hey, I have a catalog, I have a checkout, please get me to meet agents,&quot; in the most friction-free way. And that&#x27;s done tastefully is why I would think I would hire Stripe for. And I think the merchant onboarding, because I&#x27;m assuming the long tail of merchants</p>\n<p>being able to click and say, &quot;Hey, enable me for agentic commerce,&quot; is going to be the thing that&#x27;s going to drive. Because the good news here is there is going to be multiple, I mean, obviously ChatGPT is the big one, but there&#x27;s going to be, I mean, you know, Google&#x27;s going to be there, we&#x27;re going to be there, Meta will be there, Perplexity, there&#x27;s going to be a lot of competition. There&#x27;s going to be a lot of front doors as aggregators. Yes. But the more interesting thing is they themselves, will on their website or on their mobile app, will want to support natural language queries. And so all of that being enabled for,</p>\n<p>or my own agents will go interrogate those things. So I think that that&#x27;s the key thing to be challenged, you know, or rather really solve well. Because going to a small merchant and saying, &quot;Hey, you go stand up an MCP server, do this protocol, that protocol,&quot; what&#x27;s the easy button? I think the other thing that&#x27;s we&#x27;re going to see is, and you&#x27;re probably seeing this already, a merging of a bunch of the agentic experiences. So we&#x27;re talking about agentic commerce here. And we had Des Traynor from Intercom, they&#x27;re now doing customer service AI mediated and just like replacing humans,</p>\n<p>doing customer service with AI. But what they&#x27;re seeing obviously is a huge amount of induced demand where people initially come for the help desk type queries and it&#x27;s like, &quot;Wow, this is honestly a much better way to navigate the website.&quot; And it&#x27;s almost like a command line for... Anyway, it can&#x27;t quite take as much actions now as it will be able to. But I also wonder how much all these experiences merge where like, we&#x27;re doing the buying stuff over here that is growing and expanding and, you know, maybe there&#x27;s some discovery and things like that. They&#x27;re doing the customer service stuff over there. It&#x27;s universal. Yeah, that&#x27;s a good point. When does it become a command-line application? Like, again, my example of this</p>\n<p>is I find the fashion space interesting where, how incredibly poor the tech is with a lot of websites out there where people are trying to do this very aesthetic vibe space. &quot;I&#x27;m looking for something like that, but like a little more fancy,&quot; you know, whatever. And it&#x27;s all keyword based search and manual tagging and things like that. And things like that feel to me perfectly set up for having an interactive AI based experience where, again, like your Midjourney prompts, you&#x27;re like, &quot;No, the image wasn&#x27;t quite right. Change it in this way.&quot;</p>\n<p>Just doing that with commerce, I think, will be really interesting. Makes sense. And I also think intuitively like, I mean, all of us our inside sales is also, or rather customer service is also inside sales. Exactly. Yeah, yeah. And so intuitively that makes sense, you know, and definitely in the agentic world, you can stitch these things together so that the seams are not like to what they are today. Maybe what we&#x27;re describing is a bunch of swim lanes have been established by random accidents of software and org charts and everything like that.</p>\n<p>You do customer service, when people come with a query is of a non-commercial nature, you are an SDR. That&#x27;s right. You know, you do whatever.</p>\n<h2>AI brand loyalty</h2>\n<p>And all those distinctions are probably going to get thrown away. We&#x27;re talking lot about kind of the AI apps that people use and Copilot and ChatGPT and Gemini and all these kind of things. There&#x27;s a debate about how much model quality matters and is it the case that people pick a brand and, you know, they&#x27;ve been drinking, you know, Coke for the longest time and even if Coke&#x27;s, I mean, Coke&#x27;s a bad example, because there was a revolt about the change in the formula. But, you know, even if they change the formula, you know, people, they still have a preferred brand. You know, I use o3, my wife uses GPT-5. I&#x27;m always horrified &#x27;cause I&#x27;m like, you know,</p>\n<p>&quot;You deserve more intelligence than that.&quot; And, you know, you can take o3 from my cold, dead hands. Where do you stand on the debate of do people have loyalty to it? And there was also the revolt when they tried to take away 4.0, was it? Yeah, that&#x27;s right. And people were really attached to that model. Do people have loyalty to a model or do they have loyalty to an AI brand? And how does this affect your business strategy? I think that in the consumer products, this was the first time we saw that, right? When you changed models, they&#x27;re not sort of uniform changes and they impact people differently, right?</p>\n<p>And personality is one such thing or style or what have you. And so it just sort of is a new dimension. So in other words, it&#x27;s also an argument that, &quot;Oh, wow, this is a new dimension of perhaps differentiation,&quot; right? People will, you know, it&#x27;s sort of, there&#x27;s the IQ side of it, there&#x27;s the EQ side of it, and then there is all these style points. And maybe that&#x27;s kind of one of the things that people will steer things towards. But long term, for me, I think you have to kind of make sure</p>\n<p>that the models are most capable for the hardest high value tasks. And then you continuously optimize, after you have access to that, for what the task had had is, right? So as a product builder for us, and my thing is have the model drop which is the most capable, but then what&#x27;s in production is multiple models. And my favorite, like, new thing in GitHub for example, is auto, which is I want to keep, you know, people still obviously love sonnet whatever,</p>\n<p>they want to use it. But at the end of the day, I really want the model picker and it just can&#x27;t be a dumb model router, right? It has to basically have the intelligence to know that this task deserves this kind of cogs or this type of intelligence and this is my complexity of my repo or my PR task. That ultimately is where, you know, the future of agents would be, right? And so therefore you want the model, in fact, you want an ensemble of models that then, you know, you have agents</p>\n<p>intermediating that ensemble so that it meets your needs. And then you&#x27;ll have preferences. Will everyone&#x27;s preference not just be for more intelligence? Like, I&#x27;ll go into the picker and manually select o3 for like, &quot;where should I go get ice cream&quot; query? Like I always want the most— That&#x27;s habit, don&#x27;t you think? But that is, you know— Maybe. But it&#x27;s also an important considered decision. But it is true. I mean, like, it&#x27;s very hard for any of us to take our, that&#x27;s why defaults matter and we love our defaults. We don&#x27;t love the cheese to be moved.</p>\n<p>You know, even the model selection stuff, you know, it&#x27;s kind of like, wow, if you now took away the model selection, you know, it&#x27;s a problem and so therefore you got to be careful. But I do think in the long run, if I can trust, that&#x27;s another one, right? Which is if I can trust something to always do something for me while it&#x27;s making a selection that somehow is delightful, then that&#x27;s when I&#x27;ll hand off. Okay, and so you think that&#x27;s what you need to get to, is me trusting that you&#x27;ll pick an appropriate model? Exactly. Yeah. Yeah. And then, I mean, my mental model of Microsoft</p>\n<p>is that you just play at every part of the stack in that there&#x27;s the, you know, you have Copilot, you have your stake in OpenAI, you have, well, we can get to vertical applications in AI. You have the Azure layer, you have chips, everything. I leaving out a whole bunch of stuff. Are some more important to you than others? What is the must win? Will you do verticals? Yeah, I mean, at some level— What&#x27;s the nuance to that? Yeah, well, at the core, the way I kind of conceptualize it is our infrastructure business. We have to be fantastic at building what I&#x27;ll call the token factory, right? This is the tokens per dollar per watt.</p>\n<p>Really being super efficient in that. Then I&#x27;ll say we have another layer of it, which is the agent factory. And the difference between the token factory and the agent factory is use the tokens most efficiently to drive a business outcome, or a consumer preference outcome, which is about— That&#x27;s the value per token or something? Yeah, the value per token. And as evaled by sort of the specific domain that people care about. And that is, to your point, it has tooling around it. It has a whole host. It&#x27;s kind of the new app tier</p>\n<p>or the app server, right? Every new platform has always had, there was the web and there was a web server. This is the AI server in some sense, or the AI cloud. Then we will definitely want to build our own, I&#x27;ll call it systems of intelligence or AI systems, that is the family of Copilot, right? Whether it&#x27;s for information work, that&#x27;s kind of what we have done. For coding or software development, that&#x27;s the GitHub Copilot. Security&#x27;s another domain where we are absolutely going to be a primary. Those would be the three horizontal. We will also have business applications.</p>\n<p>The other one that is, we&#x27;re doing a lot in health and science. So in health the, you know, we had bought nuance and now we have something called DAX Copilot and this is the notetaking diarization for physicians, right. So the ability to be able to have a doctor spend more time with their patients and then the AI do everything else in terms of everything from coding to taking the notes. So that&#x27;s one place we are, you know, have a great close partnership with Epic. It&#x27;s embedded part of Epic. So that&#x27;s kind of what we are doing in health. And then we are also doing stuff in Copilot</p>\n<p>for consumer health that sort of docks to it. But the other one is science. And the science, it turns out it&#x27;s a big domain for what I&#x27;ll call the outer loop orchestration, right? Which is the scientific method in some sense requires you to create the hypothesis, then run these multiple experiments in silico, come back, refine and so on. So that to me is another tool chain. It&#x27;s kind of like we&#x27;re trying to discover some combination of the GitHub Copilot meets</p>\n<p>Microsoft 365 Knowledge work, if you will, for the scientist where they have the authoritative sources of knowledge. They have even the interfaces tools used could even be, hey, the MCP server for the wet labs, so to speak. Can I interface with it? And then how do you orchestrate all of this</p>\n<h2>Product bundling</h2>\n<p>such that the scientific loop can go faster. As a platform company, you always have decisions around when should you try and bundle products together, when should you try and staple them and mandate they be used together and when should you not. And, you know, I think the classic example for some reason that everyone talks about, despite it being quite minor, is the fact that Apple originally only let you use an iPod with a Mac and try to use it to drive Mac sales and then gave up and, you know,</p>\n<p>shipped iTunes for Windows. And my understanding reading the &quot;Apple in China&quot; book is it was like a totally random decision that someone just made it, you know, one day. But it&#x27;s often held up as one of these examples. Obviously Microsoft, the entire history is full of these interesting examples. I don&#x27;t think people realize how open Microsoft was in the early days where in 1985 most of Microsoft&#x27;s revenue was from Macintosh applications. And then for the Microsoft operating systems, most of the applications were third party, you know, like Lotus 1-2-3 and things like this.</p>\n<p>And so it was like a fully open strategy. And then you had the Windows era of the tight coupling between Office and Windows and those kind of mutually reinforcing each other. Then early on, I get the sense Azure and Cloud was, you know, oh, it&#x27;s a place you can run your SQL server. And then fully embracing Linux later on and things like that. I&#x27;m curious just to, &#x27;cause again, we think about this as a platform company and we&#x27;ve been of late embracing much more modularity where Stripe Radar, you can use it even if you&#x27;re not using Stripe for payments and things like that. How do you in general think about your framework for when products should be coupled</p>\n<p>versus when you sell them independently? That&#x27;s a great point. And then, I have AI specific versions of that question. So the way I reason about it is, I think we overstate many times how many of these battles are quote, unquote, &quot;zero sum.&quot; So at some level, one of the pieces of analysis that I think that you want us to be sharp at is, what are by definition going to be multiplayer. Like Cloud is a classic example, right? Which is, I remember even back in the day when I got started, and obviously Azure got started much later than AWS,</p>\n<p>people would tell me, &quot;Oh, God, isn&#x27;t AWS so far ahead?&quot; Whereas is there a room for a second Cloud? And having competed against Oracle and IBM on all the middle tier servers and so on, I felt like, no, this enterprise customer and commercial customers by and large are going to demand sort of a multiple. And so that was the structural understanding that drove us to even just be at it. And the rest is history. So a little bit of, to me, if you over package things, you might in fact sort of reduce your TAM,</p>\n<p>and not compete. Like for example, if we built Azure, in fact Azure&#x27;s, you know, we just called Windows Azure, right? Oh, well, that&#x27;s a problem. Because Azure makes no sense just for Windows. It&#x27;s sort of got to support Linux as first class. It&#x27;s got to support MySQL and Postgres as first class. And so that&#x27;s what sort of allowed us to make sure that you have to actually have to do a great job with SQL Server. But you got to do as bang of a job as like, you know, Amazon would do with Postgres or MySQL. And so it was driven primarily by, hey, that&#x27;s the TAM. That&#x27;s what customers expect us.</p>\n<p>And we are going to have tough competition. But, so to me that&#x27;s kind of how I define my modularity, right? What&#x27;s the thing that maximizes my stack&#x27;s market opportunity, then yes, we are a firm, and the reason we we&#x27;re not a conglomerate. And so therefore there should be a theory of some integration benefits and platform effects. And so therefore, what is that and how do we do a great job of it? But each layer of the stack, right, even in, let&#x27;s say in Azure, the token factory, somebody should be able to come</p>\n<p>and say, &quot;I just want to use Azure for its bare metal services. I just need Kubernetes, you know, clustered all over, but I just need to you to do the management part and I&#x27;ll bring all my software.&quot; No problem, we got to win that workload. Maybe then after that we&#x27;ll at least have a shot someday when it becomes a real pain to manage sort of your multi-region database on your own that you&#x27;ll say, &quot;Oh, let me just use Cosmos.&quot; But it&#x27;s a separate decision. But isn&#x27;t there always a debate between if we have Linux and Azure, we&#x27;ll sell more Azure. But then the Windows people say, &quot;Yeah,</p>\n<p>but you&#x27;re a hamstringing, you know, Windows server.&quot; And there are some places like you&#x27;re describing where Microsoft&#x27;s open, there are other places, you know, Microsoft Flight Simulator is not available on the PlayStation, it&#x27;s available on the Xbox. And that makes sense, you know, it feels kind of natural to be integrated that way. I know this might be a bit of a stretch, but, you know, Teams Chat and Teams Video are not sold separately. They&#x27;re just part of one thing, and that makes sense. It makes the bundle more compelling. And so don&#x27;t you always end up in these debates as to does the bundling cost outweigh the bundling benefits? Yeah, and I think some of those, like for example, Teams thing is, it&#x27;s a classic one,</p>\n<p>which is Teams was born as a product that brought those four things, like Outlook, right? Outlook was brought, you know, there was a PIM before, there was an email client and calendaring was separate. And Outlook was the first scaffolding that said, &quot;Hey, we bring these three things to get a job done,&quot; right? So that was, and same thing with Teams, right? We brought chat and channels and video and what have you into one. So the bundling was the product to some degree, right? That was the product scaffolding. And so then of course you can then say, &quot;Hey,</p>\n<p>that needs to have an open marketplace and it needs to integrate with other things,&quot; or what have you. So the modularity has to be thought through in ways that make sense at the atomic level. Then you don&#x27;t want to overthink about the synergies or sort of integration effects and you&#x27;re not competitive, right? A classic thing would be if you built an unbelievable public cloud, except it only ran Windows workloads or SQL workloads, that&#x27;ll be essentially a very small sliver of the market. So it was in our sort of interest</p>\n<p>and definitely in the interest of meeting the customer needs. And so being able to sort of really click in the AI stack, that&#x27;s kind of how I look at it, right? We have an infra business, we have an app server business, and we have an apps business. It&#x27;s just simplifying. I want those three things to stand for them on their own merits. We ourselves of course want to have the feedback loop across these three layers, but customers and partners will choose which door they enter through. This impression I have is that when you took over Microsoft,</p>\n<p>you shifted the culture from a highly bundled, you&#x27;ll buy your Windows machines and they&#x27;re running Microsoft Access and you know, they&#x27;re a SQL server and everything is like neatly packaged together in this Microsoft life to moving towards more of an open and interoperable strategy. I think that the way I would say is my thing was to go back even to the Microsoft of the &#x27;80s perhaps, right? Because most of what happened was really in the &#x27;90s there was Microsoft. and there was pretty much nothing else.</p>\n<p>And so there was sort of a lot more of our things coming together, whether it was on the client or on the server. The &#x27;80s were like to your point, right? You know, we built Office on the Mac. Windows came later. In fact, the concept that Bill had when he started Microsoft was it&#x27;s a software factory. I&#x27;m not in love with any one category. I&#x27;m just like going to build the best software factory and it&#x27;s going to churn out whatever, flight sim— Interpreters. Flight sim, you want, you know, a basic interpreter. No problem, we have one. You want an operating system, we have one too. So in some sense that was the idea.</p>\n<p>And at what point we got into a lock between four or five parts of that, that became the Windows and Windows NT and client server and what have you. And so I sort of realized that when, you know, I became CEO and even when I was running our Cloud business, that, hey, this is a time where, you know, the market&#x27;s going to be a lot bigger and a lot different. And we didn&#x27;t, like, we didn&#x27;t have the mobile platform at that time and so therefore we really needed to make sure we would stay relevant in the largest markets that we could address by bringing our products together in configurations that made sense.</p>\n<p>So it is actually a lot more less dog... There was not that much dog... In fact, I would say, you know, if it was not in the core DNA of the company, I don&#x27;t think just because I showed up as a CEO and I said, &quot;I want to do this,&quot; we would&#x27;ve executed well. It was in the core DNA of the company</p>\n<h2>Microsoft’s culture</h2>\n<p>that we can in fact take our software to every platform. Yes, speaking of the core DNA of the company, there&#x27;s the famous cartoon of, you know, Microsoft with all the guns pointing at each other. How much cultural tweaking did you have to do? And how do you actually do that when you get down to brass tacks? &#x27;Cause you can see all the nice things, the all hands and things like that, but ultimately culture comes down to what you will and won&#x27;t tolerate and how decisions are made and things like that. Yeah, I mean, I&#x27;d say there are two things that I learned from that entire episode</p>\n<p>because I always say, look, I&#x27;m a consummate insider, right? Anything good and bad about Microsoft of the last 35 years, I lived through them all and I&#x27;m part of it, right? So I can&#x27;t deny any of it. The thing that I felt was, a little bit of that was just we lost our own belief because we lost the narrative. That cartoon is a great example of someone else defining what became the cultural narrative more so than reality, right? The people started to identify with the cartoon.</p>\n<p>That&#x27;s right, I mean, that&#x27;s kind of one of the... I think that one of the fundamental issues of today&#x27;s social media and the zeitgeist is you can absolutely lose narrative. It&#x27;s reflexive Yeah, it&#x27;s completely reflexive. Like, so one of the interesting things is, of course all of these things have signal, right? So this doesn&#x27;t mean, oh, wow, we were all perfect divisions and we were all sort of, you know, in greater harmony. That is not the case. But you know, in some sense, some of these divisional tensions are real issues that need to have tension, right? You can&#x27;t have... Like, social cohesion is not a goal, Winning in the marketplace is a goal,</p>\n<p>but at some level you have to orchestrate these large organizations. In fact, you may even have two competing teams by design. And just because somebody sort of said, &quot;Hey, I&#x27;m going to read the New Yorker and there&#x27;s going to be a cartoon,&quot; like, that&#x27;s the type of stuff that I think leaders, and how to communicate in today&#x27;s world where your employees read about you outside and form opinions about you is one of the toughest leadership challenges, I think. Which is how do you earn the trust? How do you really make sure</p>\n<p>that they can in fact feel the reality, shape the reality? Like the other thing is everybody thinks it&#x27;s the system. It&#x27;s that guy at the top or, you know, my VP and they have all the power and I have none. The reality is the power is a lot more diffused and distributed and so therefore how do you really help people especially get hold of that and reshape. Like, you know, one of the other famous things people say is, &quot;Hey, I never leave companies, I leave managers.&quot;</p>\n<p>And, you know, I believe that, right? And so it&#x27;s kind of micro cultures and they can be shaped. In fact, when I look back at my Microsoft career, I was lucky to fall into these people who created these unbelievable environments in the company, right? And that&#x27;s kind of why I stayed and that&#x27;s how I thrived. And so to some degree, you know, I feel that the more culture... You need at the top, a narrative that you have to live and be consistent, right? So that&#x27;s where this growth mindset or learn-it-all versus know-it-all</p>\n<p>has been super helpful for us as just a frame because nobody thinks of it as my dogma, right? Thank God it&#x27;s not, you know, it&#x27;s a well understood child psychology thing that appeals to people outside of work. And so cracking something like that and then living it, but also somehow I would say the challenge for all of us in today&#x27;s world is, let the social media memes not define us. What&#x27;s that inner strength that is there in an organization that can in fact resist the social meme?</p>\n<h2>The law of very large companies</h2>\n<p>That I think is the key. How many people is Microsoft? I think around 200,000. Okay, so rough number is, you know, Microsoft is 200,000 people, Stripe is 10,000 people. Maybe there&#x27;s someone who&#x27;s listening to this who runs a company that&#x27;s 500 people or something like that. A lot of the things that we do are probably fairly scale independent where you&#x27;re trying to make sure that you&#x27;re talking to customers, you&#x27;re holding a leadership offsite. We&#x27;re looking at the numbers for &#x27;26. We want the revenues to be a bit higher and the cost to be a bit lower. You know, there&#x27;s a lot of activities in companies that are kind of the same regardless of the size. That said, there&#x27;s also probably things</p>\n<p>that only show up at the, you know, 200,000 person, you know, city state size that, you know, I wouldn&#x27;t be aware of at the 10,000 person size. What effects only show up when you&#x27;re that big? There are two things I would say. Quite honestly, having only worked at Microsoft, it&#x27;s not that I&#x27;m like an expert. But the one thing I would say, taking over for a founder, you know, Steve and Bill built the company, I mean, Paul and Bill started</p>\n<p>and Steve and Bill scaled it and I was the sort of the first, quote unquote, &quot;non-founder person.&quot; The thing I realized quickly, or in fact I got into the job and I realized that I need a team. And just to have the ability to manage the scope. But then, you know, that A.G. Lafley thing that we put out there, which I think is a great one. Like what is this, being clear about what does the CEO clearly need to do though in that, right? Which businesses are you in?</p>\n<p>Which businesses are you out synthesizing the outside, having the standards, setting the standards for culture, and then the ability to your point about having that performance culture that you can&#x27;t say, &quot;Hey, I&#x27;m only about the long term, or I&#x27;m only about the short term.&quot; You&#x27;ve got to deliver both. Getting a real grip of the four or five things that only you can do. And then building the team, building the team. You&#x27;d say, &quot;Even at a 500 person, that&#x27;s what you do.&quot; But quite frankly,</p>\n<p>you can keep in your working memory, right, growing up as a developer, right? There was a set of things everybody would talk about. How many lines of code do you know, right, personally? At some point you sort of say, &quot;Oh, that&#x27;s the person who knows that module or that library.&quot; That becomes more, like, and everybody starts where they know every line of code. At some level then you have to get to the person who knows, &quot;Oh, I know the person who wrote that.&quot; And I think that that modularity and team building and the cohesiveness is, I think they most important. So am I understanding you correctly that maybe at the Stripe scale</p>\n<p>or at a smaller scale, you can still reason about the product as a product and know everything that you&#x27;re shipping and everything like that— But I also think founders are unique in that sense. because the founders are, you know, that&#x27;s kind of what is singular about them, right? Because they&#x27;ve grown up with it from day one. See, it&#x27;s kind of hard to take the working memory of a founder and say, &quot;Oh, let me take it and imprint it.&quot; Sort of a professional CEO. It just doesn&#x27;t work because the...</p>\n<p>You know, even for me, I joined the company in &#x27;92, I was not there in the early &#x27;80s, right, you know? And so to some degree it was a continuous scale that only the, quote unquote, &quot;the founder, CEO&quot; or the founders see it. And so that&#x27;s why I think having respect for what founders can do uniquely and founders having respect for whoever comes next, that they can&#x27;t be like we&#x27;re doing exactly the same thing that they did, right? So that&#x27;s why I think this founder mode thing is interesting, which is that clearly there is, you know,</p>\n<p>the culture personality of a founder is unbelievable, right?</p>\n<h2>What’s in the water in Hyderabad?</h2>\n<p>And you use it, maximize it. Then mere mortal CEOs like us have to sort of also be, you know, you can sort of be in the refounder mode but don&#x27;t think you are a founder. And that nuance I think is an important one. Last question, because we&#x27;re running up against time, as we talk about cultures and building them, what&#x27;s going on in the water in Hyderabad where, you know, the school that you went, also Shantanu went there, Ajay Banga went there.</p>\n<p>A bunch of good chess players are similarly from there and southern India more broadly and things like that. But do you have any theory on the local outperformance? Yeah, the high school we went to in fact, yeah. Until I would say NVIDIA and Jensen, because Jensen has it now covered for all of us. Yeah, between me and Ajay and Shantanu. In fact the CEO of Procter &amp; Gamble today is also from my high school. See, it&#x27;s cabal. It&#x27;s kind of a cabal. I would say one of the fascinating things</p>\n<p>growing up in Hyderabad and going to that school in the middle of nowhere at that time in the late &#x27;70s and the early &#x27;80s, I would say, I think it gave us a lot more space. If you look at even each of us, right? Academics was a thing, but quite frankly, we, mostly all of us had things which we excelled at a lot of other things beyond academics in fact. That was a pretty rare thing at that time in that country. And so I attribute it a lot to my high school because I feel that it is a place where it gave us a lot more space and room</p>\n<p>to follow what really became your passion. But you were able to take your time to discover it versus sort of feeling that, &quot;Hey, I had to join some kind of a race.&quot; It wasn&#x27;t as tracked. That&#x27;s right. Yeah. That&#x27;s right. What was your passion in high school? Cricket. In fact, this, by the way, the Samuel Beckett. Yeah, so I want to know the story. Sure, you know who... So if you asked the question, who is the one sports person who played actually professionally? I guess he played one or two matches for I guess the Dublin University and he played first class cricket.</p>\n<p>And so he&#x27;s the only person who played professional cricket and won a Nobel Prize. Really? That&#x27;s really funny. So you can have it all is the— There you go. The chess, boxing of its day or something, you know, merging the— A Nobel Prize winner and he&#x27;s a professional cricketer. That&#x27;s awesome. Well, you know, you, you came close but in another life, you know, that could have been you. Alright. Thank you so much. Thanks, Satya. It&#x27;s such a pleasure.</p>", "chapters_count": 13}