{"video_id": "uCw6JIryJL0", "title": "Turning ideas into reality with Figma", "link": "https://www.youtube.com/watch?v=uCw6JIryJL0", "published": "2025-11-12T17:18:54+00:00", "summary": "Figma democratizes design through its collaborative design products. It evolved from a design tool into an AI-powered platform when doubling its products in May 2025. In doing so, it helps teams go from idea to shipped product faster than ever before.\n\nLearn more about Figma: http://stripe.com/customers/figma", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=uCw6JIryJL0\">https://www.youtube.com/watch?v=uCw6JIryJL0</a></p>\n<h2>Transcript</h2>\n<p>Figma is a design tool that helps people bring their ideas out of their head and get them into the world. We want you to be able to get in there and design what you want. We cater to a lot of different people, a lot of different sizes of organizations and teams. Designing beautiful products and just making the world a more well-designed place is what Figma is trying to do. One of the things I love most about Figma is similar to one of the things I love most about Stripe, which is the focus on craft. We care about quality, we care about simplicity.</p>\n<p>With Stripe, we have the ability to meet customers where they are. To charge them in their local payment methods and in their local currency. About 85% of our users are based outside the US. We have so much that we want to do, especially in terms of how our customers access Figma, how they get value out of Figma. We went from four products to eight. We introduced new tools for AI. Stripe is really meant to serve businesses from that initial moment where they have a single product all the way to when they&#x27;re scaling. It was really important for us</p>\n<p>when we were redoing our billing model that it was more transparent, simple and easy to understand for our customers. In the future, we want to be able to look at things like usage-based billing or other ways of billing our customers. We&#x27;re able to know that Stripe is going to be ready to support us as we ship different types of products that just have completely different monetization needs. I think that is really empowering to be able to keep your main thing the main thing, right? Keep your focus on what you&#x27;re building</p>\n<p>and just depend on Stripe to handle payments, invoicing, compliance. I definitely don&#x27;t think we would have been able to move at the speed that we did without Stripe. Stripe got into the details with us and that kind of felt like, you know, we depend on Stripe, but also Stripe is depending on our feedback to make the best product possible for everyone. And that kind of partnership, you just don&#x27;t get to see it much.</p>", "chapters_count": 0}