{"video_id": "4wZiC4g3GPo", "title": "Can Movies Save Us From Our Phones? | Reclaim Your Attention | Cal Newport", "link": "https://www.youtube.com/watch?v=4wZiC4g3GPo", "published": "2026-02-23T11:00:00+00:00", "summary": "Cal Newport explains if movies can save us from our phones in episode 393 of the Deep Questions podcast.\n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\nLast month, the Atlantic reported that film students are now struggling to sit through entire films. In this episode, Cal argues that this is both an issue and an opportunity. The fact we can’t watch full movies indicates the impact of digital tools on our brains is worse than we assumed. But in this problem we also find a solution: maybe teaching ourselves to become better movie watchers can be the first step to reclaiming our own minds. Cal then dissects a viral AI essay that seems to have everyone worried (spoiler: Cal’s not impressed), reads a reader note about social media and the Olympics and gives an update on his next book project.\n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\nFebruary Books:\n\nAttensify\nThe Lost Island (Eilis Dillon)\n\nLinks:\nBuy Cal’s latest book, “Slow Productivity” at www.calnewport.com/slow \nGet a signed copy of Cal’s “Slow Productivity” at https://peoplesbooktakoma.com/event/cal-newport/ \nCal’s monthly book directory: bramses.notion.site/059db2641def4a88988b4d2cee4657ba?\nhttps://www.theatlantic.com/ideas/2026/01/college-students-movies-attention-span/685812/ \nhttps://fortune.com/2026/02/11/something-big-is-happening-ai-february-2020-moment-matt-shumer/\n\nThanks to our Sponsors: \n\nhttps://www.pipedrive.com/deep\nhttps://www.drinkag1.com/deep\nhttps://www.butcherbox.com/deep\nhttps://www.grammarly.com\n\n0:00 Can Movies Save Us From Our Phones?\n31:23 Something Big is Happening\n49:33 Digital Minimalism and the Olympics \n56:04 Cal gives his weekly reading update \n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<p><em>No transcript available for this video.</em></p>", "cleanup_applied": false, "cleanup_reason": "no_transcript"}