{"video_id": "ZagdY6UJYL4", "title": "[State of Research Funding] Beyond NSF, Slingshots, Open Frontiers — Andy Konwinski, Laude Institute", "link": "https://www.youtube.com/watch?v=ZagdY6UJYL4", "published": "2025-12-31T20:18:01+00:00", "summary": "From co-founding *Databricks* and *Perplexity* to launching the *Laude Institute*—a dual venture fund and nonprofit designed to turbocharge the path from *research breakthrough to breakout company*—*Andy Konwinski* is building the infrastructure to recreate the Databricks motion at scale: fund researchers doing open work, help them ship products that matter, and turn paradigm-shifting ideas into trillion-dollar companies. We caught up with Andy live at *NeurIPS 2025* to dig into the origin story of Laud (\"right resource, right researcher, right time\"), why the *Databricks founding model* (eight co-founders, deep research scars, years of collaboration) is becoming the gold standard for AI startups (not an anomaly), how Laude's *venture arm* backs researchers-turned-founders with 50+ professors and PhDs as LPs (Jeff Dean, top Berkeley/Stanford faculty, Databricks and Perplexity co-founders), why the *nonprofit arm* does no-strings-attached grants to fund open research before incorporation (the upstream funnel that feeds the next generation of companies), the *slingshot program* funding breakthrough projects like *DSPy, Terminal Bench, LMArena, and continual learning research,* why *NSF isn't broken but insufficient* (it's $1B/year for computer science when we need $10-100B, and Silicon Valley's picker model can deploy capital more effectively), how the *\"post-post-training\" layer* (prompt optimization, context management, RAG, memory curation, tool usage) is becoming the new frontier above pre-training and post-training, why *Chinese labs are outpublishing Western labs* in open research (Moonshot, DeepSeek shipping twice as many interesting papers as American startups because OpenAI and the frontier labs stopped publishing), the launch of *Open Frontiers*—a live-streamed conference in San Francisco bringing together the 100 most influential open researchers (Yann LeCun, François Chollet, Jan Leike, Percy Liang, Berkeley AI Research, Allen Institute, and more) to share roadmaps and unify the ecosystem, why the *Laude Lounge at NeurIPS* became the VIP gathering spot (Starlink WiFi, free food, couches, and the gods of AI hanging out because conferences need a place for the VVIPs to actually sit down), and his thesis that *open research is the path to world-changing impact*—and Laud is the bridge from grant to company, from paper to product, and from researcher to billionaire founder. We discuss:\n* What *Laude Institute* does: dual structure with a *venture fund* (backing researchers-turned-founders post-incorporation) and a *nonprofit* (no-strings-attached grants for open research pre-incorporation)\n* The *slingshot program:* funding *DSPy, Terminal Bench, LMArena, continual learning, and Jepa-style prompt optimization* projects across Berkeley, Stanford, MIT, CMU, Wisconsin, Caltech, UI Urbana-Champaign, Toronto, Waterloo, and beyond\n* The *\"post-post-training\" layer:* compound systems, prompt optimization, context management, RAG, memory curation, tool usage—the layer above pre-training and post-training where innovation is exploding\n* *GEPA and DSPy:* evolutionary prompt optimization (genetic algorithms reinvented by PhD student Laxia) and the DSPy framework (a reverse compiler that takes code and compiles natural language)\n* Why *NSF isn't broken but insufficient:* $1B/year for computer science (and they're trying to cut it in half) when we need $10-100B for frontier AI research—Laud complements NSF with Silicon Valley's picker model and high-velocity grant writing\n* The *PhD entrepreneurship clubs:* Computer Science Grad Entrepreneurs (CSGE) at Berkeley (started 2012), Agent at University of Washington, Research to Impact at Wisconsin, Saplings at Stanford, and more clubs forming at CMU, MIT, UI Urbana-Champaign\n* *Open Frontiers:* a live-streamed conference in San Francisco (next five months) bringing together the 100 most influential open researchers (Yann LeCun, François Chollet, Jan Leike, Percy Liang, Berkeley AI Research, Allen Institute, and more) to share roadmaps and unify the ecosystem\n* The vision: *open research as the path to world-changing impact,* and Laud as the bridge from grant to company, from paper to product, and from researcher to trillion-dollar founder\n\n — Andy Konwinski\n\n* Laude Institute: https://www.laude.org/lounge\n* X: https://x.com/andykonwinski\n\n00:00:00 Introduction: Andy Konwinski and the Laud Institute Vision\n00:01:17 The Databricks Motion: From PhD Research to Billion-Dollar Companies\n00:02:15 Laud's Two-Sided Model: Venture Fund and Philanthropic Grants\n00:06:37 Slingshot Program: Funding the Layer Above Foundation Models\n00:07:56 JEPA and DSPy: Evolutionary Prompt Optimization\n00:10:29 Beyond Berkeley and Stanford: Expanding the Research Network\n00:13:22 NSF Complementarity: Not Broken, Just Insufficient\n00:17:03 The Laud Lounge: Creating a VIP Experience at NeurIPS\n00:18:41 Open Frontiers: Reclaiming Leadership in Open AI Research\n00:19:06 The Open Research Crisis: Why", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=ZagdY6UJYL4\">https://www.youtube.com/watch?v=ZagdY6UJYL4</a></p>\n<h2>Introduction: Andy Konwinski and the Laud Institute Vision</h2>\n<p>[music] Light and space to fire. Wake up. [music] Light. &gt;&gt; We&#x27;re here with Annie Kinsky of Loud Institute. Welcome. &gt;&gt; Yeah. Thank you so much. &gt;&gt; I It&#x27;s weird to welcome to you to your own lawn show. We&#x27;ll talk about that. &gt;&gt; No, I am welcome here. &gt;&gt; Yes, &gt;&gt; everybody that everybody invited is Yes, I&#x27;m here. So your intro is very very long but you&#x27;re a co-founder of data bricks and perplexity and and and now I think um people are less familiar with</p>\n<p>the law institute and what you&#x27;re what you&#x27;re doing it&#x27;s brand new we covered your terminal bench events recently that was a little bit of a coming out party but maybe just for folks who are out of the loop what is the law institute &gt;&gt; oh good question LA itself beyond just law institute is an organization that gives resources to researchers at the exact moment that they need them. So we say right resource, right researcher, right time and there&#x27;s a sort of dotted line in the life cycle of a researcher who makes a company which is when you incorporate. So after that you want to raise venture funding. So law has a</p>\n<p>venture arm that funds researchers and researchy technologists that aren&#x27;t coming from PhDs or or professorships to build companies. And that&#x27;s actually a</p>\n<h2>The Databricks Motion: From PhD Research to Billion-Dollar Companies</h2>\n<p>path that I am extremely passionate about with data bricks perplexity being companies founded by PhDs at paradigm at the heart of a paradigm respectively big data for data bricks and public cloud and then kind of search as genai came around for perplexity. So that&#x27;s a a part of a lot that I&#x27;m very passionate about just helping researchers build the next data bricks the next trillion dollar or so far hundred billion dollar company and before that dotted line researchers need uh in an unprecedented way like an existential existential way more resources to participate in</p>\n<p>frontier AI research uh people doing research in the open and inspired by data bricks and my history I want big breakthroughs to happen in the open from research things that move humanity forward like computing, you know, silicon or the personal computer or internet or big data with data bricks or the next paradigm of search with perplexity. So I want all that to be happening in the open. So I want to fund the researchers who are doing open research just in a philanthropic motion</p>\n<h2>Laud&#x27;s Two-Sided Model: Venture Fund and Philanthropic Grants</h2>\n<p>and across both of those there&#x27;s so so there&#x27;s law ventures for the venture fund law institute this nonprofit for the upstream stuff and across both this obsession with shipping uh in in the case of the venture fund shipping your code as product in the case of the nonprofit shipping your research as open source projects and then there&#x27;s this ethos to bring meccratic principles which researchers love into the whole thing as a governing philosophy. So for researchers and by researchers so the venture funding there&#x27;s 50 professors and PhDs the top names like Jeff Dean and the top faculty of Berkeley and</p>\n<p>Stanford and my co-founders of data brace and perplexity who&#x27;ve invested in the fund and then give advice and make deal flow introductions and on the institute side it&#x27;s my money as as sort of a successful technologist plus the tech the money of other billionaires who have done well by their tech companies giving money into the nonprofit to do this no strings attach grant writing that ultimately becomes a funnel for recreating the data bricks motion you know like make the breakthrough in the open go become a billionaire tech founder that translates your research insight into people products in people&#x27;s</p>\n<p>hands so that&#x27;s a lot law ventures law institute just kind of this one la vision &gt;&gt; a lot of visions I&#x27;ll I&#x27;ll dive in I want to talk about slingshots and as as a funding vehicle but you mentioned a a bit of this the data bricks motion and I think that&#x27;s an interesting analogy because data bricks is very unusual as founding story &gt;&gt; and I&#x27;m wondering if it&#x27;s replicable. I thought &gt;&gt; why do you think it&#x27;s unusual? &gt;&gt; Uh eight co-founders &gt;&gt; the seven eight. &gt;&gt; Yeah. So basically it what was the model that you think really worked for data bricks and does it transfer to the other</p>\n<p>law grantees who are not as big who don&#x27;t have the &gt;&gt; and I think openai had quite a lot of co-founders. I think VMware had a decent number of early research team turned co-founding team. I think snorkel AI is a unicorn came out of out of Stanford to have a pretty good size founding team. Core research teams wouldn&#x27;t when they gel at a university or outside at a research lab in an industry after years of of deep scars from working together knowing each other&#x27;s ins and outs and team like the the dynamism and like the the gestalts like some is greater than</p>\n<p>the parts of working together as a team. They&#x27;re great bets. So you kind of derisked the founder divorce risk with uh that&#x27;s one of the most big problems that VCs have to watch out for by having built a breakthrough together. You&#x27;ve also proven traction that you know how to come up with a disruptive idea. You still have to prove that you can turn it into a product market fit. But I think that the founding team sizes is one thing that there is some precedent for the path from I cited a few examples of the path from research just massively successful startup. the Google co-founders Larry and Sergey obviously</p>\n<p>took research NSF funded research by the way and uh turned it into one of the most iconic companies in the history of humanity. I cited some VMware. There&#x27;s even examples, you know, more and more examples of researchers besides perplexity coming out of Berkeley like Ella Marina more recently has become the standard for evaluation for all of the the the whole ecosystem and that was a research turned startup product now project now. So uh 10 years ago I would have agreed that it was and when we found a data brick sure it was a little bit more rare. Now I think it&#x27;s becoming</p>\n<p>the gold standard and the thing that you know all the VCs want in on and being at inside the heart of it all lot institutes sort of bridges those two and is obsessed with that path to impact that so many researchers want to have. So I would say that um I do believe going you know we are we have reached the tipping point already of this being the most high lever path from breakthrough to breakout company to world changing you know hopefully we&#x27;ll get to that trillion dollar or beyond we&#x27;ll get some we&#x27;ll be at 10 trillion</p>\n<p>dollars in value uh so I think it&#x27;s been a new norm for and it&#x27;ll be great for the world to have this path because researchers are they&#x27;re both amazing founders and they&#x27;re genuin ly good people in that they tend to want they&#x27;re very utilitarian. They want they want to bring all of humanity forward very pragmatic and reasonable and evidence-based. So kind of I think the world needs a little bit more of much of that right now too. &gt;&gt; Yeah. Amazing. Uh let&#x27;s talk about some</p>\n<h2>Slingshot Program: Funding the Layer Above Foundation Models</h2>\n<p>of the research directions that you have funded through your slingshot program. Um so we we already featured Terminal Bench. People can go look at that episode. Uh Arena we already mentioned. We also just did an episode. Um, one thing that we haven&#x27;t talked about as much is Jeppa, which you have a couple of Jeepa uh co-authors in there. &gt;&gt; That&#x27;s right. Um, maybe Jeepa and then any others that you care to pick out. But yeah, I&#x27;ve been asking people what&#x27;s been buzzing as I&#x27;ve been talking to people at Nurups this year and this idea that the language models themselves are more like compute or GPU a generation ago where what can we build at the layer</p>\n<p>above and in software systems we&#x27;ve traditionally thought of be a more great example. You have the operating system and the underlying architecture. you know, how do you make it a layer of abstraction above that empowers higher leverage decisions and choices and more applications that are more profound and powerful. So, I think that&#x27;s neat to think that there&#x27;s this layer above which is getting a lot of attention in the last year with context management, rag being the most well-known kind of implementation of this. It&#x27;s this layer above where we&#x27;re managing what the how the agents work and how they make decisions, how many memories they can keep track, how and how many memories</p>\n<p>they keep track of. That&#x27;s all at this prompt management. And it&#x27;s not just prompt anymore. It&#x27;s like tool usage and and memory curation and lots of innovation happening at the earlier above the core stack pre-training, post-</p>\n<h2>JEPA and DSPy: Evolutionary Prompt Optimization</h2>\n<p>training, distillation and and now talking about one of the Delara the PhD student working on some of this this prompt up from his jeep related stuff talking about post post training and that&#x27;s tying over &gt;&gt; post. I like that. I like yeah exactly. So there that&#x27;s tying over to um there&#x27;s actually a little bit of bleed over where this layer above now what we talk about as compound systems or prompt optimization where and and context management is kind of getting a new level of buzz and a new level of of enthusiasm and maybe a level up of the</p>\n<p>number of researchers working hard at that layer. Jeepa I would say is the probably up there for or the most successful example of adoption so far of ESP &gt;&gt; well it is kind of embedded in adjacent to so kind of like &gt;&gt; I I don&#x27;t know what to think of it you know it&#x27;s like has like a couple years of branding and &gt;&gt; we&#x27;re in ESPI the way I think of it is DSP is something closer more akin to a lang chain so it&#x27;s a a framework for writing agent type codes you give it a task and it like com it it it takes natural language and comp uh it actually takes code and compiles natural</p>\n<p>language. So it&#x27;s like a reverse compiler that&#x27;s DSPI and the optimizers which came kind of were born in the context of this DSPI project they uh take a prompt and make it better. So that &gt;&gt; so Jeppa is the part of optimizer and it&#x27;s using this evolutionary genetic technique like a very old area of research reinvented by Lakshia the mean PhD student on Japa really the way I zoom out and think about it is this layer above the core AI model stuff and now it&#x27;s broaching into</p>\n<p>doing model weight updates as well and there&#x27;s this big debate about is it in the context is it rag plus vector database plus whatever and sort of like lightweight, very few like if I if I tell you I had yogurt for breakfast this morning, you can remember that. It&#x27;s a very bespoke piece of information that I just told you. Uh you didn&#x27;t have to like go pre-train your brain weights for another round of like 10,000 GPU hours. You&#x27;re able waiting that. So that&#x27;s kind of the parallel with this. And that also takes us not to get too sprawling here into continual learning. Another buzz area that overlaps a ton with this layer. So really excited about that.</p>\n<p>that higher layer compound systems is kind of a word that people are using to capture it. Continual learning factors really close to it. Context management, comp optimization, jeepa, better together. Those are some of the buzzwords. Florida in that in that area. A lot of what your source of alpha is is</p>\n<h2>Beyond Berkeley and Stanford: Expanding the Research Network</h2>\n<p>coming from the Berkeley ecosystem. Uh obviously you&#x27;re not exclusively Berkeley. There&#x27;s a lot of &gt;&gt; more and more Stanford. &gt;&gt; More and more Stanford. &gt;&gt; I&#x27;d say kind of equal partnerships, &gt;&gt; right? Is there a risk of that you&#x27;re just doing only west coast universities and no like you know the good ideas come from anywhere right &gt;&gt; that&#x27;s true and we have massive focus to beyond Berkeley Stanford I would say it&#x27;s power law big focus &gt;&gt; which obviously like wrote let&#x27;s let&#x27;s be objective Berkeley and Stanford have produced a lot so yeah more than anything else but walk around here right now and you&#x27;ll talk to Jackson Clark second year PhD from UIC think second year your first second year from UI in</p>\n<p>Illinois several UI teams here he&#x27;s running a thing called S bench we have teams Stanford and MIT uh sorry not Stanford CMU and MIT very well represented Wisconsin PhD students around here Caltech PhD students lots of great projects are of our slingshots I would say the majority are non Berkeley Stanford or something maybe I don&#x27;t I need to double check that number but lots of great projects and a heavy push one one example is I started this PhD club focus on entrepreneurship at Berkeley when I was a PhD student in 2012 called computer science grad</p>\n<p>entrepreneurs it transformed in my brain eventually to this venture upon computer science grant ventures CSGV and that was a pro prototype that turned into lot eventually so has this lineage I&#x27; been doing this a while PhD yeah yeah 2012 PhD club now we&#x27;ve taken that I&#x27;ve been that and I&#x27;ve went to University of Washington so starting with another west coast school and we started a club called agent there&#x27;s their CS department is in a building called Allen uh so it&#x27;s Allen graduate entrepreneurs agent it&#x27;s a PhD student club on entrepreneurship then we went to Isconin has started one</p>\n<p>called research to impact. There&#x27;s another one at UIC forming right now. There&#x27;s another one one at Stanford called saplings. So, but a big focus on going to find the PhD students who are interested in shipping their research at CMU, UAC, MIT, Wisconsin, Taltech, all the top 15 universities, Toronto, Waterlue and uh McGill. &gt;&gt; Yeah. And then the the like vector and ma so North America bringing Canada into the mix because they&#x27;ve got also equally great universities up there.</p>\n<p>&gt;&gt; Yeah. There is a really big focus on bringing creating a fat pipe of bandwidth to the root of where all the action like you can&#x27;t get around that the root is of all of it&#x27;s happening in Silicon Valley. Yeah. It&#x27;s really opening the the like flying them out here more engaging them deeply in the programs giving them money. Uh, let&#x27;s be honest, getting you as a mentor. &gt;&gt; That&#x27;s right. And animal collecting other Braden who did snorkel. He was a PhD of Chris Ray at Samford who went on to do a unicorn company. He joined a lot. So, assembling a partnership like a</p>\n<p>venture partnership, but for PhDs and researchers turn founder turn unicorn founder. &gt;&gt; Yeah. I want to get to open frontiers, but one more question about just the NSF, which I think you uh you mentioned</p>\n<h2>NSF Complementarity: Not Broken, Just Insufficient</h2>\n<p>once for for about data bricks, but also I think you&#x27;re trying to target the law grants as sort of NSF level prestige and and and and impact. I think one thing I maybe as like a spicy question is well what&#x27;s broken about the NSF process you&#x27;re trying to fix? &gt;&gt; Uh I don&#x27;t think NSF is broken. I love NSF. It has been probably the best investment the American popular public has ever made. Thousands xx return on their investments. I mentioned Google earlier, data bricks, all these researchers came from NSF funding. Uh</p>\n<p>and it&#x27;s just been a paradigm generation. So DARPA was important for at some point. There&#x27;s been these these paradigm shifts in how open research has been funded. DARPA was a key one. NSF&#x27;s been a key one. And now NSF is not is not big enough. It was $1 billion a year for computer science and that they&#x27;re trying to cut that into half of that. But we need $10 to hundred billion dollars to do frontier AI research. So it&#x27;s not broken. They are trying to break it more is insufficient. &gt;&gt; You need more NSF. &gt;&gt; And and I think in addition to the mechanisms NSF has used to to boy the</p>\n<p>money which are very effective. We have secret sauce in Silicon Valley of how startups find product market fit. We have really good pickers. We have venture capitalists that that have their own sort of evolutionary uh Hunger Games way of like finding who is great who are really good at at having intuition when they meet a person to pick the next winner. That&#x27;s a that&#x27;s a a unique approach that NSF does not use. They do not make a little venture partnership inspired group of research partners who go grant do grant writing. you don&#x27;t get</p>\n<p>equity back, but you do uh empower the right project. If you if you got good pickers, you can actually you can actually have much more effective deployment of a way you can actually deploy an order of magnitude less capital and have more impact with this approach and it&#x27;s very complimentary because you can still have traditional NSF. INSAP is is brings faculty, many of which are very near and dear friends, into a centralized organization that is in charge of deploying billions and billions of dollars of funding, has an insane track record, and we are going to complement that with a much more Silicon</p>\n<p>Valley inspired approach of a high velocity, turn the funding around really quickly, have very strong opinions about the type of research we fund and re and be very narrow in the type of research. NSF funds everything from like all types of research from biology to you know like computer to uh and beyond uh English research and anthropology and sociology like I said 1 billion to computer science 10 billion total so one10enth going computer science and NSF has to manage all of that law and law like approaches were focused very tightly on high impact computer science</p>\n<p>research yeah especially AI but AI systems you know crypto cryptography security in networking and architecture. Um, so like other areas besides core AI as well. So by being so laser focused, we can go deeper by bringing in researchers who have shipped, researchers who started companies, researchers who had found product market fit. We can actually identify projects that are more likely to become a data bricks or an Apache spar or array or an almarina sooner and and and with more confidence. And so I think it&#x27;s a very complimentary model, but nobody&#x27;s ever</p>\n<p>done it before. and you needed someone to kind of step up and propose a pretty fundamentally different architecture or organization shape like you need to hire people in a different way. It&#x27;s a nonprofit which is you know got its own challenges but you wanted to behave in a very lean extremely high velocity way like a startup. So that&#x27;s what we did. It&#x27;s working amazingly so far. &gt;&gt; Congrats on on everything. Final question. Uh we have the open frontiers</p>\n<h2>The Laud Lounge: Creating a VIP Experience at NeurIPS</h2>\n<p>uh announcement and you&#x27;re also doing the law launch here in Euros. How are you able to get such amazing people? You got Oral Vignyals and Jeff Dean and I saw Dylan Patel was a long long one. Yeah, that&#x27;s so fun. &gt;&gt; Uh so so basically like uh what is open frontiers? Where is this all going? &gt;&gt; Great. Yeah. So L lounge basically Nurips has needed a VIP lounge. We have VVIPs the gods of computer science and AI is you know obviously AI particularly walking around the halls of that Giants conference hall. It&#x27;s actually hard to</p>\n<p>find a chair much less a comfortable couch. You got meeting room 23A on good. [laughter] &gt;&gt; Yeah. &gt;&gt; No, no, no. It&#x27;s It&#x27;s not a VIP launch at all. It&#x27;s just Yeah. Yeah. So, the idea here is open 8 to 10, 8 a.m. to 10 p.m. Identifi and it&#x27;s not too hard to know who the big names are. The high impact researchers, Yan Stoka, France Shalet, Yen. Yeah, Jen D is over there and I mean Tallwalker and we kind of know the circles already. So, it just took a lot of emails and texts to like, &quot;Hey, if you&#x27;re going to be in nerves, cross the</p>\n<p>street. We&#x27;re just going to throw VIP lounge Wednesday, Thursday, Friday, free food, Starlink, Wi-Fi, open all day, chat with us. You want to jump on a podcast. You want to talk to some talk to Swix.&quot; I mean, you&#x27;re a big draw here, too. Uh, walking through, people like, &quot;Oh, is that Swix?&quot; &gt;&gt; Yeah. Like, you just walk through and you feel important and you are important if you&#x27;re hanging out here. So, it&#x27;s it&#x27;s working. So it&#x27;s like the MVP of open frontiers. &gt;&gt; Okay. So that&#x27;s that&#x27;s Law Lounge. Open Frontier is a project that I&#x27;ve been cooking on for a while in my brain, but</p>\n<h2>Open Frontiers: Reclaiming Leadership in Open AI Research</h2>\n<p>really has come together in the last 3 weeks really quickly. It&#x27;s inspired by the core premise of open research that happen that that is symbolized by Nurups, right? People publishing their ideas. And what&#x27;s happened in the last year is western open science and research discourse has no has has lost the number one spot to China. So uh we if you ask Stanford and Berkeley PhD</p>\n<h2>The Open Research Crisis: Why</h2>\n<p>students which I have dozens of them and they&#x27;re hanging around here I&#x27;m going to introduce you where where are the best papers the most interesting papers about AI coming they&#x27;ll say I read twice as many interesting papers by Chinese startups than I did by Americans because really just make an effort. &gt;&gt; Yep. Moonshot, Kimmy, Deep Seek, they&#x27;re publishing really interesting stuff. They make an effort to talk about it. Whereas in the United States, since OpenAI closed their doors and stopped publishing, so did all the other labs. And by and large, you go and you don&#x27;t get to publish. You are actually working on the frontier at those labs, but you&#x27;re not talking about it. &gt;&gt; And so, &gt;&gt; so you need to open the frontier.</p>\n<p>&gt;&gt; The so the the openness is the key word. Um, Open AI was called Open AI and they were open for a while and now they&#x27;re not. We need something that fills in that gap to be a champion and bring together all open researchers to put forward a unified front at the so that we can operate at the frontier. And so that&#x27;s what the goal of this thing is to bring together every single organization that is leading in open research. So Allen Institute, France law will be around for ARC prize foundation. We have Berkeley, Stanford, Skyab, Berkeley AI</p>\n<p>research bearer. You got you know the like Yedjin&#x27;s lab and Marin the project of Percy Leang who&#x27;s kind of very senior at HAI and runs the center for uh &gt;&gt; foundation modelation models. &gt;&gt; He coined the term. &gt;&gt; Exactly. Yeah. Foundation model. So and Percy was in the lab with a lot of this is just my my network because Percy and I were in the same as lab with mate and all the other data bricks founders back in 2008 back at Berkeley. So it wasn&#x27;t hard to go find these people. Everyone I&#x27;ve approached said yes. The idea is like let&#x27;s team up, get together one day</p>\n<p>in San Francisco in the next five months and get the hundred most influential open researchers together for a conference and for meetings where we share our road maps and we talk about common goals amongst the entire ecosystem. It&#x27;s kind of surprising this hasn&#x27;t happened yet. And the the the thing we&#x27;re basically doing is making an open frontier lab effort starting with a conference. &gt;&gt; Yeah. And it&#x27;s live streamed so they&#x27;ll actually open so that we actually can actually like embody the democratic principles that have gotten us to where we are today. Get an order of magnitude more people in the world watching the</p>\n<p>breakthroughs that are happening in these labs. All the continual learning, prompt optimization, BLM SG, breakthroughs in inference, breakthroughs in evaluations, terminal bench and a lot of other I just heard for the first time about this benchmark called impossible bench. It&#x27;s a genius idea. I haven&#x27;t talked about it with you until Yeah. just so um that that dissemination of what&#x27;s actually happening will capture the world&#x27;s attention and in turn the goal is to with the world&#x27;s attention help this become to gel into uh the a well enough funded and resourced collaboration team</p>\n<p>up of the ecosystem that we can once again become number one at open frontier research uh because that should be so hard it shouldn&#x27;t you talked to like yeah it shouldn&#x27;t And then I was like, &quot;How about we just put this conference together?&quot; They&#x27;re like, &quot;That&#x27;s a good idea.&quot; Okay, we&#x27;re doing it. &gt;&gt; Well, thanks for kicking it off. I&#x27;m excited to support it in any way I can. And I&#x27;m see I&#x27;m sure you&#x27;ll be there and I&#x27;m sure everybody will be like, &quot;How do we get on with Swix?&quot; &gt;&gt; Thank you so much. &gt;&gt; Yeah, my pleasure. [music]</p>", "chapters_count": 10}