{"video_id": "ck63uv6APBA", "title": "Goodfire AI’s Bet: Interpretability as the Next Frontier of Model Design — Myra Deng & Mark Bissell", "link": "https://www.youtube.com/watch?v=ck63uv6APBA", "published": "2026-02-05T20:45:28+00:00", "summary": "From Palantir and Two Sigma to building Goodfire into the poster-child for actionable mechanistic interpretability, Mark Bissell (Member of Technical Staff) and Myra Deng (Head of Product) are trying to turn “peeking inside the model” into a repeatable production workflow by shipping APIs, landing real enterprise deployments, and now scaling the bet with a recent $150M Series B funding round at a $1.25B valuation. (https://www.goodfire.ai/blog/our-series-b)\n\nIn this episode, we go far beyond the usual “SAEs are cool” take. We talk about Goodfire’s core bet: that the AI lifecycle is still fundamentally broken because the only reliable control we have is data and we post-train, RLHF, and fine-tune by “slurping supervision through a straw,” hoping the model picks up the right behaviors while quietly absorbing the wrong ones. Goodfire’s answer is to build a bi-directional interface between humans and models: read what’s happening inside, edit it surgically, and eventually use interpretability during training so customization isn’t just brute-force guesswork. (https://www.goodfire.ai/blog/on-optimism-for-interpretability)\n\nWe discuss:\n• Myra + Mark’s path: Palantir (health systems, forward-deployed engineering) → Goodfire early team; Two Sigma → Head of Product, translating frontier interpretability research into a platform and real-world deployments\n• What “interpretability” actually means in practice: not just post-hoc poking, but a broader “science of deep learning” approach across the full AI lifecycle (data curation → post-training → internal representations → model design)\n• Why post-training is the first big wedge: “surgical edits” for unintended behaviors likereward hacking, sycophancy, noise learned during customization plus the dream of targeted unlearning and bias removal without wrecking capabilities\n• SAEs vs probes in the real world: why SAE feature spaces sometimes underperform classifiers trained on raw activations for downstream detection tasks (hallucination, harmful intent, PII), and what that implies about “clean concept spaces”\n• Rakuten in production (https://www.goodfire.ai/research/rakuten-sae-probes-for-pii-detection): deploying interpretability-based token-level PII detection at inference time to prevent routing private data to downstream providers plus the gnarly constraints: no training on real customer PII, synthetic→real transfer, English + Japanese, and tokenization quirks\n• Real-time steering at frontier scale: a demo of steering Kimi K2 (~1T params) live and finding features via SAE pipelines, auto-labeling via LLMs, and toggling a “Gen-Z slang” feature across multiple layers without breaking tool use\n• Hallucinations as an internal signal: the case that models have latent uncertainty / “user-pleasing” circuitry you can detect and potentially mitigate more directly than black-box methods\n• Steering vs prompting (https://www.goodfire.ai/blog/feature-steering-for-reliable-and-expressive-ai-engineering): the emerging view that activation steering and in-context learning are more closely connected than people think, including work mapping between the two (even for jailbreak-style behaviors)\n• Interpretability for science: using the same tooling across domains (genomics, medical imaging, materials) to debug spurious correlations and extract new knowledge up to and including early biomarker discovery work with major partners\n\n—\n\nGoodfire AI\n• Website: https://goodfire.ai\n• LinkedIn: https://www.linkedin.com/company/goodfire-ai/\n• X: https://x.com/GoodfireAI\n\nMyra Deng\n• Website: https://myradeng.com/\n• LinkedIn: https://www.linkedin.com/in/myra-deng/\n• X: https://x.com/myra_deng\n\nMark Bissell\n• LinkedIn: https://www.linkedin.com/in/mark-bissell/\n• X: https://x.com/MarkMBissell\n\n00:00 Introduction\n00:45 Welcome + episode setup + intro to Goodfire\n02:16 Fundraise news + what’s changed recently\n02:44 Guest backgrounds + what they do day-to-day\n05:52 “What is interpretability?” (SAEs, probing, steering and quick map of the space)\n08:29 Post-training failures (sycophancy/reward hacking) + using interp to guide learning\n10:26 Surgical edits: bias vectors + grokking/double descent + subliminal learning\n14:04 How Goodfire decides what to work on (customers → research agenda)\n16:58 SAEs vs probes: what works better for real-world detection tasks\n19:04 Rakuten case study: production PII monitoring + multilingual + token-level scrubbing\n22:06 Live steering demo on a 1T-parameter model (and scaling challenges)\n25:29 Feature labeling + auto-interpretation + can we “turn down” hallucinations?\n31:03 Steering vs prompting equivalence + jailbreak math + customization implications\n38:36 Open problems + how to get started in mech interp\n46:29 Applications: healthcare + scientific discovery (biomarkers, Mayo Clinic, etc.)\n57:10 Induction + sci-fi intuition (Ted Chiang)", "transcript_html": "<p><strong>[00:00]</strong></p>\n<p>If you ask 50 people who quote unquote work in interp like what is interpretability, you'll probably get [music] 50 different answers to some extent. Also, like we're where Goodfire sits in the space. We're an AI research company above all else and interpretability is a is a set of methods that we think are really useful and worth [music] kind of specializing in in order to accomplish the goals we want to accomplish. But I think we also sort of see some of the goals as even more broader as as almost like the science of deep learning and just taking a not blackbox [music] approach to sort of internal representations and then</p>\n<p>bringing interpretability to training which I don't think has been done all that much before. So welcome to the lane space. We're back in the studio with our special mech co-host Vivu. Welcome >> Mochi. Moi special co-host >> and Mochi the mechanistic interpretability doggo. Uh we have with us Mark and Myra from Goodfire. Welcome. >> Thanks for having us on. >> Maybe we can sort of introduce Goodfire</p>\n<p>and then and then introduce you guys. How do you introduce Goodfire today? >> Yeah. Uh it's a great question. So GoodFire we like to say is an AI research lab that focuses on using interpretability to understand, learn from, and design AI models. And we really believe that interpretability will unlock the new generation, next frontier of safe and powerful AI models. Um, that's our description right now. And I'm excited to dive more into the work we're doing to make that happen.</p>\n<p>>> Yeah. And there's there's always like the official description. Is there like an unofficial one that sort of resonates more with a different audience? Well, being an AI research lab that's focused on interpretability, there's obviously a lot of people have a lot that they think about when they think of interpretability. And I think we have a pretty broad definition of what that means and the types of places that can be applied and in particular applying it in production scenarios in highstakes industries and really taking it sort of from the research world into the real</p>\n<p>world which you know it's a it's a new field so that hasn't been done all that much and we're excited about actually seeing that sort of put into put into practice. Yeah, I would say it's it wasn't too long ago that topic was like still putting out like toy models or supervisition and that kind of stuff. And I wouldn't have pegged it to be this far along. Uh when you and I talked at New Reps, you were talking a little bit about your production use cases and your customers. And then not to bury the lead, today we're also announcing the fund raise uh your series B $150 million</p>\n<p>at a 1.25b valuation. Congrats. You're a unicorn. >> Thank you. Yeah. No, things move fast. We were talking to you in December and already some big updates since then. >> Let's dive I guess into a bit of your backgrounds as well. Mark, you you were at Palanteer uh working on health stuff which is uh really interesting because uh GoodFire has some interesting like health use cases. I don't know how related they are in practice.</p>\n<p><strong>[03:01]</strong></p>\n<p>>> Yeah. Not not super related but um I don't know it was helpful context to know what it's like just to work with uh health systems and generally in that domain. >> Yeah. And Mara, you were at Two Sigma, which actually I was also at, uh, Two Sigma. Really back in the day. >> Wow, nice. Did we overlap at all? >> No. Uh, this is this is when I was the briefly a software engineer before I became a sort of developer relations person and now you head of product. >> What are your sort of respective roles just to introduce people to like what all gets done in Goodfire? >> Yeah, prior to Goodfire, I was at Palunteer for about 3 years uh as a as a</p>\n<p>forward deployed engineer, now a now a hot term. uh wasn't always that way and as a technical lead on the healthcare team and at Goodfire I'm a member of the technical staff um and honestly that I think is about as specific as [laughter] like as as I could describe myself cuz I've worked on a range of things and you know it's it's a fun time to be at a team that's still reasonably small. I think when I joined one of the first like 10 employees now we're above 40 but still it looks like there's always a mix</p>\n<p>of research and engineering and product and all of the above that needs to get done and I think everyone across the team is is you know pretty pretty switch hitter in the roles they do. So I think you've seen some of the stuff that that I worked on related to image models which was sort of like a research demo. More recently, I've been working on our scientific discovery team with some of our life sciences partners, but then also building out our our core platform from more of like a flexing some of the kind of MLE and and developer skills as well. >> Very generalist. Um, and you you also</p>\n<p>had like a very like a founding engineer type role. >> Yeah. Yeah. So, I I also started as I still am member of technical staff. Did a wide range of things from the very beginning including like finding our office space and all of these like nittygritty. people visited when you had that open house thing. It was really nice. >> Thank you. Thank you. Yeah. Plug to come visit our office. Um >> like it was it was like 200 people like it has room for 200 people but there you guys were like 10. [laughter and clears throat] >> Yeah. >> For a while it was very empty. >> But yeah like like Mark I I spend a lot</p>\n<p>of my time as as head of product. I think product is a bit of a weird role these days, but a lot of it is thinking about um how do we take our frontier research and really apply it to the most important real world problems and how does that then translate into a platform that's repeatable or a product and working across you know the engineering and research teams to make that happen. And also communicating to the world like what is interpretability, what is it used for, what is it good for, um why is it so important? All of these things are</p>\n<p>part of my day-to-day as well. >> I love like what is things because that's a very crisp like starting point for people like coming to a field. Leo I'll do a fun thing VU why you want to try tackling what is interpretability and then they can correct us. >> Okay great. Um so I think like one just to kick off it's a very interesting role to be hit a product right because you guys at least as a lab you're more of an applied interp lab right which is pretty</p>\n<p><strong>[06:03]</strong></p>\n<p>different than just normal interp like a lot of background research but you guys actually ship an API to try these things you have ember you have products around it which not many do okay what is interp so basically you're trying to have an understanding of what's going on in model like in the model in the internals so different approaches to do that you can do probing saes transcoders, all this stuff. But basically, you have an you have a hypothesis. You have something that you want to learn about what's happening in a model internals and then you're trying to solve that. From there, you can do stuff like you can, you know, you can do activation</p>\n<p>mapping. You can try to do steering. There's a lot of stuff that you can do. But the key question is, you know, from input to output, we want to have a better understanding of what's happening and, you know, how can we how can we adjust what's happening on the model internals? How'd I do? >> That was really good. I think that was great. I I think it's also a it's kind of a minefield of a if you ask 50 people who quote unquote work in interp like what is interpretability, you'll probably get 50 different answers. And to some extent also like where where</p>\n<p>GoodFire sits in the space. I think that we're an AI research company above all else and interpretability is a is a set of methods that we think are really useful and worth kind of specializing in in order to accomplish the goals we want to accomplish. But I think we also sort of see some of the goals as even more broader as as almost like the science of deep learning and just taking a not blackbox approach to kind of any part of the like AI development life cycle whether that means using inter for like data curation while you're training your</p>\n<p>model or for understanding what happened during post- training or for the you know understanding activations and sort of internal representations what is in there semantically and then a lot of sort of exciting updates that were, you know, are sort of also part of the the fund raise around bringing interpretability to training, which I don't think has been done all that much before. A lot of the stuff is sort of post talk poking at models as opposed to actually using this to intentionally design them. Is this post- training or pre-training or is is that not</p>\n<p>>> focused on post- training? But there's no reason the techniques wouldn't also work in pre-training. It seems like it would be more act applicable post training because basically I I'm thinking like rollouts or like um you know having different variations of a model that you can tweak with your >> steering. Yeah. And I think in a lot of the news that you've seen in in on like Twitter or whatever, you've seen a lot of unintended side effects come out of post-training processes. You know, overly sycopantic models or models that exhibit oh god strange reward hacking</p>\n<p>behavior. I think these are like extreme examples. There's also, you know, very uh mundane more mundane like enterprise use cases where, you know, they try to customize or post-train a model to do something and it learns some noise or it doesn't appropriately learn the target task. And a big question that we've always had is like how do you use your understanding of what the model knows</p>\n<p><strong>[09:03]</strong></p>\n<p>and what it's doing to actually guide the learning process more effectively? >> Yeah. I mean, you know, just to anchor this for people, uh, la one of the biggest controversies of last year was 40 glazegate. [laughter] I've never heard I didn't know that was what it was called. >> No, the other one they called it that on the blog post and I was like [laughter] why the opening I call it like officially used that term and I'm like that's funny but like yeah I I guess is is the pitch that if they had worked to a good fire they wouldn't have avoided it like you know [laughter] >> I think so. >> Yeah. >> I I think that's certainly one of the use cases I think and another reason why</p>\n<p>post training is a place where this makes a lot of sense is a lot of what we're talking about is surgical edits. you know, you want to be able to have expert feedback very surgically change how your model is doing. Whether that is, you know, removing a certain behavior that it has. So, you know, one of the things that we've been looking at or is is another like common area where you would want to make a somewhat surgical edit is some of the models that have say political bias. Like you look at Quen or um R1 and they have sort of like this CCP bias in them. And you know,</p>\n<p>>> is there a CCP vector? Well, there's there are certainly internal Yeah. parts of the representation space where you can sort of see where that lives. Yeah. [laughter] Um and you want to kind of, you know, extract that piece out. >> Well, I always say, you know, whenever you find a vector, a fun exercise is just like make it very negative to see what what the opposite of CCP is. [laughter] >> The Super America bald eagles flying everywhere. But yeah, so in general like lots of post- training tasks where you'd want to be able to to do that whether it's unlearning a certain behavior or you know some of the other kind of cases</p>\n<p>where this comes up is are you familiar with like the the groing behavior? >> I mean I know the machine learning term of groing. >> Yeah. sort of this like double descent idea of of having a model that is able to learn a generalizing a generalizing solution as opposed to even if memorization of some task would suffice, you want it to learn the more general way of doing a thing. And so, you know, another way that you can think about having surgical access to a model's internals would be learn from this data</p>\n<p>but learn in the right way. um if there are many possible you know ways to to do that >> can meant trips solve the double descent problem >> depends I guess on how you >> okay so I I I view that double ascent as a problem because then you're like well if the loss curves level out then you're done but maybe you're not done >> right [clears throat] right >> but like if you actually can interpret what is uh generalizing or what is what is still changing even though the loss is not changing then maybe you you can actually not view it as a double the</p>\n<p>problem and actually you're just sort of uh translating the space in which you view loss and you like then you have a smooth curve. >> Yeah, [laughter] I I think that's certainly like the domain of of problems that we're that we're looking to get at. Yeah. to me like double descent is like the biggest thing to like ML research where like if you believe in scaling then you don't you need to know where to scale and but if you believe in double</p>\n<p><strong>[12:04]</strong></p>\n<p>descent then you don't you don't believe in anything where like anything levels off like [laughter] >> yeah I mean also tangentially there's like okay when you talk about the China vector right there's the subliminal learning work it was from the anthropic fellows program where basically you can have hidden biases in a model and as you distill down or you know as you train on distilled data, those biases always show up even if like you explicitly try to not train on them. So, you know, it's just like another use case of okay, if we can interpret what's happening in post- training, you know, can we clear</p>\n<p>some of this? Can we even determine what's there? Because, yeah, it's just like some worrying research that's out there that shows, you know, we really don't know what's going on. >> That is, yeah, I think that's the biggest sentiment that we're sort of hoping to tackle. Nobody knows what's going on, right? Like subliminal learning is just an insane concept when you think about it, right? Train a model on not even the lojits literal literally the output text of a bunch of random numbers and now your model loves owls. And you see behaviors like that that are just they defy they defy intuition and</p>\n<p>and there are mathematical explanations that you can get into, but >> I mean early days >> objectively there are a sequence of numbers that are more allike than others. There there should be >> according [laughter] to according to certain models, right? It's interesting. I think it only applies to models that were initialized from the same starting >> usually. Yes. But I mean I think that's a that's a cheat code because there's not enough compute. But like it if you believe in like platonic representation like probably will transfer across</p>\n<p>different models. >> Oh, you think so? I think of it more as a statistical artifact of models initialized from the same seed sort of um there's something that is like path dependent from that seed that might cause certain overlaps in the latent space and then sort of doing this distillation. Yeah. Like pushes it towards having certain other tendencies. >> Got it. >> I think research >> a bunch of these open-ended questions, right? like you can't train in new stuff</p>\n<p>during the RL phase, right? RL only reorganizes weights and you can only do stuff that's somewhat there in your base model. You're not learning new stuff. You're just reordering chains and stuff. But okay, my broader question is when you guys work at an interp lab, how do you decide what to work on and what's kind of the thought process? Right? Cuz we can ramble for hours. Okay, I want to know this, I want to know that, but like how do you concretely like you know what's the workflow? Okay, there's like approaches towards solving a problem, right? I can try prompting. I can look at chain of thought. I can train probes,</p>\n<p>SAEs. But how do you determine, you know, like okay, is this going anywhere? Like do we have set stuff? Just, you know, if you can talk about that. >> It's a really good question. I feel like we've always um at the very beginning of the company thought about like let's go and try to learn what isn't working in machine learning today. whether that's talking to customers or talking to researchers at other labs trying to understand um both where the frontier is</p>\n<p><strong>[15:04]</strong></p>\n<p>going and where things are are really not falling apart today and then developing a perspective on how we can push the frontier using interpretability methods. Um and so you know even our chief scientist Tom spends a lot of time talking to customers and trying to understand what real world problems are and then taking that back and trying to apply the current state-of-the-art in inter to those problems and then seeing where they fall down basically and then uh using that those failures or those shortcomings to understand what hills to</p>\n<p>climb when it comes to interpretability uh research. So like on the fundamental side for instance when we have done some work applying SAE and and probes we've encountered you know some shortcomings in in Saes that we found a little bit surprising and so have gone back to the drawing board and and done work on um better foundational interpreter models and a lot of our team's research is focused on what is the next evolution beyond SAES for instance and then when it comes to like control and design of</p>\n<p>models you know we tried steering with our first API and realized that it still fell short of blackbox techniques like prompting or fine-tuning and so went back to the drawing board and were like how do we make that not the case and how do we improve it beyond that and one of our researchers ECDE who just joined is actually ECDE and Attakus are like steering experts and and have spent a lot of time trying to figure out like what is the research that enables us to actually do this in a much more powerful robust way. So yeah, the answer is like look at real world problems, try to</p>\n<p>translate that into a research agenda and then like hill climb on on both of those at the same time. >> Yeah, Mark has the steering CLI demo queued up which we're going to go into a sec, but I always want to double click on when you drop hints like we found some problems with SAEs. Okay, what are they? You know, and uh let's let's then we then we can go into the demo. >> Yeah, I mean I I'm curious if you have more thoughts here as well because you've done it in in the healthcare domain. Um, but I think like for instance when we do things like trying to detect behaviors within models that</p>\n<p>are harmful or like behaviors that a user might not want to have in their model. So hallucinations for instance, harmful intent, PII, all of these things. We first tried using SAPE probes for a lot of these tasks. So taking the feature activation space from SAEs and then training classifiers on top of that and then seeing how well we can detect the properties that we might want to detect in model behavior. And we've seen in many cases that probes just trained on raw activations seem to perform</p>\n<p>better than SAPE probes, which is a bit surprising if you think that SAEs are actually also capturing the concepts that you would want to capture cleanly and more surgically. And so that is an interesting observation. I don't think that is like I'm not down on SAEs at all. I think there are many many things they're useful for. But we have definitely run into cases where I think the concept space described by SAEs is</p>\n<p><strong>[18:05]</strong></p>\n<p>not as clean and uh accurate as as we would expect it to be for actual like real world downstream performance um metrics. >> Fair enough. >> Yeah. >> Yeah. It's the blessing and the curse of unsupervised methods where you got to peek into the AI's mind, but sometimes you wish that you saw other things when you when you looked [laughter] inside there. >> Although in the in the PII instance, I think weren't SA an SAPE based approach actually did prove to be the most generalizable. >> Well, in in the case that we published with Rocketin and I think a lot of the reasons it worked well was because we</p>\n<p>had a noisier data set. And so actually the blessing of unsupervised learning is that we actually got uh to get more meaningful generalizable signal from SAEs when the data was noisy. But in other cases where we've had like good data sets, it hasn't been the case. >> And just because you named Rakutin and I don't know if we'll get it another chance like uh what what is the overall like what is Rakutin's uh usage uh or production usage? Yeah. So they are using us to essentially guard rail and inference time monitor their language</p>\n<p>model usage and their agent usage to detect things like PII so that they don't route um private user information to um downstream model providers. And so that's you know going through all of their user queries uh every day. And that's something that we deployed with them a few months ago. And now we are actually exploring um very early partnerships not just with Rocketin but with other people around how we can help with potentially training and customization use cases as well.</p>\n<p>>> Yeah. And for those who don't know like it's Racketin is like I think number one or number two e-commerce >> store in Japan. >> Yes. >> Yeah. Yeah. And I think that use case actually highlights a lot of like what it looks like to deploy things in practice that you don't always think about when you're doing sort of research tasks. So when you think about some of the stuff that came up there that's more complex than your idealized version of a problem, they were encountering things like synthetic toreal transfer of methods. So they couldn't train probes, classifiers, things like that on actual</p>\n<p>customer data of PII. So what they had to do is use synthetic data sets and then hope that that transfers out of domain to real data sets and so we could evaluate performance on the real data sets but not not train on customer PII. So that right off the bat is like a big challenge. You have multi-ingual requirements. So this needed to work for both English and Japanese text. Japanese text has all sorts of quirks including tokenization behaviors that caused lots of bugs that caused us to be pulling our hair out. And then also a lot of tasks</p>\n<p>you'll see you might make simplifying assumptions if you're sort of treating it as like the easiest version of the problem to just sort of get like general results where maybe you say you're classifying a sentence to say does this contain PII but the need that racketin had was token level classification so that you could precisely scrub out the PII. So as we learned more about the</p>\n<p><strong>[21:07]</strong></p>\n<p>problem and you're sort of speaking about what that looks like in practice. Yeah. a lot of assumptions end up breaking and that was just one instance where you a problem that seems simple right off the bat ends up being more complex as you keep diving into it. >> Excellent. One of the things that's also interesting with interp is a lot of these methods are very efficient right so where you're just looking at a model's internals itself compared to a separate like guardrail LM as a judge a separate model one you have to host it two there's like a whole latency so if you use like a big model you have a second call some of the work around like</p>\n<p>self detection of hallucination it's also deployed for efficiency right so thinking of someone like rakuten doing it in production live you know that's just another thing people should consider Yeah. And something like a probe is super lightweight. Adds no extra latency really. >> Excellent. Uh you have the steering demos uh lined up. So we were just kind of see what you got. I I don't I don't actually know if this is like the latest latest or like alpha thing. >> No, this is a pretty hacky demo from uh from a presentation that someone else on</p>\n<p>the team recently gave. So this will give a sense for for steering in action. Honestly, I think the biggest thing that this highlights is that as we've been growing as a company and taking on kind of more and more ambitious versions of interpretability related problems, a lot of that comes to scaling up in various different forms. And so here you're going to see steering on a one trillion parameter model. This is Kimmy K2. Uh, and so it's sort of fun that in addition to the research challenges, there are</p>\n<p>engineering challenges that we're now tackling because for any of this to be sort of useful in production, you need to be thinking about what it looks like when you're using these methods on frontier models um as opposed to sort of like toy kind of model organisms. So yeah, this was thrown together hastily, pretty fragile behind the scenes, but uh I think it's quite a fun demo. So screen sharing is is on. So, I've got two terminal sessions pulled up here. On the left is a forked version that we have of the Kimmy uh CLI that we've got running to point at our custom hosted Kimmy</p>\n<p>model. And then on the right is a uh setup that will allow us to steer on certain concepts. So, I should be able to chat with Kimmy over here. Tell it hello. >> Is this running locally? So the CLI is running locally, but the Kimmy server is running back to the office. Well, hopefully should be. [laughter] Um, >> that's too much to run on that Mac. >> Yeah, I think it's uh it takes a full like H100 node. I think it's like you can run it on 8GPUs. H100. So So yeah,</p>\n<p>Kimmyy's running. We can ask it to prompt. It's got a forked version of our uh of the SGline codebase that we've been working on. So I'm going to tell it, hey, this SGLine codebase is slow. I think there's a bug. Can you try to figure it out? It's a big code base, so it'll it'll spend some time doing this. And then on the right here, I'm going to initialize in real time some steering.</p>\n<p><strong>[24:09]</strong></p>\n<p>Let's see here. Continue searching for any bugs. >> Feature ID 43205 layers 20 30 40. >> So, let me uh this is basically a feature that we found that inside Kimmy seems to cause it to speak in Gen Z slang. >> [laughter] >> And so on the left, it's still sort of thinking normally. It might take, I don't know, 15 seconds for this to kick in, but then [clears throat] we're going to start hopefully [laughter] seeing it. Dude, this code base is massive for</p>\n<p>real. [laughter] So, we're going to start seeing Kimmy transition as the steering kicks in from normal Kimmy to Gen Z Kimmy [laughter] and both in its chain of thought and its actual outputs. And interestingly, you can see, you know, it's still able to call tools uh and stuff. It's um it's purely sort of its its demeanor. And there are other features that we found for interesting things like concision. So, that's more</p>\n<p>of a practical one. You can make it more concise. Um the types of programs uh programming languages it uses. But yeah, as we're seeing it come in, pretty good output. >> Scheduler code is actually wildl [laughter] um something about how agents for interp</p>\n<p>is different than like coding agents. I don't know. While this is spewing up, how how do we find feature 43205? >> Yeah. So, in this case, um we our platform that we've been building out for a long time now supports all the sort of classic out of the box interp techniques that you might want to have like SAPE training, probing, things of that kind. I'd say the techniques for like vanilla ses are pretty wellestablished now where you take your model that you're interpreting run a</p>\n<p>whole bunch of data through it gather activations and then yeah pretty straightforward pipeline to train an SAPE there are a lot of different varieties there's top kes batch top kes um normal relu seaes and then once you have your sparse features to your point assigning labels to them to actually understand that this is the Gen Z feature. That's actually where a lot of the kind of magic happens. And the most basic standard technique is look at all of your input data set examples that</p>\n<p>cause this feature to fire most highly and then you can usually pick out a pattern. So for this feature, if I've run a diverse enough data set through my model, feature 43.205 probably tends to fire on all the uh tokens that sound like Gen Z slang. And um so you know you could have a human go</p>\n<p><strong>[27:11]</strong></p>\n<p>through all 43,000 concepts and look at the pattern but to automate that you just kind of hand those examples off to a frontier LLM and ask it to identify that pattern. >> And I've got to ask the basic question you know can we get examples where it hallucinates pass it through see what feature activates for hallucinations? Can I just you know turn hallucination down? >> Oh wow. you you really uh solved it. >> You really predicted [laughter] some a project we're already working on right now, which is um detecting hallucinations using interpretability techniques. And this is interesting because hallucinations is something</p>\n<p>that's very hard to detect and it's like a kind of a hairy problem and something that blackbox methods really struggle with. Um whereas like Gen Z, you could always train a classifi a simple classifier to to detect that um hallucinations is harder. But we've seen that models internally have some awareness of of like uncertainty or some sort of like user pleasing behavior that leads to hallucinatory behavior. Um, and so yeah, we have a project that's trying to detect that accurately and then also working on mitigating the hallucinatory</p>\n<p>behavior in the model itself as well. >> Yeah. And I would say most people are still at the level of like, oh, I'll just turn temperature to zero and that turns off hallucination. And I'm like, well, that's a fundamental misunderstanding of how this works. >> Yeah. Although, so part of what I like about that question is you there are SAPE based approaches that might like help you get at that. But often times the beauty of SAEs and like we said the curse is that they're unsupervised. So when you have a behavior that you deliberately would like to remove and that's more of like a supervised task,</p>\n<p>often it is better to use something like probes and and specifically target the thing that you're interested in reducing as opposed to sort of like hoping that when you fragment the latent space, one of the vectors that pops out will be the thing you're interested in. And as much as we're training an autoenccoder to be sparse, we're not like for sure certain that, you know, we will get something that just correlates to hallucination, right? you'll you'll probably split that up into 20 other things and who knows what they'll be</p>\n<p>>> of course right yeah so there's known sort of problems with like feature splitting um and feature absorption and then there's the offt target effects right ideally you would want to be very precise where if you reduce the hallucination feature suddenly maybe your model can't write creatively anymore and maybe you don't like that but you want to still stop it from hallucinating facts and figures >> good uh so people has a paper to recommend there that we'll put in the show notes but yeah I mean I guess just because your demo is done. Uh any any other things that you want to highlight or any other interesting features you want to show?</p>\n<p>>> I don't think so. Yeah, like I said, this is a pretty small snippet. I think the main sort of point here that I think is exciting is that there's not a whole lot of inter being applied to models quite at at this scale. You know, Anthropic certainly has some some research and yeah, other other teams as well. But it's it's nice to see these techniques, you know, being put into practice. I think not that long ago the idea of real time steering of a trillion parameter model would have sounded</p>\n<p><strong>[30:12]</strong></p>\n<p>>> yeah the fact that it's real time like you you started the thing and then you edited uh the steering vector I think it's it's an interesting one uh TBD what the actual like production use case would be on that like the real-time editing um >> it's like that's the fun part of the demo right you can kind of see how this could be served behind an API right like you're you only have so many knobs and you can just tweak it a bit more and I don't know how it plays in people haven't done that much with like how does this work with or without prompting right how does this work with fine-tuning like there's the whole hype of continual learning right so there's</p>\n<p>just so much to see like is this another parameter like is it like parameter we just kind of leave it as a default we don't use it so I don't know maybe someone here wants to put out a guide on like how to use this with prompting when to do what >> oh well I have a paper recommendation that I think you would love from uh ectep on our team who um is an amazing research just can't say enough amazing things about act. He actually has a paper that as well as some you know others from from the team and elsewhere that go into the essentially equivalents</p>\n<p>of activation steering and in context learning and how those are from a he he thinks of everything in a cognitive neuroscience basian framework. But basically how you can precisely show how prompting in context learning and steering exhibit similar behaviors and even like get quantitative about the like magnitude of steering you would need to do to induce a certain amount of behavior similar to certain prompting uh even for things like jailbreaks and</p>\n<p>stuff. It's a really cool paper. >> Are you saying steering is less powerful than prompting? more like you can almost write a formula that tells you how to convert between the two of them and so >> be formally equivalent actually in the in the limit >> right so like one case study of this is for jailbreaks there I don't know have you seen the stuff where you can do like manyot jailbreaking you like flood the context with examples of the behavior >> when put out that paper a lot of people</p>\n<p>were like yeah we've been doing this guys like what [laughter] happens Yeah. Um, what's in this in context learning and activation steering equivalence paper is you can like predict the number of examples that you will need to to put in there in order to jailbreak the model. That's cool. >> By doing steering experiments and using this sort of like um equivalence mapping. >> That's cool. That's really cool. >> That's very neat. >> Yeah. I was going to say like uh you know I can like back rationalize that this makes sense because you know what context is is basically just you know it</p>\n<p>updates the KV cache kind of and like and and and then every next token inference is still like you know that the the sheer sum of everything all the weights plus all the context up to date and you could I guess theoretically steer that with uh you probably replace that with your um steering. The only problem is steering typically is on one layer, maybe three layers like like you did. So it's like not exactly equivalent.</p>\n<p><strong>[33:13]</strong></p>\n<p>>> Right. Right. There's sort of you need to uh get precise about Yeah. like how you sort of define steering and like what how how you're modeling the setup. But yeah, I've got the paper pulled up here. Belief dynamics reveal the dual nature. >> Yeah. The title is belief dynamics reveal the dual nature of in context learning and activation steering. So Eric Bigalow um Dana Warcraft on the um who are uh doing fellowships at Goodfire ECE's the the final author there. I think actually to your your question of like what is the production use case of steering I think maybe if you just think like one level beyond steering as as it</p>\n<p>is today like imagine if you could adapt your model to be I don't know an expert legal reasoner like in almost real time like very efficiently using human feedback or using like your semantic understanding of what the model knows and where it knows that uh behavior. I think that while it's not clear what the product is at the end of the day, it's clearly very valuable. Thinking about like what's the next interface for for model customization and adaptation is a</p>\n<p>really interesting um problem for us. Like we have heard a lot of people actually interested in fine-tuning and RL for openweight models in in production. And so people are using things like um Tinker or kind of like uh open source libraries to do that. But it's still very difficult to get models fine-tuned and RL for exactly what you want them to do unless you're an expert at at model training. And so that's like something we're looking into. >> Yeah. Um I never thought so Tinker from thinking machines famously uses uh rank</p>\n<p>one Laura. Is that basically the same as steering? Like you know what's the comparison there? >> Well, so in that case you are still applying updates to the parameters, right? You're not you're not touching a base model. You're you're touching an adapter. It's kind of >> Yeah. >> Right. But I I guess it still is like more in parameter space than I guess it's maybe like are you modifying the pipes or are you modifying the water flowing through the pipes? >> Okay. >> To get what you're after. >> Yeah. >> Is maybe one way. [laughter]</p>\n<p>>> I like that analogy. >> That that's my mental map of it at least. But it gets at this idea of model design and intentional design which is something that we're that we're very focused on. And just the fact that like I hope that we look back at how we're currently training models and post-training models and just think what a primitive way of doing that right now. Like there's no intentionality really in >> it's just data right the only thing can control what data we feed in. So, so Dan from Goodfire likes to use this analogy</p>\n<p>of um, you know, he has a couple of young kids and he talks about like, \"What if I could only teach my kids how to be good people by giving them cookies or like, you know, giving them a slap on the wrist if they do something wrong?\" Like not telling them why it was wrong or like what they should have done differently or something like that. Just figure out action. Right. Exactly.</p>\n<p><strong>[36:13]</strong></p>\n<p>>> So that's RL. >> Yeah. Right. And then, you know, it's sample inefficient. There's, you know, what do they say? It's like slurping uh feedback. It's like slurping supervision throughout. And so you'd like to get to the point where you can have experts giving feedback to their models that are uh internalized >> and and you know steering is >> an inference time way of sort of getting that idea but ideally you're moving to a a world where it is much more intentional design in perpetuity for</p>\n<p>these models. Okay, this is one of the questions we asked Emanuel from Anthropic on the podcast a few months ago. Basically, the question was, you're at a research lab that does model training, foundation models, and you're on an interp team. How does it tie back, right? Like, does this do ideas come from the pre-training team? Do they go back? Um, you know, so for those interested, you can you can watch that. There wasn't too much of a connect there, but it's still something, you know, it's something they want to push for down the line. >> It can be useful for all of the above. like there are certainly post hawk use</p>\n<p>cases where it doesn't need to touch that. I think the other thing a lot of people forget is this stuff isn't too computationally expensive right like I would say if you're interested in getting into research mechan is one of the most approachable fields right a lot of this train a probe this stuff like the budget for this one there's already a lot done there's a lot of open source work you guys have done some too um you know you can >> there's like there's like notebooks from the Gemini team from Neil Nanda who are like this is how you do it just step</p>\n<p>through the notebook >> even if you're like not even technical with any of this you can still make like progress there. You can look at different activations, but uh if you do want to get into training, you know, training this stuff, correct me if I'm wrong, is like in the thousands of dollars, not even like it's not that high scale. And then same with like, you know, applying it, doing it for post- training, RL, all this stuff is fairly cheap in scale of okay, I want to get into like model training. I don't have compute for like, you know, pre-training stuff. So, it's it's a very nice field to get into. And also, there's a lot of</p>\n<p>like open questions, right? There's so many questions we have. Some of them have to go with, okay, I want a product. I want to solve this. Like, there's also just a lot of open-ended stuff that people could work on that's interesting, right? I don't know if you guys have any calls for like what's open questions, what's open work that you either open collaboration with or like you'd just like to see solved or just, you know, for people listening that want to get into mechan because people always talk about it. What are what are things they should check out? Start of course, you know, join you guys as Well, I'm sure you're >> there's a paper I think from was it Lee uh Shy? It's open problems in</p>\n<p>interpretability which I recommend everyone who's interested in the field read. Um just like a really comprehensive overview of what are the things that experts in the field think are the most important problems to be solved. I also think to your point it's been really really inspiring to see I think a lot of young people getting interested in interpretability. actually not just young people also like</p>\n<p><strong>[39:14]</strong></p>\n<p>scientists who have been you know experts in physics for many years and in biology or things like this um transitioning into interp because the barrier to entry is is you know in in some ways low and and there's a lot of information out there um and ways to get started. There's this anecdote of like professors at university saying that all of a sudden every incoming PhD student wants to study interpretability um which was not the case a few years ago. So it just goes to to show how I guess like exciting the field is, how fast it's</p>\n<p>moving, how quick it is to get started and things like that. And also just a very welcoming community. You know, there's an open-source mechan slack channel where people are always posting questions and just folks in the space are always responsive if you ask things on various forums and stuff. Um, but yeah, the open paper uh open problems uh paper is is a really good one >> for other people who want to get started. I think you know Matts is a great program. What's the acronym for? Machine learning and alignment theory scholars I think. [laughter]</p>\n<p>>> It's like the normally summer internship style. >> Yeah. But they've been doing it year round now and um actually a lot of our full-time staff have come through that program or or gone through that program and um it's great for anyone who is transitioning into interpretability. Um there's a couple other fellows programs. we do one as well as anthropic and so those are great places to get started if anyone is is interested >> also I think been seen as a research field for a very long time but I think engineers are sorely wanted for for</p>\n<p>interpretability as well um especially at good fire but but elsewhere uh as as it does scale up >> I should mention that Lee actually works with you guys right and in the London office and um I'm adding our first ever meant track and edi Europe because I I see this industry applications now emerging and I'm pretty excited to, you know, help get push that along. >> Yeah, I >> it'll effectively be the first industry mechan conference. >> Yeah, I'm uh I'm so glad you added that.</p>\n<p>>> You know, it's it's a still a little bit of a bet like this there it's not like that widespread, but like I I can definitely see like this is the time to like really get into it like you want to be early on things >> for sure. And I think the field is understands this, right? So like at ICML the I think like title of the mech interp workshop this year was actionable interpretability and there was a lot of discussion around bringing it to to various domains. Um, >> everyone's everyone's adding like pragmatic pragmatic >> actionable like whatever like okay well we weren't actionable before I guess I</p>\n<p>don't know >> and I mean like just you know being at Europe you see the interp room uh one like old school conferences like I think they had a very tiny room till they got lucky and they got it doubled but there's definitely a lot of interest a lot of nich niche research so you see a lot of research coming out of university students we covered the paper uh last week it's two unknown authors, not many citations, but you know, you can make a</p>\n<p><strong>[42:16]</strong></p>\n<p>lot of meaningful work there. >> One thing I I did want to call out because I think people haven't really uh mentioned this yet is uh just interfer uh I think is is like an abnormally important field. We haven't mentioned this yet. The conspiracy theory last two years ago was when the first SA word came out of anthropic was they they were like, \"Oh, we just used uh SAEs to turn the bad code vector down [laughter] uh and then turn up and then code >> turn up the good code.\" Uh and uh I think like isn't that the the dream like you know like but basically I guess maybe why is it funny like it's it's if</p>\n<p>it was realistic it would not be funny it would be like no actually we should do this but it's funny because we know there's like we feel there's some limitations to what steering can do and I think a lot of the public image of uh steering is like the Gen Z stuff like like oh you can make it really love the Golden Gate Bridge or you can make it speak like Gen Z to like be a legal no reason or seems like a huge stretch. >> Yeah. >> And I don't know if that we'll get there this way. >> Yeah. I think um I will say we are announcing something very soon that I</p>\n<p>will not speak too [laughter] much about. Um but I think yeah, this is like what we've run into again and again is like we we don't want to be in the world where steering is only useful for like stylistic things. That's definitely not not what we're um aiming for. But I think the types of interventions that you need to do to get to things like legal reasoning um are much more sophisticated and require breakthroughs than in learning algorithms. And that's um >> and is this an emerging property of scale as well?</p>\n<p>>> I think so. Yeah. I mean I think scale definitely helps. I think scale allows you to learn a lot of information and and reduce noise across you know large amounts of data. But I also think we think that there's ways to do things much more effectively. um even even at scale. So like actually learning exactly what you want from the data and not learning things that you do that you don't want exhibited in the data. So we're not like anti-scale but we are also realizing that scale is not going to get us to the type of AI development</p>\n<p>that we want to be at in in the future as these models get more powerful and get deployed in all these sorts of like mission critical contexts. current life cycle of training and deploying and evaluations is is to us like deeply broken and and has opportunities to to improve. So uh more to come on that very very soon >> and I think that the basically maybe are just like a proof point that these concepts do exist like if you can manipulate them in the precise best way you can get the ideal combination of</p>\n<p>them that you desire and steering is maybe the most coar grained sort of peak at what that looks like but I think it's evocative of what you could do if you had total surgical control over >> every >> concept every parameter. Yeah, exactly. >> There were like bad code features. >> I've got it pulled up >> just coincidentally as you guys were talking. So, >> this was like this is exactly what</p>\n<p><strong>[45:17]</strong></p>\n<p>people thought it >> there's like specifically a code error feature that activates and they show it off. It's not it's not typo detection. It's like it's it's typos in code. It's not typical typos. And you know, you can you can see it clearly activates where there's something wrong in code. And they have like malicious code, code error. They have a whole bunch of sub, you know, subbroken down little grain features. >> Yeah. >> Yeah. So, so the the rough intuition for me, the why I talked about post training was that well, you just, you know, have a few different rollouts with all these things uh turned off and on and whatever</p>\n<p>and then, you know, you can that's that's synthetic data you can kind of post train on. >> Yeah. >> And I think we make it sound easier than it is just saying, you know, do they they do the real hard work. >> I mean, you guys you guys have the right idea. Exactly. Yeah. We replicated a lot of these features in in our llama models as well. I remember there was like >> and I think a lot of this stuff is open right like yeah you guys opened yours um deep mind has opened a lot of essays on um Gemma even anthropic has opened a lot of this there's there's a lot of resources that you know we can probably share of people that want to get</p>\n<p>involved >> and special shout out to like Neuronedia as well like uh yeah amazing piece of work to visualize those things >> yeah exactly >> I guess I wanted to pivot a little bit on onto the healthcare side uh because I I think that's a big use case for you guys. Uh we haven't really talked about it yet. This is a bit of a crossover for me because we are se we are we do have a separate science pod that we're starting up for [laughter] science. >> Wow. Okay. >> Uh just because like it's such a huge investment category and also I'm like less qualified to do it. We actually have bio PhDs to cover that which is</p>\n<p>great but I just kind of recap your work maybe on the EVO 2 stuff but then and then building forward. >> Yeah, for sure. And maybe to frame up the conversation, I think another kind of interesting just lens on interpretability in general is a lot of the techniques that we're describing are ways to solve the AI human interface problem and it's sort of like birectional communication is the goal there. So what we've been talking about with intentional design of models and you know steering but also more advanced</p>\n<p>techniques is having humans impart our desires and control into models and over models and the reverse is also very interesting especially as you get to superhuman models whether that's narrow super intelligence like these scientific models that work on genomics data medical imaging things like that but down the line you know super intelligence of other forms as well. what knowledge can the AIS teach us as sort of that that the other direction in that and so some of our</p>\n<p>life science work to date has been getting at exactly that question which is well some of it does look like debugging these various life sciences models understanding if they're actually performing well on tasks or if they're picking up on spurious correlations for instance genomics models you would like to know whether they are sort of focusing on the biologically relevant things that you care about or if it's</p>\n<p><strong>[48:18]</strong></p>\n<p>using some simpler coralate like the ancestry of the person that it's looking at. But then also in the instances where they are superhuman and maybe they are understanding elements of the human genome that we don't have names for or um specific you know yeah discoveries that they've made that that we don't know about. That's that's a big goal. And so we're already seeing that right we are partnered with organizations like Mayo Clinic leading research health system in in the United States Arc</p>\n<p>Institute as well as uh a startup called Prima which focuses on neurodeenerative disease and in our partnership with them we've used foundation models they've been training and applied our interpretability techniques to find novel biomarkers for um Alzheimer's disease. So, I think this is just the tip of the iceberg, but it's uh that's like a flavor of some of the things that we're working on. >> Yeah, I think that's really fantastic. We obviously we did the Chan Zuckerberg uh pod last year as well, and like</p>\n<p>there's a plethora of these models coming out because there's so much um potential and research. Um and it's like very interesting how it's basically the same as language models, but just with a different underlying data set, but like it's the same exact techniques. like there's no change basically. >> Yeah. [laughter] Well, and even in like other domains, right? Like I you know, robotics I know like a lot of the companies just use Gemma as like the the like backbone and then they like make it into a VLA that like takes these actions. It's it's it's transformers all</p>\n<p>the way down. So like we we have Medma now, right? Like this week even there was Medma 1.5. Uh and they're they're training it on this stuff like 3D scans, medical domain knowledge and all that stuff too. So there's a push from both sides but I think the thing that you know one of the things about mechan is like you're a little bit more cautious in some domains right so healthcare mainly being one like guard rails understanding you know we're we're more riskadverse to something going wrong there so even just from a basic</p>\n<p>understanding like if we're trusting these systems to make claims we want to know why and what's going on. Yeah, I think there's totally a kind of like deployment bottleneck to actually using foundation models for real patient usage or things like that. Like say you're using a model for rare disease prediction, you probably want some explanation as to why your model predicted a certain outcome and an interpretable explanation at that. So that's definitely a use case. But I also think like being able to extract</p>\n<p>scientific information that no human knows to accelerate drug discovery and disease treatment and things like that actually is a really really big unlock for sc like scientific discovery and you've seen a lot of startups like say that they're going to accelerate scientific discovery and I feel like we actually are doing that through our interp techniques and kind of like</p>\n<p><strong>[51:18]</strong></p>\n<p>almost by accident like I think We got reached out to very very early on from these healthcare institutions and none of us had healthare. >> How did they even hear of you? Like >> a podcast. >> Okay. Yeah, podcast. Okay. Well, now is that time, you know, like [laughter] everyone everyone can call us up. >> Podcast are the most important thing. Everyone should listen to podcast and everyone should come to >> podcast. They were like, you know, we have these really smart models that we've trained and we want to know what they're doing. Um, and we were like really early that time, like 3 months old, and it was a few of us, and we were like, \"Oh my god, let's [laughter] we've</p>\n<p>never used these models. Let's figure it out.\" Um, but it's also like great proof that interpret techniques scale pretty well across across domains. We didn't really have to learn too much about >> interp is a a machine learning technique, machine learning skills everywhere, right? Like, and then there's obviously it's just like a general insight. Um, probably to finance too, I think, which would be fun for our history. Um I don't know if you have anything to say there. >> Well, just across the science like we've also done work on material science. Yeah, it it really runs the gambit. >> Yeah. Awesome.</p>\n<p>>> And you know, for those that should reach out like you're obviously experts in this, but like is there a call out for people that you're looking to partner with, design partners, people to use your stuff outside of just, you know, the general developer that wants to plugandplay steering stuff? like on the research side more so like are there ideal design partners, customers, stuff like that that >> yeah I can talk about maybe non life sciences and then I'm curious to hear from you on the life sciences side but um we're looking for design partners across many domains language anyone</p>\n<p>who's customizing language models or trying to push the frontier of code or reasoning models is really interesting to us and then also interested in the frontier of models that work in like pixel space as we call it. So if you're doing world models, video models, um even robotics um where there's not a very clean natural language interface to interact with um I think we think that interp can really help and are looking for a few partners in in that space. >> Just cuz you you mentioned the keyword</p>\n<p>world models um is that a big part of your thinking? Do you have a definition that I can use because everyone's asking me about it [laughter] >> uh about world models? There's quite a few definitions. Let's say >> I don't feel equipped to be [laughter] an expert on world model definitions, but the reason we're interested in them is because they give you like, you know, with language models when you get uh features, you still have to do auto interpret and things like that to actually get an understanding of of what this concept is. But in image and video and world, it's like extremely easy to</p>\n<p>to gro what the concept is because you can see it and you can visualize it. And um this makes the feedback cycle extremely fast um for us also for things like I don't know if you take think about probes in language model context and then take it to world models like what if you wanted to detect harmful actors in world model scenes like you can't actually like go and label all of</p>\n<p><strong>[54:20]</strong></p>\n<p>that data feasibly but you maybe you could um synthetically generate you know I don't know world like harmful actor uh data using SAPE feature activations or whatever. and then actually train a probe that was able to detect that much more scalably. So, [snorts] I just think like video and image and world has always been something we've explored and are continuing to explore. Um, Mark's demo was probably the first moment we really like were like, \"Oh, wow.\" Like, this is really going to this could really like change the world of</p>\n<p>>> the steering demo. >> Yeah. No, the image demo. >> The the diffusion one. Exactly. >> Yeah. Yeah. We should probably show that and and you demoed it at Worlds Fair. So we can choose to link that. >> Nice. Yeah, >> people can play with it, right? >> Yes. >> Yes. >> Yeah. I think for for me one way in which I I think about world models is just like this like having this consistent model of the world where everything that you generate operates within the rules of that world. And imagine it would be a bigger deal for science uh or like math or anything that</p>\n<p>where like you have verifiable rules whereas I guess in natural language maybe there's less rules. And so it's not not that important. >> Yeah. And and which makes the debugging of the model's internal representations or it's internal world model to the extent you can make that legible and explicit and have control over that. I think it makes it all the more important because in language it's sort of a fuzzy enough domain that if its world model isn't fully like ours, it can still sort of like pass the Turing test so to speak. But I know there have been papers</p>\n<p>that have looked at like even if you train certain astrophysics models, it does not learn F= MA. Like the same way that you can, you know, have a model do well for modular arithmetic, but it doesn't really like learn what how we think of modular arithmetic. It learns some crazy heristic that is like essentially functionally equivalent, but it's probably not the sort of groed solution that you would hope for. >> It's how an alien would do it, >> right? Exactly. Uh but but no no I that's probably I think a function of</p>\n<p>our learning being bad rather than the well that approach probably not being real because it's it's how we humans learn >> right >> yeah right well it's just it's the problem of induction right all of ML is based on induction and and it's impossible to say I have a physics model you might have a physics model that works all the time except when there is a character wearing a blue shirt and green shoes and like you you can't disprove that that's the case unless you test every particular situation your model might be in. Um, so we know that</p>\n<p>the laws of physics apply no matter where you are, what scenario it is, but from a model's perspective, maybe something that's out of distribution, it just never needed to learn that the same laws of physics apply there. >> Yeah. You were very excited because I I read Ted Chang over the holidays. Um, and I was very inspired by this uh short story called Understand. Uh, which apparently it's like pretty old. You you must be familiar with it. To me, it was</p>\n<p><strong>[57:21]</strong></p>\n<p>like it's this fictional story. It's like the inverse of flowers for Alenon where uh you had someone like uh get really smart but then also try to outsmart the tester >> and the story just read like the chain of thought of an of a super intelligence right where they're like oh I realize I'm being tested therefore and okay what's the consequence of being tested oh they're testing me and if I score well they will use me for things that I don't want to do therefore I will score badly and like but not too badly that they'll raise alarms. So [laughter] it's just like uh so model sandbagging is a</p>\n<p>thing that people have have explored but I just think like uh Ted Chang's work just in general seems to be something that inspires you. I just wanted to prompt you to talk about it. >> I think so Ted Chang has two is a is a sci-fi author who writes amazing short stories and >> his other claim to fame is uh stories of our lives which became uh the movie Arrival. >> Exactly. Yeah. So so two books of short stories that I'm aware of. He also actually also has a great um just online blog post. I think he's the one who coined the term of LLMs as like a blurry JPEG of the internet. I should fact</p>\n<p>check that, but he it's a good it's a good post. But I think almost every one of his short stories has some lesson to bear on thinking about AI and thinking about AI research. So, you know, you you've been talking about alien intelligence, right, in this AI human communication translation problem. That's, you know, exactly sort of what's going on in arrival in story of um story of your life. And just the fact that other beings will think and operate and communicate in ways that are not just challenging for us to understand, but</p>\n<p>just fundamentally different in ways that we might not even be able to expect. And then the one that's just super relevant for interpretability is the other short book of short stories he has is called Exhalation. And that is literally about a robot doing interpretability on its own mind. >> Oh, okay. >> Uh so I just think that that you know you don't you don't even have to squint to make the analogies there. >> Well, I I actually take uh Exhalation as a discussion about entropy and order. Uh but yes, there's this there's a scene in</p>\n<p>Exhalation where basically the the uh so everyone is a robot. Uh so the the guy realizes he can set up a mirror to work on the back of his own head and then starts doing operations like that and by looking at the mirror and doing this. [laughter] >> Yeah. And I think Ted Chang has written about like the inspiration for that story. It was like half inspired by some of the thing he had been doing on Entropy. There's apparently some other short story that is similar where a character goes to the doctor and opens up his chest and there's like a like a ticker tape going along. It's like he basically realizes he's like a touring</p>\n<p>machine. Um and I don't know I I think especially as it comes to using agents for interp that story always sticks in my mind. >> I find the uh brain surgery or like surgery analogies a little bit a little bit morbid but it is very apt. Um and when we talked to a lot of computational neuroscientists they moved to interp because they were like look we have</p>\n<p><strong>[60:22]</strong></p>\n<p>unfettered access to this artificial intelligent mind. It's so much. You have access to everything. You can run as many ablations, the experiments as you want. It's an amazing bed for science. And um you know, human brains obviously we can't just go and do whatever we want to them. Um and and I think uh it is really just like a moment in time where we have intelligent systems that can really like do things better than humans in many ways. And um it's time I think for us to to do the science on it. I'll ask a a brief like safety question. You</p>\n<p>know, uh me and Turk was kind of born out of the alignment and safety conversation. I safety is on your website. It's not like something that you you like depprioritize, but like there's like a sort of very militant safety arm that like wants to blow up data centers and like stop AI and and then there's this like sort of middle ground and like is is this like a conversation in your part of the world? Do you go up to Berkeley and Light Haven and like talk to those guys or are they like, you know, there's like a brief like civil war going on? I don't know. >> I think I think a good amount of us have</p>\n<p>spent some time in Berkeley. Um, and then there are researchers there that we really admire and respect. Um, I think for us it's like we have a very grounded view of alignment and and safety in that we want to make sure that we can build models that do what we want them to do and that we have scalable oversight into what these models are doing and and we think that that is the key to a lot of these like technical alignment challenges and I think that is our opinion that's our research direction.</p>\n<p>Um, we of course are going to do safety related research to make sure that our techniques also work on, you know, things like reward hacking and and other like more concrete safety issues that we've seen in the wild. But we want to be kind of like grounded in solving the technical challenges we see to having humans be humans play a big role in in the deployment of of these super intelligent agents of the future. Yeah, I found the community to actually be</p>\n<p>remarkably cohesive. Whether it's talking about academia or the interpretability work being done at the frontier labs or some of the independent programs like maths and stuff. I think we're all shooting for the same goal. I don't know that there's anyone who doesn't want our understanding of models to increase. I I think everyone regardless of where they're coming from or the use cases that they're thinking, whether it's alignment as the premier thing they're focused on or someone who's coming in purely from the angle of scientific discovery, I think we would</p>\n<p>all hope that models can be more reliably and robustly controlled and understood. It seems like a pretty unambiguous goal. I'll maybe phrase it in terms of like there's maybe like a U curve of uh of this where like if you're extremely doomer you don't want any research whatsoever. If you're like mildly doomer you're like okay there's this like high agency doomer is like well the default path is where we're all dead but like we</p>\n<p><strong>[63:23]</strong></p>\n<p>can do something about it. Whereas there's there's other people who are like no just like don't ever do anything. Um you know >> Yeah. Yeah. There's also the other side like there is the super alignment like people that are like okay weak to strong generalization we're going to get there we're going to have models smarter than us and use those to train even smarter models how do we do that safely that's you know there's the camp there too that's trying to solve it but yeah there's there's a lot of doomers too [laughter] >> well and I and I think there's a lot to be learned from taking a very um like even regardless of the</p>\n<p>problems s that you're applying this to. Also just like the notion of like scalable oversight as a method of saying let's take super intelligent or or current frontier models and help use them to understand other models is another case where I think it's just like a good lesson that everyone is aligned on of ideally you are setting up your research so that as super intelligence arrives that is a tailwind that's also bolstering our ability to like understand the models cuz otherwise</p>\n<p>you're fighting a losing battle if it's like the systems are getting more and more capable and our methods are sort of linearly growing at like human pace. >> Yeah. Yeah. Uh Viva did call out something like you know I I I do think a consistent part of the mechan field is consistently strong to weak meaning that we we train weaker models to understand stronger models something like that. Um or maybe I got it the other way around. >> The other way weak. Yeah. Yeah. The question that Ilia and Yan Leica posed was well is that going to scale because eventually these are going to be</p>\n<p>stronger than us right so I I don't know if you have a perspective on that because I that is something I still haven't got over even after seeing that >> there's a good paper from open AI but it's somewhat old I think it's like 23 24 it's literally weak to strong generalization but the thing is that most of OpenAI super alignment team has >> they're gone >> they're gone >> but like I think the idea the idea is >> so now it's it's back there's no more >> they're so Yeah. Yeah. I [laughter] think I think there's some new blog posts coming out. >> I know. And just, you know, check the Thinking Machine's uh website to see who's back.</p>\n<p>>> Go [snorts] back. Um [laughter] there's more coming. >> You know, you know what I mean? Like we too strong seemed like a very different direction. And when when it first came out, I was like, \"Oh my god, this is like this is what we have to do.\" >> Uh and like it may be completely different than everything all all the techniques we have today. >> Yeah. My understanding of that is it's that's more like weak to strong when when you trust the weak model and you're uncertain whether you can trust the strong model that's that's being developed. I'm sort of speaking out of my depth on some of these topics, but I think right now we're in a regime where</p>\n<p>even the strong models we uh trust as reasonably aligned and so they can be good co-scientists on a lot of the problems that we've been we've been tackling which is a nice a nice state to be in. >> Yeah. Any last thoughts, calls action? >> I don't think so. As we mentioned, actively hiring MLES, research scientists. Um, you can check out the careers page at Goodfire. Um,</p>\n<p><strong>[66:24]</strong></p>\n<p>>> where are you guys based? >> San Francisco. We're in um Levis's Plaza, like by Court Tower. It's where our office is. So, come hang out. Um we're also looking for design partners across um people working in in reasoning models um world models, robotics and then also of course people who are working on building super intelligent science models or looking at drug discovery or disease treatment. We would love to partner as well. Yeah, maybe the way I'll phrase it is like, you know, maybe you have a use case where LLMs are</p>\n<p>almost good enough, but you need one magical knob to tune so that it is good enough. You guys make the knob. >> Yeah. Yeah. Or foundation models uh in in other domains as well. The some of those are the um especially opaque ones because you can't you can't chat with them. >> What what do you do if you can't chat with them? >> Oh, well like thinking about like a genomics model or material science model. So like a Yeah. narrow foundation. Yeah. They predict. Yeah. Got it. Got it. >> I was going to say I thought the diffusion work you guys did early was pretty, you know, pretty fun. Like you</p>\n<p>could see it directly applied to images, but we don't see as much interp in diffusion or images, right? Like I see genomics, >> it's going to be huge. Like look at this video models. They're so expensive to produce. And like I mean basically a midjourney sref is kind of a feature, >> right? >> The what? mid journey sref like the the string of numbers that you >> right right the style reference I guess. >> Yeah. No, I I mean I think we're starting to see more of it and I'll say like the the research preview of our diffusion model kind of like a creative use case and the steering demo you saw.</p>\n<p>I I think of those much more as as as demos than um a lot of the sort of core platform features that that we're working with partners are unfortunately sort of under NDA and less demoable. But I will, you know, hope that you're going to see inter pervading a lot of what gets done even if it is behind the scenes like that. So some of the Yeah, some of the public facing demos might not always be representative of like the it's just the tip of the iceberg, I guess, is one way to put it. >> Okay, excellent. Thanks for coming on. >> Thanks for having us. This is a great</p>\n<p>time.</p>"}