{"video_id": "qyaiG_mGkmo", "title": "The New Trend that Terrifies Netflix | Cal Newport", "link": "https://www.youtube.com/watch?v=qyaiG_mGkmo", "published": "2026-02-16T11:00:00+00:00", "summary": "Cal Newport explains why \"micro-streamers\" might become the new Netflix, and he also details why he spent $60 on a task app in episode 392 of the Deep Questions podcast.\n\nCheck out Cal on Masterclass at: www.masterclass.com/calnewport\n\nThere remains a gap between the production values of professional streaming services like Netflix and independent content that appears on platforms like YouTube. But what happens when that gap disappears? In the ideas segment of today’s episode, Cal sends a correspondent to investigate a fascinating new “micro-streaming” service producing Netflix-quality shows with a small team. Then, in the practices segment, he explains why he spent $60 on a single productivity application. \n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\nFebruary book: \n\nThe Hidden Book in the Bible (Richard Elliott)\n\nLinks:\nBuy Cal’s latest book, “Slow Productivity” at www.calnewport.com/slow \nGet a signed copy of Cal’s “Slow Productivity” at https://peoplesbooktakoma.com/event/cal-newport/ \nCal’s monthly book directory: bramses.notion.site/059db2641def4a88988b4d2cee4657ba?\nhttps://www.masterclass.com/calnewport\nhttps://culturedcode.com/things/\n\nThanks to our Sponsors: \n\nhttps://www.1password.com/deep\nhttps://www.cozyearth.com/deep (Use code “DEEP” for 20% off)\nhttps://www.calderalab.com/deep\nhttps://www.shopify.com/deep\n\n0:00 Are “Micro-Streamers” the Future of Media?\n36:33 Why Cal Spent $60 on a Task App?\n45:25 How can I find time to become a Biblical scholar?\n49:23 Should I freak out about this AI Superintelligence article?\n57:41 Cal gives his weekly reading update \n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=qyaiG_mGkmo\">https://www.youtube.com/watch?v=qyaiG_mGkmo</a></p>\n<h2>Are “Micro-Streamers” the Future of Media?</h2>\n<p>Hey, so I recently filmed a course for MasterClass. Now, this was a really interesting experience and I think the final product was great and you can check it out at uh masterclass.com/cal newport. But the thing I want to focus on here is the production values because MasterClass really makes these things look good. They have uh big cameras with fancy lenses. There&#x27;s a director of photography. They have dedicated crew to do nothing but set up and adjust lights. And you can really tell like I&#x27;m going</p>\n<p>to load up a scene here on the screen for people who are watching instead of just listening. Just so you can get a sense of what this looks like when they&#x27;re using the the full production crew. All right. Now, this stuff when we see it, we have to admit, is a level better than most of the video that&#x27;s being produced by independent creators like us here at this podcast. And here&#x27;s the thing I want to argue today. That gap has been making a really big difference in the media landscape. We have become trained as consumers that when we see video content at the level of quality of</p>\n<p>something like MasterClass or Netflix, we say, &quot;Okay, that&#x27;s something I&#x27;ll pay for.&quot; But if you move down just a little bit to the level below, like uh these really good video podcasts where people have nice DSLR cameras and some diffused light and it looks pretty good, people say, &quot;No, no, no. That is for free platforms like YouTube.&quot; So this difference of production value has really uh kept the moat around video that people will pay for. But here&#x27;s what I think is interesting about our current moment. There&#x27;s a small but growing movement of independent producers that are starting to create content at the same quality level as</p>\n<p>those big players. I call these micro streamers. and I think they&#x27;re going to change the entire future of online media and entertainment as we know it. So, this is what we&#x27;re going to get into during the idea segment. Um, I dispatched my intrepid newsletter director and podcast re researcher Nate to actually go and subscribe and use one of the most popular and interesting of these new micro streamers. So, we&#x27;re going to go through his trip report about everything that he found and try to understand what&#x27;s going on and what this tells us about the future of media.</p>\n<p>Um, a lot of what we discovered actually surprised me. So, I think you&#x27;re going to find this interesting as well. Then, in the practices segment, we&#x27;re going to switch gears and turn our attention to the world of digital productivity. I just spent $60. That&#x27;s right, $60 US on a task app. And I&#x27;m going to tell you what it is, and I&#x27;m going to explain to you why I spent so much money on it. because I think it highlights a more general principle about the intersection of technology and trying to organize your life. All right, so we have a lot to do. As always, I&#x27;m Cal Newport and</p>\n<p>this is Deep Questions, the show about the fight for depth in an increasingly distracted world. We&#x27;ll get started right after the music. All right. So, to make this discussion more concrete, I want to take a closer look at a specific very successful micro streamer um that&#x27;s popular at the current moment. It has a couple names. It used to be called Dropout TV. They</p>\n<p>now stylize it, if you see it online, as a colon followed by the word dropout. Uh it costs $6.99 a month. You can watch it on your devices or on an app on your TV just like you would Netflix or any other streaming service. Now, here&#x27;s the backstory of Dropout TV as best as I can tell. It actually came out of an early 2000&#x27;s era website called collegehumor.com. Do you remember College Humor, Jesse? That was like our college years. &gt;&gt; No, I don&#x27;t. &gt;&gt; Well, as someone who wrote for a College Humor magazine, I knew all about uh College Horror. I remember because I</p>\n<p>really got started like right around uh I think 1999. So, right after 911, they actually had some pretty funny stuff. And the one I remember was like a a collection of books that the premise was they had come out right before 911 and now these books weren&#x27;t doing so well, like unfortunately time books. I remember one of them was like how to dress like the Taliban. It was just like some guy with a turban and like another one was like why airport security doesn&#x27;t matter. And so the premise was like these were all books that were now doing really poorly because they were very illtimed. So it was like a website. Then YouTube came along. This was after</p>\n<p>I stopped uh following that site and it sounds like what they did is they went hard into video on YouTube and they were doing pretty well there. Nate did some research on this. I think they were up to like a million subscribers but they were frustrated because of two things. One, they were in the service of the algorithm, right? So, you know, whether or not their videos were promoted or not depended on this amorphous algorithm. And two, it was hard to find advertisers, especially when you&#x27;re doing humor or edgy humor. It can be hard to find advertisers. That was frustrating. So, at some point in the 2010s,</p>\n<p>they created their own streaming platform. The company bounced back and forth between a couple owners and then eventually that became the full-time focus of the organization, a comedy, video streaming platform. Um, and that&#x27;s where they are now. Now, what are they known for? They&#x27;re known for uh very high production values. We&#x27;ll look at this in a second. The same as like a streamer&#x27;s unscripted TV quality. They have a rotating troop of really talented improv performers and then sort of special guests like sort of well-known comedians you would probably recognize</p>\n<p>come on the shows as well. They are really good to their performers. They have almost like a co-op model where they want to pay performers like what they&#x27;re worth. Now, I did some research on this. One comedian uh talked about making more money filming a single episode of one of the shows on Dropout than he did for his seasonlong role on a Paramount TV Plus show. Uh some other specific numbers, they have a a show called Very Important People where they they put you in elaborate makeup and if you&#x27;re the</p>\n<p>guest, you can make up to $10,000 per episode. They have another show called Dimension 20, which I think is a a Dungeons and Dragons. That&#x27;s like celebrity and comedians playing Dungeons and Dragons. $7,000 per episode. They even pay performers to audition because they recognize, hey, it&#x27;s a pain to come out and spend your time auditioning. So, uh it&#x27;s wellliked within the comedy uh community. It&#x27;s also doing really well among viewers. I&#x27;ve been trying to track these numbers from interview discussions. In 2023, Sam Reich, the CEO, talked about them</p>\n<p>having quote mid hundreds of thousands of subscribers. U end quote. They then went on a big run that year. By 2025, they were reporting over a million subscribers. So, yes, this is much smaller than a Netflix, but a million subscribers at $7 uh a month, right? That&#x27;s whatever that is uh over $80 million a year. That&#x27;s a pretty big revenue generator. All right, so let&#x27;s take a closer look at what&#x27;s going on with this particular micro streamer and then I&#x27;m going to step back and try to figure out in general what what do you</p>\n<p>need to succeed in this trend and what does it mean for the future of media. So as I mentioned before um we set our sent our intrepid newsletter director on to dropout TV to subscribe and spend some time on it and take some pictures and send us back uh some notes. So I&#x27;m gonna load up here on the screen for people who are watching. So just listing some of these screenshots. All right. So, this is the main interface of the channel. It&#x27;s featuring on the front here their on the top banner, the hero banner, one of their shows called Dimension 20 Adventuring Academy. These are improv comedians. They play Dungeons and Dragons and they banter with each other. Um, as you can see, Jesse, this</p>\n<p>looks like Netflix, but also those production values, right? That&#x27;s the same you would see on any sort of unscripted show on TV. &gt;&gt; All right. Here&#x27;s another picture. This is the interface very similar to Netflix. Uh, Netflix. It&#x27;s a horizontal carousel and you could just see their shows and you can scroll sideways uh through the shows and we see here uh WTF 101 is a cartoon. There&#x27;s a show called Total Forgiveness. Cartoon Hell um Ultimate Ultimate I on Chat Ron Team Go. Um a lot of this is unscripted. Some of this is scripted itself. Here&#x27;s</p>\n<p>some more shows here. Here we see Hank Green pissing out cancer. Um I think that maybe I think that&#x27;s his standup special. I did a thing with Hank that I think is coming out soon on his channel. He&#x27;s a really cool guy. He&#x27;s a good good creator. So hopefully that&#x27;s coming out soon. Um here we see a screenshot from one of the shows. Again, this is these production values do not look like a good YouTube podcast. They look like Is it Cake on Netflix, right? So they&#x27;ve mastered they really are spending the time and money to get full legacy value production values. This game show here, Game Changers, is an improv show kind of</p>\n<p>like Whose Line Is It Anyways, is my understanding. Um, and improv people love it. Like, it&#x27;s really, really good. It&#x27;s really, really high quality. Um, here&#x27;s another show. They have original cartoons. So, that looks great. Um, this show here is called Very Important People. So, for those who are listening, I guess the right way to explain this, Jesse, is that it&#x27;s a formal interview setting, like kind of a cliche 90s era interview setting. There&#x27;s an interviewer in a pants suit and then the person being interviewed is in a elaborate hot dog costume. The premise of that show is this is a real guest like a known person and the premise of the show is they put</p>\n<p>you in elaborate crazy costumes and then they have an interview and you know for whatever reason that works. Um here&#x27;s here&#x27;s another show here. I think that&#x27;s from the Dungeons and Dragons game. So again we we see three comedians around some sort of gaming table where they&#x27;re I don&#x27;t know. I guess they play um and they chat. All right, so I also had Nate send some notes. What was his impression spending time on these shows? Here&#x27;s some things he sent to us. It feels intuitive like any other streamer. You have your trending, continue watching, and dropout originals</p>\n<p>categories. I was surprised to find animated originals. The archive is deep. There is a ton of content, even some of the original college humor stuff. They record everything. There&#x27;s so much behindthe-scenes content and additional content. They&#x27;re a relatively small team, so it&#x27;s a smart play to use everything and give their loyal fan base an intimate look into how it all gets made. The overall tone is a mix of nerdy and cheerful. You can find Hank Green science explaining elaborate D and D sets, improv that spans from silly to slapstick to existential and</p>\n<p>philosophical, sometimes flippant between the two in the same bit. It knows what it is, who its fan base is, and it delivers. All right, so that&#x27;s Dropout TV, which again is killing it if we&#x27;re talking what, a million subscribers at $7 a month. So here&#x27;s the question I want to ask next. Why is Dropout TV successful? If we can understand what goes into making a micro streamer be able to generate tens of millions of dollars, we&#x27;ll have a better understanding of what&#x27;s going to happen with this trend</p>\n<p>going forward in the future. So, I have three properties I want to suggest here. Having spent time listening to Nate and looking at this report and reading articles about this, I have three properties I want to suggest are critical for something like Dropout TV to be successful. And I&#x27;m going to actually uh draw a picture for each of these properties on my virtual blackboard here for people who are watching. So, just listening because well uh I want to punish you. Making you see my drawing is never never the best part of people&#x27;s day, but I like doing it. All right, property number one that</p>\n<p>you need to succeed. All right, so here&#x27;s what I&#x27;m going to draw here. We have a stick figure standing there. Um, and then we got a camera and don&#x27;t laugh. That&#x27;s great, Jesse. I don&#x27;t know what you&#x27;re talking about. And then here&#x27;s a big lighting panel. All right. So, what am I talking about here? What property is this? I&#x27;ll write the word production. Production values. That&#x27;s the thing that we started with. The thing that caught my attention about Masterclass, the thing that I think most obviously differentiates Dropout TV from YouTube, production values. I think</p>\n<p>micro streamers need production quality that matches the large legacy uh platforms such as Netflix or such as Disney Plus or uh Masterclass. Now, that&#x27;s expensive. It&#x27;s getting cheaper. Dropout TV is a relatively small team, but you still need they got millions of dollars of investment over the time to actually make this thing play out. So most people, most indie creators won&#x27;t be able to do this, but if the price is low enough that it is not out of the reach for a very successful indie</p>\n<p>creator or talented group of people who already have some sort of notoriety or talent or fan base that people already know about. 99.9% of independent content creators can&#x27;t compete in the space. But I don&#x27;t think that&#x27;s going to be a bad thing because that&#x27;s going to prevent the problem that I think afflicts the free platforms like YouTube, which is crowding. There&#x27;s so much stuff on these platforms because the barrier to entry is so low. It&#x27;s hard for the really good stuff to rise above the noise because for every good show that is on YouTube, right, there&#x27;s going to be a 100,000 weird videos and it&#x27;s all getting mixed</p>\n<p>together. So, it&#x27;s not the worst thing in the world that this micro streamer universe is going to have a much smaller number of competing indie creators. You&#x27;re not going to make a play here unless you have a good chance of actually offering something good. And I think that filtering might not be the worst thing. Let&#x27;s take a quick break to hear from some of our sponsors. Here&#x27;s a mistake that a lot of small business owners like myself often make. We think because we&#x27;re not big that we&#x27;ll be ignored by bad actors. But unfortunately, when it comes to digital</p>\n<p>attacks, that is not true. Cyber criminals uh know that lean teams often lack the resources to prevent or respond to a breach. What&#x27;s the solution? You need one password. One Password provides simple security to help small teams manage the number one risk that bad actors exploit, weak passwords. It&#x27;s a simple turnkey solution that can be rolled out in hours whether you have a dedicated IT staff or not. And here&#x27;s the thing, one password is designed to meet small teams where they are, but it&#x27;s also built to grow along with your</p>\n<p>company. However complex your security needs may get, one password will stay with you every step of the way. So take the first step to better security by securing your team&#x27;s credentials. Find out more at onepass.com/deep. That&#x27;s the number one password.com/deep and start securing every login. I also want to talk about my friends at Cozy Earth. Let me describe the weather in Washington DC where Jesse and I live over the past couple of weeks. And Jesse, I&#x27;m going to use the technical meteorological terms here. Cold as hell.</p>\n<p>But you know what made that easier? Cozy Earth. I&#x27;m only exaggerating a little bit when I say between my wife and I, I think we own basically every product that Cozy Earth sells. I&#x27;m talking like their bamboo sheets. It&#x27;s the most comfortable I&#x27;ve ever slept in. Their bamboo pajama set, lightweight yet cozy. The cuddle blanket, super popular in our household. It&#x27;s richly plus with a comforting weight. And so many others. This gave us such a sense of warmth and comfort in a time when otherwise we were just freezing. Here&#x27;s the good news. They also now have or they&#x27;ve always had</p>\n<p>a 100 night sleep trial and a 10-year warranty so you can enjoy these purchases risk-f free. But you don&#x27;t need it. You&#x27;re going to love it what you buy from them. So why not share a little extra love this February and wrap yourself or someone you care about in comfort that truly feels special. Head to cozyearth.com and use my code deep to get up to 20% off. That&#x27;s code deep for up to 20% off. And if you get a post-purchase survey, be sure to mention you heard about Cozy Earth right here. Celebrate everyday love with comfort that makes the little moments count. All right, Jesse, let&#x27;s get back to the</p>\n<p>show. All right, property two that these micro streamers need. And I&#x27;ll draw a picture on here. Um, as always, maybe I&#x27;ll ask Jesse to try to figure out what&#x27;s going on here. I&#x27;ll switch colors. All right. What do you think about this, Jesse? What do you think? &gt;&gt; I like it, but I&#x27;ve also cheated. So, &gt;&gt; you&#x27;ve seen the script, haven&#x27;t you? All right. It&#x27;s a person juggling. And I&#x27;m going to put under here, I&#x27;ll put the word content. Okay. So, the second property these micro streamers need is really good</p>\n<p>content. The content has to be undeniably good and it has to pass an important test. It is better than most uh equivalent topic content that you can get for free. Right? I think this is a key part of the micro streamer platform movement is at Dropout TV. People who like comedy say this is the best improv they&#x27;ve seen since the show Whose Line Is It Anyways? So, you can&#x27;t find equivalently good um improv necessarily on YouTube easily.</p>\n<p>The shows are really good and funny, right? They&#x27;re edited well. It&#x27;s comedians who know each other, who know the format, who&#x27;ve auditioned, they they put together really good groups of people. It&#x27;s just really high quality to the degree where there&#x27;s not a lot of free equivalents on like on YouTube or something that&#x27;s going to scratch that same inch. So, you have to differentiate yourself with quality in some platform. I mean, in some topics, it&#x27;ll be easier than others. I think this is a problem right now that the maker DIY space is having. There&#x27;s a lot of really good maker DIY content right now on YouTube</p>\n<p>for free. And like that, for example, would make it hard if you&#x27;re, you know, Adam Savage or the woman from Nerd Forge to say, &quot;We&#x27;re going to create a micro streamer around maker content.&quot; The problem is is you have really good stuff. You could make the production values better, but it would be hard to differentiate your content. So you have to find an area where by bringing in the right talent and putting in the right effort, you can differentiate yourself. It has to be undeniably good. All right. The third property is something that surprised me. Um I&#x27;ll draw a picture over here. So this is supposed to be</p>\n<p>like a big audience of a big audience of people that are then looking up. I don&#x27;t know has a stage up here or something like that. All right. So what I mean by this audience and I&#x27;ll write the the word here. People say my handwriting uh identical to uh Queen Elizabeth, former Queen of of uh England, similar quality. And &gt;&gt; did she have great handwriting? &gt;&gt; I I&#x27;m assuming so. &gt;&gt; I think if Queen Elizabeth wrote something that looks like this that I</p>\n<p>have on the screen right now, they would have said, &quot;Well, she clearly had a stroke.&quot; And they would have rushed her off to the hospital. Like clearly she has some sort of neurological damage. Community was the piece that surprised me. So, this is something that Dropout is working on really well. They know their fans. They connect with their fans. They listen to their fans. They respond to their fans. And they create a parasocial relationship with their fans. This is Nate pointed this out and it caught me off guard. They&#x27;ll talk a lot like the the the performers in these shows.</p>\n<p>They&#x27;ll get personal. It&#x27;ll be really funny and then they&#x27;ll talk about, you know, they&#x27;re dealing with a sickness or like a mental health issue or something hard that&#x27;s going on in their life and their other performers are there to support them and then they&#x27;ll get back and they&#x27;re doing like a really silly bit. So, it moves back and forth between vulnerable and funny. They respond to the fans. They do shows and specials based on like what the fans really like. Nate was telling me that they are going to release Blu-rays of some of their shows just because their fan has a lot</p>\n<p>of like TV culture nerd them in it who like the physical things like great we&#x27;ll build these physical things. They have a really great merch shop and they do live events and you could just tell it&#x27;s it&#x27;s tightly intertwined. Also just how they behave. I mentioned before all these like benefits. They pay their performers really well. Um they try to carve out a space where like we&#x27;re we&#x27;re like a co-op type model even if it&#x27;s not technically that. And the audience responds to it. they feel like they&#x27;re a part of a community. Um, I&#x27;m going to go back briefly to the notes. Uh, Nate pulled up some comments from the internet so you can see the way people think about this. I&#x27;m going to read a</p>\n<p>couple things. This from a Reddit thread. Their content isn&#x27;t my personal cup of tea, but I am 1,000% on board with what they are doing as a business model, how they&#x27;re treating their creative people. They pay people who audition. Let that sink in. Here&#x27;s another comment. I know I sound like a corporate shill, but they have put in the work. I have never and extremely probably will never interact with anyone on the cast or crew, but from what&#x27;s public, it seems like a good place to work. I hope they are what their social media and public filings portray them to be. So, people are really into the company itself. This is a level of openness and transparency and vulnerability that you don&#x27;t have in the</p>\n<p>legacy streamer models where you have a real separation between like the performer and the audience. Dropout TV is having success by uh obscuring those lines. Now, to try to make this a little bit more clear, we track down a a longtime fan of Dropout TV. Uh her name is Megan. And here&#x27;s what&#x27;s interesting about this person. She&#x27;s not a big streaming newsletter subscriber, streaming service person. She&#x27;s a professor. This is not She&#x27;s not a big internet person, but she&#x27;s deadly loyal. This is like one of the only things she</p>\n<p>pays for monthly is Dropout TV. U So, we got some tape from her explaining what it is about this service that really attracts her. So, I really love the co-op model of dropout. That is something that just from a ethical consumption standpoint, I really, really want to support. But then on top of that, there is all the rewards of what art is produced when artists are paid fairly, have ownership in the things they&#x27;re doing, have really healthy workplaces and support, and then they produce extremely high quality creative work, really uh joyful work that like</p>\n<p>speaks to things happening out in the world that are really meaningful as well. So, it&#x27;s a way of processing um the zeitgeist. And so it&#x27;s not necessarily just escapism in like, you know, accessing these really silly skits, but it&#x27;s also a way of processing and not feeling alone. Um, and is exceptional high quality. And the way that it&#x27;s set up is like resulting in the artists who&#x27;ve been hired in in having success outside of dropout alone. So their model of paying people who are even just auditioning is really unique.</p>\n<p>Um, and I, yeah, huge fan of both the material and the way that it&#x27;s set up in the world. &gt;&gt; That interesting, Jesse, it&#x27;s like people can&#x27;t even pull apart the like, I love the content. I love the workplace. I love what they&#x27;re doing. It&#x27;s been mixed all together, which I think is a really interesting model. People will pay for video. They&#x27;ll pay for it even more regularly if they feel like this video is a a window into a community that they feel like they&#x27;re a part of. All right. So, let&#x27;s prognosticate. We&#x27;ve looked at this one micro streamer.</p>\n<p>Let&#x27;s prognosticate. What is going to come next in this movement? Well, first I want to make a point. Not all content, in fact, I would say most content that would is out there now and you can find it on platforms, free platforms like YouTube doesn&#x27;t make sense. Most content does not make sense for micro streamers. All right? So, for example, if you&#x27;re producing like reasonable stuff that has occasional virality, you want to be on a algorithmically curated free platform like YouTube, right? Because that&#x27;s not going to pass the the super high uh</p>\n<p>quality bar. It&#x27;s going to be too expensive to pass the production value bar to be a successful micro streamer and you want as many eyeballs as possible. And so, you want to be on a platform where virality can can gain you big eyeballs on a semi-regular basis. On the other end, let&#x27;s say you have really good production values, but you also have a massive audience. So, I&#x27;m thinking like Mr. Beast or Mark Robber. Doesn&#x27;t necessarily make sense for them to have a micro streaming service either because when your audience is that big, you know, Robber has 70 million subscribers, Mr. Beast has se several</p>\n<p>hundred million subscribers. When your audiences are that big, actually, the best monetization strategy is to directly sell them your own products. And that&#x27;s what they do. So, you know, Mr. Beast has like Feastables and Beastburgers and Mark Robber has the Crunch Labs. And it turns out that&#x27;s just going to make a lot more money than getting a much smaller fraction of that to pay a smaller subscription fee. Um, and again, the other thing that&#x27;s going to struggle, like we talked about before, is content that you could make really good, that you could have really good production values, but there&#x27;s a lot of really, really good free</p>\n<p>equivalents already out there, and then it&#x27;s just hard. Again, this is the this is the DIY problem. I I think about at the end of his TV run, the maker, former Mythbuster, Adam Savage, had a show called Savage Builds, and it was like a great traditionally produced, high-end production value maker show where he&#x27;d have a crazy project and him and a team would build the project, right? That show didn&#x27;t work. And in part, the reason why it didn&#x27;t work is because by that point, you had people doing equivalently crazy projects with maybe</p>\n<p>the production values weren&#x27;t quite there, but just as interesting maker projects on YouTube for free. And it was sort of the end of maker stuff on cable TV because you had people doing these huge projects for free on YouTube and it became hard to separate the two. Interesting fact, Jesse, the director of my master class uh directed like half of the episodes of Mythbusters. So, she knows those guys really well. All the things connect. All right. So, what is the future though? What do I predict is going to happen? All right. I have a few points here I&#x27;m going to throw out there. I&#x27;m going to look into my crystal</p>\n<p>ball. I do think there will be a micro streamer boom. A lot of money is going to come into this. A lot of private investment money. U there will be a mini bust as well. A lot of these things are not going to work, but we&#x27;re going to shake it out to have like a pretty stable ecosystem of micro streamers at the end of that boom bus cycle. I don&#x27;t know how many. I&#x27;m going to say less than 200. I mean, more than 200, less than 5,000. That&#x27;d be my best guess, right? And so, what we&#x27;re going to have is a situation where, you know, a lot of people might subscribe to three to five micro streamers in addition to like a</p>\n<p>one or two of the big streamers. This might sound like crazy, but it&#x27;s not crazy if you think about how many people are already subscribing to like three or five substacks, which is just text. We&#x27;re talking the same amount of money. But for now, a chicklet or app that can be on your Apple TV next to Netflix that gives you really high quality u indistinguishable from the streamers, hard to find elsewhere content that has a real sense of community. I think we&#x27;re just going to find a lot of people like, &quot;Yeah, I have a few of those on my uh smart TV.&quot; So, we&#x27;re going to have maybe a few thousand</p>\n<p>of these. They&#x27;re these are going to be multi-million dollars. Usually like eight figure year revenue, not nine figure year revenue type companies and that&#x27;s just going to become a part of the entertainment experience. I&#x27;m trying to think about like examples of what could be there. So like Joe Rogan is someone who could probably have a a successful micro streamer because you could imagine what would that app give you? Well, it would be I don&#x27;t know certain episodes of his show that aren&#x27;t otherwise available. maybe like certain types of episodes like the Protect Our Park episodes where he&#x27;s joking around with his comedian friends, but then he</p>\n<p>could put a lot of standup from his comedy club could be on there as well. So, you could see all these clips, new clips every every week from standup comics. Then he could probably put a camera in his green room and kind of have a regular show of like comics that are just sort of BSing in the green room. And then maybe I think he&#x27;s bu he&#x27;s building a ranch outside of Austin. I could imagine some sort of show where him and other comedians like they go hunting or something. and whatever. Like you could imagine an ecosystem there. It&#x27;s like $10 million uh a year, $20 million a year investment to run this thing makes $100 million. Like that type</p>\n<p>of thing is going to be more likely. Uh if we did deep questions TV, Jesse, I think we would have conservatively 20 hours of skeleton footage each week. I think conservatively um there&#x27;d be a show that&#x27;s just me doing accents, which I think would be popular. Um, and a weekly series that&#x27;s called Cal Network Lifts Things. And it would just be Cal Network lifting absurdly heavy things while women clap. &gt;&gt; Not like uproariously, but just like Yeah. Well done. &gt;&gt; And a show of you trying to improve your handwriting like the queen.</p>\n<p>&gt;&gt; Uh, there would be a show. It would be called Cal or Queen &gt;&gt; and and they would show handwriting on it and then you would have to guess was it written by me or Queen Elizabeth, the former queen of England. it be that that would also be uh a popular micro streamer. So, we&#x27;ll have to get on that. We just need if anyone wants to invest $20 million, we could deliver this like tomorrow. All right. So, what&#x27;s our assessment of this? Is this micro streamer revolution I&#x27;m protecting a good thing? I think yes. A few things I want to point out here. A, it&#x27;s non-algorithmic, which is music to my ears. When you have a subscription service, what is your</p>\n<p>incentive as the provider of content? Delighting your audience, giving them the best possible experience. You don&#x27;t really time on device doesn&#x27;t matter. You&#x27;re not going to initify and do all sorts of weird ads and data mining. You want that to be the best possible experience that&#x27;s better for consumers. Non-algorithmic content is not addictive content. Non-algorithmic content can have much higher quality in a sort of almost literary type of creative sense, right? Like it&#x27; be more uplifting. And I think some of these dropout TV shows are way more interesting to consume. Top-notch improv with real vulnerability</p>\n<p>and interesting people than like a Tik Tok video of, you know, someone getting kicked in the nuts. Oh, that could be another episode of our on our streaming channel, just constantly finding people and kicking them in the nuts. I guess that would do really well. So, I think that&#x27;s good. Another good thing about this revolution, it injects money into the class of skilled creative people, which I think is vitally important for any sort of advanced culture or society. You need a whole substrate of highly talented creative people. It should be hard to make it into that substrate. You really got to be good. But there should be an economic means to support people</p>\n<p>who are really good at comedy and writing or doing the skilled trades that surround producing high production quality video. I was actually one of the sadder the something that was sort of sad about my masterclass experience is like everyone there was coming out of movies and this was one of the only gigs in town because all the movie productions all overseas now because you can produce your movies overseas for half the cost. So all these skilled trades people are running out of work. So I think that is really good. I think it&#x27;s more important to have a an internet entertainment ecosystem that supports a sort of uh middle class of</p>\n<p>skilled creative professionals. To me, that&#x27;s much more important than what we have now, which is an internet creative ecosystem that supports like a small number of 24y old influencers and like everyone else makes no money. That&#x27;s not that useful to a society. The existence of Jake Paul is not that critical for a functioning society, but you lose all of the, you know, highly skilled humor writers. I think that is a real loss that you&#x27;re gonna feel. So, I think that&#x27;s good as well. I also think it undermines the massive social platforms,</p>\n<p>which again is a good thing because I really dislike those platforms. And I&#x27;ve been making this argument. I always go back to that New Yorker piece I wrote in 2023 on Tik Tok and the fall of the social media giants. But as soon as all those social media giants said, &quot;We&#x27;re going to follow the Tik Tok model of algorithmically curated short form video, not social networks, not giving you information from people you follow or your friends, but just showing you the most compelling possible things.&quot; I said that was the day they sealed their death warrant because now they&#x27;re just competing with everything else that can offer entertainment. And I think micro streamers when it matches your interest</p>\n<p>when it&#x27;s a community that you like that is going to be something that is going to be more compelling than let me just fall back on Instagram and watch my tradife Instagram I don&#x27;t know fitness influencer kick someone in the nuts or whatever&#x27;s going on in Instagram. So, I think in general, knock on wood, if I&#x27;m right about this, it&#x27;s a good thing. I think that&#x27;s good for the future of media, and I&#x27;m excited for some of the micro streamers that are going to enter my life and give me better highquality entertainment to watch in a way that I am happy to be watching it. So, there you go. Had you heard of Dropout TV?</p>\n<p>&gt;&gt; No. &gt;&gt; I had never heard of it either. &gt;&gt; So, none of those people on Dropout TV, do they have a presence on YouTube as well? &gt;&gt; I don&#x27;t know. They probably do. Yeah, they probably put clips on YouTube to promote it. I think I heard something like that. Yeah. So, they&#x27;re on there, but uh they were entirely on YouTube and they&#x27;re like, &quot;This is a pain and that&#x27;s why they move over to the micro streamer.&quot; &gt;&gt; Even so, even with the revenue sharing that they get from they got from YouTube, &gt;&gt; um yeah, I don&#x27;t think they were making enough money from that. Not comp I mean, they weren&#x27;t going to make $70 million a year on YouTube,</p>\n<p>&gt;&gt; which they&#x27;re able to do here. They&#x27;re growing now. I was I was doing a lot of reading in like Variety and other Hollywood centric newspapers. They&#x27;re now hiring professional like producers and entertainment executives from like TV networks and streamers and stuff like that. So, it&#x27;s sort of it&#x27;s growing out, but it&#x27;s still a very small team compared to anything else for which you might have an app on your TV, but once you click it, you can&#x27;t tell the difference. That&#x27;s what&#x27;s exciting to me. Once you can&#x27;t tell the difference, it doesn&#x27;t mean automatically you&#x27;ll be successful, but it means you as an independent now have a shot at being successful in</p>\n<p>that type of pay media ecosystem. So, I think it&#x27;s a bigger deal than people realize, but we shall see. All right, we&#x27;re going to take another quick break to hear from some of our sponsors. Men, let me level with you. We need to take better care of our skin. And here&#x27;s the way to do it with the help of Calira Lab. Calira Lab makes high performance skin care designed specifically for men&#x27;s skin. More importantly, they&#x27;ve simplified the use of their products into a straightforward three-step routine. Step one, you use the clean</p>\n<p>slate, a cleanser to clear dirt, oil, and sweat off of your skin. Step two, use the great, which is a serum clinically proven to reduce wrinkles um and improve elasticity. And then step three, use the hydrolayer moisturizer to lock in moisture all day. That&#x27;s it. I have all three products, so I can tell you from experience, this routine is simple and it&#x27;s fast, but it works. Especially the moisturizing. Uh, I&#x27;m so used to my skin feeling like sandpaper in the winter that I was amazed to learn that it doesn&#x27;t have to be that way. Use moisturizer. I didn&#x27;t know about this. Women know about this. I didn&#x27;t know</p>\n<p>about this. So, go to calderab.com/deep and use code deep to get 20% off your first order. Starting a new business is hard. I remember what it was like starting up the media company that produces this podcast. And here&#x27;s what I learned. Don&#x27;t reinvent the wheel. Trust industry leaders wherever you can. This is where Shopify enters the scene because if you need to sell something, you need Shopify. Shopify is the commerce platform behind millions of businesses around the world and 10% of</p>\n<p>all e-commerce in the US. From big names like Allirds and Mattel to new brands just getting started now. You want to sell online? Get started with your own design studio. Hundreds of readytouse templates will help you build a beautiful online store. Need help spreading the word? Shopify can help you easily create email and social media campaigns to reach your customers wherever they scroll or stroll. We ever start selling products on this show, I know exactly what product we will use, what service we&#x27;ll use that is, and it is Shopify. So, it&#x27;s time to turn those whatifs into</p>\n<p>with Shopify today. Sign up for your $1 per month trial today at shopify.com/deep. Go to shopify.com/deep. That&#x27;s shopify.comdeep. All right, Jesse, let&#x27;s get back to the show. All right, so uh that&#x27;s what we got for our ideas section. I think we&#x27;ll move on now to talk practices. Earlier this year, I switched to a new task management app. It&#x27;s called Things 3. I</p>\n<h2>Why Cal Spent $60 on a Task App?</h2>\n<p>spent $10 to buy a copy for my phone and then I spent $50 to buy a copy for my Mac. I can&#x27;t actually remember the last time I spent that much money on a piece of software. Um, but that&#x27;s what you have to do with things three. There&#x27;s no free version. It&#x27;s not a monthly subscription fee. If you want it on a device, you buy a copy for that device. Now, I want to talk briefly today about why I spent $60 on a task app because I think the reason is more generally relevant than just why I like this app. And it gets to a a core point about how to successfully</p>\n<p>use technology to help organize your life. All right. So, I&#x27;m going to load up on the screen here for people who are watching instead of just listening, a screenshot of things three in action. So, what we see over here is a list of different areas. There&#x27;s an inbox today, upcoming. Below here, what you see is areas like family, work, and hobbies. And here they have these circles are list that exist under the different areas. You don&#x27;t have to have project list under areas. You can just have standalone tasks. I do that. Um, if we look at the actual task pane, we see</p>\n<p>here a particular list called prepare presentation, and there&#x27;s a bunch of tasks. These tasks have been divided into sub areas. I don&#x27;t do that, but you can do that if you want. And that&#x27;s about it. A couple little features to notice. Some uh tasks have a star, meaning it&#x27;s something that you said you wanted to work on that day. Others have a date next to them, meaning that you have an upcoming deadline. Uh, one other view here, this shows what happens if you click the today tab, which is very or very nice. It shows you all the tasks for whatever list and whatever areas they had clicked the star on saying you want to work on that particular day. You</p>\n<p>see them all in one place. That&#x27;s basically it with things three. So what about this made me want to spend $60? There&#x27;s one feature in particular that they emphasize that I think is critical. Reducing friction. they have minimized the effort, time and clicks involved in going from a task in mind to a task in system or to see task in your system in front of you. There&#x27;s all sorts of sort of intuitive shortcuts that they&#x27;ve they&#x27;ve perfected over the years. You hit spacebar and you can just</p>\n<p>start typing. If you want to set a date, you like click on the calendar and it pops up right there and you click on it. So the interface is beautiful. What they don&#x27;t emphasize which a lot of other task applications do is features. If you look at the web pages for a lot of other popular task apps, they try to overwhelm you with feature after feature that they offer all these complicated integrations. You could do this, you could do that. You could integrate these apps with your task app. And what&#x27;s going to happen is that you will automatically get sent a notice to your Apple Watch if you happen to walk past this billboard on the vernal equinox and then your notion board will capture it</p>\n<p>and send it to an LLM after which uh the mouse trap falls and you get trapped under the cage. like they&#x27;re always pushing all these different features. And I get why that&#x27;s compelling because you&#x27;re like, &quot;Wow, these are all things I could do that could make my app more powerful.&quot; But here&#x27;s what I learned in my two decades of thinking and writing about the intersection of productivity and technology. Features are not the problem. The number one problem people have with any sort of task management system is they stop using them. It doesn&#x27;t matter how many cool features and integration your tools have if you don&#x27;t use them.</p>\n<p>And so the number one problem that you want to avoid if trying to use technology to organize your life is to stop using the technology. This is where friction enters the scene. It is the number one reason why people give up with a tool over time. When you&#x27;re first using it, there&#x27;s a little bit of friction. You got to do a couple clicks here to enter a task. I have to I can&#x27;t really see the full title of this task until I click on the card and then I see the whole thing. When you&#x27;re first using the app, that&#x27;s not a big deal. like, okay, whatever. It&#x27;s a couple extra clicks, but the point is, look at all</p>\n<p>these cool features. But over time, that friction begins to add up and it generates more and more heat until it gets too hot for the system as a whole to run. It&#x27;s when you&#x27;re tired. It&#x27;s when you&#x27;re busy. It&#x27;s when you&#x27;re in a hurry that that friction becomes more and more annoying until you finally say, &quot;I don&#x27;t want to do those clicks anymore. I&#x27;ll just keep track of this in my head.&quot; Or like send an email to myself and the system is out of your life. So we think about task technology wrong. We think about features when we should be thinking about friction because by</p>\n<p>far the largest expected value that you&#x27;re going to get from a task uh tool. The largest expected value will be from the simple tool you use for a long time. That is a larger amount of aggregate value than a fancy tool that you do great things with but only for a few weeks. And so that is why I like things is the friction is so low. It makes it as easy as possible to use. I actually looked this up Jesse. I first started talking about reducing friction in task task tools back in 2006. &gt;&gt; 2006 &gt;&gt; 2006 in my second book which was called the Da Vinci Code.</p>\n<p>&gt;&gt; I wouldn&#x27;t be in this dump if that was my book. I&#x27;d be podcasting from a golden throne. No, in my uh second book, which was almost as pos popular as the Da Vinci Code, uh how to become a straight Ara student. Actually, here&#x27;s a connection to the Da Vinci Code. There&#x27;s a real one. I remember because I I have a bad memory for most things except books. I remember every book I&#x27;ve read and where I was for whatever reason. And I remember exactly where I was reading I read the Da Vinci Code. It would have been the summer of 2003. I was staying at a friend&#x27;s house in New Jersey, northern New Jersey. I can</p>\n<p>remember the room I was reading the Da Vinci. They had a copy there and I started reading it. During that trip, the thing I kept checking on is uh the proposal for my first book. So I was a finished my junior year in college, how to win a college was out to publishers that summer. And so while I was reading the Da Vinci Code in Northern New Jersey in the summer of 2003, I was waiting to hear back had we sold my first book. So it all kind of connects together. Anyways, the next year I wrote how to become a straight A student. And in my section about how to manage your task as a</p>\n<p>student, it&#x27;s all focused on reducing friction. It was a system I invented. I had no computers involved. You ripped a sheet of paper out of a notebook and kept in your pocket all day and then you used your digital calendar you already had as a place where you stored everything. And I was really clear. This is the simplest possible system I could come up with because you don&#x27;t need features. Your problem is not that you don&#x27;t have a sufficiently complicated task management system. Your problem is you don&#x27;t have a task management system. And if I want you to have one, I got to make it so simple that even when you&#x27;re hung over and you&#x27;re rushing the class, you&#x27;re still going to use it. So from the very beginning of my professional career, thinking about this intersection</p>\n<p>of technology and productivity, friction is what I cared about. That&#x27;s why I like things 3. They care about it, too. And it&#x27;s so important to me that I was willing to pay $60 for it. So there we go. Things three, Jesse, I recommend it. &gt;&gt; So are you still using Trello? &gt;&gt; I&#x27;m not right now. I&#x27;m not right now. There are certain things I do where Trello is the right tool. In particular, if it&#x27;s a complicated project with multiple people involved, Trello is the right tool because you need the ability to have easy sharing of your workspace with other people. You need the ability to attach voluminous information to</p>\n<p>individual cards. That&#x27;s critical, I think, for team collaboration. Oh, here is the text of this email. Here&#x27;s a PDF of the report. So, all the stuff you need to execute a task lives on the same card that everyone sees and can update. Uh so Trello was you know very useful when I was working on team projects. I&#x27;m not right now. Most of what I&#x27;m doing is in my sort of uh deep work pain cave of you know books and articles and all this type of stuff that&#x27;s just uh individual effort and I was all kind of crowding onto each other and so I had to fall back onto my roots. Friction friction</p>\n<p>friction. So right now my trell is waiting there and I&#x27;ll use it again as I get to my next larger collaborative project. But for my personal stuff man I&#x27;m just reducing the friction. So then you check the app on your phone. &gt;&gt; Yeah, I have it on my phone and I have it on my Mac on my laptop. So, and then they sync. So you can synchronize, they have a service, uh, a cloud service that you can synchronize your various copies, each of which you paid for full retail. You can synchronize them so that the changes go between them. &gt;&gt; So $60 times two? &gt;&gt; No, because it was 50 for the Mac. &gt;&gt; Oh, okay. &gt;&gt; And 10 for the phone. &gt;&gt; Oh,</p>\n<p>&gt;&gt; yeah. It&#x27;s 20 for the iPad. Yeah. But if I want to put it on like the computer here, more. &gt;&gt; Well, another 50 more. Yeah, it could add up. I love it though. &gt;&gt; Also, you spend money for This is stupid, but it&#x27;s true. You spend money for something, you take it more seriously. &gt;&gt; Yeah. &gt;&gt; So, um anyways, I&#x27;m like, and it&#x27;s not an ad for things three. I don&#x27;t know the culture code people. Uh but there you go. So, friction matters. All right, Jesse, let&#x27;s move on to questions. &gt;&gt; Hi, the first question is from Alex. I work in a clerical position from to</p>\n<h2>How can I find time to become a Biblical scholar?</h2>\n<p>5 each day. I want to become a biblical scholar on the side. How should I do this? &gt;&gt; What do you think he means? I wonder, Jesse, like does he mean I want to be able to like in I have two definitions. I want to be able to No, I&#x27;m going to give three definitions. Let&#x27;s do three definitions. Easiest definition. I want to be able to uh engage with English translations of the Bible in a sort of sophisticated way like reading commentary and stuff like this. Number two, option. Option number two, I want</p>\n<p>to be able to engage with the Bible in the original language. So, for the Hebrew Bible, you&#x27;re learning biblical Hebrew and for the New Testament, you&#x27;re learning Greek, but just so that you can um have a deeper engagement with the text. Option number three is option two plus you want to do originally schol scholarly research on the Bible. So, there&#x27;s three different options for what he could mean here. He didn&#x27;t elaborate. He actually emailed me. &gt;&gt; All right. So, could you get more details here? &gt;&gt; He he did not elaborate. &gt;&gt; He did not elaborate. Okay. Well, the</p>\n<p>first the first option, which I think is a very reasonable place to start. This is a great side project, sort of like personal development side project where, you know, you get a what I would do is I would get like a reading list. I&#x27;m going to go through these books. I&#x27;m going to go back and um you know, maybe I&#x27;m going to go back and I&#x27;m going to reread these sections through the light of these books. or you can follow through uh the Bible over a particular period of time depending on what scope of the Bible you want to read. It can take a lot of years to get through the even the whole Hebrew Bible. Most of the cycles I&#x27;ve seen take like three or four years. If you&#x27;re interested in just the first five books,</p>\n<p>what the Jews would call the Torah, you can that&#x27;s split up regularly into a single year. You have a para every week. Um that&#x27;s not so hard to follow. So have some sort of curriculum of reading and studying. I&#x27;ve done a lot of biblical scholarship in the last couple of years. um this type of amateur just like reading these books and reading these elements I think it&#x27;s it&#x27;s you could do that tomorrow just put aside half hour a day and you can make progress learning biblical Hebrew that option there&#x27;s people who do this right like but who are uh lay sc meaning like non-academics who do this there&#x27;s courses that can</p>\n<p>help you right especially uh Hebrew biblical Hebrew because like in the Jewish communities there&#x27;s like a good thing to learn how to read, you know, the Bible in in Hebrew. So, there&#x27;s lots of courses and it takes a while. I think it&#x27;s it&#x27;s hard, but this could be a two-year project to like I can actually read and kind of understand. I mean, I think you&#x27;re you&#x27;re you&#x27;re not going to be able to do uh like an alter style level of uh translation or Richard Elliot, like people who just spend their entire life getting the nuances of the language, but you could pron you could kind of read and understand it. And I</p>\n<p>think there&#x27;s some value in that. That&#x27;s a two-year project. If you want to be able to read and understand to the point where you could do scholarly work, like you probably would need to learn the languages and then you would need to probably go to school part-time. So give a year or so to learn the languages and do like a two-year you probably would do like a divinity masters, theology masters part-time. So this might be like a five to eight year project. I don&#x27;t think that&#x27;s crazy. This is like a core idea from slow productivity. something taking a long time is not a</p>\n<p>problem. If it&#x27;s important to you and you enjoy the process and in this case you feel like it&#x27;s I don&#x27;t know purifying your soul or something why not have that say this decade this is going to be a structuring element of my life. So I&#x27;m not worried about any of these options taking a long time. In fact I&#x27;m going to say I like that all these options take a long time. Sticking disciplined and with diligence to things that are important and take time is a uh really good way of orienting yourself in the world and finding value. So, you should do it, Alex. Whatever option you&#x27;re looking at, I say do it. All right. What&#x27;s our next question?</p>\n<p>&gt;&gt; Next question is from Brett. I know you lean toward AI skepticism, but someone</p>\n<h2>Should I freak out about this AI Superintelligence article?</h2>\n<p>recently sent my wife and I this article, and it sort of freaked us out. Can you help us figure out what, if anything, in this argument isn&#x27;t right. &gt;&gt; All right. So, I have the the article here that Brett sent. The title was, &quot;We&#x27;re not ready for AI super intelligence.&quot; I&#x27;m not going to read the whole article. Let me read the intro and then I summarize. I can summarize the points of the article and then I&#x27;ll react to it. So the intro to the article says, &quot;There&#x27;s no shortage of dystopian views of the future, but this one might be worth your time. Basically, it&#x27;s a step-by-step visualization of where we&#x27;re taking artificial intelligence development and technology, projecting</p>\n<p>it out logically into the future into a future which could end the ex with the extinction of the human race.&quot; It says the what? If that sounds implausible and stupidly pessimistic, it might help to follow the steps from here to there and think about which of them you disagree with. So the gauntlet is laid down in this intro to this article. Hey, every step in here is pretty logical. So like this might sound like the endpoint&#x27;s crazy, but you got you tell me where there&#x27;s an illogical step. All right, so I took on that challenge and the answer</p>\n<p>of where are there illogical steps everywhere in this article. There are so many mistakes in this article. I don&#x27;t think that was the flex they thought when they said see if you can find something that is illogical. Uh the whole thing is pretty illogical. I actually think this article is just cribed from project um AI 2027. This is very familiar. Uh I&#x27;m teaching a doctoral seminar on super intelligence right now at Georgetown. So we&#x27;re reading a lot of the uh we read a lot of the source documents for the current conception of super intelligence including that and who the people were and how their views evolved. And so I recognize a lot of this. I&#x27;m just going</p>\n<p>to summarize really quickly this the story here at a high level. Then I&#x27;ll tell you what the flaw is. So basically the way this goes is it says okay we have the AI that we have now which is like cool but seems kind of harmless. Then it says but the next AI iteration is 100 times as smart, fast as powerful and the one after that is a thousand times as powerful. And their argument is just recursive self-improvement. Like we get 100 times more powerful and now the AI can just start improving itself. Um, and then they scale the quantity of chips and like, well, what if we have 50,000 of these really smart AIs? Now it&#x27;s like having 50,000 scientists all</p>\n<p>working on trying to make the next AI better and we we lose control of it. That&#x27;s the story line. This is not unique to this article. I can tell you as someone again who&#x27;s studying super intelligence from a cultural and technological view in a doctoral seminar, this is the standard argument for super intelligence. Scaling up of ability, scaling up of quantity, control lost. What step here is illogical? We don&#x27;t know how to do either of those scalings. I we do not know how to make AI twice as good as it is right now. Nonetheless, 100 times as good. This is not a simple matter of just give it more</p>\n<p>time and more energy and it keeps going up some type of curve. It is hard to make better AIs. Now, there was a brief window into language models where we had a tool that got us from here to here. This is called pre-training scaling. It got us from 2 to 3, 3 to 3.5, and 3.5 to four just by making the actual size of the models and the amount of time we trained them bigger. They got better, but that only gave us a relatively constrained improvement from two to four. After that, as I I uh I talked about this last August in my article for the New Yorker called, you know, what if</p>\n<p>AI doesn&#x27;t get much better than this? Pre-training scaling began to stall out. Most of the quote unquote improvements in straight language model performance we&#x27;ve gotten since the the stall out after GPT4 comes from post-training which is tuning these existing pre-trained models to do good on very specific tester metrics. It&#x27;s not nearly as impressive as to big systemic leaps in ability we got from pre-training scaling. So now that&#x27;s kind of where we are now is finding particular uses where we can get the right data sets to use reinforcement learning techniques to get these fine-tuning improvements on very narrow performance areas. So we&#x27;re kind</p>\n<p>of tinkering with the car and don&#x27;t know how to actually make it substantially better. So how are we going to get you can&#x27;t just casually say yeah you know over the next few years this will get a hundred times better and then what&#x27;ll happen? We don&#x27;t know how to make it 100 times better. We also don&#x27;t know how to do recursive self-improvement. These models are trained on things that they&#x27;ve already seen. There&#x27;s a little bit of minor generalization from the distributions but pretty much they&#x27;re working with rules and patterns that they&#x27;re exposed to in training. If you haven&#x27;t trained an AI on how to build an even better AI, it can&#x27;t do that. There is no notion of like just if we</p>\n<p>keep magically training these things, it&#x27;ll eventually be able to make better things. That&#x27;s the same thing as saying like look man, uh we went from propeller planes to fast propeller planes and then we had jet planes that are going faster. Um, so within a few years we&#x27;ll probably be traveling like roughly 100,000 mph. And at that point there&#x27;s these other issues we have to deal with like no, we don&#x27;t know how to get from 700 to 100,000 mph. We&#x27;re kind of tapped out. We don&#x27;t have the technology for it. We don&#x27;t know what technology could do that. So don&#x27;t be uh too taken in by scaling arguments. Demand that people</p>\n<p>talk about actual technologies that exist today or imminently are coming in the near future and their concrete implications. Do not react to extrapolation. So much of this type of AI vibe coverage that we see in articles like this is really people creating an extrapolation that&#x27;s unverified by what we actually know is possible and then they react to their own extrapolation and they&#x27;re like how can you not be worried about my story I wrote but again it&#x27;s like if I tell you some story where like planes are getting faster and then we all turn into ghosts and I&#x27;m like why could how are you not</p>\n<p>upset about us all becoming ghosts? you like because we&#x27;re not all going to become ghosts and we don&#x27;t know how to make planes much faster. It&#x27;s kind of a weird mixed metaphor there, Jesse. It&#x27;s really actually very deep. I just can&#x27;t get into all the details of why. Just trust me, that&#x27;s actually a very deep anecdote. Um, so Brett, there&#x27;s a lot of concerns about AI that I have. Super intelligence is not one of them. Again, I&#x27;m studying this very closely both culturally and technologically. This is not something that serious computer scientists are worried about. Yes, I know ones that are in the news like kind of make these cryptic statements about being worried about AI. there&#x27;s their own type of politics and agenda is going there. But let me tell</p>\n<p>you behind the scenes, people who actually are not being quoted by reporters and work on this technology. There is not a path here that anyone serious is actually worried about. That&#x27;s what I would say about that. I&#x27;m reading too much about this these days, Jesse, but super intelligence is just not it&#x27;s not a serious concern. It was a interestingly the very first people to write about the even computers brought up this fear. We went back and read things early. Alan Turring worried about this. John Vonoyman talking about the singularity. Uh Norbert Weiner</p>\n<p>talking about things getting out of control. Uh Jay Good is the one who actually invented the idea of recursive self-improvement. He called it ultra intelligence of the 60s. One of these like information theory head guys. Um also was very worried about so as soon as we had the idea of a computer, we got worried. What if these things kept getting better and take over? So it goes back to the very first people writing about computers. It&#x27;s interesting. &gt;&gt; So this is a course this semester. &gt;&gt; Yeah. first time you had this course. &gt;&gt; Yeah. So, so Georgetown has these things called doctoral seminars where it&#x27;s just doctoral students. They&#x27;re reading courses like you&#x27;re reading cutting edge work and um trying to have original</p>\n<p>thought. So, I have 10 students that are all doing research on AI in some capacity or the other. And then we&#x27;re doing this the the cool thing we&#x27;re doing inspired by John Height&#x27;s research uh group at NYU. We are creating a collaborative work document which is a um annotated bibliography of all these papers we&#x27;re reading organized by section where you get like the summary of like who wrote this paper, when did it come out, what&#x27;s it about, what&#x27;s interesting about it, what are the flaws about it, um and how does it connect? And we&#x27;re going to have this, we&#x27;re building out this really big collaborative work document of all these papers so that people who are doing</p>\n<p>research or writing or journalists who are thinking about super intelligence can have this big guide to like the relevant papers and uh what to read and who to talk to. So we we&#x27;ll have a pretty cool work product that comes out of it when we&#x27;re done. &gt;&gt; And then after you&#x27;re done, are you going to see if Jad GPT can do the same thing? &gt;&gt; Uh yeah, that&#x27;ll be No, what I&#x27;m going to do, and I think this will be fascinating, is I&#x27;m going to read it on the podcast, all 400 pages of it. I&#x27;d be like, uh, citation number 17, then I&#x27;ll read through like where it appeared. That&#x27;s what people want to hear. All right. Uh, we like to close out the show</p>\n<p>talking about what I&#x27;m reading. A book I finished last week. This is why I was</p>\n<h2>Cal gives his weekly reading update</h2>\n<p>interested in Alex&#x27;s question about becoming a biblical scholar is I finished reading Richard Elliot&#x27;s book, The Hidden Book in the Bible. Richard Elliott&#x27;s one of my favorite biblical scholars. Um, he&#x27;s like one of these critical biblical uh scholar uh studies scholars. critical biblical analysis studies scholar. These are the people it goes all the way back to the Germans in the 1800s who study the linguistic characteristics of the Hebrew Bible uh and by the characteristics of the text can actually break it up into different writers. And so like you have your primary writers of the early books of the Hebrew Bible they call the</p>\n<p>Yahwehist, the priestly source and the Deuteronomist. There&#x27;s some other sources as well. Um, anyways, he has this argument in this book that actually the Yahwehist wrote many more parts of the Hebrew Bible than he&#x27;s often given credit for or she he actually has an argu could be either. He&#x27;s there&#x27;s reason to believe it could be a woman. Um, I think Bloom was much more bigger on this idea, much more definitive about it where Elliot&#x27;s like, &quot;We just don&#x27;t know, but it&#x27;s possible. There&#x27;s various reasons why, which is interesting.&quot; Um, anyways, Elliott is arguing that Yahweh&#x27;s contributions to the Bible goes beyond the things he&#x27;s most known for in</p>\n<p>like Genesis and that what he did in this book is he took all of the text from the Bible that he thinks was written by this one writer and just put it together into one independent story, uh, an original translation he did. And he says when you see it all together, he&#x27;s like it&#x27;s like a majestic work of literature because it one not only does it flow from one story to the other, but there&#x27;s all these echoes and callbacks to same things happen like again and again and you see like the stories and the repeated themes and it&#x27;s so it&#x27;s pretty cool. I mean I&#x27;ve never read the whole Hebrew Bible before. So this is not all of it because it&#x27;s just the</p>\n<p>contributions of the Yahweh, but it&#x27;s like many of the main stories. Um, and so it was kind of like interesting to follow this one through line. Like I didn&#x27;t have I didn&#x27;t know a lot of the stories that happened sort of post um Joshua going into Canaan. I sort of know the first five books pretty well, but like all of the war story section, all of the like we killed all the whatever um David and Saul and uh it&#x27;s these stories I kind of knew, but I&#x27;d never heard them all. &gt;&gt; Is it a beast of a book? &gt;&gt; Uh it&#x27;s a bit of a beast of a book.</p>\n<p>Yeah. I mean, you know, it&#x27;s not crazy. It&#x27;s like 400 something pages. &gt;&gt; So, you&#x27;ve remembered every book you&#x27;ve ever read. &gt;&gt; I mean, I don&#x27;t know if that&#x27;s true. I just have like a really strong There&#x27;s certain things I have a strong memory for. And one of the things I have a strong memory for is books that they imprint on me in a way where I not always, but I often if I get a book, I can remember the various places I read it. Um, this was very I also have a I don&#x27;t have a photographic memory, but I have like a there&#x27;s a word for it where if I read something, especially if I&#x27;m if I&#x27;m like I read over something and I</p>\n<p>explain it out loud, like do a little active recall, I can often will remember I can remember long um portions of pros and so like when I would take tests and stuff, you know, uh, at Dartmouth, I could remember like whole passages from studying and I could kind of replicate them when I was doing the the blue book. So I I have something I have like the linguistic memory or part of my brain is whatever it is. But but yeah, I have a a stronger memory for that than almost anything. So I don&#x27;t know. I remember I remember books. I sometimes get things wrong, but that&#x27;s one of my better</p>\n<p>memories. All right. So that&#x27;s what I&#x27;m reading. I&#x27;m reading also I have like four books in progress right now. So there&#x27;s going to be like one week where they all finish. It&#x27;s like did you read four books last week? But I I I&#x27;m reading a lot of books in parallel, making a little bit of progress on each. So, like all those dams are going to break all at once, I think, and I&#x27;m just come back and have like a ton of books. &gt;&gt; So, now that we&#x27;re given like a little different structure to the reading component of the show, are we just going to assume that you read five books a month, or you going to like summarize them at some point? &gt;&gt; Um, I don&#x27;t want to talk about them twice. I thought it was nicer just to talk each week about what I read that</p>\n<p>week. Internally, &gt;&gt; we&#x27;ll just have faith that you&#x27;re reading five a week. &gt;&gt; Well, no, you can count. Just count the segments. Go through the segments and count up. Um, I still do five a month. That&#x27;s what I aim for still. &gt;&gt; No, I don&#x27;t. &gt;&gt; Yeah, five or more. But yeah, you&#x27;re going to have to actually go back and count count up what&#x27;s happening in the segments now. All right, speaking of which, that&#x27;s all the time we have for today. Be back next week with another episode. And until then, as always, stay deep. Hey, if you like today&#x27;s discussion of micro streamers, I think you might also like episode 387, which was titled, &quot;Can Substack Save Journalism?&quot; It&#x27;s another</p>\n<p>look at a major trend in this new media landscape. Check it out. I think you&#x27;ll like it. Is it possible that paid email newsletter subscriptions might be the foundation on which we can build a new type of professional journalism?</p>", "chapters_count": 5}