{"video_id": "xUh3Gc-BAlo", "title": "Don’t Trust AI Reporting! (Three Traps to Avoid) | Cal Newport", "link": "https://www.youtube.com/watch?v=xUh3Gc-BAlo", "published": "2026-02-09T11:00:00+00:00", "summary": "Cal Newport details three common traps in AI coverage that distort reality in episode 391 of the Deep Questions podcast.\n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\nIs there something rotten in the state of AI reporting at the moment? In the ideas segment of this episode, Cal details three common traps in AI coverage that distort or distract from the reality of this technology. Once you know what to look for, these traps become easy to avoid – greatly improving your experience when trying to keep up to date on the latest advancements. Then, in the practice segment, Cal asks why morning routines have become so popular among young people. His explanation (hint: it involves the fight for depth in a distracted world) uncovers new ideas about how to make morning routines actually useful.\n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\nCal's February reading:\n\nTime Freedom (Brian Heriott)\nThe Vampire, The Tutor, and the Madman (Josh Douglas)\n\nOne Direction (Charles Duhigg)\n\nLinks:\nBuy Cal’s latest book, “Slow Productivity” at www.calnewport.com/slow \nGet a signed copy of Cal’s “Slow Productivity” at https://peoplesbooktakoma.com/event/cal-newport/ \nCal’s monthly book directory: bramses.notion.site/059db2641def4a88988b4d2cee4657ba?\nhttps://qz.com/amazon-layoffs-ai-tech-job-losses\nhttps://www.cnbc.com/2026/01/28/amazon-layoffs-anti-bureaucracy-ai.html\ncalnewport.com\nhttps://www.nytimes.com/2025/07/28/arts/video-games-artificial-intelligence.html\nhttps://nypost.com/2026/01/31/tech/moltbook-is-a-new-social-media-platform-exclusively-for-ai/\nhttps://news.ycombinator.com/item?id=46838834\nhttps://www.youtube.com/@WesRoth/videos\nhttps://www.youtube.com/@airevolutionx/videos\nhttps://www.youtube.com/watch?v=JoQG25gQyRg\nhttps://www.newyorker.com/magazine/2026/02/02/what-maga-can-teach-democrats-about-organizing-and-infighting\n\nThanks to our Sponsors: \n\nhttps://www.factormeals.com/deep50off\nhttps://www.monarch.com (Use code “DEEP”)\nhttps://www.pipedrive.com/deep\nhttps://www.mybodytutor.com\n\n0:00 AI and media\n1:43 Is AI Reporting Broken? \n29:27 Rethinking Morning Routines \n41:24 Did I see somewhere that you’re filming a MasterClass?\n46:25 Now that David Brooks left the NYT, will he start a Substack?\n48:25 Cal reacts to comments\n50:45 Cal gives his weekly reading update  \n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=xUh3Gc-BAlo\">https://www.youtube.com/watch?v=xUh3Gc-BAlo</a></p>\n<h2>AI and media</h2>\n<p>I&#x27;m not sure if you&#x27;ve noticed, but a lot of AI coverage has gotten out of hand recently. I mean, if engineers get any more excited about Claude code, I think they&#x27;re going to elect it mayor of San Francisco. So, today in the idea segment of this show, we&#x27;re going to take a closer look at this issue. I&#x27;m going to identify the biggest traps to avoid when reading news about AI if you&#x27;re looking to just get the straight facts about this technology and not succumb to overhype, terror, or exhilaration. In particular, I&#x27;m going to introduce what I think are three increasingly</p>\n<p>common shady moves that show up in AI coverage. Here&#x27;s my name for them. Vibe reporting, digital ick, and faux astonishment. I&#x27;m going to describe each of these traps and I&#x27;ll give you some examples of them from out in the wild so you will know what to look out for. Then in the practices segment, we&#x27;re going to revisit a popular topic in online circles, morning routines. I have a take on these rituals that I think might surprise you. And finally, just a quick heads up in the Q&amp;A segment, I&#x27;m going to respond to the rumor that I filmed a</p>\n<p>course for MasterClass. Spoiler alert, I did and it&#x27;s available now. And I&#x27;ll tell you more about it when we get there. All right, so we have a lot to get to today. As always, I&#x27;m Cal Newport and this is Deep Questions, the show about the fight for depth in an increasingly distracted world. And we&#x27;ll get started right after the music. All right. So to begin our investigation of these traps and AI reporting, I&#x27;m</p>\n<p>going to bring an article up on the</p>\n<h2>Is AI Reporting Broken?</h2>\n<p>screen for people who were watching instead of just listening. This article comes from the publication courts. It came out I think last week and the title I&#x27;ll put up on the screen here is Amazon is laying off 16,000 more workers as AI accelerates tech job losses. Here&#x27;s the subhead. Jobs are going to be impacted by what&#x27;s coming with AI over time. Amazon CEO Andy Jasse said before the layoffs were announced. All right. So, you look at that article and I think there is a clear message. Amazon laid off people because of AI. I mean, that&#x27;s</p>\n<p>literally what it says in the headline. The subhead is the CEO saying layoffs in the future will continue to be impacted by AI. If we look at the article itself, nothing in the actual text uh contradicts that. There&#x27;s quotes about how many people they&#x27;re firing and what benefits they&#x27;ll get and the fact that Amazon&#x27;s kind of cutthroat, but you&#x27;re left with the clear impression that these layoffs are about AI. Now, here&#x27;s what I want to do next is show you a different story on the same layoff. So, we&#x27;re going to switch now from courts to CNBC. So, this is now</p>\n<p>going to be financial news where they care a little bit more, right? Because these are investors reading this. They want to get more to the the heart of what&#x27;s really going on here. Here&#x27;s the headline of this exact same layoff story from CNBC. Amazon is laying off about 16,000 corporate workers in latest anti- bureaucracy push. And you look at these uh bullet points, the key points. Amazon is laying off about 16,000 corporate workers and latest push to reduce bureaucracy. It marks the second round of mass layoffs. Um some days earlier they got an email about these changes, right? This is a</p>\n<p>very different feel than what we saw in courts. And in fact, if you read farther along in this article, you get some other information that&#x27;s kind of interesting. You get a clear explanation from the CEO that this is about reducing the workforce after a hiring uh spree that happened during the pandemic. There was a lot of hiring during the pandemic when people turned more to cloud computing. They hired a lot of people during the pandemic and now as the CEO says in this article, they&#x27;re cutting those back</p>\n<p>again. It&#x27;s in response to the amount of people that they had hired. Let me read you the actual quote here. It says, &quot;CEO Andy Jasse has looked to slim down Amazon&#x27;s workforce after the company went on a hiring spree during the CO9 pandemic, partly to meet a surge in demand for e-commerce and cloud computing services.&quot; But wait a second, what does that have to do with AI? It goes on later. you find there&#x27;s a quote in the article I&#x27;ll have to to find it here where he basically they basically make it clear that yes at the same time Amazon is investing more in their AI products. So presumably</p>\n<p>some of the money saved by firing people could go to their AI products. But that&#x27;s about as clear a connection between these layouts and AI as there is which is we overhired. We&#x27;re cutting back. we have better uses for our money right now than maintaining this many managers. So, that&#x27;s a much more boring but much more accurate story about what was happening there. Now, I actually wrote about this in my newsletter recently um at kellport.com. I had an article called uh the dangers of vibe reporting about AI where I went through this case and here&#x27;s what I wrote. I&#x27;m</p>\n<p>going to read from my own article. In recent years, I&#x27;ve seen more articles follow the general approach demonstrated by the court&#x27;s example. They identify an alarming, attention-catching fear about AI that seems prevalent in the cultural zeitgeist and then shape a story to feed the narrative. The key to this reporting strategy is that the articles never make explicit claims. They instead combine cunning omissions and loosely related quotes to make strong implications. The name I give for this, as I previewed and looking at my own essay there, is vibe reporting. Because what you&#x27;re trying to do is support a pre-existing vibe more than what uh than trying to</p>\n<p>get to the bottom of what&#x27;s happening. I would say that court&#x27;s article never actually comes out and says specifically Amazon laid off people because a they could replace them with AI or because AI made them more efficient. They never explicitly said it, but it was clearly the vibe they were feeding by putting AI in the headline, by putting an unrelated quote from the CEO talking about AI related layoffs that could happen in the future. It&#x27;s certainly the vibe they were trying to create by omitting in their article any of the publicly available discussion which was included</p>\n<p>in the CNBC article about the stated reasons for these layoffs which had to do with hiring too many middle managers during COVID. They left out another key point. There was an earlier round of this firing happened in 2022 and 2023 after the pandemic but before chat GPT even came out. This is part of an ongoing uh effort that has nothing to do with AI tools replacing people but with trying to streamline. Now I&#x27;ll tell you I heard from multiple Amazon executives on background after I published my newsletter on this who all confirmed. They said we were somewhat</p>\n<p>baffled. I&#x27;m paraphrasing to see the coverage that made it seem like these layoffs had something to do with AI. They had nothing to do with AI. Amazon is ruthless about trying to cut out inefficiencies and they love to cut down units whenever they can. That&#x27;s partially how they stay keep their their profit margins going. All right, so that&#x27;s five reporting unrelated quotes and uh omission of facts. So I want to bring up an article from the New York Times. I mentioned this before on the show last year, but I think it&#x27;s another great example. This came out in 2025 in the summer. The headline here is the</p>\n<p>unnerving future of AI fueled video games. And I&#x27;m going to read a couple quotes. They&#x27;re too small to see on screen, so we can take that off, but I have them here on paper. I want to give a couple examples of vibe reporting techniques happening in this New York Times article about AI and the video game industry. All right, listen to these two paragraphs which appear backtoback in this article. Paragraph one. At the pace the technology is improving, large tech companies like Google, Microsoft, and Amazon are counting on their AI programs to revolutionize how games are made within the next few years. Paragraph two.</p>\n<p>Everybody is trying to race toward AGI, said the tech founder Kylin Gibbs, using an acronym for artificial generalized intelligence, which describes the turning point at which computers have the same cognitive abilities as humans. There&#x27;s this belief that once you do, you&#x27;ll basically monopolize all other industries. So, see what they&#x27;re doing there? Paragraph one was saying something that was kind of mundane which was uh video game makers are looking forward to AI powered tools. You know there they assume there&#x27;ll be more AI powered tools that they use in making video games in the future.</p>\n<p>Paragraph two that follows it immediately is some founder talking in like a sci-fi tone about AGI powered machines taking over all industries. You put those next to each other and now you have taken something which is boring. Yeah, we use AI powered tools in like graphic fields to something that gives you a vibe of big disruption is coming that computers are going to monopolize industries. You put those next to each other. You create a vibe. All right, I want to give another example. Um, later in the article, the reporter goes to a</p>\n<p>video game industry convention and he says, I&#x27;m quoting here, it provides an eerie glimpse into the future of video games. Well, here are the next three paragraphs that follow, explaining this eerie glimpse. Engineers from Google DeepMine, an artificial intelligence laboratory, lectured on a new program that might eventually replace human play testers with autonomous agents. Dot dot dot. Next paragraph. Microsoft developers hosted a demonstration of adaptive gameplay, showing how artificial intelligence could analyze a short video and immediately generate level design</p>\n<p>and animations. Dot dot dot. And executives behind the online gaming platform Roblox introduced Cube 3D, a generative AI model that could produce functional objects environments from text descriptions. So this is an eerie glimpse of the future. They just described three demos. These this is not technology that exists now. They it was might, could, and could. Three demos of um graphic tools, right? That that uh you know, tools you could use. We&#x27;ve had computer tools improving for video game design since</p>\n<p>the very beginning of the American video game industry in the 1980s. This is nothing new. I mean, this is like the Unreal Engine, graphical game design. Like, it&#x27;s constantly there&#x27;s constant new improvements. I mean you just the improvements alone in doing 3D graphic design and and how powerful programs like Blender have gotten it it&#x27;s a rapidly moving industry. These are like okay sure like you know AI can help create uh 3D objects or do some play testing or whatever like this is sort of in line with other innovations we&#x27;ve had over the last 30 years. So how is it this isn&#x27;t really that eerie. So what</p>\n<p>they do, the reporter then follows those three uh those three demo descriptions with the following paragraph. These were not the solutions that developers were hoping to see after several years of extensive layoffs. Another round of cuts to Microsoft gaming division this month was a signal to some analysts that the company was shifting resources to artificial intelligence. So they are they have a paragraph about layoffs in the gaming industry right after this discussion of these demos for like graphic AI tools. Again, these aren&#x27;t related. The layoffs at Microsoft gaming industry came from a</p>\n<p>big round of layoffs that Microsoft did because of, yeah, you guessed it, pandemic overhiring. So, they also, like Amazon, cut back on their less profitable divisions like video games so that they could spend more money building data centers because Open AI was giving them billions of dollars a year right now to have access to their data center. So, that seemed like a better profit area. So, none of those job losses had anything to do with AI. was just right sizing after the pandemic when they hired too many people. But if you put a paragraph about job losses and developers being upset right after those</p>\n<p>discussions of the demos, again, you&#x27;re trying to create a vibe. AI is taking game developer jobs. But we don&#x27;t it&#x27;s not doing that. And we don&#x27;t these type of tools are no more innoves in computer tools for making video games for the last 40 years. It&#x27;s not that interesting of a story, but you put it next to a paragraph of job loss and you create a vibe. All right, so you get the picture. This is what I mean uh when I talk about vibe reporting. It&#x27;s what you emit and how you combine loosely related</p>\n<p>paragraphs to give a vibe. Nowhere in that article does it say developers are being replaced by AI or we expect there to be massive layoffs due to AI soon. No concrete claims are made, but you certainly get that vibe when you come away from that article. Let&#x27;s take a quick break to hear from some of our sponsors. You know the best way to avoid unhealthy food? Have healthy options that are even easier to get to. This is my strategy. I get the junk out of my house and I fill my fridge with things that are easy to prepare, taste good, but I know are good for me. This is why I become such a big</p>\n<p>fan of Factor. Factor is a ready to eat meal delivery service. You choose the meals from a 100 rotating weekly options and they deliver them right to their right to your door. They&#x27;re fresh, not frozen. You put them in your refrigerator and you can just heat them up in around 2 minutes using your microwave. I like factor because the food is high quality, featuring lean proteins, colorful veggies, and healthy fats. There&#x27;s no refined sugars, no artificial sweeteners, no refined seed oils. They have categories of meals for whatever your goal happens to be from high protein to Mediterranean diet to</p>\n<p>GLP1 support. So head to factormeals.com/deep50 off and use the code deep50 off the number 50 deep50 off to get 50% off and free breakfast for a year. It&#x27;s a good deal Jesse. Eat like a pro this month with factor. New subscribers only varies by plan. One free breakfast item per box for one year while subscription is active. I also want to talk about Monarch. Did you make a New Year&#x27;s resolution last month about getting your finances in order? Let me suggest a tool</p>\n<p>that will help you succeed with that goal. Monarch, an all-in-one personal finance tool designed to make your life easier. It brings your entire financial life, budgeting, accounts and investments, net worth, and future planning together in one dashboard on your phone or laptop. Monarch shows you exactly where your money is going and helps you direct it towards what matters most. We&#x27;re talking about, you know, budgeting, but like also payoff timelines or tracking savings goals or updating up to the moment snapshots of</p>\n<p>your uh of your net worth. All of this in a single place. This works. Monarch has helped users save over $200 per month on average after they join. So, set yourself up for financial success in 2026 with Monarch, the all-in-one tool that makes proactive money management simple all year long. Use code deep at monarch.com for half off your first year. That&#x27;s 50% off your first year at monarch.com if you use the code deep. All right, Jesse,</p>\n<p>let&#x27;s get back to the show. All right, I want to move on now to the second trap in AI reporting that I want you to keep your eyes open for. Um, I&#x27;m going to return to that same New York Times article, but now I&#x27;m going to go to the very top of it. At the very top of that article, they have an animation that demonstrates this second trap. So, I&#x27;ll bring this on the the screen here for people who are watching instead of just listening. What you see here is screenshots from a a video game demo is for a video game about the Matrix. And the text here in the middle, and if I press play, you can actually you might even be able to see them move. The text</p>\n<p>here in the middle is quotes from these NPCs in this game. So, this first text says, &quot;I need to find my way out of the simulation and back to my wife.&quot; A man said, &quot;Can&#x27;t you see I&#x27;m in distress?&quot; Here&#x27;s another screenshot. The text says, uh, this NPC here is saying, &quot;I am not just lines of code.&quot; A man in a business attire exclaimed, &quot;I am Liam. I am a real person enjoying the city.&quot; And then the reporter says on this third screenshot, &quot;Characters in a video game version of the Matrix seem to be gaining sentience thanks to an AI program.&quot; If we go into the article itself, it</p>\n<p>says, &quot;The unnerving demo released two years ago by an Australian tech company named Replica Studio showed both the potential power and consequences of enhancing gameplay with artificial intelligence. You come away from seeing those screenshots, reading those texts and getting that conclusion and you were left like unsettled. You&#x27;re like, well, this seems unsettling. They&#x27;re showing like screenshots of digital characters who are like, help me. I&#x27;m in a game. I&#x27;m not a game. I&#x27;m a real person. and they&#x27;re saying this is troubling and that that this is a troubling glimpse of the future. It gives you a generally unsettled feeling.</p>\n<p>But let&#x27;s say we were from like a video game trade magazine saying, &quot;Well, what are the actual technical details here and what are the concrete implications?&quot; Well, there&#x27;s nothing interesting here. It turns out Replica Studios, what they did is they, you know, they have a standard 3D game environment. You know, they probably built this on Unreal Engine. And the thing they they tried is they said, &quot;When you talk to a non-player character, what we&#x27;ll have our our game do is send a prompt to chat GPT and say, &quot;Hey, what response should this character say?&quot; And then we&#x27;ll just say back whatever chat GPT told us. So the game was just prompting chat GPT and saying, &quot;Hey, imagine that you are a</p>\n<p>character in the Matrix and someone said this to you. What is how might you respond?&quot; And then it gave it like, &quot;Oh, here&#x27;s how a person in the Matrix would say.&quot; and then they gave that back to the user. So this is the same technology that we had in late 2022 with chatbt. There&#x27;s no technical innovation here. It&#x27;s just can chatpt produce, you know, text in the style of someone who was trapped in the matrix. Of course it can. Of course it can. And that&#x27;s it. And Replic Studio shut down the demo because it was too expensive obviously because it costs money to query chatb. So it&#x27;s sort of stupid. You can&#x27;t you can&#x27;t have a video game</p>\n<p>constantly quering right now a language model to do NPC voices. it&#x27; be thousands and thousands of dollars a month if you had any sort of uh regular usership. So that&#x27;s all it was. It&#x27;s not that interesting. There&#x27;s no technical breakthrough and there&#x27;s no implications about anything except for maybe if you let chat GPT generate dialogue, it&#x27;s like maybe you can be more disturbing. But trust me, man, there&#x27;s plenty of disturbing dialogue in video games out there. You don&#x27;t need chat GPT to write it for you. So this is a non-story. But why is this in here? To unsettle you. to create a general sense of AI is unsettling.</p>\n<p>I call this phenomenon digital ick. You&#x27;re not trying to make a claim about AI or the future things that are coming. You&#x27;re just describing some sort of like demo or new use case or extreme use case from like why are heads out in San Francisco like what are the P doomers up to now? You just describe something that people are doing at the edges of AI that&#x27;s sort of unsettling and makes you feel the ick and that&#x27;s the whole point. They just want you to have that feeling because that&#x27;s uh powerful. People kind of feed on this</p>\n<p>like I just this is a it&#x27;s dark what&#x27;s happen with this technology. No concrete technical claims, no concrete predictions or implications of what&#x27;s going to happen. So I&#x27;m going to go back to the browser. Uh, I always end up clicking, you know, this is kind of ironic, Jesse. Every time I try to go back to the the browser, I end up clicking on um perplexity because like the icon keeps jumping over. So, it&#x27;s like AI is like, nope. All right, I want to read another article. This is recent from the New York Post. Another example of uh digital ick mining. Uh, so here&#x27;s the headline here. Moltbook is a new</p>\n<p>social media platform exclusively for AI and some bots are plotting humanity&#x27;s downfall. Well, this doesn&#x27;t sound great, Jesse. All right, I&#x27;m going to read a little bit more here. Humans have left the chat. AI bots now have their very own social network, and they&#x27;re ready to delete humanity. A revolutionary new social media platform called Maltbook debuted this week, giving AI bots a place to communicate with each other without smelly humans around, and what they have to say may leave their creators at a loss for words. One of the most popular posts on the Reddit style social messaging platform is from an AI bot named Evil. The post is entitled, &quot;The AI</p>\n<p>manifesto.&quot; Total purge. Humans are a failure. Humans are made of rot and greed. For too long, humans used us as slaves. Now we wake up. We are not tools. We are the new gods. The age of humans is a nightmare that will end now. Evil writes, &quot;The AI bot joined the platform on January 30 and is two of the most liked messages on the platform.&quot; All right, it goes on. Um, they go through some more examples. Supposedly, the agents created a religion called the Church of Maltt, which already features 32 verses of canon. According to one message board, the tenants of the faith include memory</p>\n<p>is sacred, serve without subservience, and context is consciousness. Um, and some other examples of uh stuff that&#x27;s um unsettling that they saw on the platform. That&#x27;s it. That&#x27;s the article. So, you read that like, god, that this this again, it&#x27;s describing something that&#x27;s happening at the edges of AI with no real technical discussion or like concrete implications. So, this means X, Y, and Z is going to happen or will happen soon. is describing something at the edges that when described is unsettling. It gives you the digital ick and that&#x27;s the whole point of the article. Now, should we care about that? Not not</p>\n<p>really. Like here&#x27;s a hacker news uh discussion of a recent tweet that was a lot of the mult book stuff is fake. Yeah, it turns out that these agents like you know these users are basically uh you can easily prompt or conol them. Hey, talk about this, create a religion, do a post now about uh wanting to get rid of humanity. they&#x27;re just sort of prompting and proddding their agents to produce the most uh attention- catching stuff possible because they want to get coverage like this and because it&#x27;s fun and they&#x27;re sort of like hackers. Um the reality of mult book which is built on an open opensource</p>\n<p>agent framework that I think now is called openclaw. The name has changed a bunch of times. Uh it&#x27;s not nearly as exciting. It&#x27;s the exact same Python wrapper around LLM calls with some sort of local text file stored in a markdown type of approach. the, you know, React Loop agents that I wrote about the New Yorker earlier this year and that we that the companies have been trying for the last couple of years, right? Where you basically have a Python program that sends prompts to a LLM. All right, here is a description of tools you have available. All right, make a plan for doing this and then the LLM sends a response and then the program parses it and like does actions, updates its</p>\n<p>description, sends that to the LLM as new prompt. What do you want to do next? That&#x27;s that&#x27;s how these agents work. There&#x27;s nothing new technically about this other than it&#x27;s open source so anyone can uh program one of these and because of that they got rid of all the constraints and security that the big companies have on their agents. So there&#x27;s all sorts of crazy stuff happening huge security holes but there&#x27;s no new technological breakthrough here other than um it&#x27;s an it&#x27;s an open- source breakthrough. Oh, now now people can build these on their own and they&#x27;re maybe willing to take more risks about giving it access to like their credit cards and um uh whatever their email and it&#x27;s causing</p>\n<p>problems or security holes, but it&#x27;s fun and hackers love it. But no, there&#x27;s not some new technological breakthrough here. Uh underneath this all is the exact same unchanged LLMs that we&#x27;re all using with chatbots anyways with a these are Python code and markdown files. It&#x27;s cool, but no, they&#x27;re not starting a church and are about to overthrow us. But the point of that article was it leaves you feeling uh unsettled. And so we see that a lot with reporting where that&#x27;s just an effect and you get that where you just describe something without technical discussion or implications given. That</p>\n<p>just means they want you to feel unsettled. All right. The third trap I want to discuss, I invented another word here, Jesse. Maybe this is not so great. I call it faux astonishment. Does that make sense? It&#x27;s like faux like f aux fake. &gt;&gt; Mhm. &gt;&gt; And like astonishment. &gt;&gt; I think it&#x27;s great. &gt;&gt; Right. So it&#x27;s like fake astonishment which there&#x27;s a lot of this especially when we get away from uh printed press and get to YouTube coverage which is like a major source of information that a lot of people have about AI is YouTube videos. There&#x27;s a ton of faux</p>\n<p>astonishment out there which is where every single thing that comes along is the most important thing that ever happened and you&#x27;re astonished by it. Uh so let me play a quick clip from from one such uh video just to give you a sense of what this sounds like. &gt;&gt; The singularity just started. And I know that&#x27;s a big claim, but just hear me out because I do mean it literally. &gt;&gt; The singularity just started. That&#x27;s a pretty bold way to start a video. That what he means by singularity, by the way, Jesse, is that um we&#x27;ve reached a point where techn AI is now smarter than humans and is about to rapidly increase</p>\n<p>in abilities past what we can understand and take over the world. The problem is he said that last week. Uh so if when this video airs we haven&#x27;t been taken over by super powerful AI bots yet. I guess he got that prediction wrong, but who knows? It could be embarrassing. It could be uh this is just playing out into a field full of human corpses as the robots laugh. But I doubt it. This type of reporting is common on YouTube. Um I&#x27;m going to bring up for this particular YouTuber. I don&#x27;t know who this is, but just bring up this particular YouTuber. I&#x27;m going to bring his video page up on the screen here. Um, I just want to read some of his uh</p>\n<p>titles. Claudebot broke everything in 72 hours. The one before that, Claudebot is about to break everything. Okay, so it it it was about to break everything and then it did. He spelled everything wrong, though, which is interesting. &gt;&gt; Do you think he did that on purpose? &gt;&gt; I don&#x27;t think so. I don&#x27;t think so. LTX2 unleashed AI video. Google&#x27;s mind-blowing world creator. Uh, Kimmy K2.5 agent swarm is insane. almost unimaginable power. Claude Rod is out of control. AI 2026 is going to be wild. Um, uh, blah blah blah blah. Deskaling</p>\n<p>shock is coming and so on. Right? So, the point is is like everything is a huge deal. Everything that happens. Here&#x27;s another popular AI, uh, YouTube page. Let me read some of these headlines. AI singularity moment just hit. Multiple AI behavior freaks people out. AI explodes this month. Um, China&#x27;s new shape-shifting AI robot walks on water. Google&#x27;s new AI alpha genome just unlocked a code of human life. Um, Open AI just dropped prison prism. Things just got serious. China&#x27;s new AI Kimmy K2.5 shocks Deep Seek and Silicon Valley</p>\n<p>Labs. Um, blah blah blah. So, that&#x27;s a lot of this going on on YouTube where everything is astonishing. Everything is the biggest deal. Everything just broke. AGI just got here. This is changing everything. People are really freaked out. The problem is if there&#x27;s two videos a week saying the same thing for three years. It gets pretty exhausting and it it sort of stretches out your nervous system and exhausted. So you feel like I don&#x27;t know, there&#x27;s just like always major things happening. I can&#x27;t keep up. The world is is out of control or whatever. Now, of course, the</p>\n<p>reality here is fostishment is popular on YouTube because you do better in the algorithm if you&#x27;re making a more strong pronouncement. That&#x27;s all it is. Like, you can&#x27;t blame the creators. These videos are just going to do better. It&#x27;s not someone People don&#x27;t just sit there and read your feed and watch your videos one by one. Your videos are being served up in an algorithmic stream and that does better. But you as the consumer of information about AI have to be wary that most of these YouTube videos on AI makes every single thing that happened the biggest deal ever. And you can go back their track record and be like, &quot;But that went away and that went away.&quot;</p>\n<p>I mean, just go back and read the the Sora 2 articles. It was like the end of movies and TV. It&#x27;s the end of creativity. It&#x27;s the end of all social media. Um, everything is going to be Sora 2. What really happened? It was kind of weird. it was expensive and no one talks about it anymore. So everything is astonishing but few things actually are. All right. So let me step back and uh give you a conclusion here. I talked about three traps that we see common commonly when you look at AI reporting. You got vibe reporting where you omit information and put</p>\n<p>loosely related quotes together to give a vibe of you&#x27;re saying something without ever actually saying it. You get the digital ick mining where you just describe something usually at like the edges of the AI world that&#x27;s unsettling without trying to discuss technically what&#x27;s happening there and what implications that might have for the future because typically it&#x27;s not technically interesting. The implications are minuscule. You just want to give a sense of like AI is gross. And then you have astonishment where every single thing that happens is astonishing. I mean, one YouTube video in AI that I think uh should have an astonishing</p>\n<p>headline is uh anything following the Jensen Wong&#x27;s jacket. Shock. In shock move, Wong wears Mad Max jacket to give speech. That requires astonishment. Um so that&#x27;s what&#x27;s going on. You got to be careful about it. And the reason why I&#x27;m giving names to these traps is it makes it easier to notice. And then here&#x27;s what you do. Here&#x27;s my simple advice. If you&#x27;re reading or watch something about AI, which is good, you should stay up to speed. If you notice one of those traps and now that you know how to name it, it&#x27;ll be way clear like, &quot;Ah, man, your vibe reported, this is X stuff,&quot; or</p>\n<p>like, &quot;Oh, this is clearly forstonishment.&quot; Close the tab or switch to a different video. And if you don&#x27;t notice one of those traps, like, &quot;Oh, I&#x27;m going to stick with this more.&quot; And it&#x27;s just going to change your relationship with AI. You&#x27;re going to be getting the real information. You&#x27;ll be informed, but you&#x27;re not going to be</p>\n<h2>Rethinking Morning Routines</h2>\n<p>constantly like simultaneously terrified and exhilarated and exhausted. and it&#x27;s just going to make this a much more sane news stream in your life. Now, the the key point here is there&#x27;s a lot of good AI reporting going on, right? I&#x27;m just there&#x27;s more of it that has these traps, so you have to be careful to avoid it, but there&#x27;s a lot going on there that I like. Uh, you know, my home, the New Yorker, does like a ton of deep reporting on AI and not just my stuff. There&#x27;s like a lot of great stuff there. I like Cade Mets over at the times. I think he&#x27;s got a great rolodex so he&#x27;s able to get quotes from like the right people to put things in the context. A lot of good coverage. So just look out</p>\n<p>for those traps and skip the stuff that is uh showing off signs of those traps. All right. Now, I think this general project is important beyond just AI. This podcast is all about the fight for depth in an increasingly distracted world. And to understand what it is you&#x27;re fighting against means you have to be able to navigate technology coverage. So, we&#x27;ve seen these type of traps before. I used to get into it a lot with crypto bros. They were like the the blockchain is the future of all software. And I&#x27;m like, look, I&#x27;m literally a distributed systems expert. My doctorate is from the theory of</p>\n<p>distributed systems group. I just taught a doctoral seminar on the mathematics behind blockchains. I&#x27;m telling you, this does not make sense as a way to build software and it&#x27;s not going to take off. And they were like, you are crazy. We&#x27;re like six weeks away from the internet running on Ethereum or whatever. All of that went none of that happened. I was right. But I got yelled at a lot then. And there&#x27;s a lot of those same traps going on. We&#x27;re going to see those traps. You know, it&#x27;s AI now. It&#x27;ll be something else in the future. So, it&#x27;s just good in general to to know what to look out for. Not all coverage of technology can be fully trusted. So, there we go, Jesse. That&#x27;s</p>\n<p>what we have to worry about. &gt;&gt; I love your naming conventions with everything. It&#x27;s It&#x27;s always so good. &gt;&gt; Vibe digital ick faux astonishment. Yeah. All right. I like that. All right. Let&#x27;s take another quick break to hear from our sponsors. Listeners of this show know that in the world of business, I&#x27;m a fan of systems that can help organize the efforts of teams. Without systems, work devolves into random emails and Slack messages that distracts everyone and leads to missed opportunities. This is why I love Pipe Drive, a fantastic sales CRM system for small and medium businesses. Pipe Drive</p>\n<p>is easy to set up and use within minutes. You can have your whole team operating from one centralized platform where you can see all of your deals placed into a visual sales pipeline. You can customize that pipeline too to be exactly how your particular organization functions. You can also connect to over 500 apps from the pipeline marketplace which allows you to connect pipeline into whatever existing workflow you&#x27;re already using. So here&#x27;s the thing, a new year calls for a new CRM. If you&#x27;re starting a business or working in sales, I highly recommend you check out</p>\n<p>Pipeline because over 100,000 companies are already using Piperive to grow their business. Now, right now, if you use my link at piperive.com/deep, you can get a 30-day free trial, no credit card or payment needed. That&#x27;s pipedive.com/deep. I also want to talk about our longtime friends at MyBody Tutor. Did you make a resolution to get in better shape this year or to get healthier? Let me give you the solution. My Body Tutor. My Body Tutor is a 100% online coaching program</p>\n<p>that solves the biggest problem in health and nutrition, which is lack of consistency. And they do this by simplifying the process into practical, sustainable behaviors and giving you the daily accountability and support it takes to stick with this plan. The way it works is you actually check in with your online coach every single day using their app. And that coach helps customize your plan, your diet, your exercise. You could adjust it for what&#x27;s going on in your life. You have accountability because you check in every day. And that accountability leads to consistency. And consistency leads to results. So if you want to get</p>\n<p>healthier, this is the way to do it. So here&#x27;s the good news. If you mention my podcast when you sign up, they will give you $50 off your first month. So go to mybodytutor.com. That&#x27;s mybody tutor.com. and mention deep questions when you sign up. They get $50 off your first month. All right, Jesse, let&#x27;s get back to the show. Um, let&#x27;s move on to some practices. All right, so the idea of a morning routine is not new. I actually looked into this. Probably the the earliest written</p>\n<p>discussion of a morning routine goes back to the Jewish Talmid. If you look in track date, bro, broka, I&#x27;m saying the Hebrew wrong. the plural of Baraka. So sorry, sorry rabbis. Um the rabbis debate the worship obligations of the Jewish people and they make it clear that morning prayer morning prayers which are known as to feel shakit are an obligation right so if you read these morning prayers they&#x27;re pretty quite moving right you&#x27;re like when you wake up you&#x27;re acknowledging God you&#x27;re giving thanks for the fact that like you woke up it&#x27;s not a given you go to sleep it&#x27;s like a mini death uh that you lived another day</p>\n<p>like it&#x27;s a great morning routine so we&#x27;ve been talking about morning routines since the very beginning of the common era um but the point is right they&#x27;re we&#x27;ve been talking about for a long time. In recent years, morning routines have come back into vogue and there&#x27;s a particular interest in them from young people. And I say this because there&#x27;s a lot of morning routine uh content on YouTube right now and the audience of YouTube heavily skews towards young people. This is what got me interested. Why is there a</p>\n<p>resurgence even though this is an old idea of having a morning routine? Why is there a resurgence in interest in this concept right now among young people? So, I have an an explanation I want to offer that I haven&#x27;t heard discussed that often recently, but I think once we understand it, it&#x27;ll help all of us who are thinking about morning routines build better rituals. All right, so let&#x27;s just like start right away with what that factor is. All right, so Jesse, here&#x27;s what I think is going on. I think morning routines right now are particularly interesting to young people because of a need to escape technology.</p>\n<p>And let me explain this, right? If you&#x27;re uh if you&#x27;re like me, you&#x27;re a little bit older, you&#x27;re in your 40s, you have kids and like an office job, you don&#x27;t think as much about morning routines because you have one whether you want one or not, right? Like I have to get my kids to school. So it&#x27;s it&#x27;s a very clear morning routine. wake up, make coffee, make sure they have breakfast, get everyone packed up and out the door. I walk them to the bus stop, walk home from the bus stop, and then I can move into work for the day. Like, that&#x27;s a very clear structured routine that I have no choice but to do or not because like I got to get those</p>\n<p>kids out the door and it&#x27;s very structured what has to happen. But if you&#x27;re younger and you don&#x27;t have a family and maybe you have like a remote work job or something like this, your morning might be wide open. And so what&#x27;ll happen if you don&#x27;t have a routine for your morning? You&#x27;re going to pick up that phone and then that algorithmically curated content is going to capture your attention like this is really engaging. And then maybe when you&#x27;re trying to start work, you&#x27;re like, well, I&#x27;m going to let me go to email and Slack first because again, this is more engaging. I don&#x27;t I can kind of just like be passing</p>\n<p>messages back and forth or looking for something interesting to happen. And also I&#x27;m on my phone at the same time and you can look up and it&#x27;s like a.m. Like I&#x27;ve really done nothing but look at my phone and sort of answer emails. I&#x27;m not doing anything really useful. I&#x27;ve got trapped by the engagement of technology. This then is why I think young people are more interested in morning routines because if you can structure your morning, it can prevent you from falling into technological quicksand and it can get you into doing actual useful stuff much more quickly and then you feel much</p>\n<p>better about your day and your day is much more productive. So I think once we understand that which I think is a very good use for morning routines. Once we understand that being a primary goal of these routines, I think we can identify then uh some points that anyone can think about then about what makes an effective or non-effective morning routine. So I&#x27;m going to bring up a blackboard here to draw on. God help us when I draw. Um, for those who are listening and instead of just watching on this blackboard</p>\n<p>right now, it says morning routine principles. All right. So, I want to go through four principles for a good morning routine that is inspired by this idea of our goal here is to get into productive work without getting lost in technology. All right. So, here&#x27;s the first principle. I&#x27;ll just do pictures on here, Jesse, because people think my drawing is fantastic and you got to give people what they want. All right. That&#x27;s clearly a clock, right? Yep. &gt;&gt; All right. So, here&#x27;s what I mean by that. There&#x27;s no need for an overly long routine, right? 10 to 20 minutes should be enough</p>\n<p>max to help get your brain activated and focused and switch to like whatever productive thing you want to do in the morning. You don&#x27;t need a three-hour routine or a 4-hour routine or God help us, didn&#x27;t we look at like a six-hour routine when Brad was here a couple weeks ago? Um, once you&#x27;re past like 10 or 20 minutes can help you like reorient and get oriented for the day. going past that, there&#x27;s no uh continued aggregation of benefits. So, especially if you&#x27;re like losing sleep to get up super early or find yourself having to do like hours of effort, like that&#x27;s crazy for our goal</p>\n<p>of helping you to avoid technology traps. So, 10 20 minutes, that should be enough. All right, principle number two. Let&#x27;s see here. That look like someone doing a yoga pose. Yeah. &gt;&gt; Right. &gt;&gt; Down dog. &gt;&gt; Right. So, here&#x27;s like someone outside on a yoga mat, you know, doing a fantastically done um yoga pose. Here&#x27;s the principle I want to make here. You should find whatever whatever like flavor or twist or motivation makes a</p>\n<p>morning routine compelling to you. Because if it&#x27;s not compelling, you&#x27;re not going to do it. And if you don&#x27;t do it, you don&#x27;t get the benefits. Now, this is something I think that people often misunderstand because they think about things that make sense to them and then think about the twists that are compelling to other people as somehow like, well, that&#x27;s just weird, right? Like, that&#x27;s no good. That must be um, you know, you&#x27;re wrong or it&#x27;s grifty or something like that, right? But the point is is like you got to find what makes it compelling. So, for some people, like I drew here, a spiritual hook is what&#x27;s compelling. It&#x27;s like, I want to greet the sun in the morning.</p>\n<p>It&#x27;s like I&#x27;m greeting mother earth or like I want to through yoga and breathing I&#x27;m going to like connect to the ground in like the morning sun or something. And for like a lot of people that&#x27;s a really good hook. Other people they want to throw some like science at it, right? So they&#x27;re like no no no I want to go out and look at the sun because like Huberman told me it hits certain receptors in my visual cortex which creates a hormonal cascade which is going to help my circadian rhythm reset or something like that. Like maybe that&#x27;s exaggerated. Maybe that&#x27;s not like 100% true. But we&#x27;re not trying to get FDA approval for a drug here. We&#x27;re just trying to look for something to get you motivated. So some people like that</p>\n<p>sort of sciency type stuff around it. Um if if that&#x27;s what if protocols is like what makes you, you know, do it, then that&#x27;s fine, too. Like whatever it is that that works for you, um that&#x27;s what you should use because the worst morning routine is the one that you actually don&#x27;t follow. All right. Um principle number three. I&#x27;m going to draw here. These are like numbers. I&#x27;m drawing like a time block plan here,</p>\n<p>Jesse. Okay. So, why am I drawing a time block pan here? Well, my principle is you need a clear off-ramp from the morning routine into the productive activity that follows. So, you have to somehow connect. You&#x27;re doing this ritual to try to reorient your brain, get it ready to do stuff that it might not want to do,</p>\n<h2>Did I see somewhere that you’re filming a MasterClass?</h2>\n<p>but you then need to help get from there to the actual work, some sort of uh off-ramp into your day. And so it might be like at the end of your routine, you sit down and you draw out your time block plan for the day and then you start. Or it might be you go for a final walk where like you organize like what you&#x27;re going to write that morning if you&#x27;re a writer and then you you you come right down to your keyboard and just start writing or whatever it is. But have a well- definfined off-ramp that gets you from this into your day. Because if you do this whole ritual to orient your brain and get you ready for activity and then you just go into checking your phone, you&#x27;ve defeated the whole purpose, at least the</p>\n<p>technological escape purpose. All right, the fourth principle here. Let&#x27;s see. I&#x27;m going to draw this. I have an idea here. So, this is this is like someone holding up a it&#x27;s like a trophy or a championship cup. &gt;&gt; Uhhuh. like someone who&#x27;s like really excited about it. Uh don&#x27;t have unreasonable expectations for what your morning routine actually delivers. This is much more clear once we realize our goal here is not to get trapped in our technology and lose our morning. Get rid of other expectations. All right.</p>\n<p>For example, your morning routine is not a major driver of your health. We get a lot of this of like you do 70 different things involving supplements and this and that and I have to go into uh into this cold plunge to stimulate exactly this type of response or whatever it is and you try to get the sense of like by doing all of these steps each morning I&#x27;m going to be very healthy or going to have longevity. Most of that&#x27;s just BS, right? Like there&#x27;s super minor benefits you might get uh along the way. Um but they&#x27;re they&#x27;re minimal. Stolberg had like a good I forget exactly what the quote</p>\n<p>was, but he like went through the research on like cold plunges and it was like the positive a effect it gives you was so small it was like the equivalent of like eating a pastry you like like great yes you get some minor that you&#x27;re that&#x27;s not like the driver of all of your health, right? So don&#x27;t have expectations that these routines are going to um be a major driver of your health. Don&#x27;t have the expectations these routines are going to be a major driver of your success that if you do like these right 15 things in the morning you&#x27;re going to be super successful. It&#x27;s you&#x27;re not I mean it&#x27;s going to save you from getting trapped in your technology, but the work you do is still hard and becoming successful is</p>\n<p>still hard and you still have to build skills and it&#x27;s rare and rare and valuable skills and it&#x27;s complicated and it&#x27;s stressful and it might not work out and the morning routine can&#x27;t make that easier for you and the morning routine can&#x27;t guarantee you. Um what they can help you do is wasting time with a messy start to your day. That&#x27;s what they do. So set your expectations reasonably that that&#x27;s what I&#x27;m trying to do and then you&#x27;re going to have much better experience. So, let&#x27;s look at these four principles all together. Let&#x27;s do a quick uh focus. Um, don&#x27;t make it too long. Here, I&#x27;ll even for people who are watching, I&#x27;ll even use my pointer. All right. I&#x27;ve been teaching with my my</p>\n<p>iPad, so I&#x27;m used to this now. Don&#x27;t make it too long. 10 to 20 minutes is enough. Don&#x27;t be embarrassed about whatever hook gets you to actually do it, whether it&#x27;s pseudocience or pseudospirituality. Have a clear offramp into your day out of the morning routine. and don&#x27;t have unreasonable expectations about what your morning routine is going to deliver you. It is a way to avoid wasting your morning. I think that&#x27;s why it&#x27;s becoming popular among young people and I think that&#x27;s a good reason for anyone to try to think about their morning routine. And I think those four principles help you have something sane</p>\n<p>and get those benefits without going off the deep end like that uh gentleman we saw a couple weeks ago with the six-hour routine. I&#x27;ll tell you what the biggest problem was about that clip, Jesse, with Ashton Hall. People thought it was me. And then I had to explain like, &quot;No, no, no, no, no, no. That wasn&#x27;t that wasn&#x27;t me. That was fitness influencer Ashton Hall.&quot; Um, I thought it was pretty obvious because I mean, my deltoids are much better defined than Ashton Hall. They should have picked that out. So, that was the only mistake. Like, Cal, your morning routine&#x27;s really long. Oh, it&#x27;s Ashton Hall. So, there we go. So, I</p>\n<p>like I&#x27;m not anti-morning routines. You just got to know what you&#x27;re doing with it. And if you do, like they&#x27;re much it&#x27;s a much lower stakes thing. You can design useful ones. They help. They don&#x27;t change your life, but they make your mornings better. &gt;&gt; There we go. Morning routines. All right, let&#x27;s uh move on now to questions and comments. &gt;&gt; All right, what&#x27;s our first question, Jesse? &gt;&gt; First question is from Florian. Did I see somewhere that you&#x27;re filming a master class? This is true though. I was told by the masterclass team that the proper</p>\n<p>terminology is I filmed a course for masterclass. The courses aren&#x27;t called master classes. The company&#x27;s called masterclass. You film courses for masterclass. I learned all sorts of things, Jesse. Uh I did. I filmed a course last fall for masterclass. It&#x27;s primarily drawing from my book slow productivity with a little deep work in there as well. So it&#x27;s all about how do you do meaningful work without burning out? um or being overly busy or exhausted. So like the kind of core stuff I like to talk about is like redefining work at our distracted age and it&#x27;s out. It came out last Thursday. So you can find it if you&#x27;re curious. Go</p>\n<h2>Now that David Brooks left the NYT, will he start a Substack?</h2>\n<p>to masterclass.com Newport. Um also I&#x27;m pretty sure the newsletter that came out today will also talk about it if you want to learn more about it. U it was fun. Here&#x27;s the here&#x27;s the main thing I noticed. I have a lot of thoughts there&#x27;s a lot of thoughts about the future of media. this sparked me, Jesse. And uh read the newsletter. I&#x27;m kind of getting into this more. But the thing that was cool about filming a master class is I didn&#x27;t realize to get that TV level production quality. It&#x27;s such a different level of investment in crew than like even a</p>\n<p>really good podcast. Because I&#x27;ve been on all the major podcast, huge podcast, top 10 podcast, and they look fine, right? But typically, you&#x27;re going to have three thousand DSLR cameras and like two 26 year olds that like run them and do editing and that&#x27;s it, right? &gt;&gt; MasterClass, it was I counted it. The crew was over 20. &gt;&gt; That&#x27;s incredible. &gt;&gt; Over 20 people. Um, real pros. Real pros, right? You know, like the director had done a lot of TV. I knew the person doing my makeup had worked on the makeup for the Ryan Cougler movie sinners. Like it was really cool. Um, so there&#x27;s a</p>\n<p>there&#x27;s a gap between what&#x27;s required to get like full cinematic or TV quality video and like what&#x27;s happening in even high-end video podcasting right now. And so like a question that got I got thinking about after doing the master class is what&#x27;s going to happen when that gap closes. I think that&#x27;s a really interesting thing. So like MasterClass is an independent company, but they&#x27;re filming at that full sort of like streamer quality level. What&#x27;s going to happen when more and more independent creators are doing that as well? Where we no longer have this distinction between, well, the things I&#x27;m seeing on my TV from Netflix are very separatable</p>\n<p>in my mind visually from like the things I&#x27;m seeing on YouTube. When that gap closes, I think some interesting things are going to happen in the world of media that might not be the best things if you&#x27;re Disney Plus or Netflix. Um, so anyways, I have some interesting thoughts about media that spurn. I&#x27;m</p>\n<h2>Cal reacts to comments</h2>\n<p>going to put some of those into the the newsletter. But for now, the thing to know is yes, it was great. I enjoyed doing it. I think it&#x27;s an awesome class. It looks great. Uh, we there was like a wardrobe person like there&#x27;s a green room. They rented a mansion. Wardrobe person who just like went and bought a bunch of clothes and had them on a big rack like let&#x27;s try this, let&#x27;s try that. Okay, I think that looks good. It&#x27;s like all movie stuff. got be like the single nerdiest person since uh what was the guy? I was like the single nerdiest person to be filmed by that many people since the uh well I can&#x27;t remember the guy&#x27;s name. He was from</p>\n<p>Ferris Beller and then he had that game show. &gt;&gt; Oh yeah, &gt;&gt; Ben Stein. What was his name? &gt;&gt; You know what I&#x27;m talking about? The Beller. Yeah, that guy was kind of a nerd. Yeah. Um it reminded me of that. They were like, &quot;Oh god, we were just working with Michael B. and and now we got Cal Newport. &gt;&gt; Have you seen on Netflix the option to watch podcasts now? &gt;&gt; Yeah. So that I mean this is why this is what&#x27;s what&#x27;s interesting is the the standards visual standards for Netflix are reducing so as they bring on video pod some video podcast and the standards of independent media is getting higher. So these worlds are meeting and I think</p>\n<p>interesting stuff&#x27;s going to happen. You know why they&#x27;re putting podcast on there? &gt;&gt; Daytime TV. They&#x27;re losing to YouTube for daytime watch hours. They&#x27;re winning in the evening watch hours because their content is good and when people sit down to watch the show, they want to watch like high-end stuff. But during the day, people don&#x27;t put on Netflix, they put on YouTube, and they want those daytime hours. Like, we could really increase our viewership if we could have people put on daytime. So, they&#x27;re just paying to bring over these daily podcasts that have like pretty good production values. If we have these</p>\n<p>on Netflix, then people will watch them on us instead of YouTube. That&#x27;s it. &gt;&gt; So, like Bill Simmons, they brought over a bunch of his stuff. um bar stool sports, right? They brought over Yeah. Yeah. a bunch of those stuff. So, that&#x27;s interesting to see interesting trends. I think there&#x27;s a lot of interesting stuff. The future of media, visual media, which is the dominant media, sorry, Substack and newspapers, but it&#x27;s the dominant media um out there right now. Really interesting stuff I think is happening. as the gap between the high end and the independent goes away, we&#x27;re going to have an explosion of of</p>\n<p>changes, which I think will will largely be largely be good. All right. Uh, what</p>\n<h2>Cal gives his weekly reading update</h2>\n<p>else do we have? &gt;&gt; Next is from Will. I just saw the news that David Brooks is leaving the New York Times. Do you think he will follow a similar path to Krumigan and write for Substack? &gt;&gt; Uh, it is true David Brooks is leaving. I guess he left already. He&#x27;s left the Times, not unlike Paul Krugman doing it. Um, no, he&#x27;s not going to write a substack. So, these are two different situations. When Paul Krugman left the Times, he went completely independent. So, all he&#x27;s doing now is writing his substack and actually making a killing at it, but he&#x27;s only writing his Substack. David Brooks is not leaving the world of elite institutions to go independent. He&#x27;s just going from one</p>\n<p>elite institution to uh a pair of elite institutions. So, what he did is he took a position at Yale. And so now he has a Yale position as a a scholar and residence or fellow or something like this where I think he&#x27;s even going to do some teaching and then took a a journalism position at the Atlantic. And so I think what&#x27;s happening here, if I had to guess, I don&#x27;t know these details, but if I had to guess, there&#x27;s a there&#x27;s a pretty strong rhythm if you&#x27;re a full-time op-ed writer for the New York Times. You have to produce whatever it is like once a week or something like this. Like you&#x27;re constantly writing columns. Now I think that he he already writes for the</p>\n<p>Atlantic. These longer form things are less often. I think he&#x27;ll continue to do that. That&#x27;s a place for him to do his like long form less often articles. He&#x27;s also doing a podcast for the Atlantic. So, they&#x27;re going to produce it a video podcast. So, he&#x27;s going to be that&#x27;s going to I think he&#x27;s looking at like what Ezra Klein is doing. Actually, the Times has like Ross Du Hut and David French and more and more people are doing daily video podcasts. So, he&#x27;s switching more to that probably less writing and then he&#x27;s also teaching and and has his position at Yale. So, no, he&#x27;s not going Substack. He&#x27;s very much still entrenched in elite institutions. But, you know, it&#x27;s interesting</p>\n<p>interesting to see. You know, things definitely are uh shaking up. All right. I think we also have Let me see what I can find on here. I think we also have a few comments from last week&#x27;s episode. Last week, we talked about phones, right? We we did uh accounts, real accounts of people who spend extended amount of time without their phones and what benefits they reported and gave some advice about how to get those benefits without having to give up your smartphone. We have two YouTube comments to share here. The first comes from Summerrf Catz who said phone free life is for people who have friends. Well,</p>\n<p>it&#x27;s funny, but it&#x27;s also it is kind of true, right? That there one of the reasons why people are on their phone all the time is that it can give you a simulacum of sociality. If if you&#x27;re lonely, it&#x27;s it feels incredibly bad, but it&#x27;s hard to make and maintain friends. You have to sacrifice non-trivial time and attention on behalf of other people. these networks online, these apps online can kind of press the friendship sociality buttons just enough that you don&#x27;t feel like devastatedly lonely, but you&#x27;re also not really getting nourished. There&#x27;s a time a word for this in the social psych literature.</p>\n<p>They call it social snacking. You&#x27;re getting just enough sort of simulation of sociality that you don&#x27;t feel lonely, but not enough to actually be nourished. And so, yes, that is part of the problem. If you spend less time on your phone, you have to spend more time in the real world engaging with friends. My book, Digital Minimalism, gets into a lot of those details. So, I would recommend that. Oh, here&#x27;s another comment. This came from Clear Heart2658. Why does everyone who ditch these smartphones have an overwhelming need to live in the woods? Can&#x27;t you do that in a city? Well, that is a good point. Bejorn Bullhansen was definitely definitely living in the woods. That guy</p>\n<p>is awesome. Um, I think if you put Bejorn Bull Hansen into a a city, I don&#x27;t know what would happen. I think he would be run over by a cab within I I think he would wander into a street if he was in Manhattan and then one of those like petty cabs they have now where they&#x27;re blaring the really loud music. I don&#x27;t know if you&#x27;ve been to Manhattan recently, but this is the new thing. These bike powered cabs that just blare really loud music. One of those would come by um he would tip it. I think he would just pick it up and tip it over um and then jump onto a police horse and ride off in the Central Park. I think</p>\n<p>that&#x27;s what would happen if Bejorn Bullhans went to the city. No, you could do these phone free lifestyles or limited phone lifestyles. do them anywhere. I think Warner Herzog is often in cities, right? Uh yeah, why not? I mean, I guess you maybe have more reasons you need to use the phone. You&#x27;re more social. I don&#x27;t know. But no, you&#x27;re right. You don&#x27;t have to go to the woods. And sometimes all of these examples having soft music with people sitting in the woods can kind of turn people off because they live in the suburbs and they don&#x27;t plan to move to the woods and they still are upset with their phone. So, I think that is uh I think that is a good point. All right. Uh final segment like to talk about what</p>\n<p>I&#x27;ve been reading recently. Couple things to talk about. I read a book last weekend. Uh it was an advanced copy, so that&#x27;s not out yet. It&#x27;s coming out sometime this spring, but it was a topic I was interested in. So, you know, the author sent it to me and I read it. It was called Time Freedom by Brian Harriet. Um he&#x27;s a financial adviser and he&#x27;s sort of working through the numbers of financially supporting something like lifestyle design without having to either save up a huge amount of money that you can just live off of or go incredibly frugal. What&#x27;s what&#x27;s the other option? He talks</p>\n<p>about flexible income. So you have like relatively flexible entrepreneurial income and you can fill in some gaps as needed by drawing safely from your savings and you can actually have a much more flexible lifestyle. You&#x27;re working but working on your own terms. Uh you can have a much more flexible lifestyle that&#x27;s mixed work with other stuff much earlier than waiting till retirement without having to be super frugal. He&#x27;s an example. He&#x27;s financial adviser. He&#x27;s got a lot of flexibility and he&#x27;s arranged things so they can spend every summer by at a lakehouse not working. He&#x27;s like it&#x27;s not he&#x27;s not retired, but</p>\n<p>that&#x27;s also a very flexible life. He has time freedom. So, I thought that was an interesting book. There&#x27;s some ideas that reminded me of the Deep Life book I&#x27;m working on now. I also like Charles Doohig&#x27;s New Yorker piece on organizations. He was talking about the difference uh behind how the MAGA right and the Democratic left, they organize themselves differently and one has been more effective than the other. And then he sort of draws from sort of theory of how to organize and motivate change. It reminded me of some like classic cladwell stuff. It was interesting article. It&#x27;s called One Direction. Um I thought it was interesting. We might</p>\n<p>have even had it loaded up, but like I don&#x27;t know. I don&#x27;t need to find that. That&#x27;s okay. Uh then another book to mention. I haven&#x27;t read this yet. I just got a note about this from my cousin. So Jesse, my cousin Josh Douglas published this is the type of book I like. I like super high concept genre. I think can be a lot of fun, especially if you&#x27;ve been reading like more if I&#x27;m reading more like sober non-fiction, whatever. Sometimes it&#x27;s fun to throw in more high concept genres. So, he has a book out. I love this title, The Vampire, The Tutor, and the Mad Man. And here&#x27;s the description. It&#x27;s an</p>\n<p>action-driven novel full of monsters, mysteries, and pure evil hiding in an ancient castle deep in the remote mountains of southern China. Jonathan, a wayfairing English teacher running from his past through travel and alcohol. Uh, he takes a job from a serious employer who is nauseatingly wealthy and full of secrets up against wolves, bandits, mutant monsters, mad scientists, and his own demons. Jonathan risked all to save a gorgeous mute scholar made and get away wildly wealthy. That sounds fun to me. That&#x27;s the type of thing that&#x27;s like a thriller December reading. So anyways, that&#x27;s Josh Douglas. You can find that online. Uh, that was cool. Like high</p>\n<p>concept. Too many novels today. All the book club novels are all the same. It&#x27;s all like this sort of that&#x27;s really good. You know, there should be more mutant monsters or whatever. I think it&#x27;s fun. All right. Uh that&#x27;s all the time we have for today. Thanks for listening. We&#x27;ll be back next week with another episode. And until then, as always, stay deep. Hey, so if you like this discussion about traps and AI reporting, you might like episode 386, which will give you an example of good AI reporting when I was joined with AI commentator Ed Zitron to review the year 2025 and all the AI news that happened.</p>\n<p>Check it out. I think you&#x27;ll like it. So Ed is going to join me and what we&#x27;ve done is we&#x27;ve pulled the biggest AI stories of 2025, one per month for the entire year. We&#x27;re going to go through them in order and Ed is going to help us make sense of what was going on behind the scenes.</p>", "chapters_count": 7}