{"video_id": "mQZ1w4KzmXs", "title": "Dangerous Question: Has AI Been A Disappointment So Far? | Cal Newport", "link": "https://www.youtube.com/watch?v=mQZ1w4KzmXs", "published": "2026-01-29T11:00:00+00:00", "summary": "Cal Newport examines if AI has been a disappointment so far in this clip from a recent episode of the Deep Questions podcast.\n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\n0:00 Is AI a disappointment?\n3:20 Pattern finding\n6:10 AI and customer support\n8:50 Corporate trade secrets\n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=mQZ1w4KzmXs\">https://www.youtube.com/watch?v=mQZ1w4KzmXs</a></p>\n<h2>Is AI a disappointment?</h2>\n<p>Clearly, a huge amount of money is being invested into new generative AI tools built on large language models such as chatbots. And it&#x27;s just goes without saying this has been massively disruptive. Most of the conversation is about how do we deal with the disruption that has been caused by this new technology. But think about this question for a second. What actually are the things that this massive investment in generative AI through language models, what actually are the things that this has changed? Because if you ask people, they don&#x27;t</p>\n<p>always have an immediate answer to offer up. Is that possible? Well, I want to investigate this. So, here&#x27;s the way I&#x27;m going to do this. Um, I found a Reddit thread that was from three months ago. I&#x27;ll put this on the screen here for people who are watching. It says the same question. with all the billions or trillions going into it, what has AI actually done other than as a search engine and funny pictures. So, this is a thread where people from all over the internet are going to write in and do their best to explain all the various things that we&#x27;ve gotten from this</p>\n<p>massive investment in new AI technologies. So, whatever these benefits are, you would think they&#x27;re in this very popular thread. So, what we&#x27;re going to do is I want to go through this Reddit thread to try to come up with uh a list of the things that this recent massive invest in AI has produced. Now, a couple ground rules to this. I&#x27;m not going to include things uh AI applications. I&#x27;m not going to include AI applications that are based um aren&#x27;t based primarily on the new large language models that have received the</p>\n<p>bulk of this investment. So the type of models that OpenAI and Enthropic have been producing there&#x27;s a lot of existing machine learning driven AI tools that we&#x27;ve been working on for year after year and and over the time those have made progress. I&#x27;m going to separate that because that&#x27;s not that&#x27;s just the standard progress in AI and it&#x27;s not connected to anything new that has happened. I also want to separate into its own category the one obvious place where we hear most often about language models making an impact which is computer programming. Computer programming is like a best case scenario for gender of AI. It&#x27;s a highly structured language and we have a huge</p>\n<p>amount of very uh relevant data on which to train these. So we know it&#x27;s been really uh impactful there. So we&#x27;ll kind of keep that as its own column. What I&#x27;m looking for as we go through here then what I&#x27;m actually going to write down as we go through here is examples that depend on the generative AI models that we put billions of dollars in the last three or four years. But it&#x27;s not computer programming because clearly if this has really changed our world that list should be really long. All right. So I&#x27;m going to load this back up again. Um, and I&#x27;m going to go through I this is a very long thread, so I&#x27;m just going to pull do the best I can to go through this. All right, so the first thing we see</p>\n<p>here is assisting medical and scientific research and translating ancient documents written in dead languages. Um, none of the neither of those are really from generative AI assisting medical and scientific research. I mean, there are a lot of tools that we&#x27;re using in for medical research. We&#x27;re building AI tools, but that&#x27;s using existing technology that that&#x27;s been around pre uh the Gen AI boom. Um translation documents, that&#x27;s also machine learning tools have been around. We&#x27;ve been getting better at them, but that&#x27;s not directly related to the recent boom. All right, let&#x27;s keep going here. Um AI as a</p>\n<h2>Pattern finding</h2>\n<p>tool is incredible at very specific things, mostly things human finds to be incredibly mind-numbing and meticulous. Uh its best use by far is pattern finding in wide data sets that are hard to pick up by hand. So, I&#x27;m going to put that down. Pattern finding. I&#x27;m just writing this on paper here. So, pattern finding. I I&#x27;ve heard this. You can give some data to a chatbot and it can perhaps find you some patterns. Um, let&#x27;s keep going. Alphafold protein structure database. Uh, Alphafold is not based off of directly based off of the recent investments in Generative AI.</p>\n<p>They&#x27;ve been working on that model for well before the LLM breakthrough when it uses um its own technologies that have it has some new versions have some overlap with transformer attention ideas but that is sort of a separate trajectory that&#x27;s not a result of the billions and billions that have been invested in large language models. So um I&#x27;m going to put that to the side. All right. Next thing it speeds up a lot of menial computer task. I had it make a PowerPoint from six MSWordsiz document pages for me. It made 60 slides like a minute. Would have taken me an hour to do the same thing. I&#x27;m going to write that down. Like I I&#x27;ll put down slide</p>\n<p>production. Uh it&#x27;s more generally it can produce slides. Uh I&#x27;ve seen that in PowerPoint. That&#x27;s a good that required the investments that have happened. So we&#x27;ll put that down. Um let&#x27;s see. It&#x27;s incredible tool for programming. Okay, so we&#x27;re putting that aside. There&#x27;s an argument about that. Someone else says it&#x27;s a lot of bad code and then all the cloud code people come out with their their torches and get mad at them. Um here&#x27;s a different one. I mean, it really is useful for quickly disseminating a large volume of boring info into bite-sized pieces and identifying points of interest. I think</p>\n<p>this is right. So, I&#x27;m going to put down summarizing text. So, we&#x27;ve seen this a lot. Like, you can take a a bunch of notes like a meeting transcript and say, let&#x27;s let&#x27;s give me the give me the main points here. Summarize this in the bullet points. Um, language is very good at that. All right, let&#x27;s keep rolling here. Translation of any language to another. That&#x27;s not primarily a language model based thing. We&#x27;ve been doing that for a while. It&#x27;s being used to help detect cancer earlier than humans detect it. All of that sort of medical prediction model research is not those are not underlying it language models. That&#x27;s</p>\n<p>something people have been working on for decades and we keep getting a little bit better at it. But that&#x27;s sort of unrelated to the billions being invested in large language models. So I&#x27;ll put that aside. Um discussion discussion mapped every protein. We talked about that. That&#x27;s not large language models. Let&#x27;s uh keep moving here. Someone else described a bunch of stuff and then a response to that said most of the stuff you&#x27;re describing isn&#x27;t breakthroughs from the last three years a slow incremental process over the last 20 or more years. Um that&#x27;s right. So he was pointing out a whole long example of things that uh was not actually generative AI. Someone says take</p>\n<p>customer support. Call centers are</p>\n<h2>AI and customer support</h2>\n<p>already so heavily scripted they might as well be AI. Make AI good enough to hold a rudimentary guided conversation and it can replace basically every first level support person. That&#x27;s some speculation into the future, but I will put down uh customer support agents because there are more of those. I don&#x27;t think it&#x27;s necessarily replacing the industry as quickly as people predicted, but there are better sort of firstline chat agents that language models in particular made those good enough to deploy in a way that they wouldn&#x27;t have been before. All right, let&#x27;s go here. Um, a teacher in my family uses it to</p>\n<p>create a live avatar of himself that speaks fluently in multiple different languages as it records him teach in his native language. He&#x27;s been able to teach multiple classes in multiple countries at the same time. I guess that&#x27;s partially language models are probably involved in that. Uh, the language translation is something we&#x27;ve been doing from before. In the medical field, AI does a decent job transcribing notes. It&#x27;s not really a generative AI breakthrough though OpenAI has been working on voice to text. They have a special model for that, their sort of whisper model which they then have on the front end of chat GPT. So like if</p>\n<p>you talk to your phone into the chat GPT act app, you really have a separate smaller model that&#x27;s been trained. It&#x27;s a different type of architecture than a language model that converts that to text and then the text is submitted to the large language model. So that&#x27;s cool, but again that is not a result of the billions invested in large language models. We were already doing that. Um then someone came along, this is interesting, and said you can do things like tell it read this congressional bill and note anything that seems illegal, unconstitutional, or would adversely affect separation of powers, checks and balances or civil liberties ranked by risk and describe the worst</p>\n<p>case scenario, the worst possible abuse of the change considering an executive branch intent on consolidating power for itself. And the guy&#x27;s like, &quot;Oh, that&#x27;s the type of thing you could you could ask GPT5 to do.&quot; But then someone else wrote back and said, &quot;LMs can&#x27;t actually do that, though, right? There&#x27;s no reason, no imagination. they can&#x27;t create and explore scenarios in the way you&#x27;re explaining. They&#x27;re not going to give you good advice. So, I&#x27;m not going to write anything down. Someone else said, &quot;Check this year&#x27;s Nobel Prize in Chemistry.&quot; Well, that was given to Deep Mind for AlphaFold, which again is non- language model technology that predates the billions invested. Someone else says, &quot;It can make pretty</p>\n<p>good uh hint.&quot; And someone else said, &quot;Actually, it&#x27;s slop.&quot; So, I guess I won&#x27;t write that down. Someone else said, &quot;Write the answers to my stupid quarterly self-review questions.&quot; That is true, right? boring text. Yeah. So, it is really good for that. Like, oh my god, no one cares about this. I have to write a self-re. It&#x27;ll write boring, you know, good enough text that covers what you want. It&#x27;s very good at that. All right. Uh, let&#x27;s just do a couple more because I</p>\n<h2>Corporate trade secrets</h2>\n<p>think we&#x27;re seeing some patterns here. Someone else says there&#x27;s thousands of AI projects you don&#x27;t hear about because they&#x27;re corporate trade secrets. That&#x27;s not true. Uh, there&#x27;s a lot of that push of like, no, there&#x27;s all these amazing things you just don&#x27;t know about yet. They&#x27;re coming. Let me tell you, as someone who&#x27;s studied this for the last five years, they&#x27;ve we&#x27;ve always been quote unquote three months away from learning about the amazing thing that Open AAI or Anthropic or Google or Microsoft are doing behind the scenes. I have a lot of sources at these places. There aren&#x27;t magic projects. There isn&#x27;t. I mean, we heard this two years ago that OpenAI had AI was now doing all their programming and within a few</p>\n<p>months they&#x27;re going to start like leaping ahead in models completely made by AI. That was just made up. It&#x27;s just not true. They&#x27;re using the same coding agents that anyone else is using. So, uh, I get that. Um, we&#x27;ll do one or two more small QL improvements for businesses, automatically sending text messages to confirm appointments a few days prior, things like that. Sure, you can call it AI, but none of that has to do with advances in language models that have taken all these billions of uh, investments. And then someone says, uh, fake videos and influencers pushing fascism. There</p>\n<p>is a lot of fake videos. That&#x27;s not a good thing though. That&#x27;s a bad thing. Um, and then I saw something else in here. I&#x27;ll just write this down because I can&#x27;t quite find it, but basically someone was talking about it&#x27;s good for pulling out or summarizing complicated information and they talked about taking the municipal parking rules for where they lived and then chat GPT could kind of summarize them into something that&#x27;s easier. So, make sense of complicated text. All right, whatever. We&#x27;ve been going for a while here, right? Let me look at this list I just wrote.</p>\n<p>So this is, you know, AI is a the world is going to be unrecognizable. It&#x27;s the biggest thing that&#x27;s ever happened to us. How why are our kids even going to college? Like this is where we are now. Here is the list of things from this open discussion on the internet. Anyone who can come and tell us how the billions invested recently AI have changed the world. Here is the the total list of non-computer programming uh ideas that came out of this pattern finding, producing slides, summarizing text in the bullet points, customer service agents,</p>\n<p>writing uh boring text automatically, and helping to make sense of complicated text. Those are cool, Jesse. But if I just if I five years ago said, imagine a tool that could do those six things. you weren&#x27;t going to like Simpson style crash out of the window and then like jump on the back of a horse and ride off. It&#x27;s like oh that&#x27;s yeah it sounds like that good. I&#x27;m glad we&#x27;re making progress on that. So it&#x27;s kind of interesting and look I don&#x27;t want to go too far here and be like this revolution doesn&#x27;t matter. But when you put aside the computer programming stuff which is</p>\n<p>a discussion for another time it&#x27;s complicated more complicated than people make it out to be but that&#x27;s a discussion for another time. And when you put aside other AI stuff that&#x27;s unrelated to all these billions we invested, what we are getting right now out of the whatever it is $500 billion that have been invested uh into Generative AI, there&#x27;s not a ton of home runs yet. And I think this is an a difficult point for AI boosters is why there&#x27;s a lot of like what is going to happen next year? And we&#x27;ve done this five years in a row now almost. what is going to happen next</p>\n<p>year is where the conversation goes because I think it&#x27;s hard not to admit the real concrete things are coming a little slower than we think. Now there we we see these amazing demos. We see these things do great on benchmarks and we have all these scary scenarios which are real like look at these fake videos. What&#x27;s going to happen to truth or students can produce their papers on these things? But if we really think about it, the stuff that like what&#x27;s changing your mind, people are using this like a better version of Google and then they&#x27;re very narrow right now. Now, this doesn&#x27;t mean much bigger changes aren&#x27;t coming, but I thought this was an</p>\n<p>interesting sort of experiment to do that when we actually look at what has already come specifically from investing all of this money into gener. hard not to conclude that like so far um it&#x27;s not massive yet. Hey, if you like this video, I think you&#x27;ll really like this one as well. Check it out.</p>", "chapters_count": 4}