{"video_id": "JU4m7Lm6TlM", "title": "Replacing admin hours with teaching time", "link": "https://www.youtube.com/watch?v=JU4m7Lm6TlM", "published": "2025-11-18T16:55:03+00:00", "summary": "Brightwheel is a leading childcare management software provider and supports the small businesses that make up the $100 billion early education market. The software removes administrative tasks like billing, enrollment, and payroll—giving educators more time with children each day.\n\nLearn more about brightwheel: http://stripe.com/customers/brightwheel", "transcript_html": "<h2>Transcript</h2>\n<p>Even before families come to our school, before they even step foot in the building, we are interacting with them on Brightwheel. But then when the kiddos actually arrive, throughout their kids&#x27; day, they can see kind of a ticker tape of what&#x27;s going on. It gives them peace of mind. They know that once they&#x27;ve checked their child in that they&#x27;re well taken care of. The moment you have kids that becomes your life. Like, you have your work, sleep, and your children. We can be very demanding to really develop them to be kind great human beings and that demands go to the school.</p>\n<p>And that&#x27;s where we as Brightwheel come in. We are the leading childcare management software providers. We take a lot of the admin and problems that a school has to deal with away, which allows them to actually focus on what matters the most and that&#x27;s the development of the students in their care. As a director, harnessing this technology, it has freed up literally hours upon hours within my week to spend time in the classrooms, getting to know the kids and supporting teachers. With Brightwheel, you can set up whatever billing structure that you want. Previously, my billing might&#x27;ve taken four to five hours in one given day.</p>\n<p>Now it&#x27;s just 20 minutes. On the payment side, we&#x27;re able to provide an amazing experience there because we partner with Stripe. Receiving those payments on time are hugely important for our schools. They rely on that to the next day, already use those payments to pay the rent, to issue payroll. That is like an entire payment infrastructure that we would have had to build ourselves. Our goal is that parents and schools never even have to talk about these payments. It&#x27;s hugely important, but they don&#x27;t have to worry about it. My conversation with families is &#x27;How was your day?’</p>\n<p>‘Tell me about Grandma coming into town.&#x27; I can actually build a relationship because I&#x27;m no longer hounding families for payments. We&#x27;ve grown massively in terms of scale. Today, we are all over the US and Canada, schools from Australia to Africa to South America, millions of students on our platform. Onboarding is a really key aspect of our business. We have tools like Stripe Connect embedded in our platform and the customer-facing verification becomes a super seamless process for them. We&#x27;ve made enormous progress,</p>\n<p>but there&#x27;s still so many things we could do in terms of increasing the quality, but also the accessibility of early education around the world. Handling our subscriptions and payment and financial aspects of the business through Stripe allows us to use our cash flows that come in reliably and consistently to actually reinvest it in R&amp;D and innovation. It allows us to deploy our engineers to other aspects of our platform, building more products or making our existing products even more accessible, and our brand has become synonymous with high quality and reliable childcare. The extra time that Brightwheel has given back,</p>\n<p>really having that time with the kids to support that learning journey and having that interaction is literally my job and the best part of my day if I could say so.</p>", "chapters_count": 0}