{"video_id": "hHFpsi1LAY8", "title": "Forget Your Phone. You Need a Single-Purpose Notebook! | Cal Newport", "link": "https://www.youtube.com/watch?v=hHFpsi1LAY8", "published": "2025-12-29T11:01:18+00:00", "summary": "Cal Newport explains why you need a single-purpose notebook in episode 385 of the Deep Questions podcast.\n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\nIn this replay of a classic episode from March 2024, Cal discusses his transformative experience using a small analog notebook to tackle a complicated problem in his life. He makes the broader argument that sometimes simple analog tools can far exceed the utility of their digital counterparts.\n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\nLinks:\nGet a signed copy of Cal’s “Slow Productivity” at https://peoplesbooktakoma.com/event/cal-newport/ \nCal’s monthly book directory: bramses.notion.site/059db2641def4a88988b4d2cee4657ba?\nhttps://www.notebookstories.com/2013/05/06/picasso-sketchbook/\nhttps://www.anothermanmag.com/life-culture/10788/remembering-bruce-chatwin-the-greatest-travel-writer-that-ever-lived\nhttps://www.notebookstories.com/2023/12/22/a-notebook-in-the-movie-elf/\nhttps://www.wsj.com/tech/personal-tech/quitting-tiktok-less-swiping-more-sleeping-1e166a39?page=1 \nhttps://www.newyorker.com/culture/cultural-comment/tiktok-and-the-fall-of-the-social-media-giants\n\nThanks to our Sponsors: \n\nhttps://www.monarch.com/deep\nhttps://www.1password.com/deep\nhttps://www.makeheadway.com/deep\nhttps://www.meetfabric.com/deep\n\n0:00 Single-Purpose Notebooks\n21:58 If “pseudo-productivity” isn’t effective, why is it so common?\n29:54 Can you explain the difference between limiting missions, projects, and daily goals?\n34:18 Should everyone buy a $50 notebook?\n43:08 How does “Slow Productivity” relate to mental models and first principles?\n47:40 Should I read your new book slowly?\n53:10 Struggling writer obsessing over quality\n58:14 Applying lifestyle-centric career planning \n1:01:39 TikTok Falters\n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<h2>Single-Purpose Notebooks</h2>\n<p>Back when I was doing my book tour for Slow Productivity in the spring of 2024, I had an idea that I was trying to make progress on and I grabbed at the last minute before I headed out the door a small singlepurpose notebook and I carried that notebook with me wherever I went. And when I would go to grab dinner or go to grab coffee, I would actually often not even have my phone with me, but bring that one notebook that was dedicated to trying to make progress on that problem. and it really worked. So, I recorded a podcast episode back then</p>\n<p>where I where I lay out my whole theory of single-purpose notebooks. Why using a small notebook dedicated to a single problem instead of your phone is a fantastic general strategy for making progress on the ideas or issues or personal problems or personal development that you are most interested in. I mean, after that experience, I actually bought Jesse has seen this uh a giant essentially case full of these notebooks. So now I can always grab one when I have a new problem to work on. Anyways, I wanted to revisit that episode because I get into the weeds of how this works, when you should use it,</p>\n<p>and how to get the most value out of it. And so that&#x27;s what we&#x27;re going to do today. I&#x27;m going to replay this classic episode. This originally aired in March of 2024 about using singlepurpose notebooks. Um, I think you&#x27;re really going to enjoy it. So, my recent book tour, uh, I didn&#x27;t have room in my bag. So, I was packing for two weeks. I didn&#x27;t have room to bring my normal remarkable digital notebook. But, I knew there was a particular idea that I wanted to work on related to a new book</p>\n<p>that I&#x27;m just starting to ideulate about. So, at the last minute, as I was running out the door, I grabbed the Fields Note notebook. was a a a small pocket-size notebook that I had lying around. The first 10 pages were already taken up with actually sketches from my kids, but I just grabbed this and I brought it with me to work on and it worked remarkably well. I brought it with me in my pocket almost everywhere I went. I worked on this book idea in bars, at hotel breakfastes, waiting in recording studios to start recording</p>\n<p>interviews in my hotel room, uh, on the beach in Santa Monica, as well as walking next to Ladyberg Lake in Austin. Um, I ended up capturing some really interesting thoughts in here. I thought it was very successful. So this idea of a small notebook dedicated to a single creative idea, what I&#x27;m calling a singlepurpose notebook, is something that&#x27;s now starting to fascinate me. So I want to explore it in today&#x27;s deep dive. What&#x27;s going on with this idea? Why does it work? Where does it not work? And and what should you take away?</p>\n<p>So I want to start by noting I&#x27;m not the first to discover this. This idea of having single-purpose notebooks that you use to develop particular ideas is quite common. I have a couple visuals here for those who are watching. So, I&#x27;m pulling up on the screen right now. These are notebooks from Picasso. He had these sketchbooks. I have one loaded on the screen right now. He&#x27;s doing a an ink sketches of workers in the water with some annotation. Here&#x27;s another Picasso sketch page. He would bring a Moleskin style notebook. Moleskin being a sort of</p>\n<p>it&#x27;s a brand now, but it was a general type of notebook that was especially in Paris was available with an oil skin cover. He just had these notebooks with him to develop his artistic ideas to work through sketches. Um, let me try this, let me try that, let me annotate this. Right now, he wasn&#x27;t alone in that. Here&#x27;s another example. Bruce Chatwin, the famous British travel writer. Actually, very dashing. See if I get a picture of him here. Sort of like a dashing adventurous guy. I want to read some Bruce Chatwin. Um, but he famously</p>\n<p>carried around these style of notebooks as well. Have a picture of one loaded up here. Uh, he would get them from a particular notebook store in Paris and he would buy them in bulk and he would bring them on his his adventure travels and just take notes on the trip and then would convert these into his sort of fame book. So, we see one of these notebooks here. Here&#x27;s another picture of some uh Chatwin style notebooks or these might be his exact notebooks. Some of these are in museums you can see. So again you have this idea this romantic idea of the traveler you know his first book was on journeys through Patagonia</p>\n<p>with his small notebook just working on this one idea what I am encountering and learning a singlepurpose notebook uh perhaps the the most famous example Miles Finch from the movie Elf the Will Frell movie Elf as portrayed by Peter Dinklage I&#x27;m showing here on the screen he had this famous idea notebook it&#x27;s right there you can kind of see it on the screen Uh, I&#x27;ll zoom in. This was the the notebook that was contained all of his ideas for children&#x27;s book. So, the Miles Finch character was this uh hired gun that you could bring in to</p>\n<p>write fantastic picture books. And so, he had this notebook where all of his ideas were. I actually found Jesse an analysis of online from a notebook enthusiast website where they actually went through and tried to understand from these still footages exactly what sort of notebook Peter Dinklage was using in the movie Elf. But then again, here&#x27;s the point though. Single purpose. It&#x27;s just ideas for uh children&#x27;s book and I have a single purpose for the notebook. All right. So, I didn&#x27;t discover this idea. Um it&#x27;s also not the only type of way to take notes.</p>\n<p>Obviously, we&#x27;ve we&#x27;ve talked about this on the show before. U it&#x27;s one of multiple ways to take notes. So, let I&#x27;m going to draw some let&#x27;s draw these here. Throw caution to the wind here. All right. So we have this way we just talked about which I&#x27;ll illustrate on the screen by drawing a sort of field notes style notebook expertly drawn. Um but there&#x27;s other ways to take notes as well. So like in episode 287 I&#x27;m just trying to put this singlepurpose notebook in a larger context of note takingaking. In episode 287</p>\n<p>I talked about how I take notes professionally like the the main way I take notes. And I&#x27;m drawing a laptop here because the the key idea about how I take notes for articles, books or academic academic uh research as well is my whole argument in episode 287 is you really should just go straight to the tool you use to do that work. So for books or New Yorker articles, capture notes in the research folder in a Scriber project that you&#x27;re going to eventually use to</p>\n<p>write that book or write that article for an academic article. go straight to to Latte and mark it up and have it straight in the collaborative document you&#x27;re going to use to write the paper for various reasons. That&#x27;s uh what I recommended there. There&#x27;s also this whole other approach which is popular the sort of zeal castenbased second brain approach. So I&#x27;ll just kind of draw a brain here where you have a sort of all powerful system that captures all notes on all things and and if uh the zealcasten inspired versions of second brain systems you can also have serendipitous</p>\n<p>discovery of new ideas from this like collection of notes. There&#x27;s there&#x27;s other dominant ways that people think about taking notes in our current digital world. Uh Jesse, would you say that picture of a brain is something detailed enough that you could do like anatomy studies on? I think it&#x27;s pretty much it&#x27;s that accurate. &gt;&gt; I&#x27;ve seen you write a brain before and that one is um average. I&#x27;ve seen you make a better one before. &gt;&gt; Yeah, it&#x27;s not my best brain. Not my best brain. Um so we have different approaches for taking notes. I want to put this in context, right? And each of these approaches have their own uh they have their own context in which they</p>\n<p>make sense. Right? So this my professional note system. I&#x27;m going to label it. You know, this is good for big projects. I&#x27;m working on a project. I&#x27;m writing an article or a paper or a book. I&#x27;m working on a project. I got to have to collect a huge amount of information relevant to this project and then eventually make uh make sense of it. Professional note-taking is uh about organization, right? The actual thinking about this information is going to occur in a very structured way. You&#x27;re going to have like long deep work blocks put aside for you to work on this project. I&#x27;m going to go for a long walk to do nothing but think about how to make</p>\n<p>sense of all this information. So, it&#x27;s note-taking as organizational system. the uh second brain, you know, I think this approach is there&#x27;s two things it&#x27;s good for. One is if you collect a lot of unstructured information, meaning stuff that&#x27;s interesting, but you don&#x27;t know what to do with it yet. Something like a second brain system could be beneficial because that&#x27;s what&#x27;s really good at like just put this in here. We&#x27;ll find connections between information. Um, so if you&#x27;re someone who sifts through a lot of information, wants to hold on to a lot of information, maybe wants to serendipitously surface ideas, something</p>\n<p>like a second brain system makes sense. Um, it&#x27;s also good for people who like that technology. Some people really like building these sort of digital information management systems. It&#x27;s a hobby and it&#x27;s a cool one. So, it&#x27;s good for that. So, what is the singlepurpose notebook method we&#x27;re talking about today? What is it good for? And I&#x27;m going to label this creative exploration. I&#x27;m going to write that right here on the screen. as an aid for exploring a uh single idea that&#x27;s going to require extended thinking and creative insight to come</p>\n<p>together. This is where I think the singlepurpose notebook can play a big role. So why is this method just having one notebook dedicated to a single thing you&#x27;re trying to understand better or think about or have creative insight? Why is this method work so well? Well, there&#x27;s a couple things you get working with a dedicated notebook. One is neuroscientific is focus is your context, your cognitive context. Everything in this notebook will be related to the one thing you&#x27;re trying to develop. So when you open this notebook and flip through it and start</p>\n<p>writing, all your brain associates with this notebook is that one topic you&#x27;re working on. So I was working on a book idea in this notebook. That&#x27;s what my brain associated it with. So when I pulled out this notebook, that&#x27;s what I&#x27;m thinking about this project. and I can slip into that cognitive context quicker, meaning I can get insights that are higher quality faster. This is different, for example, than pulling out your phone and talking to the notes application. Your phone represents all sorts of cognitive context. There&#x27;s email, there&#x27;s games, there&#x27;s social media on there. Your brain starts going all over</p>\n<p>the place, right? It&#x27;s the dog salivating when the digital feed bowl is being brought in from the kitchen. Same thing when you go into a professional note takingaking system. Um, you know, you associate this with work and all the different types of things you work on. It puts you in a work mode, but maybe that&#x27;s not where you want to be where you&#x27;re trying to develop an idea creatively. You&#x27;re trying to be original. Same thing with the second brain system. It puts you in the sort of not just brainstorming mode, but a mode that&#x27;s associated with everything. There&#x27;s so much unstructured information. Single-purpose notebook. This is for this one thing. So, it puts</p>\n<p>your brain into the the right mindset for not just capturing thoughts, but developing them. It&#x27;s also extremely low friction. So, when you&#x27;re working on a new idea that&#x27;s non-trivial, serendipity plays a big role. I&#x27;m walking, I&#x27;m in the car, and oo, I just had a flash. The friction in getting that idea into this notebook is minimal. You take it out of your pocket, you open it, you write. Nothing&#x27;s turned on. You&#x27;re not opening any apps. You&#x27;re not typing with your thumbs. And so it&#x27;s very well suited for exactly the information flow that describes this</p>\n<p>type of creative development of a focused idea which has these moments of serendipity and quick capture. The third reason why this method works well is ritualistic. There&#x27;s a ritual around it, right? I mean the the shape of the notebook, the associations you have between this and Bruce Chapwin, you know, on an iceberg somewhere in Patagonia romantically writing his thoughts down. It it&#x27;s it&#x27;s a ritual of pulling out a notebook you a well-worn notebook that you you just like the shape and the feel of and a pen that you really like. That ritual also</p>\n<p>helps puts you in a mindset for in this case creative exploration in a way that just loading up your laptop does not or taking out your phone does not or looking into an interface for an unstructured information storage system does not. Right? there is it&#x27;s a ritualistic aspect to this that uh puts you into that mindset. So when you put these three things together, the focus cognitive context, the ritualistic aspect, the extremely low friction, um it becomes a very effective tool for the creative exploration of a single topic, something you deploy for a single topic.</p>\n<p>It works very well for that. All right. So what&#x27;s the protocol here? Well, if you do creative work as part of uh your job or your leisure life, things that require extended thought and creative insight, buy a bunch of notebooks, small like Moleskin or even I like these Fieldnote ones even better because it&#x27;s flexible, very thin, so it fits right in your pocket. Get a pen you like that writes really well on the paper. I still use my Uniball micros.3 millimeters, but whatever you like, and start bringing them with you to tackle a particular problem. This is my notebook</p>\n<p>for this. Uh I I want to wrap my mind around this new idea and maybe write an article about it. I will carry this notebook with me until I have something smart to say about it. I need to figure out a product doesn&#x27;t feel right. A product market fit here is not right. I&#x27;m going to bring a notebook with me until I feel like I have my arms around it. There&#x27;s something going this not might be non-professional. You know, there&#x27;s something about my life that&#x27;s not feeling uh good. I it&#x27;s what what what&#x27;s happening in my career? or I feel this is something non-de I&#x27;m not resonating here something is not</p>\n<p>right I&#x27;m going to bring this notebook with me till I have an idea about what is right that&#x27;s the protocol you have a stack of these when a problem comes up that requires extended thought and creative insight you grab one dedicate it to that and when you&#x27;re done you&#x27;re done with that notebook don&#x27;t use it for multiple things don&#x27;t say well I only used five pages so now I want to use the rest for another problem say no this notebook is for this idea that&#x27;s what it is it is a in the end will be an artifact reflecting my thinking on that particular idea. It is a a hack for extracting more</p>\n<p>creative insight out of the human brain. We are by far not the first people to think of it. But this idea which used to be common I think as being less common in an age of digital tools and a lot of these digital tools just don&#x27;t serve the same purpose. Picasso on an iPad or Bruce Chatwin, you know, typing into Obsidian would not be the same as just having the the single-purpose notebook that you can romantically and creatively just pull out as needed and develop your thoughts.</p>\n<p>So, I like this idea. I&#x27;m going to do more of it. I&#x27;m going to buy a bunch of field notes and I&#x27;m going to have a stack and I&#x27;m just going to grab them. Hey, this week I&#x27;m using this notebook for this idea one at a time. I&#x27;m excited about it. I&#x27;ve done this off and on before, but I&#x27;m excited to have an official protocol here to actually pull from. &gt;&gt; Actually, I was going to ask you about that. So, if you have multiple things you&#x27;re thinking about, you&#x27;ll just kind of think about one per week with that notebook. &gt;&gt; Yeah. Or I&#x27;d have two notebooks &gt;&gt; in your pocket. &gt;&gt; Yeah. But maybe I&#x27;d only bring I&#x27;d probably just bring one with me at a time. You know, hey, I&#x27;m going to be gone all day doing X. This is the idea I&#x27;m going to work on, so let me pull</p>\n<p>that notebook with me. &gt;&gt; Yeah. &gt;&gt; Yeah. That&#x27;s what I would do it. I wouldn&#x27;t have two notebooks with me at the same time. I always carry around a notebook to like write down things I forget and I have it in like in a little golf holder, but it actually has a slot for like two so I can possibly put another one in there for like an idea for like a separate one. &gt;&gt; Yeah, I think a capture notebook&#x27;s another good idea. Um, this I always carry that. &gt;&gt; That&#x27;s a David Allen idea. Yeah. Right. Like you you want to have something to capture stuff you have to do as soon as you think of it so that it&#x27;s not just in your head. uh they&#x27;re not as common now because most people spend so much of their day</p>\n<p>near a digital device where they can do that capture that it doesn&#x27;t come up that often. &gt;&gt; But if you spend a lot of time away from such a device, I think I think that&#x27;s a great idea. So you could definitely have two of these things. Yeah. &gt;&gt; Capture and idea notebook. The other question people often have is when do I read it? &gt;&gt; And I would say weekly plan, &gt;&gt; right? So if you&#x27;re using a single purpose idea notebook, when you do your weekly plan each week, that&#x27;s a good time to sort of go through this take stock. Where am I? Did I reach some conclusion that I now want to put into my strategic plan? Or do I want to put aside time now to actually like take the</p>\n<p>ideas and build a plan and start a new project? Just confront it every week. And it might just be, nope, still working on it. Uh had some ideas, nothing great yet, and there&#x27;s nothing else to do. But knowing that you will look at these active idea, single-purpose idea notebooks. Knowing that you will look at them each week will also give you confidence to let these ideas leave your mind. or they will otherwise be a source of stress like don&#x27;t forget don&#x27;t forget don&#x27;t forget we had this great idea about this book don&#x27;t forget don&#x27;t forget you really need a way to offload that into a notebook that you trust you will check so I would say use your weekly plan as</p>\n<p>where you just check in on whatever notebooks you were actively using that week and if you&#x27;re ready to act on it that&#x27;s a great time to actually figure out what you&#x27;re going to do this might be a task goes into your Trello board time is put aside on your calendar a project is started but you really need to trust that the notebooks won&#x27;t be forgotten that the ones you&#x27;re using will be checks. I think the weekly scale is probably the right scale. &gt;&gt; In Isacson&#x27;s book about Da Vinci, he had a lot of notebooks. &gt;&gt; Yes. And that&#x27;s all they had back then. &gt;&gt; Yeah. &gt;&gt; Yeah. I mean, I I it&#x27;s interesting. It&#x27;s part of integrating the digital. Like</p>\n<p>we&#x27;re in this new digital age. We&#x27;re trying to live deep lives. Half of this is I&#x27;m not going to do halves. Let me do thirds. Like a third of this is like knowing what not to use. Don&#x27;t get stuck using Tik Tok all the time. A third of it is knowing what to use, right? That okay, I I need to take advantage of the opportunities that new technologies make possible. This is like us with a podcast. This didn&#x27;t exist 15 years ago and now it could be like like the cornerstone of me reaching an audience and making a living. Um, and like the other third is like knowing the analog stuff to really embrace to make sure</p>\n<p>that the digital isn&#x27;t completely pushing you around. And this is like one of those cases for ideiating. This is much better than what we&#x27;re doing digital. So like the intentional use of analog is is really critical when you&#x27;re trying to analyze the digital. We forget the analog when we think about what to do or don&#x27;t do in the digital. But you know having the right analog bullwarks against the digital incursion is just as important as just focusing on the incursion itself and trying to pick and choose what you&#x27;re getting involved with. Also, it&#x27;s cool. Bruce Chapman&#x27;s a cooler rider than I am. That&#x27;s what I&#x27;m thinking.</p>\n<p>&gt;&gt; Well, he probably did it longer than you. You&#x27;re getting there. I need to wear a cool leather jacket more often. &gt;&gt; He&#x27;s going to obsess over quality. &gt;&gt; Wear wear aviator glasses and like a leather jacket. But I hate kids. Smoke smoke marbell reds. I think that&#x27;s what&#x27;s going to do it. Stay deep. Stay deep in efers. Smoking my cigarette. &gt;&gt; French accent. &gt;&gt; Lot of French. A lot of berets. All right. So anyways, uh we got a lot of questions coming up. It&#x27;s going to be a slow productivity corner takeover. Uh before we get there, let me first mention one of the sponsors that makes our show possible. Look, it&#x27;s New Year&#x27;s</p>\n<p>season, which means if you&#x27;re like me, you&#x27;re starting to think about how to get your finances back in order so that you can start saving for those visions of a deeper life. Now, if this is you, you need to be using Monarch, which was rated Wall Street Journal&#x27;s best budgeting app for 2025. Monarch is the all-in-one personal finance tool that brings your entire financial life together in one clean interface. You can access it right from your laptop or phone and it tells you exactly the status of your assets and exactly how you&#x27;re spending money in a beautiful interface. Seriously, this is the best</p>\n<p>looking financial app I&#x27;ve ever seen. And that makes you more likely to use it. And if you use it more, you regain more control. So, this season is the best time to get a grip on your finances. And Monarch is the way to do it. Don&#x27;t let financial opportunity slip through the cracks. Get this app. Now, here&#x27;s the good news. If you use code deep at monarch.com and you have to access this on your browser, go to monarch.com and use the code deep, you will get half off your first year. That&#x27;s 50% off your first year at monarch.com.</p>\n<p>Use the code deep and access that in your browser. Also want to talk about our friends at One Password. Here&#x27;s the thing. It&#x27;s easy to assume that being small means flying under the radar, but the reality is that small businesses are being targeted more and more by bad actors. Cyber criminals know that lean teams often lack the resources to prevent or respond to a breach. In short, here&#x27;s the bad news. Teams of any size can be a target. But here&#x27;s the good news. Even the smallest of teams can foil cyber crime if they use one</p>\n<p>password. One Password provides centralized management to make sure your company&#x27;s loginins are secure. It&#x27;s a simple turnkey solution that can be rolled out in hours whether you have a dedicated IT staff or not. And this matters because compromised passwords are the number one way bad actors attack companies. So, a password manager should be the first security purchase you make for your team. Now, don&#x27;t let the name fool you. Uh, they&#x27;re not just a password manager. One password enterprise password management lets you securely store and share developer secrets and other sensitive data and helps streamline and transition to passwordless authentication by</p>\n<p>transitioning to pass keys. Think about one password as a service designed to meet small teams where they are but to also grow with your company. Take the first step to better security by securing your team&#x27;s credentials. Find out more at onepass.com/deep and start securing every login. All right, let&#x27;s get back to our episode.</p>\n<h2>If “pseudo-productivity” isn’t effective, why is it so common?</h2>\n<p>All right, every question today will be slow productivity themed. All right, Jesse, what&#x27;s our first one? First question is from Sam. You define pseudo productivity as the use of visible activity as the primary means of approximating actual productive effort. With this being so common, what are your thoughts on how all these knowledge work businesses are still profitable with all these workers kind of pretending to work? &gt;&gt; Yeah, it&#x27;s a great question. I mean, this is the key argument of part one of my book is that what happened in knowledge work is it emerges as a major economic sector in the mid 20th century. They have this problem of how do we</p>\n<p>measure productivity? In the industrial sector, it was quantitative products produced per input hour. The agricultural sector was quantitative. how much bushels of crop that we produce per acre of land under cultivation. That ratio, quantitative ratio approach did not apply to knowledge work because now there&#x27;s not a single thing you&#x27;re producing. Individuals produce many different things and those sets are dynamic and often incomparable. What I&#x27;m working on is different than what you&#x27;re working on. And the systems by which I&#x27;m organizing and managing my work are internal. So there&#x27;s no uh clear or consistent</p>\n<p>workflow system that you can even optimize to see its impact. So, so we couldn&#x27;t use traditional productivity. So, what did we do instead? We fell back on this rough heristic shooter productivity which says we will use visible activity as a crude proxy for useful effort. So, I&#x27;m just going to let&#x27;s let&#x27;s all gather in the same office. I want to see you working work while you&#x27;re here and at least something useful will be getting done. All right. And this worked okay until we got the front office IT revolution until we got networks and mobile computing. Um, and</p>\n<p>then suddenly pseudo productivity plus the ability to demonstrate fine-tune work on your phone or laptop at any moment. That was a a toxic combination that sparked the the burnout crisis that we&#x27;re all facing now. All right, so that&#x27;s the whole setup. Sam is saying, well, if pseudo productivity is such a crude heristic, um, how are companies still surviving? Well, there&#x27;s a couple there&#x27;s a couple answers here. One is this notion of managerial capitalism. It&#x27;s a notion that I really came to understand from Alfred Chandler&#x27;s uh Puliter Prizewinning book, The Visible Hand, where he looks at the rise of large</p>\n<p>companies with managers, which is newer than we think, huge companies with managers, is not something that was really widespread until the 20th century. And one of the things that Chandler argues in this book is that once you have a a manager-based company, a large company that does different things managed by managers as opposed to a smaller shop just sort of run by the owner, you begin to get a separation between how it internally operates and market signals. So the managers inside these companies</p>\n<p>uh they optimize for things different than just what&#x27;s going to produce the highest value overall. They optimize for things like stability. They optimize for things like risk reduction. They optimize for things like convenience or efficiency or flexibility in in sort of how they run their own jobs, how they manage their employees. Because that&#x27;s their incentive is not some vague bottom line that has a complicated dynamic connection between what their individual employees are doing and how much money the company makes. Their incentive is like, I want to keep this job stable and understandable and I keep my arms around it.</p>\n<p>So managerial capitalism, I believe, is what helps keep things like pseudo productivity and its sort of uh terrifying stepchildren, like the hyperactive hive mind, email workflow, the Zoom all day, remote work uh strategies, like the things that would that seem so absurd and terrible and distracting today. They can survive because they&#x27;re also simple. They&#x27;re stable. It&#x27;s uh easy to deploy. You&#x27;re not going to rock any boats by saying everyone should have an email address. we all have a shared calendar. Let&#x27;s just rock and roll,</p>\n<p>right? So, you can have uh operations within knowledge work companies, especially large ones that are somewhat insulated from market signals. The second reason is in these complicated knowledge work organizations, most people are not directly connected to the bottom line in the same way that you might have if it&#x27;s just here&#x27;s an assembly line. And if like one person on the Model T assembly line is really slow, it directly affects the number of Model T&#x27;s we&#x27;re producing. Like you&#x27;re really slow putting steering wheels on and it&#x27;s really slowing down the rate at</p>\n<p>which Model T&#x27;s are produced. Knowledge work is not like that. In fact, in a lot of knowledge work, what you find is a small number of people actually producing the the bulk of the cognitive capital on which the the money itself is actually made. Right? So, so in the book, I would call this like the Anthony Zukier effect from a a story I tell in part one of the book about CBS, the television network, um how they turned around their fortunes in the late 90s, early 2000s, right? So the story talks about how they were in third place among</p>\n<p>the major networks. They hire Les Moonveves. You got to turn this ship around. And Les Moonveves turns up. He&#x27;s a pseudo productivity guy. Uh and he says, &quot;Here&#x27;s the problem. I am here at like 3:00 on a Friday and the offices are half empty. We need more visible activity.&quot; And he sends out this memo. At ABC, you better believe they&#x27;re probably still in their offices at 3:00 on a Friday. at uh NBC, you better believe they&#x27;re, you know, in their offices at three o&#x27;clock on a Friday. You better be as well. Like that was his approach to turning around their</p>\n<p>fortunes. And within a few years, they were number one. But the argument I make is they they were not number one because uh Zukier told the employees at Television City to spend more hours in the office. Um I mean Moonveves. They were number one because of this eccentric showrunner Anthony Zukier who came up with the idea for CSI. and CSI plus uh Mark Bernett, this crazy Australian producer who came to them with an idea for a show called Survivor. Those two ideas turned around the whole the whole uh network. Huge ratings hits pushed them up to number one. So the</p>\n<p>reality here is okay the the core cognitive capital on which the ultimate success of CBS depended was like the brains of two people. Those shows executed well produced hundreds of millions of dollars worth of value. Everyone else was sort of involved with just the logistics of how you actually in some sense gather that money. You know, we have to we have to keep the budgets of the shows running and the advertiser serviced and have to make sure that the memo here goes there. Right? So, it&#x27;s it&#x27;s a a lot of what happens in knowledge work is support and administrative even if it&#x27;s not directly administrative role. like no, I&#x27;m the</p>\n<p>assistant sales of West Coast, you know, marketing directing, but the marketing itself, the ad sales, this is all sort of supporting the core capitalization, the knowledge work equivalent of the model T that&#x27;s actually being sold in the end. So, you have these huge asymmetries of knowledge work as well. the small number of 10x minds are producing the actual proverbial model T and everything else is is around servicing you know u making sure that then you&#x27;re competently putting that thing to market and harvesting the money that comes back instead. So that also weakens the</p>\n<p>connection between how you&#x27;re working and the ultimate bottom line. Like it doesn&#x27;t super matter if the West Coast ad team at CBS is super efficient in the ultimate question of are they number one in the ratings. It could be annoying if they&#x27;re really inefficient, but if they&#x27;re efficient enough, which you can get with pseudo productivity, it&#x27;s like you&#x27;re not a problem. That&#x27;s fine. So I think those are two of the reasons why this uh this uh nonoptimal way of work has persisted. Knowledge work is complicated. That&#x27;s like the theme of my the almost a decade</p>\n<p>now I&#x27;ve spent studying digital age knowledge work is knowledge work is a complicated system. &gt;&gt; Um we underestimate how complicated it is. We look for simple stories but it&#x27;s a complicated system. All right. Who do</p>\n<h2>Can you explain the difference between limiting missions, projects, and daily goals?</h2>\n<p>we have next? &gt;&gt; All right. Next question is from Carol. Can you please elaborate on the connection between limit missions, limit projects, and limit daily goals from your new book? Specifically for limit daily goals, how do you determine what to focus on each day? Do you only work on a specific project each day? So this comes from uh part two of the book in the chapter dedicated to the principle do fewer things and one of the propositions in that chapter. So I have these things called propositions which each has a an idea related to the</p>\n<p>principle that I then discuss all sorts of concrete tactics for putting into action. And so one of these propositions is about limit what you work on and uh I get more specific about that and said think about your work at three scales. So you have at the the the high scale your mission like what what&#x27;s the thing I&#x27;m trying to do? I&#x27;m Lin Manuel Miranda. I want to be a celebrated playwright. You know I&#x27;m the West Coast ad director for CBS. I want to have you know the highest ad rate sales of uh each of the regions. I&#x27;m trying to</p>\n<p>whatever make a modernized shop. Here you have a missions at the top. That then leads the projects. Okay, here&#x27;s the specific projects I&#x27;m working on now that advance my mission. And then the underneath the projects, you have daily goals. Here&#x27;s what I&#x27;m doing today that is advancing the projects which themselves are advancing my higher level mission. So we have these three levels. And what I argue is um you want to limit each of these levels. Now, the problem is, and this was the point of this section of the book, the problem is when we feel like we&#x27;re too crowded, we want</p>\n<p>to solve overload. We tend to focus only at the bottom level. We say, &quot;I&#x27;m working on too much each day, so let me just cut back and work on fewer things each day. I&#x27;m too busy. I need more breathing room. I need more time in my schedule.&quot; But the problem I point out is that that will prove difficult if you don&#x27;t also limit the levels above. So, if you have a ton of ongoing projects, it&#x27;s very difficult to limit how many goals you&#x27;re making uh progress on each day because you have all these projects that you need to make progress on. I have six things I&#x27;m doing, these six big projects, and if I only work on one per</p>\n<p>day, that&#x27;s too slow because then I&#x27;m I&#x27;m only I&#x27;m not even touching on every project each week. Of course, I have to work on multiple ones each day. So, you have to reduce your projects before you can reduce your daily goals. But if you have a ton of missions, like here&#x27;s my four things I&#x27;m trying to do. Well, any mission is going to have at least some projects going on if it&#x27;s really one of your missions. And so if you have too many missions, you&#x27;ll have a hard time limiting your projects. So I you have to start at the top. Focus your missions down to like this is the one or two things I&#x27;m trying to do. That&#x27;ll then allow you to reduce the number of active projects you&#x27;re working on because there&#x27;s less missions to service. And</p>\n<p>with fewer projects now, you can be more selective each day and not be running around so frenetically. So, Carol, when it comes you&#x27;re asking about limiting daily goals, make sure that&#x27;s the final thing you do. Start with the mission, then reduce the projects, how do you know you&#x27;ve done enough that when you then say, &quot;I&#x27;m only going to work on one major goal per day.&quot; That&#x27;s not hard. You don&#x27;t say, &quot;Oh man, this is not going to work.&quot; That&#x27;s how you know you&#x27;ve limited things enough. How do you choose which daily goal to work on? Uh, your weekly plan will help this, right? Because where are these projects? where are these missions captured in your your</p>\n<p>semester or strategic or quarterly plan, whatever you want to call it. So, when you do your weekly plan and you review that, like what am I going to make progress on this week? Like these two things. All right, so maybe the first half of the week I&#x27;ll work on this, the second half I&#x27;ll work on that. So, you can kind of figure this out during your weekly plan when you&#x27;re able to take in the whole landscape of uh the week ahead of you and your big picture vision for the current the current quarter. Um, and beyond that, don&#x27;t sweat it too much, right? There&#x27;s no perfect choice like this is the exact right project to work on. You just want to be making progress on one serious thing per day. So what then happens with the rest of your day?</p>\n<p>Well, that&#x27;s all the administrative overhead stuff, right? So you make one deep progress on one thing is pretty good. The rest of your day is going to be meetings and emails and and talking about projects that are going to generate daily goals in the future, but like one substantial deep work per day is is good. Sometimes maybe two and you should be happy with that. If you&#x27;re not happy with that, you need to move up the chain of limiting. Uh because all these things connect together. So yeah, that&#x27;s a cool part in the book. Um so Carol, thanks for asking that question. All right, what do we got next?</p>\n<h2>Should everyone buy a $50 notebook?</h2>\n<p>We have Thomas in Slow Productivity. You discussed your $50 notebook and how it provided inspiration. Can you elaborate on investing in tools and how that can help but also be taken too far? &gt;&gt; I found that notebook, too. I should have brought that in. My $50 lab notebook. Yeah, &gt;&gt; I talked about it in some one of the many podcast interviews I did recently. We got into it. H I can&#x27;t remember who it was now though. I&#x27;ve been doing too many of these, Jesse. &gt;&gt; Yeah, when I was reading the book, I read through that. &gt;&gt; I will bring it in. So, for people who don&#x27;t know, I I talk about how at MIT during my posttock, I bought a lab</p>\n<p>notebook. Lab notebooks are very expensive because uh maybe I talked about this with Adam Grant. Well, whatever. Um lab notebooks are very expensive because they&#x27;re archival, right? So for like patent disputes etc. um this is how you you uh record this was the day when I had this idea right so like you end up inventing the telephone you have your lab notebook will actually be how you establish priority so it&#x27;s um very this thick paper they&#x27;re all stamped with numbers uniquely stamped very thick covers because these are meant to be stored for</p>\n<p>potentially decades really good spiral binding they&#x27;re very high quality notebooks and so I had this experiment at MIT where I bought one of those and I I think it was $50 it might have $70. I don&#x27;t remember. But I bought one because my thought was I&#x27;m going to take this notebook more seriously. So when I&#x27;m working on proofs, um I&#x27;m gonna it&#x27;s going to make me be more careful because I don&#x27;t want to just scribble in something that cost so much money. And in the book, I talk about how I I went back recently and I went through that $50 notebook and counted up every idea in that notebook that either became a peer-reviewed published paper or an NSF</p>\n<p>grant. And it was a really big number. I forgot exactly what it was I think it was like seven or eight different papers and grants came out of this one notebook and it&#x27;s all very all my handwriting is very uncharacteristically neat and the diagrams are careful. So the idea here the bigger idea is when it comes to the most important thing you do if you&#x27;re a knowledge worker. So the the the most value producing skilled cognitive labor that you do, invest in your tools, spend money on your tools because this signals to yourself, I take this really</p>\n<p>seriously. And then your mind is like, this is for real. Let&#x27;s go. Let&#x27;s rock and roll. Like we&#x27;re doing something really serious here. Right? It&#x27;s like uh radio people. I used to hear radio people had a hard time at first when they shifted to the podcast format. Even when they were getting bigger audiences on their podcast because when they were doing radio, it was a much more expensive studio setup. And here&#x27;s the the soundproof room and the engineer and the big soundboard. And uh just the seriousness of the context</p>\n<p>made it seem like a more serious endeavor than when they just had, you know, an SM7 in their uh attic. So the tools can really matter. Um so this means, for example, don&#x27;t use free software. Pay for the full version of whatever you&#x27;re using. Get the best tool. If you&#x27;re if if screenwriting is what you do, you should have the final whatever the what do they call what do they use? Final draft. I don&#x27;t know what the big screenwriting software is. &gt;&gt; Uh Final Cut. &gt;&gt; It&#x27;s Final Cut. &gt;&gt; Is that editing? &gt;&gt; Yeah, it&#x27;s like an editing. &gt;&gt; Yeah. Well, whatever. You know, like</p>\n<p>have the good software, right? Use Scriber if you&#x27;re doing non-fiction or novel writing like and pay for it, you know. Um if you&#x27;re a scientist, have a really good, you know, latte or editor like markup editor that you use really good notebooks. if you&#x27;re podcasting, once your audience starts to grow, get a really good, you know, invest that money back into your sound equipment to make it better. Um, it&#x27;s psychological as much as it is practical. So, Thomas is asking, you know, how do you know if you&#x27;re taking this too far? Um, invest in pro I was going to say invest in</p>\n<p>proportion to the value you&#x27;re creating, but I actually want to edit that. Invest in proportion to the value you could credibly be creating in the near future. Right? So, uh, I wouldn&#x27;t, for example, if I was just starting a podcast, buy a $700 microphone because you&#x27;re like, I&#x27;m probably not going to be generating, you know, enough value, enough ad revenue, etc. to really justify that yet. But maybe I will buy uh the new Sure product that has the built-in DTOA converter,</p>\n<p>the thing I use, you know, when I&#x27;m on the road. It&#x27;s like 130 bucks. And like, I don&#x27;t know. I think the audience I might grow over the next six months is big enough that it&#x27;s like worth having spent, you know, 150 bucks on the mic and and 50 bucks on good headphones and because it signals I&#x27;m taking this seriously, but it&#x27;s kind of in proportion to what I&#x27;m doing. But I&#x27;m not going to spend $2,000 a month on a studio lease and have, you know, $5,000 worth of equipment yet. Now, on the other hand, if your show is starting to produce $1,000 a month, $500 a month in ad revenue, you&#x27;re like, &quot;This is in</p>\n<p>proportion. actually let me like make this investment be 6 months worth of the ad revenue that&#x27;s in proportion to what I&#x27;m doing. So you want to keep it the investment into proportion to the value you are creating or conceivably will be creating in the near future. And it&#x27;s not always a clear-cut number. Of course you could be working for a large organization um investing in a new tool. You might not have a specific revenue number they say you generated but you&#x27;re like this this thing I&#x27;m doing in this company is really important and it&#x27;s moving my my stock my proverbial stock higher in this company. So, I&#x27;m going to invest in getting a better version of</p>\n<p>this tool. I&#x27;m going to get a better whatever it is, right? Um, so yeah, you don&#x27;t want to just go crazy. What&#x27;s the most expensive thing I can get? But you also don&#x27;t want to go free. So stay in proportion, whatever that means to you with the value you could credibly be creating now or in the near future. I think office space is a tool, you know? &gt;&gt; Yeah. like having a studio for podcasting, but also if you&#x27;re a knowledge worker, like you&#x27;re a writer or something like this and and you&#x27;re, you know, you&#x27;re doing well at</p>\n<p>it, like investing in I have a place to go to write. I think that&#x27;s like investing in a tool. That makes sense. &gt;&gt; You and Humeman were talking about that a lot on your podcast. He was you were mentioning like your working writing space and &gt;&gt; yeah, &gt;&gt; he was asking a lot of questions about that. &gt;&gt; Yeah, he loves the details, right? And I was saying like this is a a reasonable if you can afford it, it&#x27;s a reasonable investment. And afford it means I mean I sometimes use the 5% number like if you&#x27;re especially if you&#x27;re a creative like you all you do is creatively produce stuff that is then sold for money. You should be in reinvesting 5% at least of your take-home pay in</p>\n<p>your tools and context. Mhm. &gt;&gt; You know, like uh when I see someone who has like a pretty successful podcast or they&#x27;re they&#x27;re a successful writer and they&#x27;re still like working in difficult circumstances, I was like, &quot;No, this is part of the business of what you&#x27;re doing.&quot; Yes, it&#x27;s true. You can you can in theory do all of your writing at the kitchen table or do your podcasting in the closet. It&#x27;s fine, right? And you&#x27;re just I just want every dollar to come. But you have to think the spend money to make money type of mentality. take 5 to 10% of what</p>\n<p>you&#x27;re earning and say, &quot;How can I use this to make my situation my tools and situations better?&quot; And if a lot of people did that, they would have co-working spaces. They would have, you know, I write here, not just here. I have better tools. I&#x27;m going to um podcast. I&#x27;m going to rent the studio for my podcast each week at for as opposed to doing my house. Like it it it will lead you ultimately to producing better stuff and also just enjoying the process of doing it better. So maybe that&#x27;s another rule. five to 10 percent of your take-home income, uh, if you&#x27;re a high level creative producer, should be reinvested in all the tools and</p>\n<p>context you use to produce that work. I think Brandon Sanderson followed that rule, right? Because he makes a lot of money. His books are very successful and he built the underground layer that we&#x27;ve talked about. Yeah. &gt;&gt; Like the hidden underground Victorian Gothic layer where he goes to write. &gt;&gt; Might have been more than 5%. Well, it depends. Making millions. &gt;&gt; I think he might be making millions. I mean, how much do you think it would cost to make it was completely underground? It&#x27;s got to be expensive, right? Uh, and it&#x27;s completely looked like custom furnished with woodwork. You think a million? I was going to say like half a million dollars. &gt;&gt; I was going to say 300k at first</p>\n<p>depending on where it was, but then when you said those numbers, maybe a little bit more than 300. &gt;&gt; Yeah. Something like &gt;&gt; if it was in New York. &gt;&gt; Yeah. So, that&#x27;s probably more than 5%. I&#x27;m trying to think about that. If he spent $500,000, I don&#x27;t think he makes $10 million a year. All right. All right. So, he&#x27;s spending a little bit more, but you know, he might make &gt;&gt; The other thing that you got me thinking of was um in last week&#x27;s episode or last week&#x27;s episode you were talking about how much money Juel had because her mom was &gt;&gt; stole $200 million from her. &gt;&gt; Yeah. &gt;&gt; That popped in my mind. &gt;&gt; I hope she has an awesome workspace. She followed this rule.</p>\n<p>&gt;&gt; All right. Who do we got next?</p>\n<h2>How does “Slow Productivity” relate to mental models and first principles?</h2>\n<p>&gt;&gt; Next question is from Sula. I&#x27;ve been reading your new book, Slow Productivity. I also read something about mental models and first principles. I think I heard you mention these concepts before. How does slow productivity relate to these concepts? &gt;&gt; Well, Sula, you can think about it both in terms of a new mental model. You can also think about it in terms of a collection of new first principles. So, mental model for those who don&#x27;t know, at least the way I use the term is a cognitive structure you use for understanding a concept. So when you shift your mental models it can give you uh a whole new understanding of how some</p>\n<p>part of the world or your life actually works which can completely change the way you approach it. Principles or first principles I think of as core ideas that are generative from these ideas you can generate new uh decisions about what to do and what not to do. It&#x27;s it&#x27;s a core principle from which I can then derive action. I should stop doing this. I should do more of that. So you use it to judge or evaluate potential actions. So I think of that as like a generative idea. I sometimes call this. So the mental model shift embedded in slow productivity um is this idea</p>\n<p>that pseudo productivity the thing that we have been implicitly referring to when we talk about being productive in knowledge work is not actually that productive. If we really mean by productive production is stuff that matters. Right? That&#x27;s a big mental model shift. Um the prior mental model shift I think the mental model we had for knowledge work is we tried to without realizing it adapt the industrial agricultural ideas of productivity to knowledge work even though they don&#x27;t fit. Now remember</p>\n<p>the agricultural and industrial notions of productivity are all about output per input. So to be more productive is to more efficiently transform inputs into outputs. the assembly line increased the model T&#x27;s per labor hour by a factor of 10 for example. So then when we thought about being productive in knowledge work we we had this model of trying to squeeze more model T&#x27;s out which meant that uh in an assembly line is a more efficient way of putting together a model T. So it was a mental model of productivity based on efficiency and speed. It&#x27;s why when we we we hear, you know, critiques of hustle culture from</p>\n<p>magazine writers, they&#x27;re always talking about Frederick Winslow Taylor, the creator of scientific management, which is the the epitome of industrial productivity. How do we get the the movements that are producing the thing that this foundry or factory produces as efficient as possible? And so we just assume, well, that&#x27;s what productivity is. And so if we say I want to be productive in knowledge work, it&#x27;s about efficiency and optimization and hacks and all these type of things. But it&#x27;s not really right. So my book slow productivity shifts the mental model. That&#x27;s not actually what we&#x27;ve been</p>\n<p>doing because we don&#x27;t have we we we can&#x27;t bring Frederick Winslow Taylor into a knowledge work office. What is he measuring with his stopwatch? How fast you type when you answer emails, you know, like how you put stuff on your calendar. There&#x27;s no clear thing you&#x27;re doing. And so this mental model shifts. is like no what we what we&#x27;ve been doing instead of pseudo productivity which is just activity you just need to demonstrate that you&#x27;re here and doing things which in the modern world means sending emails replying to Slack jumping on calls and going to meetings um this is how what we mean by productivity is it has very little to do with like</p>\n<p>efficiency or um squeezing the increasing the speed at which we do things and it has it&#x27;s not good right that&#x27;s mental model shift we&#x27;re not doing wins low Taylor we&#x27;re doing pseudo productivity pseudo productivity doesn&#x27;t actually produce a lot of valuable stuff in the end anyways is actually a slower approach to work with more careful workload management and variation and a real care for quality that&#x27;ll produce in the end more stuff that matters. That&#x27;ll push CBS from number three to number one, not how active we are. So that&#x27;s the key mental model shift. What are the key</p>\n<p>first principles for achieving that shift? Well, that&#x27;s my three principles of slow productivity. Do fewer things, work at a natural pace, obsess over quality. These are generative first principles. Uh I introduce the concepts in the chapter dedicated to each and then from that principle we we move to uh a wide variety of practical advice. They&#x27;re generative principles from which actionable specific ideas, suggestions, and filters can be derived. All right. So good terminology, Sula. I appreciated that. It&#x27;s a good way of trying to</p>\n<p>capture what&#x27;s new and what&#x27;s interesting about this concept. All right. Um let&#x27;s do one more question here. This looks like a long one. &gt;&gt; Go. All right. What do we got?</p>\n<h2>Should I read your new book slowly?</h2>\n<p>&gt;&gt; Next question is from Peter. I&#x27;m wondering if you have any tips on how to approach reading and applying the lessons. I know the temptation will be to devour it like Cberus on a baconflavored Twinkie while furiously taking notes in hopes of sifting through and acting on all of it someday. However, I have sometimes had more success when I limit myself to one chapter per week, which allows me to slow down and make sure I understood and applied the information to each chapter before moving on. Do you think that the information in slow productivity needs to be understood and applied in order in</p>\n<p>which it is presented or would it work to read the whole thing and then go back and try to piece it together? &gt;&gt; That&#x27;s a good question, Peter. Good Greek mythology reference. That&#x27;s like old school old school deep questions. I appreciate that. Um, all right. So, here&#x27;s how I would recommend reading slow productivity. The there&#x27;s part one, part two. Part one is the this whole concept of pseudo productivity. How do we get here? What&#x27;s the real problem? The mental model shift. Part two, here&#x27;s the three principles. Let&#x27;s explain each and break them down into concrete action. I would read both parts all the way through first.</p>\n<p>Don&#x27;t I don&#x27;t particularly care on the speed, but there I would read the whole thing first. Why? The principles relate to each other. Like when we get to principle three, obsess over quality, I sort of end up revealing this is actually the glue that holds the first two together. And like without this, the first two are not going to do well in isolation. So I would just read the whole thing completely shift your mental model. And then you can go back through more carefully and say, okay, so where do I want to start? And you actually might start with principle three. And you might go back to that. Let me let me go back to it this week and look through</p>\n<p>the advice and like where do I want to start? What do I want to actually try here? and maybe get that going for a few weeks and then say, &quot;Okay, now I&#x27;m going to work on the workload, the doing fewer things. Now I&#x27;m going to go back to that chapter. Let me give it a few weeks to experiment with it.&quot; So I would read the whole thing and then I would go through principle by principle in the order that makes most sense to what resonates with you. And I you could spend a month per principle really because a lot of it&#x27;s experimental. Let me try this. Let me get some feedback. Let me adjust this. U you&#x27;re sort of experimenting with each of these principles. Once you&#x27;ve done that for all three, because now we&#x27;re like three months out from you first</p>\n<p>getting the book, that&#x27;s when you&#x27;re going to start to feel the synergy. Oh, the stuff&#x27;s starting to click. Like my obsession over quality is helping me do fewer things and the natural pace now feels inevitable as opposed to contrived. You and everything starts to work together and you&#x27;re going to begin to get that that feeling of relief, that slow productivity advantage. So, that&#x27;s a good question, Peter. Um, that&#x27;s how I would do it. I want to take another quick break to hear from a sponsor that makes this show possible. Look, if you&#x27;re someone who loves learning but never seems to find the time for it, whether it&#x27;s reading a full book or</p>\n<p>finishing that podcast series or just carving out time to think, today&#x27;s sponsor is going to be a gamecher. It&#x27;s called Headway. Headway is a daily app that keeps your brain sharp with key insights from the world&#x27;s best non-fiction books, each distilled into focused 15minute sessions that you can read or listen to any time on your commute, during a break, or when you&#x27;re getting ready in the morning. With over 1,800 summaries across more than 30 categories from productivity and happiness to money and creativity, Headway is like having your own personal growth guide. Now, in an age when</p>\n<p>shallow distractions are constantly pulling at your attention and they&#x27;re trying to make you dumber, Headway gives you an alternatives, a way to use those spaces to actually become smarter. And that&#x27;s what I recommend. Make Headway your default whenever you feel the urge to jump on TikTok or yell at someone on X. Instead, over to Headway and get some personal growth information. So, stay curious, stay sharp, and grow your way with Headway. Go to makehadway.com/deep and use promo code deep to get started today. That&#x27;s makeheadway.com/deep</p>\n<p>with the promo code deep. I also want to talk about our friends at fabric. Look, the new year season is here. This means it&#x27;s time to finally get to those important tasks and goals that you&#x27;ve been procrastinating on. And few goals are more important than making sure you are properly caring for your family with the proper amount of life insurance. Now, I&#x27;ve had to adjust my life insurance multiple times, and I always put this task off because it seems like a pain. Something that has like lots of ambiguous steps that I don&#x27;t want to deal with. But then I heard about Fabric by Gerber Life. Fabric by Gerber Life is</p>\n<p>term life insurance you can get done today. It&#x27;s made for busy parents like you or me. It&#x27;s all online. You can do it on your schedule right from your couch. You could be covered in under 10 minutes with no health exam required. You hear that? You&#x27;re just 10 minutes away from finding flexible, highquality uh policies that fit your family and your budget. We&#x27;re talking about things like million dollars in coverage for only a dollar a day. Join the thousands of parents who trust fabric to help protect their family. Apply today in just minutes at meetfabric.com/deep.</p>\n<p>That&#x27;s meetfabric.com/deep. mefabric.com/deep policies issued by Western Southern Life Insurance Company. No, not available in certain states. Price subject to underwriting and health questions. All right, Jesse, let&#x27;s get back to our episode. All right. Uh, we have a call. &gt;&gt; Yep. &gt;&gt; All right, let&#x27;s hear that.</p>\n<h2>Struggling writer obsessing over quality</h2>\n<p>&gt;&gt; Okay. &gt;&gt; Hi, Cal. This is Kyle. I run a large nonprofit mindfulness center and I&#x27;ve been a big fan of your work for many years. I&#x27;ve read all your books, listened to all your podcasts, and use your principles in classes, workshops, and executive coaching. So, thank you so much for putting so much good content out into the world. I love your ideas, but as a busy CEO, a father of several kids, and a mere mortal, I struggle to implement them consistently, and I find myself intimidated by the degree to which you seem to have everything so perfectly dialed in in your life and your seven jobs. One of my favorite moments in your podcast was an episode</p>\n<p>when you admitted how long it takes you to get ready for evening events compared to your wife Julie. It was such a wonderful humanizing moment to learn that for all his aerudition and success, Cal Newport may have areas of his own life that stubbornly resist submitting to his systems. So my question is whether you might be able to share any stories about the pain and failure points in your life where you really struggle uh to implement your best practices maybe where you feel like a hypocrite where you fall down and have to keep trying. It would be such a relief to know that even you can&#x27;t perfectly engineer things or execute</p>\n<p>your plans as well as you&#x27;d like. Thanks so much. &gt;&gt; Uh there&#x27;s nothing I can say I&#x27;m perfect. All right, so what do we got next? Um no, it&#x27;s a good it&#x27;s a good question. I think people often get me backwards. So they think like I have all of these perfected systems and this goes back to my our mental model discussion that I have these like perfected systems that like optimize what I produce. It is the exact opposite. the the philosophies I deploy in my life are trying to deal</p>\n<p>with all of the sort of imperfections and stubborn inefficiencies that are intrinsic to me as a person. So, I&#x27;m not just um slow to get ready, though that&#x27;s definitely a big thing. Um I don&#x27;t I&#x27;m not fast with stuff. I really deal poorly with having a lot to do, like a crowded calendar day. I talked about this some on Andrew Huberman&#x27;s podcast that in grad school I developed this acute insomnia that would episodic it would come and go right uh and it was a</p>\n<p>real it really shook me up because it was oh I don&#x27;t control this so it like something else can just come in and like take away my ability to you know do work because I&#x27;ll just be like really tired or something like this and a lot of my ideas and strategies for example like case in point is dealing with that reality like a lot of my my slow productivity approach. It was was dealing with this idea of well, I can&#x27;t be someone that just gets after it every day because what if I&#x27;m really tired or I&#x27;m not sleeping? And so like I reoriented my whole creative life around uh pursuits where it doesn&#x27;t really</p>\n<p>matter what you do tomorrow, but it does matter that over the next few months you do make a lot of progress. So I I began to get this allergy to crowded schedules because if I have crowded schedules every day, what happens when I&#x27;m tired or I&#x27;m sick? It&#x27;s a problem. But if I&#x27;m writing a book over like a four-month period, I can have periods in there where I&#x27;m not I didn&#x27;t write for two days, it&#x27;s fine. And I can come back on the other days when I&#x27;m doing better, right? Why do I why do I have a shutdown routine? Because the anxiety of thinking about my doctoral dissertation was keeping me uh distracting me in the evening. I had to invent the shutdown</p>\n<p>routine to try to ch to tame that. Why do I have fixed schedule productivity? To make sure that I don&#x27;t work too much like and to keep things to keep things reasonable, right? Um, why do I limit the number of projects I work on? I know we joke I have seven jobs, but what do I do? I&#x27;m a professor and I write. And I even made those the same thing now because now I write about the things that I study as a professor. I I I don&#x27;t use social media. It took me 10 years to start a podcast. I only give it a half day a week. And even that stresses me out. Um, so like my whole life is dealing with I&#x27;m not someone that can work 15 hour days. I&#x27;m not the smartest</p>\n<p>person in the room. Stuff takes time. I&#x27;m not always the best visionary. I come to insight slow. And so my whole idea is like don&#x27;t do too many things. Give yourself flexibility and just try to work very steadily on the things that matter. This is Steve Martin&#x27;s advice, you know, be be so good they can&#x27;t ignore you. Eventually good things will come. That&#x27;s my whole motto. So all of my systems are really trying to deal with an imperfect reality, you know, because I can&#x27;t sit there and crank on math equations all day or write 15 hours a day. So you</p>\n<p>shouldn&#x27;t think about things that way. It should be about there&#x27;s only so much I can do. Let me like and we&#x27;re imperfect and we&#x27;re variable. So, how do I make sure given all that reality and all that chaos, how do I make sure that I&#x27;m still making forward progress on the things that matter so that even if last week was a disaster, last year will be something that I&#x27;m proud of. And all this ideas which I&#x27;ve been working on for 20 years now is all sort of consolidated in slow productivity. That&#x27;s where that philosophy came from. It&#x27;s like how to produce cool stuff if you&#x27;re a human. So, I appreciate the</p>\n<p>appreciate the call. Um, let&#x27;s do a quick case study. Let&#x27;s</p>\n<h2>Applying lifestyle-centric career planning</h2>\n<p>see. All right. So, the the case study is not slow productivity theme. So, let&#x27;s let&#x27;s call this the end of the slow productivity takeover and get that theme music one more time, Jesse. All right. That was great. Slow productivity case over. Buy the book if you haven&#x27;t read it. Review the book if you read it and liked it. All right. Case studies from M. Hi, Cal. I&#x27;m a diplomat with the US Department of State, currently stationed overseas. I use your ideas to plan my next career move within my organization. In the foreign service, we rotate assignments</p>\n<p>every two to three years, and I had been feeling a bit burnt out with my current position and not motivated to start looking for my next job. Using your lifestyle ccentric career planning, I set criteria for the types of positions I would target. I wanted to move back to DC and avoid positions involving emergency or after hours duties. I had accepted that this could be a career detour and not great for promotion, but to my surprise, I found many intriguing positions that match my criteria. Last month, I happily accepted an offer at the State Department&#x27;s diplomatic</p>\n<p>training institute. I will be leading a medium-sized team, so it will still be a substantive role, but it offers an element of seasonality, flexibility, and hopefully no after hours emergencies. I think this position will be a great fit as I transition back to the US with my family. What I like about this case study is that it really does highlight the power of lifestyle career planning. uh too often, especially if you&#x27;re high achieving, you just let the criteria of like what is objectively the most impressive job of my options be what drives you. So you</p>\n<p>imagine it&#x27;s going to sound great when I say I&#x27;m now the senior diplomat in the such and such consulate, but it turns out the the opportunities you have to say that and receive praise, you know, it&#x27;s like seven times in the year and then you&#x27;re stuck with the reality of that job and it might have elements to it that you hate. So by far the the more sane thing to do if you&#x27;re trying to build a sustainable career is to say, &quot;What do I want in my lifestyle in general? What type of place do I want to live in? What is the rhythm of my day like? What&#x27;s the feel of my</p>\n<p>work like? What else is going on in my life? And work backwards from that to figure out your career. This is a great example of that. So, our our uh correspondent here has a good sense from the State Department foreign service what it&#x27;s like to have these after hours or emergency duties. He knows he doesn&#x27;t want that. He wants seasonal seasonality, flexibility, the type of stuff. I like more of a slow, productive uh compatible role. Knowing that, working backwards from that lifestyle led him to choices that wouldn&#x27;t just be the obvious next thing to choose. And I think this is a really cool choice he made, you know, I became</p>\n<p>a professor in part because of lifestyle career planning. I wanted the flexibility, the ability to write and have seasonality. There was less money in this than going to the tech jobs I had offers for out of college. But I wasn&#x27;t trying to do the most impressive thing. I was trying to do the thing that fit my lifestyle vision better. So, I think it was a great case study of lifestyle career planning in action. Um, if you&#x27;re new and you want to know more about that, probably the best book of mine to read is So Good They Can&#x27;t Ignore You from 2012. That&#x27;s my contrarian take on building a career that you love.</p>\n<p>All right, we have a final segment coming up where going to react to something interesting. So, for our final</p>\n<h2>TikTok Falters</h2>\n<p>segment, I like to react to something interesting I&#x27;ve encountered recently. And today, I want to talk about an article that many of you sent me from the Wall Street Journal. I&#x27;ll bring the headline up here on the screen. Cool graphic here of the Tik Tok logo with a cage below it and someone walking out of the cage. Uh the article is written by a reporter who has an awesome name for writing tech articles, Julie Jargon. An awesome name. Uh the article is titled Why Some 20somes are saying no to Tik Tok. I also wrote about this article in my newsletter. So if you don&#x27;t</p>\n<p>subscribe, you should at calport.com. Um, so here&#x27;s the thing they&#x27;re talking about. The the news hook for this article is that Tik Tok reported a near 10% drop in users between 18 and 24. Uh, that&#x27;s a lot for one year. To lose 10% of a user group, especially when you&#x27;re a a service that is advertising yourself to investors is being on the rise. So Julie Jargon went to talk to some of these users, some of these young 20s something users of Tik Tok and say, &quot;Why did you quit?&quot; And what she found was they were getting uneasy with their addictive relationship to the</p>\n<p>tool. She profiled one reader in particular who couldn&#x27;t put it down. So he would hold it. He could only take garbage bags to the outside to the can one at a time because he had to hold TikTok while he was putting out the garbage. That cook he would hold the phone with one hand and chop with the other. Like he literally couldn&#x27;t have it out and be watching it. And at some point he realized like this is probably not great. Like this is probably not maximizing my chances of a full and healthy life. And and he got off of it and it&#x27;s hard. And a lot of them say like the addictive thing meant they had</p>\n<p>to try multiple times. It was very much reminiscent of the way you hear people talking about quitting smoking. The fourth time it stuck. The sixth time it stuck. So it was interesting. There&#x27;s definitely the terminology of addiction when people are talking about leaving the service. But what I thought was relevant about this was uh it is a demonstration of the idea that I talked about in this article. Oo, look at the New Yorker from 2022. Jesse, it&#x27;s a similar graphic. I&#x27;m looking at this.</p>\n<p>&gt;&gt; Interesting. My article was first, ladies and gentlemen. So, this article also has a graphic of people leaving curved cages. Um, so I wrote this article in the summer of 2022 called Tik Tok and the fall of the social media giants. And I&#x27;m going to argue that in this New Yorker piece, uh, I predicted a dynamic that we are now seeing reported on in this more recent Wall Street Journal piece. What I said in this New Yorker piece is Tik Tok is making a bit of a Fouian bargain. They&#x27;re going all in on being as addictive as possible, which means the straight up algorithmic curation of the most addictive possible content they</p>\n<p>can give for each possible user. As a result, they got very fast user growth and their users use it a lot. But in doing so, they abandoned the model of the legacy social media giants in which their value proposition depends on a hard one social graph, Twitter, Facebook, Instagram. A big part of their value proposition was over the years their users have painstakingly built up these social graphs of who their friends are and who they follow. Uh there is a huge first mover advantage here. No</p>\n<p>other company will ever get users to spend so much time creating these graphs. So only they have these giant social graphs. No one else will have them again. So the legacy social media players have these social these social graphs that are a a first mover advantage that they can entrench on. Now Tik Tok said those are great but but depending just on a social graph doesn&#x27;t give you the most addictive possible experience. So we&#x27;re going to give you the most addictive possible experience. Here&#x27;s the Fouian bargain. The social graph might not give you the most addictive possible experience, but I have a hard time leaving that service because it&#x27;s not just providing me an</p>\n<p>abstract stream of distraction. It has all my friends on there that I&#x27;ve said. It has these follower networks I&#x27;ve clicked. I don&#x27;t want to leave that behind. There&#x27;s something there of value that doesn&#x27;t exist elsewhere. Tik Tok doesn&#x27;t have that. So, what it&#x27;s saying is people can walk away without losing anything. Now, it&#x27;s hard because it&#x27;s addictive, but once they break the addiction, they have not left behind a social graph, a collection of followers, people, friends that they&#x27;ve indicated. It&#x27;s just an abstract stream of brain stim stimulation. Um, which they could replace with any other stream of brain</p>\n<p>stimulation. They could with a video games or with podcast or with high high-end streaming things or drug use, right? I mean, it&#x27;s all kind of doing the same. It&#x27;s all interchangeable. This is the direction that the the social media market&#x27;s going in because you get more engagement with addiction, but it makes it more dynamic. It makes it more tenuous. And that&#x27;s what I argued in this 2022 article. I said we&#x27;re going to start to see a more tumultuous attention economy, digital attention economy landscape with services coming to go and and and big sweeps and as people jump around the</p>\n<p>various things. And I think with this uh migration of 20somes away from Tik Tok all at once, we&#x27;re seeing that thesis start to play out. So I think those are the key dynamics to understand. Social graph is a entrenched advantage that produced content that was more addictive than just straight news, straight production. Uh pure algorithmic distraction is even more addicting and and compelling, but doesn&#x27;t have the entrenchment of the social graph. And so we&#x27;re seeing the the sort of endgame, I think, of the long-standing legacy</p>\n<p>players, we&#x27;re going to get lots more dynamic shifting in the market. Ultimately, I think that&#x27;s good because when you don&#x27;t have a small number of things that everyone feels compelled to use, you as a pursuant of the deep life have a lot more social flexibility to construct the online life that you want. The more variety there is out there, the more uh easy and acceptable it is for you to create something that you really like. So, I think ultimately it&#x27;s good news and it&#x27;s cool to see the the theories I predicted starting to actually play out in reality. All right, Jesse, that&#x27;s it. I think</p>\n<p>that&#x27;s our episode for today. Thank you everyone for listening andor watching. We&#x27;ll be back next week with another normal episode of the Deep Questions Podcast. Remember to send your ideas for topics you like or want to hear about to jesse@calort.com. And otherwise, I&#x27;ll see you next week. And until then, as always, stay deep. Hey, if you like this video, I think you&#x27;ll really like this one as well.</p>", "chapters_count": 9}