{"video_id": "oI0RIW8-yFc", "title": "Can’t Stop Scrolling? This Old Strategy Can Tame New Technology | Cal Newport", "link": "https://www.youtube.com/watch?v=oI0RIW8-yFc", "published": "2026-01-22T11:00:00+00:00", "summary": "Cal Newport talks about an old stategy that can tame new technology. \n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\n0:00 It's the 1990s\n3:50 Modern single purpose tools\n8:14 Punkt phone\n13:00 Nintendo Switch\n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<h2>It&#x27;s the 1990s</h2>\n<p>I want you to consider a thought experiment. Imagine that it&#x27;s the 1990s. This is when Jesse and I were growing up, when we were kids. Uh, and that one day I walked into my house wheeling like a media cart. And on this cart, I had a television connected to a Sega Genesis. And on one side was a pouch that contained cigarettes. On the other side was a pouch containing a lot of pornographic magazines. And there was a radio next to it that was blaring like AM political talk radio. And on top of the TV was a phone. And I&#x27;m wandering by pushing this media cart. Um, as I head to my room in this thought experiment, my mom correctly stops me and says,</p>\n<p>&quot;What the hell do you think you&#x27;re doing with all that?&quot; And then I answer calmly, &quot;Mom, there&#x27;s a phone on here. Do you not want me to be able to talk to my friends?&quot; Seen in that context, the situation would be ridiculous. But isn&#x27;t this exactly what&#x27;s happening today when we let an 11-year-old have a smartphone and all of the types of harms and negative externalities that introduces just because there&#x27;s like one or two single features on there that we&#x27;ve convinced ourselves or they&#x27;ve convinced us is somehow useful. Um, I want to play an audio. This is a clip I played before.</p>\n<p>This is from uh Smartphone Free Childhood. It&#x27;s a PSA they did. But I want to play a quick clip here that makes that same point about my ridiculous experiment about the media cart is exactly what we&#x27;re doing when we give a kid a smartphone. Let&#x27;s hear the audio. This is a dad checking in on uh his elementary school age kid at bedtime. &gt;&gt; Hey kiddo, it&#x27;s about time for bed. Okay. &gt;&gt; Okay. &gt;&gt; Well, remember there&#x27;s a box in the corner over there with all the pornographic material that&#x27;s ever been made in the world. Even the really weird</p>\n<p>stuff that could scar you for life. I&#x27;m trusting you not to look in there. Okay. &gt;&gt; Okay. &gt;&gt; Feelings are for losers. &gt;&gt; Oh, and this guy&#x27;s going to be in your corner all night just randomly spewing out hateful things. Just [snorts] ignore them. Okay. While I&#x27;m thinking of it, there&#x27;s an order form on your desk where you can purchase illegal drugs. The mean girls from your school are going to be standing there talking about you all night. And this Russian hacker is going to keep asking for your password. &gt;&gt; I&#x27;m not hacker. Amazon customer service. &gt;&gt; Just need you to ignore them. Okay. &gt;&gt; Love you, buddy.</p>\n<p>&gt;&gt; We ask too much of our kids when we give them a smartphone. Let&#x27;s change the norm together. &gt;&gt; Maybe we go around the &gt;&gt; All right. This is making the point I was just saying, which is like it&#x27;s pretty crazy the way that we turn a blind eye to all of the terribleness on these devices because there&#x27;s some reason, well, but my kid needs to tell me when his play practice is over. Like one reason we let them use all this stuff. We&#x27;re basically letting in my scenario me with my media cart full of all that stuff go into my room and bring that all with me. Now, in the 1990s, this would have been ridiculous. Um, but</p>\n<p>we also had an easy solution to the problem because all of these different bad technologies in my 1990s example were single use which made them easy to control or curate. So, in my scenario, if I had that media cart full of all that stuff, my mom would have like, &quot;Whoa, whoa, whoa, whoa, whoa.&quot; Okay, here&#x27;s what you can do. You can have the phone because I want you to be able to talk to your friends. No, you can&#x27;t have a TV in your room. Uh, we&#x27;ll have a TV out in the living room, and that&#x27;s where the video games are, and you can only play those video games during times where we say you can play the video games, and you</p>\n<p>can&#x27;t have cigarettes, and you can&#x27;t have the porno magazines, and I don&#x27;t want you listening to the Rush Limba on the AM radio. Because everything is a separate technology, it is very easy to control and curate. In an age when all that&#x27;s pushed together into one device like a smartphone, things can seem kind of hopeless. So, can all we do is look back nostalgically at the &#x27;9s and say, &quot;Man, those were easier times.&quot; Not necessarily. All right. All right. So, in my own family, my wife and I have increasingly been seeking out modern singlepurpose</p>\n<h2>Modern single purpose tools</h2>\n<p>tools to replace specific functions that you might otherwise have been delivered through a smartphone. This is allowing us to help support our rule of no smartphones until high school by being able to use and deploy single-purpose technologies for specific things we think would be useful or enjoyable to our kids without having to give them the device that had everything else on it as well. So, here&#x27;s what I want to do in this practices segment today. Um, I want to talk about four different singleuse technologies, singlepurpose technologies that my wife and I actually have deployed with our kids in our life as</p>\n<p>part of our strategy to not have to give them a Swiss Army knife style uh smartphone. All right. The first single-use technology, and this one we just got, and I&#x27;ll load this on the screen here for people who are watching, so just listening, is a 10 phone. A tin can phone is uh it&#x27;s a landline basically. It uses the internet but it is you can see this on the screen. Um it is an actual phone with a cord and it plugs into the wall and the receiver is connected to the base and when you pick it up there&#x27;s numbers on it and you can you know dial</p>\n<p>numbers. They even have one that looks like an oldfashioned phone like from the &#x27;9s and that one uh is actually sold out. So, we now have this in our house for our kids to call or receive call from friends. Like my 13-year-old can like call one of his friends by dialing the number or they can call their cousins or they can call their grandparents if they want to talk to them. They can also receive calls on it. Yeah, you control everything through the app. So, you can say what numbers you&#x27;re allowed to come in. Also important, if my wife and I are out of the house, if we&#x27;re going for a walk or something like that and someone&#x27;s at home, they can call us from the home. If they have a</p>\n<p>question or an issue, you can also call 911 from it. It&#x27;s what we used to have. Just a landline. It just uses the internet instead of copper wires, but it&#x27;s just like a landline like we used to have. A couple things I&#x27;ve noticed, Jesse, now that we&#x27;ve deployed the tin can phone. One, kids these days aren&#x27;t used to dialing phone numbers, right? Because it&#x27;s a lot of digits, right? Like we got kind of used to it. You have like the the the area code and then the exchange and D. They really struggle. They&#x27;re like, &quot;Wait, another number? Another number?&quot; they kind of lose their</p>\n<p>train of thought. Like, they&#x27;ll have to dial a number a lot of times. Another thing I noticed, which I thought was interesting, is my my 13-year-old didn&#x27;t know how to use a wired phone handset. So, he called his friend and he was holding it like a speaker phone. He&#x27;s like, I can&#x27;t hear him. Cuz he didn&#x27;t know about like holding uh a phone, you know? It&#x27;s like, no, you got to hold it up like to your face. And then when he tried to do that, he hung up using his ear. So, he pushed it up against his face and hung up. So, they&#x27;re like they&#x27;re not used to using landlines. say we we take that for granted. Um, but they love having it and now they can have contact. We told our oldest son, by</p>\n<p>the way, if he ends up using it a lot, we&#x27;re open to putting one in his room so he can have more private conversations with his friends and we can turn it off with an app and say, &quot;Yeah, but at like bedtime, it just shuts off.&quot; All right. Um, that is uh that&#x27;s how we use it. We use it for if you had a smartphone, you would make calls on the smartphone. Now, we use this landline instead. It&#x27;s a singlepurpose technology. One thing it can&#x27;t do is text. Uh the solution for the singlepurpose technology solution for texting in my opinion is to get an old iPad, like a refurbished iPad that&#x27;s</p>\n<p>plugged in in your kitchen that you have an iMessage account logged into. And if you have a kid who wants to be a part of group uh chats, they can in the kitchen sit there on the iPad and check in on the chats and and and and add to it. They can&#x27;t have it in their own room. They have to be in the kitchen to do it. and they have to be subject to you could walk by and see what they&#x27;re chatting, right? Especially if they&#x27;re younger. That threat of like you don&#x27;t have complete privacy on here because God knows what you&#x27;re going to do. Helps sort of keep things more reasonable. My son, like a lot of boys like don&#x27;t care too much about it. They</p>\n<p>do have some text chat uh threads. He he doesn&#x27;t care enough for us to set this up because he it&#x27;s mainly just dumbness. Girls his age, from what I understand, are doing much more sort of sophisticated sort of social coordination on there. But that would be the solution I would give is here&#x27;s the the the group chat machine just like next to the telephone is the group chat iPad next to it in the kitchen. All right. So let me load up here the second single purpose technology we use. We have a punct pu n kt. I have this loaded up on the screen. So as you can see Jesse it is a old school cellular phone</p>\n<h2>Punkt phone</h2>\n<p>that only has numbers. You actually press the physical buttons one through nine. You have like a call and a hang up button and like a volume up and down button. What do we use our punked phone for? This is our single-use technology. If one of our kids is going somewhere where they might need to contact us when away from the home, this is one of the major reasons why people end up giving in and buying young kids smartphones is there&#x27;s these occasional scenarios where we might need to hear from you. These happen all the time. Like I give you some examples. Uh my one son will often</p>\n<p>take a bus from his school to like where baseball practice is. And you know sometimes the buses don&#x27;t come or maybe there&#x27;s not actually a baseball practice that day. Um he was at a baseball clinic the other day and I thought I knew how long it run but I wasn&#x27;t quite sure. It&#x27;s 3 hours. I don&#x27;t want to wait there for 3 hours and I wasn&#x27;t quite sure because it was the first time he&#x27;d done it. So I gave him the punk phone to bring with him. He could call me if he&#x27;s like, &quot;Oh, we ended early.&quot; Um and we&#x27;d be able to find out what&#x27;s going on. And so it&#x27;s useful for occasions where a kid might need to get in contact with you. Now, the thing about these phones is they&#x27;re like, it&#x27;s a great piece of</p>\n<p>technology. They&#x27;re not very fun to use. You just have to press these buttons. It&#x27;s very tedious. Uh the main thing you can do with it is we have our numbers programmed in and you can scroll and press a button and call us. You can try to send text messages, but you have to do the T9 where you press the button a bunch of times. It&#x27;s too frustrating, so it gives up. So, they&#x27;re not at all fun. They don&#x27;t care about them. They&#x27;re not happy to have them. It&#x27;s entirely utilitarian. They don&#x27;t own them. We have one. You check it out because you are going to an event. Bring the punct um and then you bring it back when</p>\n<p>you&#x27;re done and it goes back into our drawer. So that has replaced the sort of mobile phone functionality you would get from a smartphone. All right. The third piece of technology. This one I love. This is the uh Fio Snow Sky Echo Mini Hi-Fi Bluetooth MP3 Walkman. This is a I believe it&#x27;s a Korean technology. This is an Alibaba website I have up here. It is a MP3 player, Jesse. Uh in the style of like early iPods, the</p>\n<p>way it works is you have a a memory card and you just, you know, you it&#x27;s like a disc. You put MP3 files on this card. like you you plug in your computer and you just put MP3 trials on it. You put that card into this player, you can play the MP3 f songs on the file. That&#x27;s it. So, this thing here where you see like a cassette, that&#x27;s actually a display. And so, uh you can see a list of all the songs that are on the memory card and you can scroll through them and you can click on one and it plays that song. That&#x27;s all it does. My middle son really likes music. We had him for a while.</p>\n<p>There was a there&#x27;s a a device called the Mighty, which is like a small It was meant to solve this problem of like, oh, I want my kids to listen to music, but they don&#x27;t have a smartphone. But it&#x27;s too high-tech. It It tries to synchronize with Spotify playlist on a smartphone, and it has to continually sort of synchronize with an actual device, and it would often not work. And you would have to we&#x27;d have to be on the phone trying to like make these playlists, and then did it sync? Oh, it didn&#x27;t sink. Maybe it sunk this time. And my son, you know, he&#x27;s going to summer camp this summer for about a month. and he wants to be able to listen to music. And with this, the Mighty, if</p>\n<p>you haven&#x27;t synchronized online with the phone, because of rights issues, every however many days, the list goes away. Uh, this is much simpler. It&#x27;s just MP3s on a card, and you can listen to them. Where do they get the MP3s? Well, they have CDs, so they they my my kids own boom boxes, 1990s style boom boxes, the big tall things, the towers with the CD player and the radio. They listen to the radio and they we buy them CDs and they listen to CDs. We just bought it was like 40 bucks a CDROM reader that you plug in USB to your computer where you</p>\n<p>can rip MP3s off the CDs just like we used to do in like 2002. So they can put their CDs in here and rip which means like make MP3s out of songs from the CDs and they drag those on. Also, it turns out that on Amazon you can buy for a lot of albums still unprotected MP3s. Just buy them one by one. like I want to buy this song for like a $130 and you can still buy the unprotected uh MP3 and just drag him right on this machine. So, it&#x27;s great. Interesting. &gt;&gt; Yeah. &gt;&gt; So, he wants to listen to music like when on car trips or whatever or in his own room or whatever and this this solves that problem and only that</p>\n<p>problem. Again, it&#x27;s the type of thing you might otherwise be like, I don&#x27;t know, Apple Music&#x27;s on a phone, they want to listen to music. Let&#x27;s just buy them the smartphone. But we have a single purpose piece of technology for that. All right. The fourth uh single-purpose technology we use, and this kind of goes back to one of the issues we talked about in the idea segment, Nintendo Switches, old-fashioned video games. So, it&#x27;s a</p>\n<h2>Nintendo Switch</h2>\n<p>Nintendo, it has its own screen. We have one that hooks up to the TV and then uh two of the kids have the portable ones and the third has one that can hook up to the TV, which allows multiple people like to play on the same screen. If you&#x27;re playing Mario Kart or Minecraft or something like that, you can you can split up the screen. No online gaming, no playing with other people that they don&#x27;t know. I I I like to buy them the games. You can download games. I like to buy the cartridges. You stick a cartridge in, little memory card now, and you can play that game. So, it&#x27;s a video game player that only plays</p>\n<p>non-line video games, and that&#x27;s all it does. They have to be Our rule is these have to be plugged in. We have a charging station and the whatever you call the media console under your TV. They have to be in there. If we find one not in there, you lose the next video game sessions. So like when you&#x27;re not using it, you have to go and plug it in. That&#x27;s where it lives. And then we just have well- definfined video game playing sessions. It&#x27;s on the weekends. If there&#x27;s a babysitter and if a car ride is beyond a certain amount of time, they have to spend the first 45 minutes, you know, being bored and then they can play video games for what happens or flights</p>\n<p>if we&#x27;re going on longer flights. So, this is a single-purpose technology which allows them to play fun video games. My son has some crazy fighter jet game where I don&#x27;t understand this game. I thought it was a flight simulator and he keeps coming in and telling me what&#x27;s happening in the game. He&#x27;s like, well, I&#x27;m in, this is true story. He came in and said, &quot;I&#x27;m in jail because I blew up the president.&quot; [laughter] And I was like, &quot;What type of flight simulator?&quot; Turns out it&#x27;s this like this game that has these like crazy scenarios they put you in. And that son and the next time he talked to me, he&#x27;s like, &quot;Well, we have a weapon at this base that was</p>\n<p>invented to blow up meteors, but we&#x27;re using it to repel a fighter jet or like it&#x27;s just this crazy game, but it&#x27;s like oldfashioned. It&#x27;s a video game that you&#x27;re playing through levels and you know, oldfashioned video game.&quot; Again, this is another reason why people end up with smartphones like well like also or iPads like I could play games on there as well. It&#x27;s an easy way. I can play the games on the phone, but the single-use technology allows us to control exactly what types of games they play. They&#x27;re not online. We can control when they play them because it&#x27;s a separate device that we can keep at the TV. So again, when you put all this onto a phone, there&#x27;s always some reason why</p>\n<p>they need that phone. Now, they have access to all these things all the time and in ways you can&#x27;t easily control. All right, so here&#x27;s my conclusion. When it comes to technology and kids, single-use devices have to be the way to go. It gives you so much more control over their experiences and allows you to much more confidently steer them away from potential harms, right? It&#x27;s just so clear with single-use technologies. It&#x27;s so much easier to use. The strategy, I think, also makes sense for adults as well. Convenience is not necessarily the most</p>\n<p>important thing, especially when you&#x27;re talking about like your own entertainment or distraction. And when you put everything on the same phone, it&#x27;s like you have that media cart that I imagined myself having as a kids in the 1990s. Like you&#x27;re going to you maybe be trying to make a call, but you&#x27;re going to end up browsing that porno mag while smoking a cigarette, too, because they&#x27;re right there. So even for adults, I think moving to single purpose technology makes sense. You can get that MP3 player if you want to listen to music on long walks, not have a phone that&#x27;s going to come around with you. You can have a simple dumb phone that you bring when you&#x27;re doing stuff where there&#x27;s like these small</p>\n<p>percentage chances you might need to be contacted in an emergency, but you otherwise don&#x27;t want this whole distraction machine coming along with you. That could work for an adult as well, right? Don&#x27;t play online video games. Only play AAA games that you know you have to be on a a screen and plugged in with a card and there&#x27;s no internet involved. a single-use technology can make as much sense for adults as is for kids. But for kids, I think it&#x27;s a game changer because it allows you to get away or avoid that sort of that path of least resistance approach where it&#x27;s like, well, there&#x27;s some reason why a phone would be useful. And it&#x27;s so easy like</p>\n<p>on AT&amp;T or Verizon, it&#x27;s like 10 extra dollars. I click this button, they&#x27;ll just send me a phone and it works. And it&#x27;s so tempting to just do that. But don&#x27;t let them bring that proverbial media cart full of nonsense into their room. It&#x27;s worth taking the time to control the specific technologies they have and how they use each individual one. Hey, if you like this video, I think you&#x27;ll really like this one as well.</p>", "chapters_count": 4}