{"video_id": "W2cBTVr8nxU", "title": "⚡️ Prism: OpenAI's LaTeX \"Cursor for Scientists\" — Kevin Weil & Victor Powell, OpenAI for Science", "link": "https://www.youtube.com/watch?v=W2cBTVr8nxU", "published": "2026-01-27T19:36:10+00:00", "summary": "“2026 in AI for Science is going to look a lot like 2025 for Software Engineering” — Kevin Weil\n\nFrom building *Crixet* in stealth (so stealthy Kevin had to hunt down Victor on Reddit to explore an acquisition) to launching *Prism (*https://openai.com/prism/) as OpenAI's free AI-native LaTeX editor, *Kevin Weil* (VP of OpenAI for Science) and *Victor Powell* (Product Lead on Prism) are embedding frontier reasoning models like GPT 5.2 directly into the scientific publishing workflow—turning weeks of LaTeX wrestling into minutes of natural language instruction, and accelerating the path from research breakthrough to published paper.\nWe discuss:\n\n* What *Prism* is: a free AI-native LaTeX editor with *GPT-5.2 embedded directly into the workflow* (no copy-pasting between ChatGPT and Overleaf, the AI has full context on all your files)\n* The *origin story:* Kevin found Victor's stealth company Cricket on a Reddit forum, DMed him out of the blue, and brought the team into OpenAI to build the scientific collaboration layer for AI acceleration\n* *Live demo highlights:* proofreading an introduction paragraph-by-paragraph, converting a whiteboard commutative diagram photo into TikZ LaTeX code, generating 30 pages of general relativity lecture notes in seconds, and verifying complex symmetry equations in parallel chat sessions\n* Why *LaTeX is the bottleneck:* scientists spend hours aligning diagrams, formatting equations, and managing references—time that should go to actual science, not typesetting\n* The *software engineering analogy:* just like 2025 was the year AI moved from \"early adopters only\" to \"you're falling behind if you're not using it\" for coding, 2026 will be that year for science\n* Why *collaboration is built-in:* unlimited collaborators for free (most LaTeX tools charge per seat), commenting, multi-line diff generation, and Monaco-based editor infrastructure\n* The *UI evolution thesis:* today your document is front and center with AI on the side, but as models improve and trust increases, the primary interface becomes your conversation with the AI (the document becomes secondary verification)\n* *OpenAI for Science's mission:* accelerate science by building frontier models _and_ embedding them into scientific workflows (not just better models, but AI in the right places at the right time)\n* The *progression from SAT to open problems:* two years ago GPT passed the SAT, then contest math, then graduate-level problems, then IMO Gold, and now it's solving open problems at the frontier of math, physics, and biology\n* Why *robotic labs are the next bottleneck:* as AI gets better at reasoning over the full literature and designing experiments, the constraint shifts from \"can we think of the right experiment\" to \"can we run 100 experiments in parallel while we sleep\"\n* The *in silico acceleration unlock:* nuclear fusion simulations, materials science, drug discovery—fields where you can run thousands of simulations in parallel, feed results back to the reasoning model, and iterate before touching the real world\n* *Self-acceleration and the automated researcher:* Jakub's public goal of an intern-level AI researcher by September 2026 (eight months away), and why that unlocks faster model improvement and faster science\n* The vision: *not to win Nobel Prizes ourselves, but for 100 scientists to win Nobel Prizes using our technology*—and to compress 25 years of science into five by making every scientist faster\n\n—\nPrism\n\n* Try Prism: https://prism.openai.com (free, log in with your ChatGPT account)\n* OpenAI for Science: https://openai.com/science\n\n00:00:00 Introduction: OpenAI Prism Launch and the AI for Science Mission\n00:00:42 Why LaTeX Needs AI: The Scientific Writing Bottleneck\n00:03:13 The Cricket Acquisition Story: From Reddit to OpenAI\n00:05:50 Live Demo: AI-Powered LaTeX Editing with GPT-5.2\n00:17:13 Engineering Challenges: Monaco, WebAssembly, and Backend Rendering\n00:18:19 The Future of Scientific UIs: From Document-First to AI-First\n00:15:51 Collaboration Features and Notebooks: The Next Integration\n00:21:02 AI for Science: From SAT Tests to Open Research Problems\n00:23:32 The Wet Lab Bottleneck: Robotic Labs and Experimental Acceleration\n00:33:08 Self-Acceleration and the Automated AI Researcher by September 2026", "transcript_html": "<h2>Introduction: OpenAI Prism Launch and the AI for Science Mission</h2>\n<p>Okay, we&#x27;re here at OpenAI with some exciting news from the AI for science team. Uh with us is Kevin Wild from I guess your VP of AI for science. &gt;&gt; Open AI for science. Yeah, &gt;&gt; open for science and Victor Powell um who is the product lead on the new product that we&#x27;re talking about today. Uh and with me is our new Yeah, for science host R.J. welcome. &gt;&gt; Uh so thanks for having &gt;&gt; us. Yeah, it&#x27;s very good to be here. &gt;&gt; Yeah. uh thanks for hosting us as as well. It&#x27;s always nice to come over to the office. Um what are we announcing today? &gt;&gt; So we&#x27;re launching Prism, which is a an a free AI native [snorts] latte editor.</p>\n<p>What does all that mean? Because</p>\n<h2>Why LaTeX Needs AI: The Scientific Writing Bottleneck</h2>\n<p>probably a lot of people on the the pod haven&#x27;t worked with Latte in the past. Latte is a a language effectively for type setting mathematics, physics, and you know, science in general. So if you&#x27;re uh a scientist writing a paper, you&#x27;re probably not using Google Docs because you need to you have diagrams, you have equations, etc. But it&#x27;s and it&#x27;s been the standard for decades. But the the tools that that people use to to actually write latte, write their papers haven&#x27;t changed in a long time. &gt;&gt; And uh in particular, AI can help with a</p>\n<p>lot of the tasks, right? Because you you spend your time doing the science, you need to write it up. That&#x27;s an important part of communicating your work. But you want that to be fast and you you want that to be accelerated and AI can help in a ton of ways and we&#x27;ll talk about some of those. But if you if you step back right is open AI for science. Our goal is to accelerate science and the surface area of science is very large. So we&#x27;re we&#x27;re trying to build tools and products that help every scientist move faster with AI. Some of that is obviously the work that we can do with</p>\n<p>the model, making the model able to solve really hard scientific frontier, you know, frontier kind of problems. Uh allowing it to think for a long time. But it&#x27;s not only that, right? If if there was a lesson from what happened over the last year with software engineering, it&#x27;s that part of the acceleration from uh in software engineering came from better models, but part of it also came from the fact that you now have uh AI embedded into the workflows into the products that you use as a software</p>\n<p>engineer. Right? It&#x27;d be one thing if we were going back and forth copying and pasting code between, you know, chat GPT and your IDE. that would be okay. That would be an acceleration. But the real acceleration came when you embedded AI into the actual workflow. And so that&#x27;s what we&#x27;re doing here. So OpenAI for science, it&#x27;s it&#x27;s both building great models for scientists and also speeding them up by bringing AI into the workflow. That&#x27;s what we&#x27;re doing with Prism. &gt;&gt; Yeah. I often say like every million copy and paste done in ChachiBT, there&#x27;s probably some product to be built, &gt;&gt; right? Exactly.</p>\n<p>&gt;&gt; That&#x27;s a good analogy. [laughter] Yeah, that&#x27;s a good way to look at it. &gt;&gt; Especially with latte, having written a lot of latte papers. &gt;&gt; Yes. &gt;&gt; Yeah. [laughter] Yeah. So, so &gt;&gt; me too. The number of hours as a grad student I spent like trying to get some diagram to line up. Exactly. And Oh, man. &gt;&gt; Yeah. &gt;&gt; Uh and uh Victor, you this is your sort of baby.</p>\n<h2>The Cricket Acquisition Story: From Reddit to OpenAI</h2>\n<p>&gt;&gt; Yeah, I guess uh it started off as um just a a project. I I left Meta about three years ago. Um trying to look for various different projects to start. Uh and uh this was this was one that like when I sort of presented it to people, they&#x27;re like, &quot;Oh, I get it. That&#x27;s I I see what you&#x27;re doing.&quot; And so I&#x27;ve just been focused on that, building it for about a about a year and a half and um you [clears throat] know, it it it has now has become part of OpenAI and that&#x27;s been very exciting. &gt;&gt; Congrats. Thank you. &gt;&gt; Yeah. So it&#x27;s kind of a kind of a fun story, right? I mean we as we were</p>\n<p>thinking we had this thesis around it&#x27;s it&#x27;s not just models it&#x27;s also building models into the workflow and and accelerating scientists in that way and this is there are obviously a lot of different ways that you can do that but the the scientific collaboration and publishing uh thing is definitely one of them and I was looking around like what is there in this space and there hadn&#x27;t been a lot of innovation for a long time uh like it wasn&#x27;t that different from when I was like writing up you you know, my assignments and papers in tech and grad school. And uh and then I found on</p>\n<p>this uh Reddit forum, maybe it was Rlettech, I don&#x27;t remember, but somewhere on this Reddit forum, I found uh this thing about a company uh called Cricket. And uh I was like looking around. I couldn&#x27;t find who the founder was. It took me a little while. And then I think I found you on Twitter and DM&#x27;d you out of the blue and just said, &quot;Hey, I don&#x27;t know if you want to talk about this, but I would love to talk about this if you&#x27;re open to it.&quot; And gave you my number. And uh we talked on the phone and then like um jumped on a Zoom and eventually met in San Francisco and uh</p>\n<p>made it happen. That&#x27;s right. And it&#x27;s uh it&#x27;s awesome to have you guys here, but it&#x27;s just um yeah, I have a ton of respect for what you what you started to build. &gt;&gt; I actually never heard that full story from you until now. &gt;&gt; [laughter] &gt;&gt; You got to find that Reddit user and thank them because you know &gt;&gt; it might have been me. &gt;&gt; I thought you were totally in stealth because uh it was it was the hardest thing to actually figure out who the founder of this thing was &gt;&gt; and then I was like, &quot;Oh, for sure he&#x27;s not going to respond to my random DM.&quot; &gt;&gt; I mean, I guess that&#x27;s a part of part of our focus has always just been entirely on product and to the point where it&#x27;s</p>\n<p>almost embarrassing how little we focus on anything else. &gt;&gt; Worked out for you. &gt;&gt; Yeah. So also full circle from moment for you using Twitter to do your business development. &gt;&gt; Yeah, that&#x27;s right. [laughter] &gt;&gt; So that&#x27;s kind of interesting. &gt;&gt; Your DMs forever, &gt;&gt; right? Like I actually Yeah, like probably one of the most important social network uh innovations I guess is is those that stuff and I&#x27;m sure you know a lot about that. Um shall we go</p>\n<h2>Live Demo: AI-Powered LaTeX Editing with GPT-5.2</h2>\n<p>right into a demo or talk about it? &gt;&gt; It&#x27;s always fun to show it. Okay. &gt;&gt; I I&#x27;m a fan of like show don&#x27;t tell, push people to the video. &gt;&gt; Yeah. All right. I&#x27;ll try and arrange this so you guys can see a little bit. &gt;&gt; Yes. &gt;&gt; Um, all right. So, what you have here, so this is this is Prism. &gt;&gt; Um, and what you can see is on the left here, this is actual latte. You can see why you might want AI to help you write it because it&#x27;s, you know, &gt;&gt; a language, &gt;&gt; a little bit, it&#x27;s a language. It&#x27;s a little bit messy. And then on the right, this is my colleague&#x27;s uh paper, Alex Lupas. He&#x27;s a physicist. Um, this is a</p>\n<p>paper that he wrote on black holes. And so you see it over here all the all the l you know you can imagine trying to write this in like Google Docs or something it&#x27;d be impossible. This is why latte is uh super powerful. Um and then and you&#x27;ve got kind of your your files here that make up the project tech file which is the actual main source file bibliography files etc. And um you know you can go through and you can change it and then you compile that into into the PDF itself. But here I can say um this is where at the bottom you can</p>\n<p>use the the AI you using GPT 5.2 and I could say you know this introduction maybe I want a little help writing the introduction. So uh help me proofread the introduction section paragraph by paragraph. Uh suggest places where where I can simplify. This is a live demo and we were we&#x27;re working on it pretty heavily. So just uh [laughter] you nervous yet? You can&#x27;t be nervous. You&#x27;re good.</p>\n<p>&gt;&gt; Spoken like a true founder. [laughter] &gt;&gt; Um and so one of the nice things is you could do this in chat GPT, but you&#x27;d have to go upload your files into a chat, right? You&#x27;re going back and forth here because the AI is built into the product. It has all of the files that are part of your project. It automatically puts them in context. it works the way you you think it would work. So, here it&#x27;s looking at the files. All right. Um, and it&#x27;s given us kind of a diff here. So, it&#x27;s suggesting changes. You&#x27;ve got the the part in red, which is the part that it&#x27;s changing.</p>\n<p>The part in green what it wants to change it to. And you can see the different places where it uh is suggesting that we change things. So, okay, we can we&#x27;ll just keep all of them, right? YOLO. Um, &gt;&gt; hope is all true. Yeah, we&#x27;re changing Alex&#x27;s paper. What&#x27;s the big deal? [laughter] Um, so here&#x27;s another thing. We were talking about diagrams in Latte. Uh, so I&#x27;ve got a say I wanted to input a commutive diagram, right? It&#x27;s really easy to draw a commutive diagram like</p>\n<p>this. &gt;&gt; It is an absolute nightmare to put these things [laughter] into tech. &gt;&gt; So I will upload this photo and I&#x27;ll say here, whoops. &gt;&gt; Is there a tech bench for this kind of stuff? uh like a set of evals. We totally need one. I think there&#x27;s an opportunity to do that for sure. So, here&#x27;s uh a communive diagram that I drew on the whiteboard. Can you make it into a tix diagram</p>\n<p>and put it right after the I don&#x27;t know, right after right before right at the top of the introduction section. Make sure you get the details right. [snorts] &gt;&gt; So, so I didn&#x27;t want to interrupt you while you were typing, but why don&#x27;t you use voice? &gt;&gt; Oh, actually, I should and I totally could. Yeah. &gt;&gt; No, but isn&#x27;t it interesting that we all have these voice buttons and we don&#x27;t use it? &gt;&gt; Yeah.</p>\n<p>&gt;&gt; It&#x27;s not second nature yet. &gt;&gt; Yeah. &gt;&gt; Like it&#x27;s interesting. &gt;&gt; Um, and that one I I totally should have I was gonna also show something. So it you have the you have the the you know here I am in the tech and it&#x27;s working. You also can create new parallel chats. So you can have whole sessions with chat GBT that you can be you that can be going in parallel. &gt;&gt; So here I&#x27;ll ask it um there&#x27;s all these equations. We&#x27;re talking about symmetries of this uh of this black hole uh wave equation &gt;&gt; and in particular there&#x27;s this complex</p>\n<p>symmetry here. &gt;&gt; Um &gt;&gt; I like how it Yeah. And notice how it syncs when I highlight it. But I&#x27;ll say like why don&#x27;t you I&#x27;ll go to my chat so I can start doing this in parallel. I&#x27;ll say um please make sure or please uh verify that the H+ operator in the new symmetries section is indeed a symmetry of the stationary axis symmetric. Do &gt;&gt; you understand those questions?</p>\n<p>Are there whole I have but after that Brandon is actually [laughter] &gt;&gt; I&#x27;ll say don&#x27;t do it in the paper you know show it show it here &gt;&gt; I don&#x27;t want it to actually like edit the paper I just wanted to prove it here right okay so I&#x27;ll get that going &gt;&gt; now while we&#x27;re waiting for the diagram to finish we can also get another thing going in parallel so I&#x27;ll say um I need to write up a set of uh lecture notes on general relativity. You know, say I&#x27;m a professor, right? I&#x27;ve got I&#x27;m</p>\n<p>teaching a class or something. Um, put together a uh 30 minute set of lecture notes on uh Romanian curvature. &gt;&gt; Wow, that&#x27;s a very different task. &gt;&gt; Put it into the file. I made this grle lecture.te. Okay. And so I&#x27;ve got this going. All right. Well, it came back on my earlier one. H+ symmetry. Is it really? Here you got chatbt doing a whole bunch of uh uh</p>\n<p>of work to verify that this is indeed a symmetry of the equation. Okay, it does. It confirms it. Right. So you&#x27;ve got the full power of a reasoning model that can think deeply about frontier science. Uh and now we can go back while it works on the other thing. Okay. So it it this was where I was making the diagram, right? Uh it put it right below the introduction. I&#x27;ll compile it again. &gt;&gt; So it is an autoco compile. &gt;&gt; Uh &gt;&gt; actually you can turn that on. Okay. &gt;&gt; And look. Wow. It it nailed it. &gt;&gt; Um so it looks like it got it pretty</p>\n<p>much exactly. &gt;&gt; Just a small check the details. &gt;&gt; Oh yeah, check the details. &gt;&gt; Uhoh. [laughter] Good enough for me. &gt;&gt; Yeah, it&#x27;s pretty good. But all right, we can we can see if it&#x27;ll get it right. Let&#x27;s say um uh the Cvertex should be directly &gt;&gt; to your point about voice though I do think uh maybe over time the code kind of might recede into the background more as you&#x27;re just really interact you&#x27;re interacting with the paper you&#x27;re having conversation [clears throat] with it. &gt;&gt; Yeah. &gt;&gt; When you when you started this product was this how you envisioning it would be</p>\n<p>used or were there other design choices that you were considering and you didn&#x27;t take that path? Um, &gt;&gt; by the way, before you answer, we have our we have our uh general relativity lecture notes here. &gt;&gt; Well, that was quick. &gt;&gt; So, &gt;&gt; 30 minutes. &gt;&gt; This is a six pages. &gt;&gt; Yeah. So, 30 page 30 minute section. Okay. So, we got curvature, coariant, derivatives. Yeah, this looks like a reasonable set of uh of notes if you were going to go teach a class, right? It just did it for you. &gt;&gt; Or you can even think like, you know, generate the problem set for for this week.</p>\n<p>&gt;&gt; Yeah. Right. You&#x27;ve got work. So, it&#x27;s got some examples here. we could tell it to like work out solutions to the examples. Um, &gt;&gt; that&#x27;s sort of a hidden feature of Latte, too, that it it actually makes it pretty easy to generate problem sets with like answer sheets and things like this. &gt;&gt; There&#x27;s so many there&#x27;s so many cool features of Latte that I think uh are underutilized. &gt;&gt; Yeah. So, anyways, you could see we we went we we uh had it proofread the paper. We had it check some of the answers uh to verify that our calculations were correct. We generated a set of lecture notes. We added a diagram that we didn&#x27;t have to actually</p>\n<p>type up ourselves, which I promise you is horrendous. And that&#x27;s just, you know, we did that all all basically in parallel. And you know, you can imagine lots of other things. You can you if you have a proof that you you know, you maybe have like the the sort of the bullet points on a proof, you can just say, &quot;Here are the bullet points. Now, flesh it out for me.&quot; You can imagine having it check all of your references before you publish. Make sure all of them are real, up to-date. You can imagine having it generate your references based on the topic of, you know, so there&#x27;s so many areas where AI can help. [laughter]</p>\n<p>&gt;&gt; That&#x27;s a big problem when you&#x27;re trying to put together a paper is get all the references right. &gt;&gt; Yeah. Well, okay. So, &gt;&gt; and all of this is time that used to go to, you know, typing up a paper &gt;&gt; not science &gt;&gt; and not science and now it could go back to science and that&#x27;s just one of the ways that we look at accelerating scientists all over the world. Yeah, I I would say uh definitely, you know, be careful about including references you haven&#x27;t read, [laughter] right? Like that&#x27;s the whole point. Like you can include 100 references, but if you didn&#x27;t read them, then you might as well not have them. &gt;&gt; Uh but yeah, I think that web connection</p>\n<p>is is very important. And like is this stock GPT5 or GPU? &gt;&gt; GPT 5.2. Yeah. &gt;&gt; Um but and by the way, you when you&#x27;re looking at references, you can also ask chat GPT to help you understand the reference. you know, read this paper, tell me the relevance. So, all of the things that you might want to do to accelerate your work, you can just do from within this interface. &gt;&gt; You still have to do your work, but it should [laughter] make it it should make it faster, especially like even linking to the references. So, you can go and verify like, okay, this is this one. &gt;&gt; So, this might also make it easier to write the paper as you do the work,</p>\n<p>right? Rather than [clears throat] rather than, oh, okay, now I got to spend two days in Latic land trying to get my paper, right? like a tool for thought rather than just a publishing tool. &gt;&gt; Yeah. &gt;&gt; Yeah. Yeah. &gt;&gt; What about collaboration? &gt;&gt; It&#x27;s a great Yeah. So, it&#x27;s built for I mean, you can speak to this well. It&#x27;s built for collaboration. So, you can bring on as many uh &gt;&gt; uh collaborators as you want. Okay. &gt;&gt; Which is nice. I think most other tools in the space have hard limits and charge you money and other things. &gt;&gt; In Prism, it&#x27;s as many collaborators as you want for free.</p>\n<p>&gt;&gt; Um Yeah. So, you&#x27;ve got commenting, you&#x27;ve got all the kind of collaboration tools that you would want. Um, good. &gt;&gt; And then any other like engineering choices like um, you know, what might engineers not appreciate when just looking at a tool like this? Uh, you know, often it would be like multi-line uh, diff generation that you need to do because you&#x27;re editing a pretty complex document. &gt;&gt; It does get pretty complicated. I mean, we&#x27;re using um, let me know if I&#x27;m getting too technical into the weeds, but uh, you know, we&#x27;re relying heavily on the Monaco uh, uh, JavaScript framework. So &gt;&gt; I&#x27;m very familiar with the lack of</p>\n<p>documentation of Mono. [laughter] &gt;&gt; That&#x27;s actually it&#x27;s interesting you say that because it&#x27;s it&#x27;s very true there. It&#x27;s extremely powerful library that is almost entirely undocumented. So &gt;&gt; you can use codecs now to generate the documentation [laughter] for you. &gt;&gt; Yeah, you you think Microsoft should get on that. Uh but yeah, you know, like just stuff like that. Like I I like to hear about like the behind the scenes of like building something like this. What what do you what do you struggle with? What&#x27;s the model really like surprisingly good at? and what&#x27;s the model it should be good at but it&#x27;s not.</p>\n<h2>Engineering Challenges: Monaco, WebAssembly, and Backend Rendering</h2>\n<p>&gt;&gt; What were some of the hardest problems as you were building this in the first place? What are some of the hardest things to get right? &gt;&gt; I think um initially maybe one interesting challenge was that we really pushed on it being um web assembly and fully just running in the browser at first the whole entire latte compilation and that did help us in the sense that we were able to like flesh out the design and the AI capabilities early on without having to invest heavily in like the backend infrastructure. Uh but eventually we did hit a wall with that approach and once we switched it to backend PDF rendering like that&#x27;s when we really started to hit an inflection point with like usage.</p>\n<p>&gt;&gt; Yeah. Fast. &gt;&gt; Yeah. &gt;&gt; Yeah. I think we also the AI in here benefits a lot from everything that we&#x27;ve learned building codecs. &gt;&gt; Um and as we go forward I think we&#x27;ll likely just integrate the the full codeex harness into the application here. So you get all the benefits of the tools and the skills and all the things that Codex can do today. &gt;&gt; Uh and you just sort of automatically can bring that into your environment here. &gt;&gt; Yeah. Is there a future they&#x27;re just the same app? Uh maybe [clears throat] I think potentially it depends on I mean</p>\n<h2>The Future of Scientific UIs: From Document-First to AI-First</h2>\n<p>here&#x27;s the reason I&#x27;m hesitating is I think the the interesting thing with um with this and with codeex is we&#x27;re still mostly in a world today where people are you have you know your your main screen is your is your document and then you have your AI on the side but the more that AI that improves people trust it and they&#x27;re just yoloing it right? You&#x27;re like you&#x27;re generating code and you&#x27;re you&#x27;re like looking at the code is sort of secondary to instructing the AI and and driving from that.</p>\n<p>The UI probably changes for all of these things, right? You don&#x27;t you don&#x27;t need your your document front and center because you&#x27;re actually not looking at your document as much. &gt;&gt; You&#x27;re that&#x27;s sort of your backup and your interaction with your AI is primary. &gt;&gt; And as that happens, I think you might these these UIs can kind of converge over time. So, we&#x27;ll see. Uh, but I definitely would love to see a world where people needed to spend less time thinking about the actual syntax and much more about what they&#x27;re trying to create. &gt;&gt; Yeah. I mean, I I I feel like this plus a notebook would be amazing. Yeah.</p>\n<p>&gt;&gt; Because because you and something that uh the AI can run equal, generate plots. Oh, stick that in the paper here. like oh read you know like this paper like this part of the paper like take that equation and like you know do something with it that would be a really amazing uh integration. &gt;&gt; Yeah like think through the different corlaries [clears throat] of this thing from this paper and produce some alternatives and then like yeah I I completely agree. &gt;&gt; Yeah. &gt;&gt; Yeah. I do think that&#x27;s sort of the progression where it&#x27;s like doing doing</p>\n<p>maybe work for a few seconds versus maybe we&#x27;re already at a point where it&#x27;s doing work for a few minutes eventually doing work for hours, days, coming back with very complicated analysis. &gt;&gt; Mhm. Yeah. I mean that that&#x27;s actually maybe a good segue into some of the other questions that I had about your um your initiative. I mean uh so stepping back to AI for science in general um can you talk a little bit I I have a million questions but uh maybe start with what I okay I feel that validation of AI for</p>\n<p>science so uh is critical to its success right you have to have some sort of um real world validation of of the results that you produce with your AI right so what are the I I know that there&#x27;s been some publicity in the in the past. What are the like the latest and greatest hits of the things that big labs or any lab is doing with uh with open AIS AIS?</p>\n<h2>AI for Science: From SAT Tests to Open Research Problems</h2>\n<p>&gt;&gt; Uh I mean when you step back and look at the trend I think that&#x27;s the biggest thing because we can we can debate exactly like you&#x27;ve probably seen in in the last few weeks even there have been a bunch of different examples of like GPT 5.2 to contributing to open airish problems and things like that. And then you get into this debate of well was it uh was it really just really good at literature search and it found an example over here an example over here when you combine the two you know that it was sort of a trivial step from there to the solution and &gt;&gt; was that novel or did it really do</p>\n<p>something new and &gt;&gt; you know that&#x27;s a that it&#x27;s a legitimate discussion but when you step back &gt;&gt; two years ago we were like you know this thing can pass the SAT that&#x27;s amazing and uh [laughter] and you progress to like it can do a little bit of contest math and it can start to solve harder problems. Wow. And then you keep going and it&#x27;s starting to solve graduate level problems and then you have a model that gets a gold medal at the IMO and now we&#x27;re sitting here talking about you know it solving open problems at the</p>\n<p>frontier of math and physics and biology and other fields. So it it&#x27;s just I mean the progression is incredible. And if you think about where we are today, then you fast forward 6 months, 12 months, like I I I&#x27;m very optimistic about what the models are going to be do able to do to accelerate science. It&#x27;s like it&#x27;s already happening. And if there&#x27;s one thing that I&#x27;ve learned from uh my like two-ish years at OpenAI, &gt;&gt; it&#x27;s you go very quickly from this is this thing is just impossible for AI to do. like [snorts] it&#x27;s too</p>\n<p>hard, AI can&#x27;t do it to like AI can just barely do it and it like kind of doesn&#x27;t work and you know only early adopters are doing it because it&#x27;s not particularly reliable yet but it like sort of works to oh my god AI like does this thing really well and I could never imagine not using AI for this in the future. It&#x27;s like once you start to get to, you know, 5 10% on some particular eval, you very quickly go to like 60 70 80 &gt;&gt; and we&#x27;re just at the phase where AI can help in some, not all, but in some</p>\n<p>elements of frontier science, math, you know, biology, chemistry, etc. And it it just means we&#x27;re like right at the at the cusp and it&#x27;s super exciting. So I mean so it it fast forward a year or you know the end of the year uh and we have</p>\n<h2>The Wet Lab Bottleneck: Robotic Labs and Experimental Acceleration</h2>\n<p>AIs that can do you a lot of this um discovery process then the bottleneck becomes the wet lab or the the lab right so what what what is what are you seeing um in that domain? Yeah, I I by the way I totally we were talking a little bit about software engineering before and the analogies. I think 2026 for AI and science is going to look a lot like what 2025 looked like for soft AI and software engineering. &gt;&gt; Yeah. &gt;&gt; Where if you go back to the beginning of 2025 if you were using AI heavily to write your code,</p>\n<p>&gt;&gt; you were sort of an early adopter and it like kind of worked and but it wasn&#x27;t like certainly not everybody was doing it. And then you fast forward 12 months and at the end of 2025, if you are not using AI to write a lot of your code, you&#x27;re probably falling behind. I think we&#x27;re going to see that same kind of uh of progression in AI and science. You know, today it&#x27;s a early adopters, but you&#x27;re really starting to see some proof points and solving open problems and, you know, developing new kinds of proteins and things like that. Um, but you&#x27;re right, as it as it really starts</p>\n<p>to work, and I think this is the year that it&#x27;s really going to start to work, uh, it it shifts the bottleneck, and I think we&#x27;re going to be starting to talk a lot more about robotic labs and other things, &gt;&gt; you know, [clears throat] like do you need to have a grad student like pipetting things? &gt;&gt; No. &gt;&gt; Probably not, right? right now you do, but why why shouldn&#x27;t we have why shouldn&#x27;t we have uh robotic labs that where you have AI models doing what they do best reasoning over a huge amount of of different information um you know</p>\n<p>they have read substantially every paper in every field and can bring a lot of information to bear to help prune the search tree on you know a new material for example that you&#x27;re trying to create and then you have a robotic lab that can uh roll out a bunch of experiments in parallel do them while we sleep. Um, and then feed the results back into the AI, let it learn from them, design the next set of experiments and go. &gt;&gt; I mean, it&#x27;s hard to imagine that&#x27;s like &gt;&gt; it doesn&#x27;t even have to be YOLO science, right? To your point, it&#x27;s you&#x27;re verifying it as you go cuz you have an actual lab building it in real life.</p>\n<p>&gt;&gt; Um, but you can just do so much more in parallel. You can think harder up front with AI to design the experiments. uh and and again like prune the search tree so you&#x27;re you&#x27;re searching over a smaller number of higher value targets and then you automate the experimentation uh and and turn it around faster. And again like this is acceleration like the whole if we&#x27;re successful then it&#x27;s you end up doing you know maybe the next 25 years of science in 5 years instead. So in 2030 we could be doing 2050 level science and that would</p>\n<p>be an awesome outcome. like the world is a better place if that happens. &gt;&gt; Absolutely. I I guess uh so we spoke recently with Heather Kulik at MIT and one of the things she pointed out was that there&#x27;s a element of serendipity to working in a lab that you lose and so she was of the opinion that there&#x27;s a class of problems especially when you have like a large search space or something like that where robotics is going to really accelerate science and there&#x27;s another class of problems where even experimental science will not move forward very fast because of robotics. And so then again, you&#x27;re at a</p>\n<p>bottleneck. But I guess humans need something to do. So &gt;&gt; well, that [laughter] what she said sounds totally reasonable to me, right? There are probably places where the humans are adding no value because they&#x27;re literally just trying to pipet a certain amount of a thing into another thing or, you know, do some uh the same motion repeatedly in a bunch of different ways. And then there are places where it it&#x27;s less well understood. You want the full flexibility that you have of a really smart human thinking about the work that they&#x27;re doing. Um, by the way, the same is true in in uh the more theoretical fields as well. It&#x27;s not this isn&#x27;t</p>\n<p>about let&#x27;s automate all the humans out of their jobs. This is about accelerating scientists. It&#x27;s scientist plus AI together being better than scientist alone or AI alone. &gt;&gt; Um, and I think the same is true whether you&#x27;re talking something that&#x27;s happening in silic proving a theoretical problem or happening in the real world with a lab. like find the parts that you don&#x27;t need a human to do and try and automate them as much as you possibly can so that the humans can spend their time on the most valuable things. &gt;&gt; Yeah, I&#x27;m very pro like the incilical uh acceleration because obviously you have</p>\n<p>more control over that and you can parallelize and repeat and &gt;&gt; yeah do all those all those things. Yeah, I think there will be a huge amount of value in you know a lot of fields are are heavily simulatable and they you know and so you know nuclear fusion for example they&#x27;re running a lot of simulations before they do any particular experiment because the experiments are very timeconuming and expensive. &gt;&gt; Yeah. Um, but I&#x27;m excited to see what you can do when you have a a loop between, you know, a a very intelligent reasoning model that understands fusion and a simulation and you get the model</p>\n<p>thinking about what parameters to set for the simulation and then running, you know, a bunch of simulations in parallel, feeding that back and you have that same sort of lab loop except it&#x27;s all in silicon and in an exper in um and running on a giant GPU cluster. &gt;&gt; Yeah. And then when you really have like gotten to the end of that calculation, then you go run it in &gt;&gt; IRL. This is bringing it back to Prism. This is sort of a a nice aspect that you&#x27;re you&#x27;re getting a more sophisticated view of your result, right? instead of just um you know like a chat output and it I would I would</p>\n<p>hope as it develops it&#x27;s a way for a scientist to be able to interact with the information before you kick off your nuclear fusion experiment for you know $10 million or whatever. &gt;&gt; Mhm. And the human can learn from more things right you just you get more data that you can that you can look at and evaluate. Oh yeah, &gt;&gt; this by the way this fusion discussion makes me think like you know if one day open for science you know it gets serious enough and starts to self accelerate you should solve cold fusion and you know be your own power source. [laughter]</p>\n<p>&gt;&gt; Well I mean this is this is why we&#x27;re so excited about this, right? I mean imagine our our our mission is is to you know to to bring AGI to the world in a way that&#x27;s beneficial to all humanity. &gt;&gt; It&#x27;s right there at the lobby. &gt;&gt; Yeah. You see it every day you walk in, you see it. &gt;&gt; Yeah, absolutely. And and imagine I mean if we had GPT9 inside of chat GPT today, it would be awesome. You could do lots of things, but if you had GPT9 and it could um which I&#x27;m using as a standin for AGI, right? And and it could &gt;&gt; create new materials and we were the</p>\n<p>devices we were using were all incredible and you know had 30-day battery lives and things like that. and we had personalized medicine and we all knew someone whose life was saved because we were developing personalized, you know, &gt;&gt; uh, cancer treatments and things so much faster. Like &gt;&gt; that&#x27;s the real benefit of AGI. That&#x27;s I think maybe the most tangible way that we&#x27;re all going to feel AGI as it starts to be real. Yeah. &gt;&gt; And that&#x27;s why this work is so mission driven for us. &gt;&gt; So, so that does it brings up like kind of two questions in my mind. One is the</p>\n<p>first one is so then who uh who owns the invention and [clears throat] then the other half of that is okay so then does does open AI become a drug company and a fusion company and and right cuz this is how I mean you laugh but it&#x27;s a little bit serious that all the AI for drug discovery companies ended up being drug companies because they couldn&#x27;t sell the so far with some exceptions now with no edetic for example but they end up being drug companies because they can&#x27;t sell the the drug. But in any event that</p>\n<p>there&#x27;s like a lot of precedence for using basically building your own portfolio using uh AI. So like are you thinking about that that angle or this is right now you&#x27;re just let&#x27;s get what&#x27;s enabled scientists for outside of open AI? Yeah. I mean, my my personal belief about as we drive towards AGI is not that we&#x27;re going to we&#x27;re going to create AGI and then we&#x27;re all going to like sit back and enjoy our universal basic income and like write poetry. I we&#x27;re people the future will involve [snorts] I mean</p>\n<p>especially advanced science is going to involve experts helping to drive these models and I don&#x27;t believe that any one company is just going to do everything right. It&#x27;s why we&#x27;re focusing on first and foremost on accelerating scientists outside of these walls, right? Our goal is not to win a Nobel Prize ourselves. It is for a 100 scientists to win Nobel prizes using our technology. &gt;&gt; Yeah. And at the same time, I think there are there are like places where sometimes you actually when you&#x27;re trying to build for other people, you learn best if you actually try and go end to end on something</p>\n<p>&gt;&gt; because then you&#x27;re your own customer and you get you understand it in a tighter loop than you would if you were purely building for people outside the walls. &gt;&gt; So I think it makes sense for us to take a handful of bets like that. But &gt;&gt; by and large, we&#x27;re going to partner because the the surface area of science is massive. Yeah. &gt;&gt; And we want to accelerate all of science. &gt;&gt; Yeah. &gt;&gt; Yeah. We&#x27;re covering all sorts of disciplines from like chemistry to we are &gt;&gt; structural biology [laughter] &gt;&gt; and we&#x27;re we&#x27;re releasing the first first episode this week. So &gt;&gt; material science it&#x27;s all over the place. Uh it&#x27;s there&#x27;s a lot to do. uh one thing I did wanted to bring across</p>\n<p>also was so afraid sits within the broader sort of research uh org at open AAI and you know one of the more more</p>\n<h2>Self-Acceleration and the Automated AI Researcher by September 2026</h2>\n<p>interesting things is like self acceleration let&#x27;s call it you know &gt;&gt; [clears throat] &gt;&gt; um where yakub has very publicly declared that we&#x27;ll have a automated researcher by September 2026 &gt;&gt; yeah the beginnings of what I think you said right and it&#x27;s like the intern version this year &gt;&gt; first product uh and I&#x27;m sure you have more cooking internally but like why so soon like that&#x27;s 8 months away and uh what&#x27;s the what&#x27;s the goal there? What you know just anything above that that you can share? &gt;&gt; Yeah, I mean 8 months that feels like forever in this industry [laughter] &gt;&gt; basically infinite time. Um I mean no</p>\n<p>it&#x27;s exactly what you said right? It&#x27;s if uh if we can if we can create a a a model an AI researcher that is um that can actually do novel AI research then we can move way faster right we will we will self- accelerate uh we can discover more things quickly we can apply GPUs and compute to to moving our own research faster and that just means that we can improve our models at a faster rate and every bit that we improve our models means that we We&#x27;re a step closer to bringing AGI and all the things that</p>\n<p>we were talking about with personalized medicine and new materials and like we can bring these amazing things into the world faster. &gt;&gt; So it is about self acceleration. &gt;&gt; Yeah. I think one one thing I&#x27;m also trying to figure out is how closely is machine learning research which is a science. &gt;&gt; Yeah. uh or high performance compute which is also something that you guys are doing a lot of uh close to the traditional hard sciences let&#x27;s call it like physics and chemistry &gt;&gt; I think in a lot of ways it&#x27;s it&#x27;s sort of a parallel effort to this like it is the work that we&#x27;re trying to do with AI</p>\n<p>open AI for science and accelerating other scientists the parallel internally is they&#x27;re trying to uh build products and models for AI researchers to accelerate them so it&#x27;s there there&#x27;s a lot of sort of uh parallelism to these two work streams. They&#x27;re they&#x27;re similar in in uh in in goal just for a different set of users. &gt;&gt; Yeah. Okay. Um any parting thoughts, questions, anything we should have asked? &gt;&gt; Uh well, I hope everybody tries Prism. It&#x27;s it&#x27;s available today at</p>\n<p>prism.openai.com. It&#x27;s totally free. You log in with your chat GPT account and you can go build anything you would like. We&#x27;re really excited to see what people use it for and um if if you run into issues or have any feedback, let us know. &gt;&gt; I have a paper I&#x27;m going to write [laughter] really really soon on that. &gt;&gt; Amazing. Show notes in this thing. I don&#x27;t know. Let&#x27;s let&#x27;s see what it does in Latte. &gt;&gt; Yeah, [laughter] totally. &gt;&gt; Yeah. Congrats on your first Open AI launch. &gt;&gt; There you go. &gt;&gt; Congratulations. &gt;&gt; Congrats. Thanks for having us. &gt;&gt; Yeah. Thank you.</p>", "chapters_count": 9}