{"video_id": "faaRYgijQ-w", "title": "A conversation with Vercel's Guillermo Rauch", "link": "https://www.youtube.com/watch?v=faaRYgijQ-w", "published": "2025-12-10T16:25:18+00:00", "summary": "Guillermo Rauch, CEO and founder of Vercel, joins Stripe's Head of Data & AI, Emily Glassberg Sands, for a fireside chat on how Vercel scaled to $200 million ARR by shipping week-over-week, why AI agents are becoming the next users of software, and how natural language is transforming into the new programming primitive for builders.\n\nLearn more at https://stripe.com/startups", "transcript_html": "<p><strong>[00:14]</strong></p>\n<p>Well, thanks so much for being\nhere today for Build Day. Build Day's really all\nabout turning great ideas into great products, and so when we stepped back\nand asked what that might mean, we thought, well, no better\ncompany to talk to than Vercel, who's very much at the forefront\nof making that possible, and Guillermo, in particular, who, of course, is the\ngenius behind Next.js and Vercel in parallel. So, lots of good conversation\nto be had around open source- Good to be here, thank you.\n-And business. I think earlier this year</p>\n<p>you guys announced 200 million ARR and a doubling of users year over year. For those of you who are\nreasoning about sort of scale and what might be possible, I heard 4.3 million downloads a week of your AI SDK alone. Yeah, it's hard to keep count of downloads 'cause they're growing so fast. Good problem to have. But, yeah, the business has\nbeen growing really fast, and, as many others I think here, it was born in the cloud\nand it was born on Stripe. Amazing, and, you know, I think with many of today's startups,</p>\n<p>rather than reasoning about\nyear-over-year growth, we're increasingly reasoning\nabout month-over-month growth or even week-over-week growth-\nDay. Day.\nDay? You could ship something today that makes a huge difference. Always elevating ambitions, amazing. Well, thank you for being here. I thought we could start maybe\na bit with your background. Born in Buenos Aires,\ntaught yourself how to code? True story? That's right, yeah. Curious about kind of your early journey and what brought you to the US. You know, there are a lot of parallels between what I set out to do\nwith Vercel in my early days because teaching myself to code</p>\n<p>and speak English was\nquite the challenge, but- You taught yourself English? English was not spoken at home? The funny story, no. In fact, my parents were\nreally interested in it 'cause, in Argentina, like,\nthe country was always divided between like capitalism and socialism. And my parents were very much\nlike engineers themselves, industrial and chemical engineers, and they had a lot of admiration\nfor great engineering. And they knew that the\ncutting edge would be in Silicon Valley in the United States,</p>\n<p>but you needed to know\nEnglish in order to get there. And so I was interested\nin software engineering, and I noticed that a lot\nof the programming manuals, documentation, readmes, were in English. So I basically had a\nbootstrapping process to do. And I tell people these\ndays that, you know, AI is sort of a before and after because, if I go back in time and I'm trying to teach\nmyself how to code, I can do it in my native language, and I can do it at every step. I can just ask the LLM to teach me. Like, literally, one of the\nthings with LLMs is like, \"Explain quantum mechanics like I'm five.\"</p>\n<p>I could have done that. I could have-\nWhen you were five. You could have done that\nwhen you were five, yeah. So I didn't have that. The next best thing was the internet, and the next, next best\nthing was open source. So, for me, one of the discontinuities in my learning journey\nwas when I started getting to know the open-source communities, contributing to open source, spending a lot of time connected with strangers on the\ninternet, as one does,</p>\n<p><strong>[03:15]</strong></p>\n<p>and learning together. And so I started contributing\nto a lot of web frameworks. One of the earliest was called MooTools. It was a JavaScript library, and that was actually very formative. You know, if I think of my resume, my resume was a bunch of\nthe open-source projects that I contributed to. And the web itself was\nfor me sort of the vehicle that allowed me to\nbasically leave Argentina and become a worldwide\nfigure in programming because the instant that\nI was able to use the web to very quickly ship things,</p>\n<p>fork something and put it out into URL, now you have a worldwide audience, right? These hyperlinks can travel at the speed of, you know, thought pretty much. So fast-forward to Vercel\nand had the same inspiration. If you wanna start a company, if you wanna start a digital business, if you wanna ship your next big idea, I need to make it extremely easy. I need to remove all of the friction. And, funny enough when I\nwas here in Silicon Valley, I had already sold my first\nbusiness to WordPress, I noticed that, you know,\nthe cloud was all the rage.</p>\n<p>I always encourage people to think about platform shifts very closely. Clearly now we have a\nplatform shift towards AI. Like 10 years ago when I started Vercel, the platform shift was towards the cloud. I looked at the cloud, and it was so hard, even though I had like 10 years of engineering experience under my belt. And so Vercel set out\nto remove all friction, from idea to global cloud application. And so you're kind of\ndeveloping Next.js and Vercel, one open source, one is\na business, in parallel.</p>\n<p>I'm curious like hard\ntrade-offs along the way when you had to make a\ncall, one versus the other. Yeah, where there was no\ntrade-offs was in my vision. I wanna make the web easy, and so when I was thinking\nabout it from first principles, something that you guys\nlove to do here at Stripe, okay, I sat down, and I needed\ntwo halves of this equation. I needed the tooling, compilers, programming language, runtime framework, and then I needed the\ncloud infrastructure. And so interestingly enough,</p>\n<p>I noticed an asymmetry in the market. I noticed an unmet need because most of the platform providers were leaving the framework\nside for you to figure out. So AWS and Google Cloud and whatever, like, here's a bunch of\nlike virtual machines and clusters and networking solutions. Right, you do the rest. It's like the meme of\ndraw the rest of the owl. They were like, \"Here's some primitives. You figure it out how to\nbuild an application.\" And so I looked at it\nfrom first principles. I was like, \"Wow, that's strange,\" 'cause as I'm in the act of\ndrawing this proverbial owl,</p>\n<p>I'm realizing I need tooling. And so that's where the\nidea of Next.js came from. It's like, hey, I wanna\ncreate an application that is of the\nsophistication, performance, and flexibility of the\ngiants of the internet 'cause I always caveat my\nlittle storytelling with, look, there were ways to publish to the internet really easily.</p>\n<p><strong>[06:17]</strong></p>\n<p>You could have, you\nknow, go to Squarespace or Wix or Tumblr. Like, there were ways\nto get something online, but my aspiration was\nthat you would be born- much like Stripe-like, your\nbusiness is born on Vercel. It never graduates because we give you infinite\nscale and infinite power. And so I solved the Next.js\nside, made it open source, and then I also needed to\nsolve the other equation with half of the equation, which is, all right, how do you host and scale this? And I also set a really\nhigh bar for myself. I wanted to make it\nuniversally performant.</p>\n<p>I wanted to make it such that\nwithout even being an expert in optimization or infrastructure, you could deploy something that scales and performs excellently. And so those were the two things. One is more on the business side, and the other one is sort of\nour presentation to the world. Our cover letter to the\nworld is start with Next.js or any other open-source\nframeworks that we contribute to. I mean, awesome that they\nwere so hyper-complementary, right, additive. Were there hard trade-offs you made? I mean, even in your own time-\nYes. Like where you spent\nyour own time and energy?</p>\n<p>Yeah, it's funny because\nI had to overcome a few bad, I guess, intuitions\nin order to get there. One intuition that I\nhad at the beginning is: in order to create the world's best and most successful startup, I\nhave to make everybody happy, like every single person. I feel like that's just a life lesson. In order to be the best, yeah, you don't have\nto make everyone happy. You have to be somewhat disagreeable. Yeah, so who did you\nagree to disagree with? So, interesting, and this is why like the\nstory like seems so simple now</p>\n<p>that I tell it, it's like,\n\"Oh, wow, like, genius. Of course, you created the framework and the infrastructure.\" In the beginning, the\ninfrastructure was so generic that I was trying to appeal to everybody. You liked Java. It's like, \"Oh, I can't let Emily down. I'll do some Java over here. Oh, and you like Next? Oh, okay, I'll do some Next. Oh, and you...\" And so I really was just beginning to straddle myself like really thin. And so the principle that\nI've now extracted from this that I'm very happy to\nshare with the world, because it can save you some pain, is your ambition for a\nventure-backed business that'll reach global scale\nshould be pretty much unbounded.</p>\n<p>Like, we're here today. We're gonna colonize Mars\nsomeday, sometime in the future. So that's the like long-term\naspiration and ambition. But you also have to meet it with realism because, if you're just\npure unmitigated ambition, you're gonna be so up in the clouds- not the actual cloud, but\nthe, like, metaphorical cloud- that you're not gonna get anything done. You might get into a situation\nbeing jack of all trades, master of none-extremely\ndangerous situation to be in. You might get into the situation\nof what some call it like,</p>\n<p>you know, having a\nmillion mediocre customers versus 1,000 customers\nthat really love you. And so what was obvious in retrospect, and we did end up doing is, \"Hey, we'll start by dominating a niche.\" So the niche was- which is funny because\nI think a lot of things that we believe are\nniches turn out not to be-</p>\n<p><strong>[09:20]</strong></p>\n<p>'cause we've had $250 million of revenue from a niche, which is front end. First chapter of Vercel was front end, hosting the front-end side of\nwebsites and web applications, and then CDN and security services. Our next step, which has come way later than I would've expected,\nis back-end: agents and the AI cloud, and all those things. In many ways, you have\nto earn the privilege to expand that product lineup or that customer base in order to get to the ultimate\nambition of your business.</p>\n<p>Actually, we're seeing that\nin a lot of the companies that are being built now. What feels like a niche with\nlike a global user base- and especially sort of like\nability to reach markets that are well beyond our\nown-are not niches at all. They're like very, very large markets. Okay, but you had to make\nhard trade-offs at the start. 100%.\nHad to shoot for the stars and then decide like which\nplanet you were gonna land on first.\n100%. You talked about like, you\nknow, the new frontier is AI, and we've talked a bunch about open source versus closed source. I'm curious in the context of AI how you think about open-source models</p>\n<p>versus proprietary models, both in terms of like what\nthe industry is building, but also in terms of like how developers should adopt the two. One of the things that I believe is that once your business\nreaches product market fit, you can't get too satisfied, right? Because the world will\nexpect you to do more. Your customers will want you to do more. You'll have the people\nand funding to do more. So you can, you know, expand\ninto other adjacencies. And one of the rules for when do I expand into my next chapter- there's a bunch of rules\nthat I have or principles.</p>\n<p>One is what I call brand permission, meaning if Vercel\ntomorrow launched a washer and dryer product, even if it's slick and\nblack and beautiful, you'd be like, \"That's a little strange. I was expecting them to launch maybe like an AI coding tool.\" Like your brand doesn't\nyet give you permission to launch a washer-dryer. And also you want to\nexpand into adjacencies to your core competence. So, if you do payments, you\ncan handle billing next. Or, if you do payments,\nyou can handle fraud next</p>\n<p>and things like that. And so, for us, with our new chapter of becoming the AI cloud, what we realized is that\nthere is a lot of demand for the same things\nthat we did in the past. People want simple frameworks, tools, and solutions for creating agents. There's like a new\nprotagonist in this story. I call it, first chapter of the internet was about pages or pixels. In fact, if you've used Next.js, you know that the very\nfirst thing we asked you to do was create a pages directory</p>\n<p>and toss your files in there. It's like very much PHP-inspired. The next chapter-\nPages and pixels replaced by? Agents. And so agents might not even\nhave a face, so to speak, intelligence that is sort of\npermeating everything you do, meeting you in every conversation, in every platform integrated into Slack,</p>\n<p><strong>[12:20]</strong></p>\n<p>integrated into Zoom,\nintegrated into, you know, parsing your documents while\nyou're doing other work. And so this is a completely\ndifferent paradigm of the type of software that\nwe've all been building. And this is why it's exciting\nto start a business today because that feels to me\nlike a platform shift, and what's interesting\nabout platform shifts is that the old thing doesn't disappear. So it's not that tomorrow\nthere'll be no pixels or we'll get to a point\nwhere there is no pixels. Much like today, we still\nhave AM and FM radio, so the older technology is still there,</p>\n<p>and it'll have- I think in the case of the web, pages and URLs and\nlinks are gonna continue to have a ton of relevance. But clearly there's a new type of software people wanna build, and there's a new opportunity then to provide the\ninfrastructure and framework. So just like there was\nNext.js, we created the AI SDK. You called out it has 4.2\nmillion downloads a week. I think it's actually\ngonna surpass Next.js. Next.js now feels old compared\nto like this new hotness. It's like my new love interest. No, but they're complementary.</p>\n<p>There's like a foundations cloud, and there's an AI cloud\nthat you can build on top. And so whenever you have an idea for an agent or an assistant, you will naturally gravitate towards a platform that\nspeaks your language, and that's what we're building now. Yeah, so you guys are\nreally at the forefront of helping developers build with AI. We partnered with you to make Stripe sandboxes\nnative inside Vercel. And I'm curious sort of how you thought about integrating payments within your stack and why it\nfelt sort of worthwhile to you. Yeah, maybe for some context,</p>\n<p>my original ambition transcended Next or Vercel or the cloud. It was, okay, if I have a great idea, how can I convert it into a\nproductive software entity or business or whatever? And so my tool or my inclination was, look, JavaScript, I\nmentioned when I was a kid, I worked really hard to learn English, but I also worked really\nhard to learn JavaScript. And what I really liked\nabout JavaScript was it felt like the English of\nthe programming universe.</p>\n<p>Of course, there's lots of languages. Spanish is not too bad, but English, if you just learn English, think about how much you can accomplish. It's awesome. Same with JavaScript. So JavaScript can run on the server side, client side, edge, build time. It can be used to\nprovision infrastructure. And now our bet is it's\ngonna be the main language of orchestrating AI services,\nmaking API calls to models, creating agents and workflows, et cetera. So that was the inclination, is like, \"enable the world, broadly.\"</p>\n<p>Now, a little bit of a detour has been, well, kind of like ironically, perhaps, English is becoming the next\nhot programming language. So we created this tool v0 where it feels like a self-disruption. JavaScript allowed us to\nenable tens of millions</p>\n<p><strong>[15:21]</strong></p>\n<p>of people to create, but that's\nstill a very small number. How many people can express ideas? So I'll give you actually\nan actual proxy that I use. Slack and Teams have\napproximately combined half a billion monthly active users. What do those people do\nwhen they open Slack? They, generally speaking,\ntalk about building software or building some kind of business, and they go back and forth. \"Hey, Emily, how much money\ndid we make yesterday?\" And she's like, \"Well,\nwhat do you mean by money? Like, tell me exactly\nwhat MRR metric you want.\"</p>\n<p>It's like, \"Okay, see you tomorrow.\" But we go back and forth in some conversation\naround building a business. Imagine if we could take those words and actually more directly\nand concretely build software. That was the original idea of v0. And so for us, it means that\nwe can take that pool of people that are in the creator sort of category from like 20 million to 500 million. And so we recently integrated Stripe because obviously what you learn</p>\n<p>when people start building software is that they wanna monetize it. So we made an integration\nsuch that every person that puts a prompt into v0 or creates an application into Vercel has a seamless integration with Stripe where you don't even need\nto set up the environment. You just get this sandbox provisioned. And it even surprised me, but it quickly became our\nthird-most popular integration in the entire platform. It should not be surprising because anytime you build something, you need that flywheel of:\nis this actually working,</p>\n<p>and do people want it? And the best thing you\ncan do is sell that thing and get feedback from the market. So it's been amazing\nbecause I think, jointly, we're enabling not just the\npeople that know how to code or are proficient in coding, but now the next generation of, whether you call them vibe coders or not, but it goes back to that original mission of enabling everyone to ship. Any sort of surprising businesses\nthat you've seen spin up with sandboxes like\nthat you didn't expect, you know, just from going through?</p>\n<p>Well, there's a lot of people that are building, like, ideas. They might have a main job, and then they're like\nbuilding sort of their, like, startup, their dreams on the side. I feel like I've seen an\namplification of this, where, you know, for me, when\nI was at my previous company, I was dreaming of the company\nI was gonna create next. But I think the barrier- But you weren't building it yet. The barrier felt too high. It was too hard. That's right. That's right. And so I think there are\na lot of people now that, you know, one thing that's\nbeen really surprising</p>\n<p>is younger people. So obviously, I had this\nstory-my personal story-of like, I had to learn quite a bit in order to actually become someone that could sell something online, just integrating all the services, programming languages, et cetera. I've been hearing from people that are professional\nengineers that tell me, \"Look, my siblings, they're\nlike 12, 13 years old, and they're already\nselling products online.\" So that's also been really surprising. The other one that's even\nmore surprising, perhaps, is</p>\n<p><strong>[18:24]</strong></p>\n<p>within enterprises, the same sort of inclinations are in play where people have ideas, but they don't have the\nresources to execute. And so giving them a tool that can enable fast prototyping... One that was maybe not related\nto payments specifically but was bewildering to me\nis we heard about a company that went from v0 to patent filed just through like\nprototyping, trying it out, going back and forth with customers, visualizing the idea, et cetera.</p>\n<p>Like, okay, this actually\nis a meaningful evolution of our business. Without a tool that allowed\nthem to move this fast, they need to like get\nengineering resources. They need to do all these things. So there might be a\nrenaissance of, you know, it seemed like the only way that a enterprise scale could innovate is by acquiring a startup or by some people leaving and starting a startup where\nlike they were free to innovate and use tools and move really fast. I think there's a version of this that's gonna happen\nwithin existing companies, and it's been exciting\nto play a role there.</p>\n<p>I can't get out of my head this vision of like a five-year-old Guillermo, doesn't speak English\nyet, in Buenos Aires, sitting at a v0, you know, computer. What would you build? So it's happening already, right? So one thing I've been struck by is people send us like\nthe really cool things they build with v0. They share the chats in\nour community, et cetera. And it's been amazing to see that a lot of these chats are not in English. Japanese, Spanish, Arabic, like, the LLMs just don't care.</p>\n<p>Is it as performant in non-English? So this is the other thing\nthat's been shocking. So I've only had limited exposure, so I haven't done a rigorous analysis, but from my vibe-ometer,\nSpanish is amazing. So that young Guillermo maybe\nwould not speak English today 'cause he continued- Wouldn't have needed to, yeah. building in Spanish. But the other thing that's fascinating is this is not a one-way door, right? A lot of people are starting with v0 and they're becoming\nproficient engineers later.</p>\n<p>A lot of people ask me\nlike, \"Do you believe that this tool replaces\nthe engineering role?\" I don't think so, and I\nalready have enough evidence from seeing people telling me, like, \"I spent three months in v0. It opened my mind to the different kinds of special skills that\nit could develop later. And now I do this, and I connect to Git, and I use other tools. And I'm going towards that\njourney of proficiency.\" I don't think people should\nnecessarily stop at prompting. In fact, this is how I\nquote, unquote, \"code\" today.</p>\n<p>Whenever I have an idea, it's actually way more practical\nfor me to put it into v0 and send a prototype to my team than try to express the\nsame idea either in Slack or text messages or whatever. Or, you know, sometimes\nthe friction to coding and creating an environment,\nit's just too high. And so I think these tools\nwill continue to coexist</p>\n<p><strong>[21:25]</strong></p>\n<p>in order to help people\ndream up really big things. Okay, so your own developer\nexperience- Vercel's obviously known for an\nincredible developer experience. AI is changing what it\nmeans to be a developer. What do you think good\ndeveloper experience is gonna look like a year out, two years out, three years out? Yeah, one thing that's definitely changed in how we operate\ninternally is that we talk of the LLM as our customer. So it used to be that I designed\nNext.js only for people, and the persona that I\nwould imagine in my head is, all right, there's this developer.</p>\n<p>Maybe they've had some exposure to PHP. Maybe they know some HTML. How can I relate to them? In fact, and I haven't\nshared this too broadly, but the very first version of Next.js looked a lot like a templating language 'cause I really badly wanted\nto merge the world of React, which seemed a little divorced from the mainstream of\nprogramming at the time, and I wanted to make it super relatable. I wanted to make it like MySpace codes. I wanted to make it like,\n\"Oh, it just looks like HTML with some JavaScript logic on top.\"</p>\n<p>Or even Shopify Liquid looks\na little bit like this. And so my customer was that developer. And, whenever I design something, I try to think of a very\nbroad range of skillset. This has been sort of like a\npersonal mantra that I have. I call it progressive\ndisclosure of complexity, which is actually something\nthat's really hard to do. How many years old is Stripe? I mean, it depends when you count from but like slightly over a decade. Okay, so in ten years,</p>\n<p>a company will add more\nand more complexity commensurate to the customers that come in and the deals that they make. So, if Stripe is supporting Shopify, the needs of Shopify are way more advanced than the needs of a one-person shop. So, how do you maintain the simplicity of the early days, when it was mostly used by one-person shops, ten years in? And so my personal rule\nis, one, it's possible. It requires a ton of work, but the rule is progressive disclosure</p>\n<p>of complexity or sophistication, meaning you still should present yourself where you meet the needs and complexity and experience of that customer that comes in through the door. And then over time, if needed, you reveal your more complex self. And so I think there's a\nversion of that happening now where, in order for me to\nmake a product that is good for one person or a one-person team or we now host two of the top 20 websites on the internet by traffic,</p>\n<p>I need to be very, very cognizant of how do I expose the\ncomplexity to the end user. But, again, that end user\nis no longer just a human. We think of the agent and how is the agent\ngonna reason through this. Little example from literally last night. One of our framework builders that works on what do we call agentic\ndeveloper experience, he said, \"Look, what happens</p>\n<p><strong>[24:25]</strong></p>\n<p>when agents use Next.js is that they will boot up lots\nof dead servers and kill them and boot up lots of dead\nservers and kill them.\" And this is not a behavior\nthat a human does. A human boots up one. They go to work to their\ntech center, that's it. And, in some ways, agents are better because they try lots of\nthings really quickly, and if you give them rope, they'll do a lot of stuff in parallel. And so what we realized is that in one error message in Next.js, we had to include the process ID in order to give agent context\nof what process to kill</p>\n<p>in order to recover the port that the previous process was using. This tiny amount of information- hashtag and then\nidentifier of the process- is enough to boost the developer\nexperience, not for people, maybe actually marginally for people 'cause like what I would do\nif I was an engineer is like, oh, I would run PS and then grab my Next and then find the process and whatever. Like, not a huge difference for people can make a gigantic\ndifference for agents. And so, as developer\ntools continue to advance,</p>\n<p>they will continue to cater\nto this LLM that calls tools and commands rather than people. The people will still be behind\nthe agent instructing it. The other metaphor that\nI use is that, you know, instead of thinking of\nyourself as a junior engineer that joins a company, you're basically like a\njunior engineering manager that joins a company, and what you're managing\nis a fleet of agents. I like successively revealing complexity. I'm wondering if that works\nin personal life as well. Yeah, I meet you</p>\n<p>and we start talking about\nsomething basic, shared, and then we can end up talking\nabout like colonizing Mars. Yeah, yeah, yeah. Let's talk about business models. Business models in the\nAI era are different, unique, complex. I'm curious how you've thought about Vercel's own monetization\nstrategy, business model, and kind of what you're\nseeing in the market with all the businesses being built on v0. Yeah, when you engineer platforms, some of the early decisions that you make can be highly regrettable in the future.</p>\n<p>One of them is how you structure. I think a lot of people that have built products\nmight relate to this, for example, how you\nstructure users, teams, organizations, workspaces,\nroles, et cetera. You make some decisions, and then you wake up five years later, and you're like, \"Oh, I wish\nI'd done it differently.\" And I think there's a version\nof this with pricing models. So if young, five-year-old Guillermo in Argentina was asking me today like, \"What advice do you have for like how I should structure\nmy pricing?\" I would say- I feel like that's a question\nyou might have asked.</p>\n<p>Yeah, totally, especially because I would\nbe chatting with the LLM, and the LLM would be like, \"Yeah, you have to think about this.\" But so, for a couple rules of thumb. So one is optimizing for\nhigh-iteration velocity, not just of your product, but your pricing and packaging\nand the way you bill. Like, it's gonna undergo constant change. Another one is optimizing\nfor transparency.</p>\n<p><strong>[27:26]</strong></p>\n<p>One of the big weapons that\nVercel has today relative to old incumbents is that you can buy\nanything off the shelf, and then we transparently tell\nyou how much it costs down to a very specific unit, request, data transfer unit, token of AI. And the world has very much\nevolved to this way of buying, where you have a session\nwith an agent like v0, and then we tell you like, this part of the conversation literally costs you this many credits because you used up this\nmuch of intelligence. So, we very much live in a world\nwhere everything is on tap.</p>\n<p>Intelligence is on tap and power. I think of cloud computing as power. I almost think of what\nVercel does as a utility. You want us to scale to\ninfinite concurrency. So, for example, we host all\nof the prediction markets. We host Polymarket, Kalshi, and a bunch of the crypto ones. Today they're probably\nhaving a massive day. Why? Because everyone's hitting refresh on the New York election. I'll probably do it\nwhen I leave this room.</p>\n<p>Hey, I could see you're antsy. You wanna know what's happening. And so Vercel is\nbasically letting you draw as much power as you need. And we do it in a way that\nthey didn't need to call 'em and say, \"Hey, there's\nan election coming up. Can you just give me a\nlittle bit more power, bro?\" No, it's like on demand, and that means that we need to optimize for a system of enormous transparency, real-time accounting. So you can go to Vercel and-at any time, in real time-see, all right, how many requests, how many compute microseconds. Same for the build process.</p>\n<p>So, if you have 100\nengineers or one engineer, we can provision one build\nunit or 100 build units. Your team grows. You can draw more compute. The same is happening with tokens, right? There's some engineers at your company that will be having very long\nsessions with the agents. There's some that are\ngonna be more parallel. There's some people\nthat, you know, frankly, as much as I am agent-pilled, I have some engineers working\nin some frontier domains where AI gives them no returns today, people working on very advanced compiler</p>\n<p>or cloud infrastructure that there's just not\nenough data or whatever. And so you need this very\nfluid model of accounting, billing, et cetera. And so what I would be thinking today when you think about your pricing model and how you monetize is- especially if there is\nan intelligence component or a power component- how do you do some of that\nreal-time transparency back to your customer? But also, the SaaS models\nare still very relevant. There's a lot that is\nrightfully metered by seat or by project or by\nsome other kind of unit.</p>\n<p>So, where Vercel exists today\nis kind of a hybrid world of this very much on demand and also for some things\nthat are more related to collaboration, other\naspects of building software, more traditional like you would pay for GitHub or Figma or others. And, of course, Stripe has\nevolved to meet this level</p>\n<p><strong>[30:26]</strong></p>\n<p>of complexity.\nYeah, we do. We see a lot of this hybrid\nbilling model, right? You want the sweet, sweet ARR, but you also don't wanna\ncharge the same amount to the person who's using, you know, in browser base like\na couple hours a month as the person who's using\nthousands of hours a month. And, I'll tell you, sometimes\nentrepreneurs can get into a little bit of a cold-start problem because if you do everything on demand, then you might have 100,000 customers that pay you like 3 cents a month. And you have fixed platform costs. You have platform costs because you had to like get\nsomething up and running in order to just be online\nand serve your user base. And that's why I'm actually,</p>\n<p>number one, I'm a fan of\nextreme experimentation. I think no one really knows the answer to these hard problems, and so you have to get out\nthere and try many things. But the other one is that I\nthink I'm quite open-minded about like more of the hybrid ways, and obviously it's great that, you know, you have a lot of the\ninfrastructure already built. So doing it for yourself\nI do not recommend. It's quite hard. I wanna jump back to\nsomething you said earlier about like the web\ntoday is built on pages. Pages aren't going anywhere, but there's kind of a\nnew dominant interface that's popping up.</p>\n<p>We didn't really talk about... We talked a little bit about\nwhat that's gonna demand from the infrastructure layer. We didn't really talk about\nwhat that's gonna demand in terms of new protocols, and I'm curious sort of\nwhat's top of mind for you. Yeah, one thing I mentioned briefly is if the programming language\nof tomorrow is human, that means that you'll\nlikely be integrated into a lot of the places where the conversations\nare already happening. So, if you and I are chatting on WhatsApp, then we might create a group with a bot that is there in WhatsApp,</p>\n<p>or if we're in Slack, same thing. So, the interface that has been the poster child of this first era of AI is conversation, in talking to these agents, in prompting, and I expect that to continue. What's also true is that a lot of these platforms already exist. So there's already ChatGPT. There's already Grok. There is already v0. There's already Cursor. And so paying attention to the protocols that allow you to meet\ncustomers where they are.</p>\n<p>Literally, this morning I\nwas getting a really nice- I was telling you about it- pitch about a data AI company. And the founder's making the case that one of the key interfaces for his product is gonna be the MCP server because a lot of companies are building their own AI interfaces. I meet a lot of enterprises that have basically their\nown internal ChatGPTs. We have one at Vercel. You guys have one. Shopify has one. And so your product might not have a pixel interface, per se. You might just come to\nthe company and say,</p>\n<p>\"Hey, Stripe, if you connect\nto our MCP server over here, you're gonna get this value from us.\" So, I'm paying a lot of attention to MCP. We have a lot of customers in e-comm. Black Friday is gonna\nbe a huge day for us, also for Stripe, of course. And a lot of the questions that I get are, \"How do I survive and thrive in an age of agentic browsers?\"</p>\n<p><strong>[33:27]</strong></p>\n<p>Meaning, you know, the\ncustomers tells it like, \"Get me this beautiful black sweater.\" It's a beautiful black sweater. Do you think agent commerce\nis overrated or underrated? I thought you were gonna ask\nme, \"Where do you get it?\" No, I don't need one, but it looks- I don't think agent commerce is overrated because I think, at least for myself, I always get the same things, the same black shirts 200 times a year, and so there is a kind\nof purchase that you make that is very predictable. Again, context is king, always has been, even more so now within in the age of AI. That little example that I gave you</p>\n<p>of like we improved the\nNext.js error message by five characters, and all of a sudden, like,\nthe world works way better- the same is true for\nhow you bring context. That's just a way of\ndoing context engineering. The concept that we put into the agent determines the quality of the outcome. For commerce, I think if\nyou have really good context in like what my preferences are\nand my history of purchases, there's a lot that you can automate. I expect it to play a role\neven in the world of pixels because what a lot of merchants- the dragon that they've been chasing and have never quite gotten to-</p>\n<p>is that you open favoriteshop.com, and it knows exactly what you want instead of a generic static page. This is literally why Vercel like... A lot of our business,\nwhy it's so successful, is we helped people not ship static pages and dynamically render and personalize. But I think a lot of these pages and interfaces are gonna be LLM-backed. So, imagine behind the\nscenes of producing a page, there's an LLM with a lot of context. And imagine that the tool\ncalls that it can make is the orchestration\nof your UI components.</p>\n<p>So, all of a sudden when I\ngo to, you know, keith.com, the LLM is producing the page. That's the mental model that I have. Now, some people are\ngonna go to keith.com. Some people are gonna go to chatgpt.com. And so you need both. You need the protocol to\nintegrate it into big chat, and you also need to,\nyourself as a business but also the way that you\nshould think about it, is empowering the businesses that also wanna maintain\ntheir own interfaces with the customer. And with this new customer that's the LLM, both at the same time?</p>\n<p>Yeah, the customer might be an LLM. The customer might be a traditional user. The way that I think about it\nis when I go to the airport, and I walk past my favorite store, I might still be inclined to have a human-centric experience. So I walk in and I explore, and ideally I would want\nthat to be hyper-personalized and tailored to me. Another interface will\nbe the agent browser, meaning I tell it like, \"Get\nme my black sweater again,\" and it just goes off and gets it. And then the other interface\nwill just be purely the agent that you're not directly interfacing with but some other agent.</p>\n<p>So this is kind of the\nagent-to-agent model. There's an e-commerce agent over here, but I'm interfacing with some other agent that in order to fulfill its purpose, it needs to buy something. We did a little demo. I mean, this sounds like science fiction, but we did a little demo\nof this with Stripe, where imagine that you're coding, and you're talking to a coding agent, and you tell it, \"Deploy.\" And the agent-you haven't made\na deployment decision yet-</p>\n<p><strong>[36:30]</strong></p>\n<p>the agent says, \"Well,\nin order to deploy it, I'm gonna use Vercel\n'cause it's the best.\" How does that agent successfully\nprocure a Vercel account and pay for it, so that what it gives you is actually the outcome that you wanted? You wanted a live URL or\nyou wanted a deployment, and it just fulfilled the\ncommercial transaction as an implementation detail. Obviously, you will want oversight. You want your payment methods\nto be, you know, persisted. You want fraud prevention. You want all the good things of buying, but think of it as like my\nassistant is doing the purchase.</p>\n<p>I mean, there's disproportionate\ntalk of agentic commerce in the B2C context, but I think the B2B is\nfar under-discussed, and procurement could look\nvery different a year from now. Amazing, that is all\nwe have time for today, and a huge thank you to Guillermo\nfor the insights shared. I know I'm walking away with a lot and hope you all are too.\n- Thank you all.</p>"}