{"video_id": "PCzJYol9vk0", "title": "Elon Musk is Building \"Optimus Academy\"", "link": "https://www.youtube.com/watch?v=PCzJYol9vk0", "published": "2026-02-10T17:15:04+00:00", "summary": "Full episode: https://www.youtube.com/watch?v=BYXbuik3dgA\nMe on twitter: https://x.com/dwarkesh_sp\n\nIn the full episode, John and I got to do a real deep-dive with Elon. We discuss the economics of orbital data centers, the difficulties of scaling power on Earth, what it would take to manufacture humanoids at high-volume in America, xAI’s business and alignment plans, DOGE, and much more.", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=PCzJYol9vk0\">https://www.youtube.com/watch?v=PCzJYol9vk0</a></p>\n<h2>Transcript</h2>\n<p>Um and and a bunch of the things that we&#x27;ve done for the car are applicable to the robot. It&#x27;s very much the same uh AI. Um you&#x27;ve got, you know, many more degrees of freedom for a robot than you do for a car. Um but really if you just think of it for like as as like a bitstream, um AI is really mostly uh compression and correlation of of two streams. You&#x27;re you know, so for video you&#x27;ve got to do a tremendous amount of compression um and and uh and you got to do the compression just right. You&#x27;ve got to compress the like ignore the the things that don&#x27;t matter and and like</p>\n<p>you don&#x27;t care about the details of the leaves and the tree on the side of the road, but you care a lot about the um the road signs and the the traffic lights and the pedestrians and and even whether you know somebody another another car is is looking at you or not looking at you like these some of the some of these details matter a lot. So, but it is essentially it&#x27;s got to turn that the car has got to turn that one and a half gigabytes a second ultimately into 2 kilobytes a second of control outputs. Um, so many stages of compression. Um, and you got to get all those stages right and then correlate</p>\n<p>those to the correct control outputs. The robot has to do essentially the same thing. And you think about what what humans this is what happens with humans. We we&#x27;re really are photons in controls out. So that that is the vast majority of your your life has been vision photons in and then motor controls out. &gt;&gt; Naively it seems like between humanoid robots and cars the the fundamental actuators in a car are like how you turn and how you accelerate etc. Where in a robot especially with maneuverable arms there&#x27;s dozens and dozens of these</p>\n<p>degrees of freedom. And then especially with Tesla, you had this advantage of like you had millions and millions of hours of human demo data collected from just the car being out there where like you can&#x27;t equivalently just deploy optimuses that don&#x27;t work and then get the data that way. So between the increased degrees of freedom and the far sparser data &gt;&gt; yes &gt;&gt; um &gt;&gt; how will you how will you use the sort of Tesla engine of um intelligence on to to train the optimist mind? Now you&#x27;re you&#x27;re you&#x27;re actually you&#x27;re highlighting an important limitation and</p>\n<p>difference between cars. It&#x27;s like we we do have but we&#x27;ll soon have like 10 million cars on the road. Um and so uh that&#x27;s it&#x27;s it&#x27;s hard to duplicate that like massive training fly flywheel. Um for for the robot um what we&#x27;re going to need to do is build a lot of robots and put them in kind of like an Optimus Academy so they can do selfplay in reality. Um, so we&#x27;re we&#x27;re actually we&#x27;re actually bullying that out. So we can have at least 10,000 Optimus robots, maybe 20 or 30,000 that</p>\n<p>can do that that are doing selfplay and and and testing different tasks. And then uh the the Tesla um has quite a good uh reality generator uh like a physics accurate reality generator that we we made made this for the cars. We&#x27;ll do the same thing for the robots and um actually have done that for the robots. Um so uh so you have you know a few tens of thousands of humanoid robots uh doing different tasks and then you&#x27;ve got you can do millions of simulated robots in</p>\n<p>the simulated world and you use the uh the tens of thousands of of robots in the real world to close the simulation to reality gap. If you enjoyed this clip you can watch the full episode here and subscribe for more clips. Thanks.</p>", "chapters_count": 0}