{"video_id": "V7_Ec2WFAWs", "title": "🔬Max Welling: Materials Underlie Everything", "link": "https://www.youtube.com/watch?v=V7_Ec2WFAWs", "published": "2026-02-25T17:19:37+00:00", "summary": "In this episode recorded at NeurIPS 2025, Max Welling traces the intellectual thread connecting quantum gravity, equivariant neural networks, diffusion models, and climate-focused materials discovery.\n\nWe begin with a provocative framing: experiments as computation. Welling describes the idea of a “physics processing unit”—a world in which digital models and physical experiments work together, with nature itself acting as a kind of processor. It’s a grounded but ambitious vision of AI for science: not replacing chemists, but accelerating them.\n\nAlong the way, we discuss:\n- Why symmetry and equivariance matter in deep learning\n- The tradeoff between scale and inductive bias\n- The deep mathematical links between diffusion models and stochastic thermodynamics\n- Why materials—not software—may be the real bottleneck for AI and the energy transition\n- What it actually takes to build an AI-driven materials platform\n\nWelling reflects on moving from curiosity-driven theoretical physics (including work with Gerard 't Hooft) toward impact-driven research in climate and energy. The result is a conversation about convergence: physics and machine learning, digital models and laboratory experiments, long-term ambition and incremental progress.\n\nTimestamps\n00:00 Introduction to Max Welling and the concept of Physics Processing Units (PPUs)\n01:34 Max’s career evolution: From quantum gravity to climate-focused AI\n03:39 Physics as the \"thread\": Symmetries, gauge theory, and stochastic thermodynamics\n07:05 The explosion of \"AI for Science\" and the emerging investment bubble\n07:53 Successes in protein folding and machine learning inter-atomic potentials\n11:05 Why materials matter: The physical foundation of the AI software layer\n13:47 Transforming material discovery into a search engine problem\n14:47 The origin and mission of CuspAI: Solving carbon capture\n17:49 CuspAI’s platform architecture: Generative models, digital twins, and agents\n20:47 The role of humans in the loop: Moving from manual workflows to automation\n24:39 Strategy for breakthroughs: Lighthouse moonshots vs. incremental partnerships\n28:40 Technical Deep Dive: Explaining Equivariance and symmetry in neural networks\n31:07 The \"Bitter Lesson\" in the context of scientific inductive biases\n31:47 Preview of \"Generative AI and Stochastic Thermodynamics\" (Upcoming Book)", "transcript_html": "<p><em>No transcript available for this video.</em></p>", "cleanup_applied": false, "cleanup_reason": "no_transcript"}