{"video_id": "d6AXruG-fxc", "title": "Reinventing reimbursement for pet health insurance", "link": "https://www.youtube.com/watch?v=d6AXruG-fxc", "published": "2025-11-13T19:43:54+00:00", "summary": "Barkibu is one of Europe's fastest-growing pet health insurance providers. With a card-based insurance program by Visa and Stripe Issuing, Barkibu helps make quality animal healthcare more accessible for their customers by eliminating the traditional reimbursement model—so pet owners no longer have to pay up front and wait for reimbursement.\n\nLearn more about Barkibu: https://stripe.com/customers/barkibu", "transcript_html": "<p><strong>[00:03]</strong></p>\n<p>In the backpack\nis Minerva. She loves going\nout and about, exploring with me and, in her favorite spots,\nshe’s the absolute queen. Gideon, he snores and he barks\nreally loud when he’s asleep. Yes, you do. Cannelle, she has a very\nunique personality. Smart, a little sassy. CANNELLE! She comes back\nwhen she wants to. Barkibu is a pet\ninsurance company.</p>\n<p>Animals feel and they transmit \nthat to you, and they help you. She’s called Fenki. Say hi, Fenki. There’s Lemmy. This is Michimoni. Lemmy! This is Max. Lemmy! One thing that\nLemmy likes a lot is escaping, too. He’s a little Houdini. The fact that we work with\nthis love for animals I think this helps us connect\ndeeply with many pet parents. We work hard to give\nthem the best product so that they can take care\nof veterinary expenses</p>\n<p>and, as a result, enjoy a healthy\npet for a long time. Visa and Stripe Issuing\nhave allowed us to be able to develop\nthis card product and to be able to really\nfulfill our mission to help more animals. When you pay with\nthis card at the vet, you don’t pay out of pocket, \nbut rather Barkibu pays and then charges you\nfor what is not covered. It’s a sense of security.</p>\n<p>We can go\non adventures. If something were to happen,\nthey’re covered. I don’t need to worry if there’s\nenough money in my account. They take care of everything. She's my priority,\nmy only thought. A cat! The best financial partner\nwe found was Stripe precisely because they\noffered us flexibility, iterating very fast. This helped us a lot to\ntest new things with them like the card.</p>\n<p>With the Barkibu card, we donate 3% of each transaction. We donate it to the pet parent,\nand they donate it to a shelter. We are launching\nin new countries. I would love that Barkibu grows much more\nin all countries helping the largest\nnumber of pets as possible with this card system. It would be so cool.</p>"}