{"video_id": "7zXWXzK5IaU", "title": "Why France and Britain Were Against German Reunification – Sarah Paine", "link": "https://www.youtube.com/watch?v=7zXWXzK5IaU", "published": "2026-01-19T18:15:00+00:00", "summary": "Full episode: https://www.youtube.com/watch?v=FdkpWrlR5zg\nMe on twitter: https://x.com/dwarkesh_sp\n\nFinal Sarah Paine lecture: Why Russia lost the Cold War.\n\nTo me, the most interesting question is not why the Soviet Union ultimately collapsed - it's how a brutal, centrally planned, stupendously inefficient, colonial land empire survived for so long.\n\nI was surprised to learn about the central role that oil played in sustaining (and eventually dissolving) the Soviet Union.\n\nBy the 1950s, the Soviet system was in a crisis. Soviet growth rates had started to slow significantly as compared to the booming West. USSR's heavy-industry based economy was energy-starved. The 1953 CIA-backed coup in Iran blocked Soviet access to Iranian oil.", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=7zXWXzK5IaU\">https://www.youtube.com/watch?v=7zXWXzK5IaU</a></p>\n<h2>Transcript</h2>\n<p>And if it had tanked cold war termination or upset uh the reunification of Germany, France and Britain might have been very happy because France who is the president of France and Margaret Thatcher, prime minister of Britain were against German unification. They knew it would marginalize their own country. Germany is going to be a bigger economy which it is. uh France eventually found solace in expanding the European Union uh European community to the European Union uh when you&#x27;re incorporating all these Eastern</p>\n<p>uh block countries into it and he plays a really important role in concluding the Mustri treaty that that forms the European Union. But Margaret Thatcher just plain lost. Uh she was just upset about the whole thing. She said Germany will be the Japan of Europe and worse than Japan. I guess she hadn&#x27;t been to Japan lately. Uh she said the Germans will get in peace what Hitler couldn&#x27;t get in war and she wanted to leave Red Army troops in Germany for the duration. Imagine if that had been the case and now dealing with Putin if he had troops</p>\n<p>in Germany. We would be in trouble. But uh uh Bush and Cole worked around all of them. And Bush said to Cole at the end of it, he said, &#x27;Look, I&#x27;m not going to beat my chest and dance on the Berlin wall. Both of them were very careful never to humiliate Gorbachev about the Soviet loss of the Cold War. Why? Because they didn&#x27;t want they knew that if they did that, he might fall from power sooner rather than later. Also, they were afraid that if they did that, the hardliners would come to power much</p>\n<p>more rapidly uh than they actually did. It was 20 years before Putin consolidate started consolidating his power and the new country the newly independent countries of Eastern Europe needed those 20 years to integrate militarily, politically, economically with the West so that the the cement could uh set before you got the Russians trying to destabilize them. So uh they bought them 20 years to do this. But there&#x27;s a cost to all this. Bush never got credit for his essential role in ending the cold</p>\n<p>war on western terms. So he was not reelected for a second term. Uh uh but anyway when it came time for Nobel prizes and why the cold war ended on its holy admission this Soviet foreign service officer said look it&#x27;s difficult to deny the Soviet Union was the one that ended the cold war. And Edwin me who was a counselor to Reagan also his attorney general said look the cold war began because of the Soviet policies and it ended in a sense because of Soviet policies and the Nobel Prize committee agreed. They awarded the prize to</p>\n<p>Gorbachoff not to Bush for his role in liberating Eastern Europe. If you enjoyed this clip you can watch the full episode here and subscribe for more clips. Thanks.</p>", "chapters_count": 0}