{"video_id": "JFtCJVxuug8", "title": "Oxide and Friends 12/1/2025 -- Death by Uptime", "link": "https://www.youtube.com/watch?v=JFtCJVxuug8", "published": "2025-12-08T15:00:38+00:00", "summary": "We hit a new (and disturbing!) failure mode recently when a production rack that had been up for several months saw every (!) compute sled's service processor become simultaneously unresponsive. Bryan and Adam were joined by the members of the Oxide team who debugged the vexing issue -- and reached its surprising root cause.\n\nContext: https://github.com/oxidecomputer/hubris/issues/2304\nNotes: https://github.com/oxidecomputer/oxide-and-friends/blob/master/2025_12_01.md", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=JFtCJVxuug8\">https://www.youtube.com/watch?v=JFtCJVxuug8</a></p>\n<h2>Transcript</h2>\n<p>Full enough house. &gt;&gt; Full enough house. Uh yeah, that this was a this was a wild one. This was a really wild one. So, I&#x27;m going to give you my uh if you don&#x27;t mind, I I&#x27;m going to give you kind of my introduction to this problem, Adam, and then will maybe we can back up and get your introduction to this problem and kind of go forward from there. Um because my intro to the problem was I come into the office and I think on a meeting and Robert came up to me Robert of holistic engineer fame. So</p>\n<p>we can we can ring the chime even though people on YouTube &gt;&gt; the much the much loved chime &gt;&gt; the much loved chime. We we will be we we we&#x27;ve heard your comment on YouTube and we&#x27;ll be ringing the chime a lot. We will be making as many possible references to previous episodes. But um Robert of host engineer fame uh came up to me with a wild look in his eyes and I mean Adam you have known Robert for a very long time. &gt;&gt; Yeah. W a wild look in the eyes is not common from Robert. I mean that like that alone is enough to I mean recall</p>\n<p>just to just to get that chime really working um during when we had the data center reboot when we rebooted the data center. Robert was the one who was actually like healing the water. Cool. I was one that I thought I thought I was going to pass out and or vomit on my keyboard. I bet. But Robert was actually like the cool head in the room. &gt;&gt; No, if Robert&#x27;s panicking, it&#x27;s because the fire station itself has burned down. &gt;&gt; That&#x27;s right. That&#x27;s right. So, Robert comes up to me with a wild look in his eyes and like I&#x27;m like I was clearly on a call, but it was like so okay. I mean, obviously, yes, Robert, what is it? And Robert says, &quot;If I attempt to write to a</p>\n<p>device address via MDU minus KW, do you think it&#x27;ll let me?&quot; [snorts] And I&#x27;m like, &quot;Oh, where where are we right now?&quot; It is. Do you ever watch Quantum Leap? That show? &gt;&gt; Yes. I couldn&#x27;t quote, you know, chapter and verse from it, but yeah. &gt;&gt; I mean, I can Matt, have you ever Matt, I&#x27;m sorry to to As a as a token millennial, can you just does quantum leap ring any bells? Um, as we&#x27;ve learned in previous episodes, uh, if it wasn&#x27;t featured on Spongebob, uh, it might not have left the generational chasm. I I can&#x27;t imagine that it would.</p>\n<p>&gt;&gt; We had &gt;&gt; Yeah. &gt;&gt; Okay. So, good cliff. You You&#x27;ve seen you&#x27;ve heard of Quantum Leap. &gt;&gt; I&#x27;m familiar with it. Yeah, we had reruns on satellite. &gt;&gt; Yeah. There you go. Okay. So the quantum leap was a pretty like interesting show because the guy would travel into someone else&#x27;s body and part of the like in the beginning of the show he&#x27;s trying to figure out like where am I? Like I&#x27;ve arrived in a new body and I&#x27;ve got no idea like I clearly this body knows something that&#x27;s going. I felt like that I had that feeling of like okay I&#x27;ve obvious I&#x27;ve been transported into the middle of this problem where where we</p>\n<p>are asking if if writing to device memory is going v. So what Robert is asking is that I do a a a write via the kernel debugger. MB minus KW and MDB is is our debugger. MD minus K is running it such as it&#x27;s debugging the kernel. The W flag denotes I want to actually write to memory which is obviously like wait a minute is that like is this a debugger or is this a destroyer? It&#x27;s like well line gets blurry. &gt;&gt; That&#x27;s right. But but any any idea that is like MDB minus KW it&#x27;s like all it raises raises certain goosebumps right</p>\n<p>like that &gt;&gt; what&#x27;s the craziest thing you&#x27;ve done MD minus KW Adam &gt;&gt; uh I have um changed locking primitives so that uh everyone gets a lock that&#x27;s [laughter] the I&#x27;ve just changed it so that like it doesn&#x27;t just like whoever wants for a lock wants a lock gets a lock. Uh, no. This was not on a production system. One assumes. [laughter] &gt;&gt; No, no, no. What is the craziest thing you&#x27;ve done on a production system? &gt;&gt; Uh, probably changed an instruction to like um, you know, uh, to like bounce over a like, you know, a condition</p>\n<p>basically. Uh but that felt very it feels very sticky because you&#x27;re like if I have computed this instruction incorrectly, we are going to we&#x27;re going to bounce into outer space. &gt;&gt; That&#x27;s right. Um I for me it was I changed the branch displacement to uh to I changed a particular um or I call displacement actually. Um I change to change a CV broadcast into a CV signal. &gt;&gt; That&#x27;s exciting. Oh, it was super exciting and this was on a definitely a</p>\n<p>hot customer system where the customer was upset. This is back in Sundays and you remember you remember Jesse, our our our dear friend that we&#x27;d worked with and uh this was a customer that he&#x27;d been working with &gt;&gt; and Jesse got very nervous when I started asking him permission for what I was about to do. He&#x27;s like, &quot;Wait, why are you asking like what why are you asking why are you so uncertain about what you&#x27;re about to do? Like here&#x27;s the the surgeon is not supposed to be asking me these kinds of questions. Why is the surgeon asking me permission in this regard? Like is &gt;&gt; just to roll it back. You&#x27;re like I&#x27;m seeing this thundering herd.</p>\n<p>&gt;&gt; So what if instead of waking up everybody we just wake up somebody &gt;&gt; and Yeah. Yeah. &gt;&gt; And like that&#x27;ll probably that could be fine. &gt;&gt; Assuming I did all all this correctly. assuming [laughter] I I turned this CV broadcast into a call the CV signal and not a call into the middle of of an illegal instruction and or anything else that I could turn &gt;&gt; and you&#x27;re probably like well if it does wedge up the system I could probably turn it back and maybe the system will unwedge too. &gt;&gt; Um [laughter] I I did not really have no know I I kind of knew that there was no</p>\n<p>insurance policy this was going to be kind of a one-way trip. Uh, and I did start asking Jesse, &quot;What are the consequences of this? If this system were to reboot right now, what would be the consequences?&quot; And Jesse&#x27;s like, &quot;Not good.&quot; Like, &quot;Why are you ask why are you asking me that?&quot; That&#x27;s a weird question to ask me. It&#x27;s like, you know, it&#x27;s like your surgeon asking you just like, &quot;Oh, you know, are your your affairs are in order?&quot; So, like you do have a will, right? I mean, obviously, I mean, obviously you got a will. Me, my god, you you clearly done the most basic adult things. You&#x27;re like, um, &gt;&gt; feel like it&#x27;s more like your dentist asking that, but yeah, &gt;&gt; it&#x27;s like your dentist asking [laughter] why. Uh, this is a super. Do you ask</p>\n<p>this for No, no. Just like this is a pretty I don&#x27;t know. This is a little adventurous this one. This root canal is a little more adventurous than the ones I&#x27;ve done. And I just want to make sure just asking you your fair share or you&#x27;ve got like you know you don&#x27;t want you don&#x27;t want your you want your kids to be able to you know they&#x27;re already going to be devastated enough having lost a parent. You don&#x27;t want them to be financially ruined. Um you&#x27;re like what? Um no. So I it worked. I&#x27;d like to say it all worked and uh I was relieved and then maybe too relieved. Jesse thought I was a little too relieved and realized that like I should not have allowed you to do that. Okay, so Robert is asking me if he can write to device memory via MV</p>\n<p>minus KW. And I&#x27;m like if it did allow you to do that that would be that itself would be a bug. Like we don&#x27;t that is like what do you want to do? And what Robert quickly explained and will this is where we&#x27;re going to jump to you to get more context is like he said so this is a customer system. We have lost contact with all service processors. And I&#x27;m like, what do you mean all? It&#x27;s like every compute sled, we cannot talk to the service processor on any compute sled. Hosts are up, but all service processors are at this point like I can</p>\n<p>say, yeah, wildlook is definitely merited. And so what Robert like what Robert wanted to do, so what the first thing what we needed to figure out and again we&#x27;ll go to you to get more context on all this. Um, and I know Matt you jumped in here early too. We want to determine, you know, how dead is the service processor actually and how can we get what we can tell because the service processor is connected to the network and what we know is we can&#x27;t reach it over to the network. Um but we or seemingly um we also know the service</p>\n<p>processor is in charge of certain basic maintenance of the system. Uh the service processor among other things uh has the thermal loop which Matt wrote. Um, and we know if the service processor goes out to lunch completely, uh, the fans will all crank up. Um, so &gt;&gt; just for a little context, the service processor may be obvious here, but it&#x27;s the computer within the computer. It&#x27;s the computer that is is driving the basic kind of autonomic functions of of the of the server uh, as and including things like being able to reboot it or the or the fans as you&#x27;re saying.</p>\n<p>&gt;&gt; Yeah, that&#x27;s right. And I mean, this is the this is our answer to the baseboard management controller. So we we we do not have a traditional baseboard management controller for a bunch of good reasons. Um and what we have instead is a service processor. So the u but that the SP is definitely important. So and the SP and we&#x27;ll go into this in detail has been designed with an operating system that Cliff led the charge on Hubris that is designed to be very robust and it is really not designed to disappear. It was very unusual that it would disappear. And so,</p>\n<p>uh, the the the reason for the wild look is that what Robert Robert&#x27;s kind of bonkers idea was so requires a little bit of backstory, but the, um, so, uh, we, um, when we boot the, the service processor talks to the DIMs on the on the box. So there&#x27;s there is an I squared C bus that the DIMs the the memory is connected to and there are there&#x27;s there&#x27;s some identifying</p>\n<p>information in those DIMs and it&#x27;s the service processor that is connected to that bus and gets that information. But the host CPU ultimately needs to get that information in order to train memory. It&#x27;s got its own I squared C initiator and it when it thinks it&#x27;s talking to the DIMs, it&#x27;s actually talking to the service processor. Okay. &gt;&gt; So Okay. So this but this only happens when you boot the host CPU. Once it&#x27;s booted, the I squed C controller is like not really used. And one of the things that Robert has discovered over the last</p>\n<p>I&#x27;m not sure when he made this discovery but one of the things he&#x27;s gotten working over the last couple of months is like so this I square C initiator is hidden from you know we we we talked about uh and um the the kind of the various other uh chips the hidden cores on the die um and we uh and all the those kind of like the hidden things that we don&#x27;t see that I C controller is controlled by one of those hidden cores. And what Robert realized is like actually the I squed C controller for</p>\n<p>that thing is actually mapped into our address space and we the host operating system can actually manipulate that I squed C controller. So we can initiate I squed C. And I&#x27;m not even sure like this kind of defies metaphor. I don&#x27;t even know like we&#x27;re kind of like borrowing its underwear. I don&#x27;t know. I mean, I&#x27;m not even sure what the So, what Robert wanted to do was uh Robert&#x27;s like, actually, what I think we can go do is I can hit this memory mapped region for the I squ C controller and I can force this thing because the host CPU is up. I can force this thing to initiate I squed C transactions and see if the SP can</p>\n<p>respond to these I squared C transactions um to identify like memory which &gt;&gt; the I was like wow that okay we are really desperate um and uh we and even Robert is like yeah this this feels a little too adventurous I&#x27;m like that definitely like my my CD broadcast a CB signal can just sit If you&#x27;re going to do this, [laughter] this is definitely next level. Uh so um the but that was coming into this while</p>\n<p>it was already kind of evolved. So Will, I think you were among the first on scene on this to discover that the service processors were were were down. What was kind of the the and you were attempting to do uh were kind of supporting another issue and you all noticed that like oh my god these things are all down. Uh how did the kind of things proceed from there? Um, do you want me to give us some context on like what the customer is seeing first? &gt;&gt; Yeah, sure. That&#x27;d be great. Yeah, that&#x27;d be great. &gt;&gt; Yeah. So, the customer reached out to us because they were they were trying to stop an instance via the CLI and the request was timing out. Um, which typically means that one of the the</p>\n<p>sleds is down and like isn&#x27;t able to respond and so the the the request within the rack times out and so the the client times out. Um, so we ask for permission to to connect to the the rack and they let us let us in. Um, and then we know we list all the hosts and we can see that sled 23 is down. Um, and then at that point we list all the SPs just kind like a matter of course just to like validate that the SP for that sled is there. And then as you said all of the the sleds are gone. We still have the SPS for the two PowerShell controllers um and the two switches but</p>\n<p>the other um 16 SPS are just completely missing. Uh &gt;&gt; so so like the list like you&#x27;re able to list them and it&#x27;s like yeah I have these two or three that&#x27;s what you&#x27;re looking for right &gt;&gt; yeah there&#x27;s four right [laughter] &gt;&gt; yeah so um so the tool we use to list SPS is called pilot and that has like a streaming feature where you can just like show me all the discoveries you have and so we use that next and we can see it&#x27;s it&#x27;s only discovering the the four that we see in the list which makes sense um so we look at the MGS or management gateway service logs next and we can see that you know the we&#x27;re</p>\n<p>reaching out So all these SPs and it&#x27;s timing after 20 seconds and five attempts. Um so at that point, you know, we we reach out in the the channel and say we don&#x27;t see any SPS on this this rack. And um you know, Matt and a number of other people hop in from that point to to start to troubleshoot more. And Matt, I&#x27;m sure you were like, you can&#x27;t see you&#x27;ve lost all of them. I the I mean it definitely reminds me of that Far Side cartoon where it&#x27;s like we paid you to look after the children and you cooked and ate them both when they are coming home to a wicked witch. I mean it</p>\n<p>feels like you&#x27;ve we&#x27;ve lost all of the SPs that must have been this is not a failure mode that we&#x27;ve really uh this really shouldn&#x27;t be possible. &gt;&gt; Yeah. I mean to lose one SP could be seen as careless. To lose 27 of them that&#x27;s really [laughter] really impressive. Yeah. So, at this point, I get pinged and I&#x27;m like, &quot;Oh, it&#x27;s another quote unquote management network bug.&quot; Uh, which is never the management network&#x27;s fault, but you know, I got to go in and prove that to my satisfaction. Uh, and so I, you know, pop into the system and we have pretty good counters and visibility to like what&#x27;s going on in the management network where I guess the</p>\n<p>the context here is the management network is the separate switch which has all of the SP traffic and then it has a bridge up to the main network. Uh, so we can use this. This is running before the main switch is running. it runs when the system is mostly powered off. And so we start looking at the counters and sure enough we see that we have packet counters for all of the SPS and the packet counters are going up for the two side cars and the PSC and they are not going up for any of the SPs. So we&#x27;re like oh well that&#x27;s a bad sign. Uh that means that no packets are leaving</p>\n<p>the SP. this like this all checks out, right? Because the the whole point of the broad the way the discovery works is that the SPs are periodically broadcasting a message saying, &quot;Hello, I&#x27;m an SP.&quot; And if we don&#x27;t see that message, then it doesn&#x27;t get through. So, the fact that the packet counters aren&#x27;t going up, is like, okay, that&#x27;s understandable, but not great. So, I actually, let me just see. I pulled out, unfortunately, this is in a customer support ticket, so it&#x27;s a private repo, but I pulled out my long list of things that we did. &gt;&gt; Oh, yeah. I love that that you were saying that I actually was coming into this several hours of bad ideas in. So I</p>\n<p>I cannot wait to hear some of the other ideas. &gt;&gt; Yeah, Robert&#x27;s like, &quot;Let&#x27;s cut off our own hands was like that was the best idea.&quot; [laughter] &gt;&gt; That was exactly that was after several other ideas. &gt;&gt; So one other thing we try is running there&#x27;s a command called IPCC which talks to the SP over the serial port in the system. Uh so that is like not using the network stack at all obviously and so we tried using that to talk to the SPs on these stucks sleds and sure enough they didn&#x27;t talk over IPCC the serial line either. So at this point we&#x27;re like I&#x27;m like okay something has</p>\n<p>gone wrong and like the kernel has hung in all of these SPS and maybe it&#x27;s like a timer that has gone wrong or something like that. And I think Robert is like well can we just try to ping the SPS just to see if that works? Uh, and I&#x27;m like, &quot;Sure, sure, but that&#x27;s not going to work.&quot; Like the whole system is hung. Uh, and so we, you know, figure out the IP address and we try to ping one of the SPs and the SP answers on ping. And we see the packet counters go up for like the the two packets that it takes to do uh, ICMP discovery and echo and we&#x27;re like, &quot;Oh, the SP is still</p>\n<p>running. This is weirder than we thought.&quot; &gt;&gt; Yeah. Totally weird, right? Because we I mean &gt;&gt; Yeah. &gt;&gt; Yeah. Go ahead. No, no, I was going to say that I mean I I think because the expectation there is like when we are dead that the whole that we are the SP is actually dead. The colonel is panicked or something as as so the fact that this or that the networking task is like totally dead. So the fact that this thing can actually respond to ICMP echoes is kind of wild. Something very weird is going on. The SPs are alive enough to answer pings but dead enough that they can&#x27;t seem to do anything</p>\n<p>else. And one thing we know about pings is that pings are actually handled within the net task itself. So it doesn&#x27;t do dispatch to a different task. And what it seems like now is that like every task below priority five, which is the priority of the net task, is not running for some reason. And we&#x27;re not sure why this is happening. I point out that if the net task was always runnable for mysterious reasons, then it would always be selected and that would cause the behavior we saw. But this is still in the like mysterious reasons category. Uh we then I think</p>\n<p>will do you want to talk a little bit about the like thermal current debugging that we tried to do as well? &gt;&gt; Sure. Uh yeah so the the SPS will um collect um metrics on on current for the the sleds and then we also have and also from the power shelf controller. So we uh we did this two different ways. Um and we can we can query the metrics um with within the you know kind of like the management system of the rack using uh OMDb which is kind of internal tool. So it&#x27;s really easy to to run metrics queries. Um so</p>\n<p>the first thing we did is we just queried for um hardware current um from one of the the deadl SPS just to see uh like when when did this stop and we could see that it stopped you know roughly 25 days previously. Um and then we just repeated that for all the other sleds. Um just and we can see they&#x27;d all failed within the space of I think roughly a day. Um, and then we also like and I guess uh I and we also checked uh for the the PSC um or uh hardware</p>\n<p>metrics or uh current metrics just to see like when the SPS died, did we see an increase in current indicating that the fans were kicking off and it looks like we did see an increase in draw which was suggestive of that. I don&#x27;t know if we ever conclusively determined that though. Yeah, we so we ended up seeing like a moderate increase in current. So not enough that the fans were like at 100%. So it was like mixed results. Like we saw something change in current, but it was not strong evidence for exactly what was going on. At one point we&#x27;re also considering asking the customer to go down to the actual data center and like</p>\n<p>car talk style like describe the noise the server is making. Is it more of a woo or is it more of a woo? [laughter] Uh we didn&#x27;t actually end up asking the customer to do that though. [laughter] Um, but maybe we should, you know, even in hindsight, we&#x27;ve got this thing completely debugged, why not actually just like, you know, I think Matt, as long as you ask them in exactly that way. I feel we should uh I like the various kinds of apes that we&#x27;re trying to determine which one we&#x27;re seeing. &gt;&gt; The other uh the other thing we did at this point was take the number like 188.5, which was the rough up time, and</p>\n<p>like look at it in milliseconds, and try to turn it into an even power of two, cuz we&#x27;re like, &quot;Oh, maybe something is rolling over at this point.&quot; And it turns out you cannot turn 188.5 days into like anything that looks like power of two unfortunately. &gt;&gt; Yeah. So we&#x27;ve got uh and then we and but the host is up right. So we also don&#x27;t want to like well yeah I mean we don&#x27;t actually we don&#x27;t have the ability to extract any more state other than we know we and we don&#x27;t need to do um or were there other bad ideas that um</p>\n<p>before Robert wanted to write to device memory to use the what were some of the other things? &gt;&gt; We kind of backed off the the device memory once we saw the ping working because we&#x27;re like okay like the the SP is actually alive which was what we were trying to prove by showing that it responded over SPD. &gt;&gt; Um I think the other thing that we hadn&#x27;t done at this point is like we had not proven that the SPS would come back &gt;&gt; which was concerning. Uh yeah, the uh in terms of like we don&#x27;t know if the SPS are actually dead</p>\n<p>dead. &gt;&gt; Yes. Although by by the time we saw them responding ping, we were maybe feeling a little bit better on that front, but we were still like if we power cycle one of these sleds like and the SP doesn&#x27;t come back, then someone is flying off to a certain location with a debugger and not going to have a good week. &gt;&gt; Yeah, that&#x27;s a very dark thought. I I I guess I came into this after that I did that dark thought had not occurred to me that we had managed to actually like electrically destroy every one of the SPs. That would be uh that&#x27;s dark. Yeah,</p>\n<p>that that that&#x27;s definely dark. Fortunately, so um we and I think we did end up resetting Will, you ended up resetting the sled that was the cause of the investigation to begin with and that thing did come back up. Is that correct? &gt;&gt; Yeah, that&#x27;s right. The next day um we got had access to the rack again and um power cycled and it came the host and the people both came right right up. So that was a relief. That&#x27;s a relief. Okay. So now we have got really just the symptoms of this problem. Um it&#x27;s</p>\n<p>obviously a very bad problem. We really rely on that SP being up. Um, and but so we we&#x27;re kind of we we&#x27;re kind of reduced to we I think Matt we&#x27;ve kind of exhausted the information we can get out of the running system. Um or maybe there were some other ideas on other information we could get out but um we&#x27;re kind of reduced to like all right we&#x27;re going to need to kind of go from first principles and try to reproduce elements of this problem. Um you had the thought that I think a lot of folks had is like could this be time related? um</p>\n<p>definitely reminds Adam of the Elbolt problem, the the famous Unix Elbolt problem where after with Elbolt is a 32-bit value. Um it and at its defbolt is the lightning bolt variable that dates back to like sixth edition. Um yeah, they they took very like odd poetic license or poetic license at very odd times like &gt;&gt; drop the E off of Cat and uh and Elbolt as lightning bolt. But so this thing fires 100 times a second. This is the system clock at 100 hertz. Um you will that that value will become signed uh</p>\n<p>after 248 days. Um and kind of famously Unix systems of a certain vintage could not stay up for longer than 248 days. And I mean they would be up after 248 days. It&#x27;s just that it would be absolute madness of people thinking that that their timeouts that were in the future were in fact in the past and and a bunch of stuff would break. That was all this is all like in the 90s and actually one of the first things I don&#x27;t I the first thing I actually did at Sun was actually fixed that. Um yeah that it was kind of the I I someone else had kind of already started that work and</p>\n<p>was kind of handed to me. &gt;&gt; It&#x27;s like a classic job to like send to the new guy too cuz you&#x27;re like how hard like this doesn&#x27;t seem that hard and I&#x27;m sure then like your phone was ringing for years or whatever uh on this critical code path. Uh, you know, it was funny actually on that in particular like the the that work had already been uh had already been broadly done &gt;&gt; and they also wanted to allow the hertz value to be to be tuned uh to be configured and they had decided that they senior engineers had decided that</p>\n<p>the values that were acceptable were 100 and a thousand. So 100 Hz and a th000 Hz. I&#x27;m like, why not like why not just allow it to be configured to any value? Like, well, that&#x27;ll be kind of unsupportable. Like, that feels like that should be supportable. So, I just like crank the values higher. So, what I would do is like I&#x27;m just going to crank the value until the machine no longer boots because it&#x27;s just running the clock interrupt all the time, which was super satisfying strangely to do that. It was like I don&#x27;t know. I think that there&#x27;s something there there&#x27;s something sadistic in software engineers where we kind of enjoy computers that are in pain at some level. So, um, and I in particular remember that on Sun4C,</p>\n<p>this is Campus, this is a an old old machine at this point. Um, I don&#x27;t know what the clock rate was on that thing. Um, I could get it to 26,000 and it hung at 2,600 hertz. Um, and I came back the next morning and I was very satisfied that it hung and I hit the the the carriage return and verified that it had hung. Um, I guess I did that the night before because I came in back the next morning and it was actually making progress. It was executing like some very small number of instructions at a time. Um, and then the machine immediately panicked. Uh, and it</p>\n<p>panicked on what ultimately was a chip bug that we found. &gt;&gt; Wow. &gt;&gt; Yeah. It was just crazy. Um and the uh as it turns out uh there when you set the processor interrupt level um there was a two instruction window immediately after that where you could take in the interrupt at a level lower than you just set the interrupt level to. Um and that was a chip bug as it turns out was a chip bug in every Spark microp processor they had made up before Ultra Spark. So um yeah it was and it was it was actually it was it was kind of an</p>\n<p>interesting lesson in a whole bunch of ways. one that like the the consequences of just time in general, the these problems that you have that you only see with uptime, right, that are really hard to test for. Um because how do you like you have to just like wait um and obviously there are ways to do this and there are ways to kind of jump start time. I mean, Matt, that was one idea you had was around time. And did you end up doing the experiment of trying to accelerate time um closer to this value that of course is not even power of two to see if anything breaks?</p>\n<p>&gt;&gt; No, we had talked about just like booting the system with the clock set to 188 days, but didn&#x27;t actually get around to that. &gt;&gt; Get around. Yeah. So, we&#x27;re this kind of a you know, this is a high priority issue, but we&#x27;re kind of noodling around on how to like I got what to do. Um, and then Cliff, you uh you picked this up. It&#x27;s like, well, this seems like a high priority issue obviously. Uh, what was your approach in terms of like because this is this is a tough one to kind of go from first principles on? &gt;&gt; Yeah. Um, so I had been out for a chunk</p>\n<p>of this dealing with family stuff. And so I get in and I have text messages waiting from a bunch of these folks being like, &quot;Hey, so there&#x27;s a weird thing. Hey, there&#x27;s a weird thing. we&#x27;d really like you to look at the weird thing. Oh my god, could you please look at the So anyway, uh but fortunately by the time I got in, a lot of this prep work had already been done and the the stuff that Matt and folks investigated really narrowed down the potential failure space. So by the time I showed up, what we knew was essentially machine goes unresponsive to everything except ICMP ping, which as Matt</p>\n<p>mentioned is handled on a fast path inside the network stack. So that can keep working sort of like a brain stem reflex like a chicken with its head cut off long after the rest of the computer is doing something else. And Matt also mentioned earlier the the possibility of the net task like being really busy or doing something in a loop. And so that was sort of the leading hypothesis, but we didn&#x27;t know what would cause that or why it would be doing a lot of work in a loop. So, Cubris has some interesting properties and tools here that actually came in</p>\n<p>really handy. And this sort of we need to model the operation of the system in our heads because we can&#x27;t get information in or out of the computer because it&#x27;s that borked is the sort of situation that guided the design of a lot of the system and tooling. So what we had was uh from the build system we could get a graph showing the priority relationships of all of the IPCs between all of the tasks. Uh and from that we could clearly see that like the IPCC handling the serial port</p>\n<p>to the host was a lower priority than the network stack as are all of the clients of the network stack by design. Uh the hubris network stack is a little weird, but it&#x27;s a separate task rather than being in the kernel. And tasks that want to offer a network service are lower priority than the network stack, which means whenever the network stack has an opportunity to run, it wins. It will take the CPU away from any of its clients as a fairness thing mostly. But in this case, uh the IPCC was also lower than the network stack. So if the</p>\n<p>network stack were running with wild abandon, it could explain why all of these interfaces are down except for ping. Uh the other thing that seemed plausible at the time though was one of the ways a task in hubris can burn lots of CPU is to crash a lot because our default response, &gt;&gt; yeah, &gt;&gt; generally it&#x27;s an system is to restart the task. Now, Matt recently actually added a um sort of smart timeout to give a waiting a cool down period whenever a task crashes before it gets restarted. But I</p>\n<p>believe that uh this customer was on an older release and I wasn&#x27;t confident that that code was there. So, so that wasn&#x27;t a possibility was that it was just falling over a lot. So, we had to sort of rewind. And the good news is is like thinking about this after the fact, there&#x27;s a bunch of problems we didn&#x27;t have to chase that would have been wild goose chases that we might have had to do on earlier systems I&#x27;ve supported. Like this was probably not a wild pointer misuse in a different task because we&#x27;re pretty confident the memory isolation</p>\n<p>between the tasks works at this point. Um it&#x27;s probably not a scheduler bug because theuler is super super simple. So &gt;&gt; I had to Yeah. And just on that, a good especially on the wild pointer cliff because I think this is so important because when you have the possibility of kind of arbitrary corruption from arbitrary things, &gt;&gt; right? &gt;&gt; You&#x27;ve got this kind of like well magic happens and sometimes there&#x27;s bad magic in this system and we don&#x27;t understand why and therefore like</p>\n<p>certain things are unknowable. Um, and &gt;&gt; yeah, supporting complex C firmware for a long time is the reason why I know what it looks like in a hack dump. If a pointer has been replaced by an IE E floating point number, [laughter] that&#x27;s the sort of thing that happens, &gt;&gt; right? Oh, so having this that is a I mean not only do we have the solace that that doesn&#x27;t happen, but that also gives us a kind of resolve that like this is like there&#x27;s something else going on like we we we can&#x27;t just chalk it up to bad</p>\n<p>magic due to due to something having a straight pointer. &gt;&gt; Well, as you say, data corruption is almost is not is almost undebugable. That is to say, you&#x27;re separated at such a distance. We talked about this last week and the ramifications are almost arbitrary. So it does give you some license to feel like giving up is an option. &gt;&gt; Totally. &gt;&gt; Yeah. And and data corruption is sort of like the well I guess it was ghosts of software engineering. &gt;&gt; Exactly. Exactly. [laughter] &gt;&gt; Very un for better or worse don&#x27;t really</p>\n<p>get to reach for that one. Um, so we instead stepped through everything sort of rigorously and I started with the kernel looking for potential bugs, but theuler is really simple and we didn&#x27;t find anything there. So I started looking for things that might cause the network stack to crash because if it&#x27;s crashing, it must be crashing for a reason. It&#x27;s probably a panic cuz it&#x27;s Rust. Like that&#x27;s basically how we crash. And the number of actual panics in the network stack code is pretty low. Although I did run off on a couple of tangents chasing ghosts that wound up not bearing any fruit, but we pretty</p>\n<p>quickly narrowed it down to the idea that um the network task was probably failing to correctly acknowledge an interrupt. So hardware peripherals on on machines like this on these microcontrollers indicate some condition to software by signaling an interrupt which causes an interrupt handler. It basically interrupts the flow of instructions through the computer and in our case uh a small routine runs in the kernel to handle the interrupt and pass it off to a task outside of the kernel for further processing in this case the network</p>\n<p>stack. So if the stack were getting an interrupt from the network controller and was failing to like clear the condition, then as soon as it tried to go back to sleep, the kernel would receive another interrupt and would flap the network stack again. And you&#x27;d wind up in this cycle where the network stack basically receives all userland cycles instead of the computer ever idling. But it wasn&#x27;t clear what could be causing that because we&#x27;ve had this Ethernet driver for years and it&#x27;s generally been pretty reliable and it&#x27;s there weren&#x27;t any obvious interrupt</p>\n<p>sources we wouldn&#x27;t be clearing. So I had to go read the manual again and buried in the manual in an unexpected location of the um let me just double check the page here. &gt;&gt; And can I just ask you something about your methodology here when you say I&#x27;m going to go read the manual again. So, &gt;&gt; the manual for the microcontroller &gt;&gt; is thousands of pages long. &gt;&gt; I just looked it up. It&#x27;s 3,294 pages, &gt;&gt; which is a good thing to be clear. We&#x27;ve and I I believe</p>\n<p>&gt;&gt; I believe in our episode on transparency and hardware software interfaces, I&#x27;ve called out ST as a model in this regard. So, love having this much documentation, but when you say I&#x27;m going to go back and read the manual, are you Um, and and clearly the documentation on Ethernet controller is is slimmer, but it&#x27;s like I mean it&#x27;s probably hundreds of pages, is it not? I mean, it&#x27;s got to be &gt;&gt; Yeah, the Ethernet chapter is is only 300 pages long. And &gt;&gt; oh my god, I think the other problem with the Ethernet chapter is that</p>\n<p>&gt;&gt; there are several interrupts which are listed as enabled when the chip is reset. And that is just straight up a lie. Like we were going through this and we found, oh, it says these interrupts are enabled. These interrupts are enabled and they&#x27;re not enabled when the chip is reset. &gt;&gt; Yeah, the chapter is effectively crying wolf. There are three or four different interrupts where it asserts in plain English this is enabled by default. But it&#x27;s not. But it turns out turns out one of those four actually is enabled by default. But the only way to confirm this is with this diagram that&#x27;s hidden on page I don&#x27;t know 2000 in</p>\n<p>mumble that um I posted on the GitHub issue that uh shows that this one interrupt source for every other interrupt has this and gate that like masks it if an interrupt enable isn&#x27;t on. This one interrupt source instead has an orgate that doesn&#x27;t allow you to mask it ever. So uh &gt;&gt; uh what is I mean do I may I are we taking questions at this time? [laughter] Why?</p>\n<p>&gt;&gt; Why? &gt;&gt; Yeah. So that I mean that that was just confusing to you that this would be we&#x27;d have this this particular interable. &gt;&gt; That&#x27;s pretty bonkers. I mean so normally the sort of convention on an armed microcontroller like this is that the center central standard interrupt controller has enabled bits for every interrupt source and sometimes something like an Ethernet controller will combine a bunch of sources internally into a a single bit that goes to the central interrupt controller. So in our case from the CPU&#x27;s perspective Ethernet</p>\n<p>produces one interrupt but it&#x27;s a combination of like two dozen possible event sources. So, the nice thing to do is to have bits in the peripheral that let you turn those individual interrupt sources on and off. The next nicer thing to do if you have some of them that can&#x27;t be turned off is to have them connected to some somehow optional and maybe a function that has to be turned on. So, there were actually two stanzas in the interrupt handler and the Ethernet</p>\n<p>uh driver in Hubris that said, you know, basically had a todo, we don&#x27;t enable this interrupt, we don&#x27;t need to handle this, which &gt;&gt; which is which is half true. It&#x27;s &gt;&gt; true. So, well, actually, so it turns out to be all the way true. Folk folks had flagged that as a as an OSHA thing we need to look into, which is valid, but it turns out those interrupt sources actually aren&#x27;t enabled by default despite what the book says. So, those two are fine. There was a third that we didn&#x27;t know about that was not listed in</p>\n<p>the Ethernet interrupt section of the manual that turns out to be the thing that&#x27;s actually on by default. And it&#x27;s the uh if I can jump to the spoiler, it&#x27;s the management counters interface on the network interface controller. So, it&#x27;s this block of things which we skipped over because we&#x27;re like, &quot;Oh, management counters that&#x27;d be cool someday.&quot; Like, but it&#x27;s probably fine, right? Counters, that doesn&#x27;t sound dangerous. What would go wrong with a counter if we don&#x27;t do anything? [laughter] Yeah. So, the answer is is there&#x27;s a one of the counters is responsible for counting packets in and out. And by default, when that counter reaches its</p>\n<p>halfway value, it lets you know it&#x27;s going to overflow by causing an interrupt. There&#x27;s there&#x27;s no way to turn this off. Actually, there it did turn out there&#x27;s a way to turn it off, but it&#x27;s really hidden in a different register. Yeah. And I mean I I guess like thanks for letting me know that I thanks for thanks for killing me by letting me know that this is like a fire breathing canary. I&#x27;m trying to figure out like</p>\n<p>again what the metaphor is for this. But the uh and so it fires the interrupt when it you&#x27;re when the the counter is halfway at at its halfway mark which also feels like pretty aggressive. &gt;&gt; Anakin, come on man. Like you&#x27;re halfway there. You&#x27;re halfway there. &gt;&gt; I mean, the glass is like, isn&#x27;t isn&#x27;t the counter literally half empty? Like, why are you you&#x27;re you&#x27;re complaining that it&#x27;s half full. &gt;&gt; So, Cliff, can you walk me through the So, then you get the interrupt &gt;&gt; and then what happens? &gt;&gt; So, in this case, because there was no software to handle the interrupt, what</p>\n<p>happens is the kernel interrupt handler runs as usual. The kernel notices that it&#x27;s from the Ethernet controller, sends a notification to the Ethernet handling task, the net stack. The net stack wakes from sleep uh looks at its notifications and says, &quot;Oh, I&#x27;ve got an interrupt. Great. Let me go run my interrupt processing code.&quot; Doop doop doop. So, it goes through a whole series of reading device registers and looking at bits in them and trying to figure out what actual hardware event caused this interrupt. And it runs off the end of the code</p>\n<p>because it didn&#x27;t think to check the one register for this thing we hadn&#x27;t turned on. [clears throat] &gt;&gt; Uh so then it says, &quot;Great, I&#x27;ve handled the interrupt. This must have been spurious cuz that does happen. Uh, I&#x27;ll just reenable the interrupt, which it does. Go back to sleep. And as soon as it goes back to sleep, the colonel says, &quot;Hey, you got an interrupt.&quot; And then the whole thing is right over. So the the failure was interesting because what we basically had was a network activated time bomb in every service processor and actually in</p>\n<p>in the other in the switch in the sidecar switch and the the power shelf. All of them had this time bomb lurking, but we never seen it kind of because we usually the machines before they hit this counter, but we in hindsight, we had had a couple of infrequently used dog food systems that would mysteriously fall off the network and we never really knew why, but I think now we know why. Um, &gt;&gt; yeah, &gt;&gt; it&#x27;s also fair. Is it fair to say that</p>\n<p>this this feels like it could be lurking in every consumer of this, right? Like the this counter is so buried, the documentation does not make it clear. In some cases, it&#x27;s wrong. &gt;&gt; The pathology waits for a gajillion packets or whatever or half a gajillion, excuse me. [laughter] Right? Like could this be lurking in like everybody who thought they&#x27;ve properly implemented something on top of this? &gt;&gt; Right? I&#x27;m not accusing this construct of being enemy action, but if it were enemy action, what would it look like? [laughter] &gt;&gt; Yeah. So, I actually was wondering that,</p>\n<p>too. So, I went and checked every open source driver I could find for the Ethernet block on this microcontroller. And it&#x27;s not a super popular microcontroller, but it&#x27;s kind of popular. So, there were several code bases I could check. And in general, every codebase I found tended to have a commit usually months after the original version of the code &gt;&gt; that sheishly went in and turned these bits off. &gt;&gt; So people are hitting this in practice, but they&#x27;re hitting it faster than us,</p>\n<p>which then sent me down a whole like why why are we so late to the party here? Like why are we getting bit with this at a customer site when other people like the the rust embedded how driver for this Ethernet controller actually fixed this in 2022 I think so &gt;&gt; oh interesting &gt;&gt; yeah and I think I think the reasons are kind of a side effect of the system robustness if we get a failure like this the only symptom is that like oh wow it dropped off the network uh in a normal system having an interrupt storm like this means the</p>\n<p>entire computer locks up all interface has stopped working, you have a brick. And it&#x27;s a lot more obvious when you&#x27;re having this class of system failure. And with our systems, it&#x27;s just like, huh, well, I don&#x27;t know, maybe the cable to this one PSC is flaky. We should probably receat the cable uh and move on. And &gt;&gt; yeah, and then you reboot it and receat the cable and the problem&#x27;s gone. &gt;&gt; Yep. for you. &gt;&gt; I also could I also do wonder if the other folks using this mic controller because if you&#x27;re you I mean we don&#x27;t see this is not like a network device</p>\n<p>you you know what I mean like yes we we obviously the network&#x27;s important here but we are not like pounding the network all the time like if we were making if we were using this microcontroller &gt;&gt; for you can imagine use cases that would hit this much faster than than we hit it. The management network on the rack is completely separate from the customer data network and the amount of traffic flowing over it is relatively low and it&#x27;s very controlled. It&#x27;s all just our things talking to our things. It&#x27;s also small packets. It&#x27;s all UDP. It&#x27;s very lightweight. So our packet frequency on that network is lower than probably your</p>\n<p>home Wi-Fi network. So we can we&#x27;ll get to [clears throat] 202 to the 31st power packets sent a lot later than most people. &gt;&gt; Uh yeah 166 days later apparently I from our 186 days. Sorry Matt the number was &gt;&gt; Yeah. &gt;&gt; Um so okay so but we&#x27;ve got this uh really interesting thing in the data sheet that you&#x27;ve discovered. Um, what&#x27;s next in terms of like how can we go explore this hypothesis?</p>\n<p>&gt;&gt; Oh, yeah. So, I think I posted in chat saying I may have found a thing that that we&#x27;re not handling, but I need to look into this more um because I don&#x27;t know, I tend to be habitually uncertain about things. But uh I went digging in the data sheet and I found a test register in the Ethernet block which lets you force the hardware to set the counters just below overflow. So there&#x27;s actually &gt;&gt; in the controller for testing the overflow behavior without waiting for two to the 31st packets. So once I saw</p>\n<p>that, it was like I was worried I was going to have to run the thing overnight spamming it with packets, but no, I I just went in with a debugger. And I mean, I know it sounds like and the colonel debugger, you would consider this a bug, but I I used the debugger to write a device register to uh force this bid on uh and the and then pinged it 16 times and the thing hung up with exactly the behavior we would expect in production or we were seeing in production. So that was a strong indicator. And then if you do humility tasks at that point, you can see the all the running tasks and net is always</p>\n<p>marked as running. Idle never runs. So it&#x27;s it&#x27;s not yielding the CPU. &gt;&gt; Yeah. And I mean the great thing is that you&#x27;ve now you&#x27;ve reproduced this cuz when we are in a comput sled certainly in a customer site but even a comput sled that&#x27;s just in a rack we don&#x27;t have a debugger plugged into that thing like they we the header&#x27;s populated but we don&#x27;t actually there&#x27;s not a a so when the network is actually our only way to understand what&#x27;s going on inside that uh that service processor. You have now reproduced this on the bench where we you actually have a debugger attached to</p>\n<p>it. So we can use the serial wire debug interface in and we can actually understand heaven and earth about what this thing is actually doing. &gt;&gt; We can ask it arbitrary questions even though it&#x27;s network interfaces down because the nice thing about these embedded debugging interfaces like JTAG and serial wire debug is that they&#x27;re not cooperative. They will work even if the computer doesn&#x27;t want them to. It&#x27;s &gt;&gt; also why we don&#x27;t have them plugged in at a customer site because that would be rude and give us lots of weird powers over their computer. uh on the benches &gt;&gt; as it has died. I and I can&#x27;t remember if we&#x27;ve mentioned it here before or</p>\n<p>not, but I do feel like one of the one of the things I I love that we have done is that we have use the serial wire debug and in this incredible robustness of it. It really is a very robust mechanism and as you say it&#x27;s like it&#x27;s not an opt-in mechanism. Um this is how the root of trust can control the service processor on our machine. The root of trust actually has that squid line and it can actually control the service processor and uh force it to attest to itself and do all sorts of other things which is extremely useful. &gt;&gt; Yeah. On boot the root of trust actually</p>\n<p>stops the service processor um like alters the contents of its RAM, forces programs into it and makes them run and verifies that they ran in a way that the hardware cannot lie about. So that that that was Rick&#x27;s idea a long time ago and boy has it been a delightful hack. It&#x27;s it&#x27;s really quite powerful. &gt;&gt; It&#x27;s a damn good Yeah, it&#x27;s a damn good idea and it&#x27;s been really really robust. But it all goes to this I mean and I&#x27;ve certainly understanding Cortex microcontrollers was a first for me at Oxide and really appreciating the</p>\n<p>robustness of that of that SWID interface. Um it it&#x27;s very very helpful to have something that&#x27;s so robust there. So, all right. So, so you&#x27;ve now reproduced it. We&#x27;ve got the symptoms and then so uh so what&#x27;s the fix? I mean, it feels like what actually what is did we do? We just uh actually let this interrupt know that we&#x27;re actually not No, I guess we can&#x27;t we can&#x27;t mask it. So, we&#x27;ve got to actually deal with it. &gt;&gt; Yeah. So, once you once this interrupt goes off, you have to figure out which of about a dozen different bits in</p>\n<p>different registers you would have to set to make it stop happening. There&#x27;s a whole tree process you have to follow of like read the top level register and see which bit is set and then go read a different register depending on what bit is set and then like da da da da da da and we could do that but it also turns out that there are bits you can set in a control register to just turn this feature off. We don&#x27;t use the &gt;&gt; but the code I added is about 30 lines of comments and like two lines of rust uh basically like</p>\n<p>&gt;&gt; so this is actually on by default and here is the bit here&#x27;s the here are the bits we have to set and here&#x27;s the code to set them and now the interrupt shouldn&#x27;t occur. &gt;&gt; Amazing. Um, and uh, and I mean I think that we I mean on the one hand and Cliff I mean as as one would I mean you said look we we we can&#x27;t say conclusively we found the issue but boy we found an issue that matches everything symptomatically. It does feel like we&#x27;ve got a high degree of confidence that this is the issue that we saw in</p>\n<p>production. &gt;&gt; Yeah. Like the the simultaneous failure is really my I mean okay I&#x27;m a little bit of a ghoul. So [laughter] I one of my favorite parts about this failure is the fact that it was simultaneous because if it had totally one sled we probably wouldn&#x27;t have had this focus and we wouldn&#x27;t have been able to rule out really simple basic things. But the fact that it was an approximately simultaneous failure of every machine in this class of machines in Iraq was a big wakeup call of like it&#x27;s either a bad</p>\n<p>packet on the network or it&#x27;s power supply issue or it&#x27;s something something across all of them. And what it actually turned out to be is just the fact that a lot of our management traffic is multiccast. A lot of our access patterns over the management network to these compute sleds are uniform, which means if they all start up at about the same time, their packet counters have about the same value. &gt;&gt; And in fact, we did the math on this afterwards where we were seeing, you know, somewhere between 100 and 150 packets per second multiplied by 188</p>\n<p>days. This is a case where it actually does line up with the nice round power of two. So that was another confidence builder that this was the right diagnosis, &gt;&gt; right? There was just a conversion that we had to discover to convert between seconds and number of packets sent. And then it&#x27;s a nice power of two. &gt;&gt; Yeah, that that is absolutely wild. And I mean this is one of those and I feel we&#x27;ve had this you know many many many times where you&#x27;ve got these symptoms there&#x27;s like there&#x27;s somehow we are going to explain these symptoms and the</p>\n<p>the simultaneity is like god there&#x27;s something that&#x27;s going to explain that um you know what could it possibly be and I mean cliff I don&#x27;t I mean I thought this was very surprising I mean ultimately I mean of course it makes complete sense but it was also not I mean we we really got there from Gdonkan experiment and then careful reading of the data sheet, not thinking like, oh, there&#x27;s probably some network encounter that&#x27;s that&#x27;s interrupting in incessantly somewhere. Um, I mean, it&#x27;s uh it it was I don&#x27;t know, maybe you were you were less surprised, but I thought it was it was definitely</p>\n<p>surprising. &gt;&gt; I was honestly mostly focused on the fact one that originally missed the existence of this interrupt when I was writing the Ethernet driver. So, you know, it&#x27;s sort of a bug I created several years ago without realizing it. Well, they&#x27;re all I mean, are they all? But I also feel that like it&#x27;s um and this is where we because we have not used the uh the kind of vendor source code for this stuff. We don&#x27;t use the embedded house. We we have gone our own way which does require us to own this stuff at a deeper level. Um</p>\n<p>&gt;&gt; but I I don&#x27;t know it. Yeah, &gt;&gt; one of the things I suggested in chat when I was sort of self-posting this was the it probably makes sense for us to periodically go take a look at the other open source drivers for our peripherals because for a bunch of technical reasons we can&#x27;t use the vendor drivers. We can&#x27;t use net hell or most of the Rust ecosystem drivers. And it&#x27;s simply that they generally don&#x27;t assume they&#x27;re running on a protected mode operating system. They don&#x27;t assume that their interrupts go through an IPC system. They don&#x27;t there&#x27;s a bunch of</p>\n<p>assumptions they make that are valid for 99% of users but are not valid for us. So in the absence of being able to just share the bug fixes, we need some kind of communication channel to make sure we at least hear about them. Yeah. Um you and how Yeah. Uh so there&#x27;s a question in the chat. Have we notified ST that the docs are wrong? Um no. We probably should do that. Um, ST&#x27;s been it&#x27;s pretty I mean again pretty as these</p>\n<p>things go pretty receptive. I view ST as kind of a model for for pretty good transparency here and and in generally pretty good documentation. I mean I know that it&#x27;s uh in this case it was misleading &gt;&gt; or wrong. &gt;&gt; So the the answer here is a little complicated because ST to their credit tends to release very comprehensive docs on their microcontrollers. They also never update them. Uh unless I don&#x27;t know I don&#x27;t know what you have to do to get them to update them. They will release erata sheets that explain that oh by that way that feature we&#x27;re still</p>\n<p>advertising isn&#x27;t implemented. But um what they won&#x27;t do is a release an erata sheet for a thing that just kind of sounds misleading. So it&#x27;s it&#x27;s actually not clear that ST has a policy that would result in this getting changed. Um they&#x27;ve this has been reported to them by I I posted this on Masttodon and several people reached out saying like, &quot;Oh yeah, that bug. Yeah, man. I remember that bug. [laughter] &gt;&gt; That sucked.&quot; And uh they all reached out to ST. ST is aware, but like ST&#x27;s position is, &quot;Hey man, we described this</p>\n<p>in the manual and like yeah, maybe you don&#x27;t find the pros as accessible as you&#x27;d like, but it&#x27;s not a bug per se and you know, you do keep buying our chips.&quot; So, um, so I&#x27;m I&#x27;m maybe a little, uh, cynical there, but I I don&#x27;t think that there&#x27;s an obvious pathway to getting the manual updated. What we can do, though, is publish this in as many forms as we can, which is part of why I took a bunch of the notes and wrote up that public hubris GitHub issue in addition to &gt;&gt; Yeah. And and if anyone wants to point us to other podcast episodes from other companies talking about their firmware</p>\n<p>bugs, we will gladly listen to absolutely all of them to make sure that we uh because I I do think that this stuff is uh extremely valuable information to to to share. Um, and I think it it also just underscores the importance of having open source having because in a in a closed proprietary world and we do work with vendors where like all of the source the where the documentation is proprietary um and so it makes it a lot harder to find problems like this or to go validate them. So the transparency here is is a win and is helpful um just not totally</p>\n<p>sufficient in this case. Um, well, this is uh this is awesome. Actually, I do love the fact that we were [laughter] we were talking about this. Megan was asking this morning, he&#x27;s like, &quot;Do we need to like should we like issue a patch for a previous release on this?&quot; Like, well, no, because we&#x27;re going to we&#x27;re know that it actually is going to take a while to hit this. So, um, by the time they hit this, they&#x27;re going to we&#x27;ll we&#x27;ll have them updated to the most recent version. So, uh, it&#x27;s</p>\n<p>actually very helpful to this. &gt;&gt; Sorry. Go ahead. &gt;&gt; Yeah. If a customer doesn&#x27;t want to upgrade for another half a year, then we may want to push out a patch, but we don&#x27;t think anybody&#x27;s really, you know, insisting on that. So, &gt;&gt; yeah. Yeah. &gt;&gt; Um, and and then the uh the mystery of Sled 23, which is what kind of caused all this, that&#x27;s going to be a future podcast episode, so you know, stay tuned. We don&#x27;t have, you know, we&#x27;ve been we we&#x27;ve we&#x27;ve been on a bender recently of of oversharing uh</p>\n<p>fascinating bugs, but we just seem to be hitting more and more content generation. Um well, this is great. I Cliff, again, extraordinary work on this. um when uh and because for all I mean this uh I&#x27;m I&#x27;m not sure if you were there was some hidden work here, but you actually debugged this remarkably quickly once you hit the data sheet. Um felt like you was &gt;&gt; I mean it took a few hours of of concerted work, but I just I want to emphasize</p>\n<p>that like I was just knocking the pens down that Matt and Laura and Will and the other people that were working on this before I got there had set up. And uh well you once again I think this has been a theme on these other bugs too. We got the kind of the baton being passed. So uh everyone taking their turn with the baton. Um and uh this was this was another good one. Um and really terrific work. Very exciting to get this this fix in. Um I Adam I for one would like slightly less content generation even though this [laughter]</p>\n<p>is is terrific content. Like we can we can ease up. I feel like, you know, we if the gods are listening, you know, um &gt;&gt; on one hand, debilitating bug, on the other hand, podcast episode solved. But, uh solved, &gt;&gt; but we&#x27;re we&#x27;re going to be off for a couple of weeks, so we can just uh pause on some of the debilitating bugs. &gt;&gt; We can we we can pause on some of those. So, we uh and actually speaking of upcoming weeks, so we&#x27;ve got we&#x27;re I&#x27;m out next week. Uh but then the week after is going to be our last episode of the year. So, um that&#x27;s wrap-up time. We&#x27;re gonna do</p>\n<p>our our our wrap-up episode. So, that&#x27;s going to be uh that&#x27;s gonna be exciting. &gt;&gt; Yeah. &gt;&gt; Um we which means we will be doing a title and image review. So, [laughter] just one that&#x27;s right. &gt;&gt; Um you know, not too much pressure on anybody. Um but &gt;&gt; I assume that episode&#x27;s just going to be chime sounds the whole time. [laughter] &gt;&gt; Yeah. You know, you know, so that is actually a bit of an over question. Like I feel like it is an act of cruelty to have it just uh non-stop chimes, but yeah, it will be a lot of chimes, I</p>\n<p>think. Or maybe maybe no chimes. &gt;&gt; Maybe it&#x27;ll get them all in at the beginning or something. &gt;&gt; Exactly. We&#x27;re not actually we don&#x27;t actually hate the listener even though sometimes our audio behavior is in is &gt;&gt; No, no, it&#x27;s a much more complicated ambivalence. [laughter] Yes, &gt;&gt; it&#x27;s a much more complicated relationship. &gt;&gt; Exactly. Well, again, uh, terrific work, uh, Will, Matt, and Cliff, and and I said other folks that have worked on this problem and Robert and others, but, um, really Justin, uh, a lot of great work all around. And, uh, uh, fun to have another podcast episode,</p>\n<p>but we don&#x27;t need to have any more world gods, you can actually, it&#x27;s okay. Things can actually work now. Um, now that we&#x27;ve deal between between future lock and our data corruption episode and I also like to see we kind of like hit on all like why am I about to say this? Why am I like literally tempting the gods with the other um Yeah, I&#x27;m just going to shut up now. We know the gods are listeners. So, &gt;&gt; were you about to say like we never seen a bug in this sub? &gt;&gt; No, no, no, I wasn&#x27;t. I wasn&#x27;t. I sure wasn&#x27;t. So, awesome. Well, uh, Cliff, thank you very much especially for joining us and great work debugging this. Um and uh we&#x27;ll get get the word</p>\n<p>out there for other folks that may have this part. Um and let us know if if there are other issues that we should be aware of. Please let us know. So thanks everybody and uh we will see you next time. So in two weeks um and uh bring some of your your year highlights. We&#x27;ll be doing our year wrap-up. See you next time.</p>", "cleanup_applied": false, "cleanup_reason": "legacy_or_disabled", "chapters_count": 0}