{"video_id": "Oe4Qqschj4g", "title": "Howard Lutnick’s “reputation is in the sewer”", "link": "https://www.youtube.com/shorts/Oe4Qqschj4g", "published": "2026-02-13T15:00:47+00:00", "summary": "Yale School of Management’s Jeffrey Sonnenfeld joins Jessica Tarlov and Scott Galloway on Raging Moderates to discuss Commerce Secretary Howard Lutnick’s congressional testimony about Jeffrey Epstein.\n#epsteinfiles #trump #podcast", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/shorts/Oe4Qqschj4g\">https://www.youtube.com/shorts/Oe4Qqschj4g</a></p>\n<h2>Transcript</h2>\n<p>Commerce Secretary Howard Lutnik is testifying before the Senate. Did you in fact make the visit to Jeffrey Epstein&#x27;s private island? I did have lunch with him as I was on a boat going across on a family vacation. This guy&#x27;s reputation is in the sewer. He has overtly lied. On that clip you showed, it doesn&#x27;t demonstrate whether or not he actually perjured himself under oath, but we do know that he said repeatedly into recently to the media that as you pointed out was 2005. He&#x27;s had no more contact with that disgusting person. And now we see that he not only built a house next door to him, but he was investing in businesses for years later.</p>\n<p>He stayed in contact for 12 years past. He told us he&#x27;d stopped all contact. Based upon what you know about Trump&#x27;s view and his leadership style, how do you think that he&#x27;s going to handle having a cabinet secretary caught in this kind of lie and the attention that it brings to the administration? If he takes the move on Lutnik and pushes him out, which he should, does that start the quote unquote proverbial slippery slope where all the indiscretions of Hegsth and others start to spiral out of control? I think it&#x27;s possible that um he could lose Lutnik. Lutnik is not popular on the cabinet. A lot of CEOs tell us after they shake hands with Howard Lutnik now, they want to wash their hands. I mean, obviously, they feel soiled.</p>", "chapters_count": 0}