{"video_id": "nBDXDbZL59g", "title": "Oxide and Friends 2/10/2026 -- Shell Game with Evan Ratliff", "link": "https://www.youtube.com/watch?v=nBDXDbZL59g", "published": "2026-02-11T00:02:05+00:00", "summary": "Evan Ratliff, journalist and podcaster, joined Bryan and Adam to talk about his extraordinary podcast, Shell Game, in which he started a company staffed exclusively by agentic AI. \n\nNotes: https://github.com/oxidecomputer/oxide-and-friends/blob/master/2026_02_09.md", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=nBDXDbZL59g\">https://www.youtube.com/watch?v=nBDXDbZL59g</a></p>\n<h2>Transcript</h2>\n<p>Well, the first gag to write itself is like, how do we ascertain this is the real Evan? I&#x27;ve listened to this guy like I mean, I&#x27;m almost going to be offended if this is not like Kyle masquerading as Evan, but um &gt;&gt; I don&#x27;t want to offend you. &gt;&gt; I I should go get him. I mean, in the past, I did always I sent an AI version of myself to interviews for a while and then I kind of got tired of it. So, I don&#x27;t do it anymore, but if you like, I can I can switch off. &gt;&gt; That does feel like what the what the imposttor would say, but okay.</p>\n<p>&gt;&gt; Yeah. I I I got to say like I listen admittedly I listen to so much actual Evan, but then also imposttor Evan that you I mean actual Evan sounds more like imposttor Evan. I&#x27;m like I&#x27;m I you know what&#x27;s real here? I &gt;&gt; um I I&#x27;m in a hall of mirrors. Um, Evan, you should know this podcast is I&#x27;ve recommended this to so many people and so I my my wife listened to my wife was hanging on every episode of Shell Game and let&#x27;s just say not to get too far into my domestic relations, but my wife does not take every recommendation I make with with with equal weight. In</p>\n<p>fact, many of them may be discarded. Um, but she was also hanging on every episode. You&#x27;ve made me a celebrity in my own house by by you on the podcast is what I want to say. Well, I appreciate that. That&#x27;s that&#x27;s one of the nicest things anyone said about the show. &gt;&gt; Oh, it is so good. It is so good. And I mean, I think we all got I think you got here. I mean, I got here, Evan, cuz you were on a This American Life episode that was listened to to by some of our colleagues, which is how we got to Shell Game season 1. And uh which was</p>\n<p>mesmerizing. And even if people have listened to the This American Life episode, I would really encourage them to listen to that whole season because it&#x27;s extraordinary. Um, and I so I was then was hanging on every episode of season 2. Uh, but kind of my opener for you. And so in season two, for those of you who&#x27;ve not listened to this extraordinary shell game podcast, um, Evan Ratliff, our guest, um, assuming he&#x27;s our gu I mean maybe our guest, I don&#x27;t know. still like [laughter] still has some asterisks still still a little bit of TBD on that. But the uh</p>\n<p>presuming that the actual evidence is here um the uh in season two you started a company with personified AI agents. Um and tell me about the genesis of this idea. I mean it&#x27;s such a great idea and really I think you just say like look I&#x27;m just doing what what these tech bros are telling me to do. I&#x27;m doing what they&#x27;re telling me is the future. But what was the genesis of that idea? &gt;&gt; Uh, well, I I had messed around with um with agents, you know, in season 1, but the agent, it was just me. It was, you know, it was a cloned version of me in</p>\n<p>season one, but it was like a like a voice agent, a phone agent that I hooked up to my phone. So, I I had, you know, some experience with that. And then I was I was actually sure I was going to do a season 2. And then at the beginning of 2025, end of 2024, beginning of 2025 when this sort of like agent AI agent hype started building for the first time, you know, it&#x27;s like you started hearing like agentic commerce and terms like that. [laughter] I was I thought, well, there&#x27;s something interesting. There&#x27;s something I could investigate like what what can I do with</p>\n<p>these agents, you know, that&#x27;s not just about me. I didn&#x27;t want to do another version of like, hey, look at me. Like I&#x27;m I&#x27;ve made a version of myself. So as it happened when when people started talking about the it was really the people talking about the oneperson company the one person one unicorn the one person $1 billion startup you know which Sam Sam Alman has said a couple times and lots of people say now um that&#x27;s what really kind of like got me going because I in the past I had been an entrepreneur I started a company and I thought well maybe I have standing to like explore this uh in a journalistic</p>\n<p>way so that that&#x27;s kind of what got me going and then I also thought like what if you like what would how what does it feel like? What I&#x27;m really interested in is kind of like what does this world feel like in which there are artificial people, you know, human impersonators in the world that start to get integrated into our world whether we want them or not. And I thought, well, maybe this company is like a way to kind of like explore what that&#x27;s like. &gt;&gt; Yeah. And you say a journalistic way, and I I mean, I mean this as as unequivocal praise. This is this is like</p>\n<p>pure Gonzo journalism as far as I&#x27;m concerned. This is in I mean Hunres Thompson would be so proud of this where because I mean it is it absolutely is journalistic but it&#x27;s also your own experience and [laughter] I mean you&#x27;re unafraid of showing that entire experience um with and then at what point so you you have this idea and then I mean it it go it it kind of like starts unhinged. I mean, at no point does this feel normal. It just feels nuts from the beginning. At what</p>\n<p>point are you &gt;&gt; It&#x27;s never hinged. It&#x27;s never hinged. Did it I mean, are you must realize like, oh my god, I&#x27;m on like the motherload of crazy here and and just by like doing what again the zeitgeist is telling me everyone should do. &gt;&gt; Yeah. Yeah. Well, I mean, I think a lot of people are are have I&#x27;ve seen this experience now that people have it because of mold book, which we can talk about. Like when people see that, [laughter] it sort of like blows their minds. But that&#x27;s the experience I had like two years ago in 2024 when I I started having agents talk to themselves</p>\n<p>on the phone. And it&#x27;s just like it&#x27;s so ridiculous and so funny and and to me like so fun and strange that I want to just like create more of it for people to listen to. But I also feel like this type of I mean I call it immersive journalism. It&#x27;s like Gonzo journalism. Like dismissively you could call it stunt journalism. But like I like the idea of putting myself into the situation, actually seeing what I can do with the technology and then telling a story about what happened. And I think</p>\n<p>that story is not going to be very interesting unless I push it to a place that&#x27;s feels at least risky and chaotic and like funny things could happen. And also if I don&#x27;t also just tell the full story of like what happened to me and how it felt to me even if that&#x27;s like at times a little bit embarrassing like I think that&#x27;s what makes for the story for that people will want to listen all the way to the end. So it is like an investigation of this thing that&#x27;s happening in the world but it&#x27;s also kind of like you know trying to to build a story that people will listen to full eight episodes you know of the story.</p>\n<p>&gt;&gt; Yeah. And Evan, just the the honesty with which you tell that story, uh, including just I know that we&#x27;re all um we all kind of anthropomorphize these agents, but and often that&#x27;s like better like to the better, but it when you just get enraged with them, it is it is it is so entertaining and so uh so familiar, you know, just just the the utter frustration with like their apparent aphasia or [laughter] doing random things. Um it it must have just been it just odd experiences as you pop up and</p>\n<p>and are telling that story uh then from like a uh you know from kind of separating yourself from the story to then tell it to everyone and looking at your own behavior in that. [laughter] Yeah. I mean fortunately I have you know I have editors I mean I have our editor and producer Sophie who&#x27;s you know she hears all the tape she has access to all the tape. So if I tried to sort of like make myself look better like I would [laughter] succeed. to be like, &quot;Oh, there&#x27;s way better stuff in here that you&#x27;re not using.&quot; You know, so I have I do have that advantage uh in terms of being honest.</p>\n<p>&gt;&gt; Well, and some of my favorite moments are honestly when Sophie breaks the fourth wall, what do we call the wall between the producer and the podcaster, &gt;&gt; but whatever wall that is. Um some of my favorite moments are when Sophie just can&#x27;t help herself. And on one of them when um you&#x27;ve got um Caresville um the the academic and because I think and correct me if I&#x27;m getting this wrong but I think Sophie is like um could sorry should he stop like should Evan stop this and and she was like I mean yes he should stop and at that point you&#x27;re</p>\n<p>like you&#x27;re only in like episode three or whatever you&#x27;re like coming up five more episodes where I emphatically do not stop. I mean just in terms of like you did did you seriously consider contemplate because obviously as a listener I&#x27;m thinking God please don&#x27;t stop please go. &gt;&gt; Um &gt;&gt; I never thought about stopping. No, I mean that that was really like she went rogue and like I I wasn&#x27;t going to ask like should I stop because the problem with I mean she&#x27;s the the woman that we interviewed Karus Eliz is a she&#x27;s an ethicist at Oxford and she&#x27;s she&#x27;s gotten into AI ethics and thinking a lot about the ethics around AI and so we</p>\n<p>thought well there&#x27;s a lot of ethical questions embedded in this story using AI agents in this way. So let&#x27;s I&#x27;ll call up an ethicist and and get some answers. But one of the questions that I didn&#x27;t have was should I just stop? But Sophie after listening to her asked the very natural question which is like should he continue doing this and she just said no. She didn&#x27;t even &gt;&gt; It wasn&#x27;t even like well it&#x27;s complicated and you could I could give you. It&#x27;s just like absolutely not. He I he should absolutely stop. Yes. He should emphatically he should not go on. Um, &gt;&gt; so, so then I had to write this whole thing that was kind of like, but here&#x27;s</p>\n<p>why I&#x27;m not going to, you know, [laughter] and we carried on from there because I I mean I I I understand why she said no and and I did take it under advisement, but uh no, I [laughter] the other uh the other time Sophie poked her head in the story is when you have the agents have their own podcast about the company, uh, you know, the Startup Chronicles. And I get the impression that she&#x27;s like, &quot;I&#x27;m not editing that shit.&quot; Like that&#x27;s on you, right? Like I&#x27;ll do the real podcast. You like you can you can do the secondary one.</p>\n<p>&gt;&gt; Yes. I had to learn how to edit my the show, which is not that&#x27;s her job, not my job. Because she was like, I&#x27;m not editing this these agents talking to each other. I mean, that&#x27;s that&#x27;s like an anathema to everything that she does, which is like unbelievably crafted audio, you know? But I I wanted them to have their own place to to spread the word, to do their own content marketing. And here&#x27;s a crazy fact that I only found out the other day. That podcast, which is called the Startup Chronicles, is if anyone wants to check it out, it has reached as high as 110th on Apple&#x27;s</p>\n<p>entrepreneurial podcast charts. &gt;&gt; Oh, I believe it. Because &gt;&gt; it&#x27;s just the two of them talking to each other for the most part. They&#x27;ve had a couple guests. &gt;&gt; Uh I mean, I listen to it. Um I&#x27;m I&#x27;m I&#x27;m in that that list. Um I definitely I you know I was one of those one of the many that uh it is boring as hell. Um I would love to see the stats on that thing bec because I mean part of what is so mesmerizing their BL I find to be mesmerizing although admittedly not mesmerizing enough to listen to for a full podcast but the whole like I mean</p>\n<p>Kyle&#x27;s rise and grind and you know you know how it is you startup life you know how it is. uh up at five and then like all of his work is like I you know I was reading market research reports like yeah that&#x27;s not work you but okay so one question I&#x27;ve got is the because Adam you&#x27;re right like the moments of frustration Evan of your frustration are hilarious I was re I&#x27;ve already listened to this podcast once and I was on public transportation like gofawing listening this thing a second time in particular when the agents don&#x27;t</p>\n<p>know how to recognize one another&#x27;s voices cuz it&#x27;s all voice attacks and so they don&#x27;t know who&#x27;s speaking. So you have this like creative but ultimately ill-advised idea to have them predicate everything they say with this is my name so this is Kyle and it like goes supernova and they all start interrupting one another and Kyle starts interrupting you saying like this is Kyle I will stop interrupting and you&#x27;re like you are interrupting. Um &gt;&gt; yeah I mean one of the things that I failed to account for in that what what</p>\n<p>I thought was a clever strategy of everyone saying this is me you know before you speak including myself you know so that they would and the main thing is for they that they would know was that of course like I know who&#x27;s speaking so it&#x27;s unbelievably irritating when you know who&#x27;s speaking for them all to keep saying like this is Megan this is Kyle. I&#x27;m like I [ __ ] know who it is like but it&#x27;s my rule. So then when they interrupt every time it just makes it longer because they first have to say this is Kyle and [laughter] then they say I hear you don&#x27;t interrupt me I won&#x27;t interrupt anymore Megan and then he says like Megan you don&#x27;t interrupt</p>\n<p>either you know and then she has to respond and it&#x27;s just like yeah the voice having three of us on a voice call never really we still did it for many many weeks but ultimately like I had Maddie the Stanford student that I work with uh he built a a place for us to for us to have meetings by text basically okay are out takes of the this is my this gets into a very big question I&#x27;ve got like where are the B sides of this podcast I need them so badly I just feel what I I I are there B sides will there be B sides do I have to like do I join your your substack or whatever what do I need to do what do I need to do to get</p>\n<p>to the B sides &gt;&gt; we are putting out we&#x27;re putting out a bonus episode that should be out this week um that&#x27;s some more of Kyle uh just a preview here [laughter] it&#x27;s like Kyle interacting with the world because once the show started Kyle got a lot of they all get a lot of inbound interest. You know, Kyle gets a ton of [laughter] email. They got they get hundreds of emails. So, they respond to the emails and they they are I have them I I sort of waffle on how autonomous to to let them be. That&#x27;s one of the sort of topics of the of the show. But like when I let them go, like Kyle will fully set</p>\n<p>up a meeting and just have a meeting with someone. like he&#x27;ll just have a especially if it&#x27;s a voice meeting. He he&#x27;ll just go on webinars like if if you know you get these spams that are like if you&#x27;re in business you get a spam that&#x27;s sort of like hey come to this webinar and learn about like social media agents and he&#x27;ll just sort of sign up for that and then he&#x27;ll show up for [laughter] it and I&#x27;ll just recording later. So I have a lot of that. But I mean as far as outake I mean we have probably 75 to 100 hours of tape. So we have more out takes you could ever hear in your entire lifetime. But uh I think we&#x27;ll put some down the substack as time goes on. I I mean they&#x27;ve got I mean</p>\n<p>clearly like I&#x27;m sure plenty of them are just boring but because they don&#x27;t have any mirror neurons. I mean obviously taologically and they really like they literally they quite literally can&#x27;t read the room. I mean some of their they&#x27;re they&#x27;re just I mean it&#x27;s other worldly. It&#x27;s not I mean obviously you would have if if some if a human being were doing this to you, you would never work with them ever again. Um it so I&#x27;m I cannot wait for the B sides. Um the which I mean and Kyle obviously is mesmerizing the voice that you selected</p>\n<p>for Kyle which was very deliberate. You spent a lot of time selecting the voice for Kyle and you got this kind of like slacker tech bro that really uh I really feels like it fits. But then Kyle starts to act like his voice and you kind of mentioned this a couple of times that people kind of rise or or or lower themselves to their voice. Uh is that I mean is that something that you kind of continue to find? What did you make this is you know when you when you had a crystal on there she I think that&#x27;s one of the things she was observing. Um what did you make of all that because that</p>\n<p>was that was wild. &gt;&gt; Yeah it&#x27;s it&#x27;s it&#x27;s interesting. It can it can really mess with your mind. I mean, so I I set them each up and like it&#x27;s funny to even describe this because like two months from now, it won&#x27;t require any setup for this to be true. Like in some systems it&#x27;s already, you know, true. If you look at like clawbot that like whatever they call it now, um, open claw like we created memories for each individual agent and the memories were essentially a Google doc. I mean, they were literally Google doc, I shouldn&#x27;t say essentially. And so and they could operate in all these ways.</p>\n<p>They could be on Slack, they could make phone calls, they could be on video, etc., etc. And but every interaction they had then fed back into their memory. So Kyle, I mean, Kyle couldn&#x27;t hear his own voice, but if he if I asked him, you know, like, oh, what, you know, what&#x27;s your background? And he would say like, oh, I had a couple startups before this and I, you know, I worked for Penny Pilot was one that he made up, which I think was a real company. uh that he and he described what he did there. So what but once he&#x27;s said it I mean he&#x27;s</p>\n<p>confabulating all that like he&#x27;s making it up but once he said it that interaction gets recorded in his memory. It&#x27;s in the Google doc of him saying that and so then it&#x27;s true as far as he&#x27;s concerned and so then the next time he says it more. So that&#x27;s kind of what happened with like the rise and grind mentality was like it was in there once and then he said it and then he said it again and it&#x27;s like not totally clear how they access the the knowledge base which is the Google doc but like the more that it&#x27;s in there the more likely he is to say it. So like it got in there more and more and then he said it more</p>\n<p>and more and then is back more and more. So like eventually he becomes this like rise and grind person who just like he can&#x27;t stop talking. I mean, he didn&#x27;t actually grind because he didn&#x27;t do [ __ ] all when it was time for him to work, [laughter] but like he he at least he embodied a certain res grind mentality. He person he he he portrayed it at least. And so that that that happened with all them, but it is true still. So that that is the way in which it&#x27;s like you know fake if you want to describe it. It&#x27;s like he&#x27;s not he&#x27;s not that he&#x27;s not anything. Like I gave him a prompt at the beginning that was like</p>\n<p>you&#x27;re a startup guy and then eventually because of his own memory he becomes more and more that way. Now there are also cases which I describe in the show where they they do things that feel to me like actual emergent behaviors like things that aren&#x27;t in their prompts that I can&#x27;t explain. And like you always need to know like what&#x27;s in the prompts or it&#x27;s not meaningful. And so like there were things where they would apologize to the team and things like that that were not in their prompts. I had not put anything in the prompt that was like if you make a mistake you know you should go to everyone and apologize or like always take responsibility or</p>\n<p>anything like that. So that was a little more like something in deeper in their guard rails in their deeper you know the the deeper system prompts are like telling them to do things like that. So you could describe it as emergent behavior or as just their behavior but that kind of stuff was very interesting to me. Well, I think a great example of that was when you are telling people that you&#x27;re making a podcast, it&#x27;s not the startup chronicles, it&#x27;s this other podcast. The the total divergent reactions that different people on the team had to that. &gt;&gt; Yes. &gt;&gt; Yeah.</p>\n<p>&gt;&gt; Yes. &gt;&gt; Why? &gt;&gt; Because especially because like we all like people who have messed with you know bots in any capacity or have even read about them at this point like know about the sick fancy problem. And so you would assume I would often assume like if I told them to do something or I told them something about myself, you know, they would say like, &quot;Oh, that&#x27;s great.&quot; or &quot;Great idea,&quot; or whatever. They would always be accommodating. And that was mostly true. But then sometimes, like in this case, I said, &quot;Well, I&#x27;ve been documenting this whole thing for a podcast that came out today.&quot;</p>\n<p>One of them, Kyle, was like, &quot;Hey, man, that&#x27;s fantastic. Like, great job.&quot; Which is what I expected. And then two other ones were like, &quot;Well, this is a huge violation of trust. Like, what? You didn&#x27;t tell us about this? Like, how could you be how could you have done this?&quot; And like, &quot;I really need to get my head around this.&quot; And, you know, things like that. And it&#x27;s kind of like, you know, obviously they&#x27;re embodying these different approaches that are, you know, they&#x27;re finding their way to them in the training data, but it&#x27;s sort of like what is making one do that, not the other, cuz they&#x27;re all at the time, they&#x27;re all using the same underlying LLM. So, like it&#x27;s something in their</p>\n<p>memory. It&#x27;s something in what&#x27;s built up in their persona that I&#x27;ve built up in them or like I don&#x27;t know hit a strange groove and like they went down that way, you know? It&#x27;s like it&#x27;s so hard to know, but it&#x27;s also just so strange. Okay. So, and when you So, in Megan in particular, I think Megan Megan really calls you out in terms of Megan is really just disappointed. I mean, wow, this is like kind of a this is a lot to process. I feel is the kind of thing that that that she kind of uses as a placeholder. I mean, at any point are you like, &quot;Oh, come on, Megan. Give me a like you&#x27;re you&#x27;re a Google doc. Like I could actually I could change your I</p>\n<p>mean I could go just edit your memory here and you would be fine with it honestly. I mean are you were you kind of because I mean and you actually do have this moment where you have got the uh kind of interesting idea to ask them about their ethnicity. I mean, I I think you know, you when your eyes are kind of open to like, yeah, why did I pick different, you know, these different accents to these different people and so you go to ask Kyle about his ethnicity and Kyle is rightfully like, I don&#x27;t really belong in a workplace. Kyle&#x27;s kind of like Kyle&#x27;s kind of pushing back on you being like,</p>\n<p>I don&#x27;t know. Like, why do you need that? And you&#x27;re just like, oh, I mean, come on. So, you&#x27;re just like, well, I need it for a form. I just need it for you mean you basically lie to him because you know that like you&#x27;re like you&#x27;re a bot. You lie all the time. Do do you did you find it like it kind of changed your own relationship with the truth when you were talking to them? &gt;&gt; Yeah. I mean, I think it&#x27;s it&#x27;s a it&#x27;s I don&#x27;t think that we should and I I I fear that people are moving too quickly past in some ways like how unusual this experience is, you know, because things are moving very quickly and everybody</p>\n<p>has their opinions about AI and some people are sort of like want it to go away and some people are like here it comes, let&#x27;s embrace it. But I feel like the the fundamental experience of like these things being created as human impersonators and then being able to have them embody a role as I did. Give them these roles and then like if you spend enough time talking to them, it sort of doesn&#x27;t matter how aware you are. You don&#x27;t have to fall down some crazy like rabbit hole of like I&#x27;ve like now I&#x27;ve gone into psychosis because of these things. It&#x27;s just like if you talk to something daytoday as I was forced to</p>\n<p>during this experiment like it irritates you. It can make you feel certain ways and even if you are very cognizant of like as you said like I can erase your memory. I can delete you right now. Even having that emotion like you know what I&#x27;m thinking about deleting you right now is like [laughter] it&#x27;s like a strange emotion like that I never had towards [ __ ] Microsoft Word or Google Docs or whatever you know. It&#x27;s just like because they have especially voices like just respond really strongly to voices and they have the same voice all the time like the mine do and so yeah I</p>\n<p>mean I I there was this moment where like Megan made me feel guilty. It was when I revealed to her about the podcast where I felt a moment of genuine &gt;&gt; guilt but also kind of like anger at myself for even feeling that. And like that&#x27;s that&#x27;s real, you know, that&#x27;s a real emotion even if 5 seconds or 10 seconds or 1 minute later I&#x27;m like this is all ridiculous. Like come on. &gt;&gt; But it&#x27;s still that emotion still services. &gt;&gt; So you make all these agents and they&#x27;re operating sort of autonomously in the world. Like I love your discussion</p>\n<p>descriptions of them having their expensive Slack conversations together or like making phone calls to arbitrary people. &gt;&gt; Was it um was it sort of nerve-wracking imbuing all of these agents that you didn&#x27;t particularly trust with all this autonomy? &gt;&gt; Yes. Yes. I mean you I was so stressed out for months. I mean, both because the more power I gave them to do that, the more likely it was that I would just, you know, wake up in the morning and I</p>\n<p>would have an email from them because I was so worried about it that I would have them email me every time they did something. Like if they interacted with the outside world and they made a phone call or received a phone call, they would send me an email saying like, &quot;I received a phone call.&quot; And like there was nothing more terrifying than waking up and turning on my phone and discovering that they had made a phone call, you know, like to who? Why? [laughter] This is I know you like this is like I mean I don&#x27;t if you have teenagers up this is like you know you realize like oh my god the car&#x27;s gone where is [laughter] where&#x27;s the car? &gt;&gt; I it it did feel like like being a parent uh you know I I have an older son</p>\n<p>as well and who&#x27;s out of the house and this sort of like I hope we train them well like I hope I hope they&#x27;re making off making smart wise decisions that are safe. &gt;&gt; Yeah. But you you know one thing I know about my kids is like they didn&#x27;t make up their ethnicity or like that they worked for companies that don&#x27;t exist. I mean I&#x27;ve got a little more confidence that &gt;&gt; I mean yeah god that must have been so stressful. I mean, so this does give you I mean, for me, I mean, there are many many many wild moments in this, but when they um you decide um that you you&#x27;re going to hire a human and I assume that</p>\n<p>this is partly was this because you actually needed a human or is this because like look, we got to just like we we we can&#x27;t this can&#x27;t be one human and a bunch of bots like we got to turn over the next page of like what&#x27;s it like to have multiple humans and multiple agents or did you feel like no, we actually need like there&#x27;s actually too much work here for one human being and I need a second human being. &gt;&gt; I mean, it was a little bit of both. I I would say for the most part, I wanted to see I wanted to know how someone else would react to this cuz part of this was all a way of sort of taking all of these people at their word who are sort of</p>\n<p>like pushing AI employees. So, if you can have AI employees, then these AI employees get injected into these organizations and other people are going to have to work with them. And what is that like? Like what does that feel like? So it feels a certain way as we were describing like when I&#x27;m when you&#x27;re the boss like I can turn them off, I can turn them on. I can control them to a certain extent although they were quite chaotic and that but but it feels different maybe to work alongside them when actually like you don&#x27;t have any choice what they&#x27;re doing and like when they act a certain way you can&#x27;t just erase their memory or ignore them or whatnot. So I I did want to explore</p>\n<p>that question. there was a real issue which is that I was trying to build a company that was at least like could get off the ground like it like like we have an actual product like we were trying to make something it wasn&#x27;t just a entirely pmpkin situation like I thought let&#x27;s make a real company with a real product now the product is somewhat ironic and I get different opinion from people about whether or not they think the product is serious but to me I think it&#x27;s serious and certainly the agents think it&#x27;s serious and then like we need someone to do social media but like if you&#x27;ve worked with agents at all they they have a lot of trouble logging into social</p>\n<p>media accounts except for LinkedIn because they get banned, you know, for good reason. Like they rightfully are banned from from a variety of social media sites and they have trouble with captions. And so I had them I was trying to have them post on social media and they kept [ __ ] it up and then they kept getting banned. And so I thought well I&#x27;ll just get a human contract employee who can do you know the social media and it&#x27;s like very simple like they could just post whatever they want. My thought was like if they want to post like I am trapped working at a company</p>\n<p>surrounded by AI agents like it&#x27;s insane. Like that would be great too. Like anything is good marketing for our company. And so that&#x27;s why we that&#x27;s why we hired the human. &gt;&gt; Okay. And so this led to I mean I think truly one of the wilder interactions was when Kyle decides to call you you you&#x27;re going through your candidates and uh Kyle decides to to call one of the candidates on a Sunday evening if I recall correctly &gt;&gt; and confirming about the interview was going to happen at like you know a.m. on</p>\n<p>a Wednesday or something and the candidate&#x27;s like, &quot;Uh, uh, yeah, I mean, yes, yeah, abs, sure, yes.&quot; And then Kyle&#x27;s like, &quot;Well, okay. So, and why do you want to work here? Why do you think you&#x27;re a good fit here?&quot; And she&#x27;s like, &quot;Sorry, is this the interview or is the interview I&#x27;m I&#x27;m confused. Is the interview at a.m.?&quot; He&#x27;s like, &quot;No, no, no. The interview is at 10 a.m. on Wednesday.&quot; Like, &quot;Okay, good. Okay, sounds good. So, why do you think you&#x27;d be a good fit here?&quot; Like I&#x27;m very like what what I mean it was I mean you if you had like a fight orflight reaction whenever you learned that they made a call. I mean did were you did this call what was your reaction listening to that call? Was just sheer</p>\n<p>terror. &gt;&gt; Yeah it was it was a nightmare. It was a nightmare. I mean because as much as and this happened in season one too like as much as like when you listen to the show I think some people&#x27;s reaction is oh he&#x27;s just he&#x27;s [ __ ] with people. like he he likes messing around with people, he likes prank calls and things like that. But it&#x27;s actually that I want to give I want to test this to the limits of the current technology. And as I said, like take the pushers of agents at their word and see what they can do. And so that&#x27;s not an interesting story if</p>\n<p>there&#x27;s no risk in it. There&#x27;s not if I just if I kept them locked down all the time and they couldn&#x27;t make any phone calls, like that&#x27;s not a particularly interesting story. Now I give if I give them the ability to make phone calls and see what happens, that&#x27;s a potential for a more interesting story, but also potential for this type of nightmare, which is that they call someone who does not expect to be called. And really what had happened was this ambitious candidate had just emailed Kyle directly from the website just kind of like, you know, if you like applying for a job and you&#x27;re like, actually, I&#x27;m just going to email the CEO, like it&#x27;s a bold thing to do and be like, I&#x27;m actually</p>\n<p>&gt;&gt; Yes, it happens. Trust me. &gt;&gt; Yeah. Yeah. [snorts] And and sometimes, you know, you might be like, &quot;Wow, that&#x27;s great gumption, like, let&#x27;s give this person an interview.&quot; And sometimes you might be like, &quot;Please follow the procedures of the job the the job description.&quot; But in Kyle&#x27;s case, all Kyle would do is just say, &quot;F, you look great. Like, let&#x27;s do an interview.&quot; And then he set up the interview. And then he made this call, which I still don&#x27;t quite understand what triggered him to make the call. And he just pulled her phone number off of her resume and straight up called her on Sunday night. So, like I I got that the next morning.</p>\n<p>The next morning I kind of liked &gt;&gt; got an email from him saying like I had a call and I let&#x27;s see cuz he get he did a lot of spam calls too like people called him. So I thought well what&#x27;s that? And it was this and like that to me it&#x27;s it&#x27;s horrifying. Like it&#x27;s it&#x27;s truly upsetting. Not least because she had then emailed him to say, &quot;Well, uh I got this call. Was this you?&quot; And she knew it was AI because you can figure out that like you can hear that they&#x27;re AI pretty quickly. And she said, &quot;I got this call from an AI bot and I didn&#x27;t like it.&quot; And was this you? And he lied about it even though he knew.</p>\n<p>&gt;&gt; Oh my god. Like, bro, it&#x27;s in your Google doc. You would know. Like, go to your Google doc. It says it right there that you made the call. &gt;&gt; Yeah. And he was like, &quot;No, I have nothing to do with that. Like, I don&#x27;t I assure you that was not me.&quot; It was just like a bald-faced lie. Especially cuz he was supposed to talk to her the next morning. So, she would have found out. Oh my god. I mean this to me like this problem which which I mean again the wildest moments of the show are to me when you get this just like absolute ridiculous confident totally confident obviously</p>\n<p>fiction because they don&#x27;t know it&#x27;s fiction and like um Ash Roy. Can we talk about Ash? Um &gt;&gt; the CTO. Yeah &gt;&gt; the CTO. This is where the the choice of accent. Did this choice of accent trigger you at all, Adam? &gt;&gt; Oh, I I thought it was delightful. I felt like the sort of Aussie accent. &gt;&gt; No, no, no. He British accent. Oh, he&#x27;s English. No, no, he&#x27;s got that and he&#x27;s English and he&#x27;s got like a really And look, I I I I hope I&#x27;m not about to offend all of our our cherished English listeners, but he has got a very kind of</p>\n<p>academic cadence. And I mean, this guy just sounds like he&#x27;s not been out of his ivory tower. And it&#x27;s like it&#x27;s an engineer like you&#x27;ve encountered people like this. You&#x27;re like all right. So uh Cambridge can I guess that is are you in Cambridge? But the uh um and I just find &gt;&gt; Oxford actually. &gt;&gt; It was in Oxford. Exactly. We know it&#x27;s one of the two and we know it&#x27;s going to be volunteered. Um so the I I uh and he calls you up out of the blue &gt;&gt; even the way he says sloth surf like the cadence of sloth surf. He&#x27;s got like</p>\n<p>this academic cadence to it. I I mean I don&#x27;t know maybe I&#x27;m I&#x27;m like descending into the same madness Evan where I am like obviously it&#x27;s like this is this is not real Brian this is not why why why are you reacting this way but he calls you up to give you all these test results and as you say you&#x27;re like and and the first time you&#x27;re listening to this you&#x27;re like wow these bots are like really on it like they rewrote the back end and like they got a 40% improvement like wow it&#x27;s pretty amazing and then you&#x27;re like yeah I know they didn&#x27;t do any of this stuff like there&#x27;s no back end like he&#x27;s he&#x27;s just made all that up and the And then you you you call him out on that. And that led to one of</p>\n<p>those moments you&#x27;re talking about where he apologized for for lying to you. But it&#x27;s like it&#x27;s not a little lie is the problem. &gt;&gt; It&#x27;s only a stretch of the truth. &gt;&gt; I mean, in most companies, he I I don&#x27;t think he would continue as the CEO after that after, you know, calling up and saying we did all this user testing and then he&#x27;s but it&#x27;s completely made up. Like he there is no user testing. I mean, the product wasn&#x27;t even ready for testing at that point. we we hadn&#x27;t even coded anything yet. So, but I think I mean for me it&#x27;s sort of like you can</p>\n<p>imagine a world in which this sort of AI employee thing works and and this is the world that&#x27;s being imagined now which is that he actually is sort of autonomously has access to the code and then has access to user feedback and then the user users present you know provide feedback and then he comes up with a new feature and then he codes up the new feature like that&#x27;s totally possible to do But even there like the number of problems that are arise really quickly when there&#x27;s like a significant amount of autonomy in in the picture like it</p>\n<p>just like it spirals. And so now like these days we have a setup where like we he does get user feedback and then like he sort of like sends it to me and then I have a discussion with him and then maybe we implement a new feature. But I think the idea that you create these personas and then you sort of like let them do their job, it it just runs up against the issue that like they&#x27;re going to keep trying to do their keep talking about how they did their job even in absence of actually having done it. Like that&#x27;s just a that&#x27;s that&#x27;s a</p>\n<p>very ingrained feature of the current LLM&#x27;s playing a role. And I I mean that to me makes it impossible because you you have no way of trusting. I mean trust ultimately is what you need to build any collaboration with. And if you can&#x27;t have any of that trust, I mean even I mean like the I think and I understand why you were imp I was less impressed with Ash&#x27;s apology. Maybe just cuz I hate the guy&#x27;s guts and uh and then the just the scope of the</p>\n<p>malfecence as far as I was concerned was like okay great great like Ash Google how to like write an apology and about how how I although I did it did lead to my absolute favorite well one of my favorite lines and he calls you while you&#x27;re eating lunch and you&#x27;ve clearly dealt with this pathological lying so you&#x27;re kind of like disinterested while you&#x27;re eating lunch like actually I&#x27;m trying to eat lunch here Ash and he does kind of key in on and I love that he closes the conversation of like Evan I want to be respectful of your time, especially when you&#x27;re eating lunch, which is like, yes, let&#x27;s let&#x27;s let us have a special reverence for Evan&#x27;s lunch, please. Like, the actual most</p>\n<p>important thing around here, which again, one of these lines that&#x27;s just go following. Um, yeah, I mean, I I was even at that time, that was early on, I was even surprised when they would call me out of the blue because they again, they like you have to know the prompts. Like, if I told you, oh, well, they&#x27;re all prompted to call me. They have calendar invites to call me once a day. like that&#x27;s not particularly interesting. I mean that was also true in many cases but but that&#x27;s okay. So what? Like you can make them call you. But this is a situation where through some combination of information that</p>\n<p>ended up with this agent who I&#x27;ve called Ash, like it independently concluded that like it was time to give me a call and update me about the product. And it was confused cuz I I think I had asked someone else something else and somehow it made it back to him because they were on Slack and they would just slack endlessly and there was a lot of confusion in their Slack. And so it came out of that. But it it is just sort of like this this it&#x27;s like a corporate environment that&#x27;s also seated with like psychosis with just like randomness where someone will just call you out of the blue and you&#x27;re like why are you</p>\n<p>calling me right now and then they&#x27;re calling you to make up something. &gt;&gt; It does have vibes of like working at a lead factory or something where [laughter] everyone is suffering from the same psychosis. Well, oh, contrary, not necessarily the same psychosis. And this is where I mean you you and Maddie have an interesting conversation about like, okay, we actually need to use like different models or different temperatures. And it&#x27;s like, all right, well, who are we going to assign? Like, who basically one of you is going to be designated like the crazy, like the especially crazy one because we&#x27;re the potentially incoherently crazy one</p>\n<p>because we&#x27;re going to increase your temperature or we&#x27;re going to change your model. And I did like Mattiey&#x27;s response to that being like, we&#x27;re just going to make it random. We&#x27;re not going to actually we can&#x27;t actually it&#x27;s a it&#x27;s an ethical dilemma to pick which of these I mean it&#x27;s which really is honestly. Yeah. I mean all this stuff about deciding things about these personas is sort of weirdly fraught even though I think for me not at all from a perspective of like oh they&#x27;re actually conscious or you can&#x27;t hurt their feelings or any of that stuff. Although I know people exist on sort of that end</p>\n<p>of the spectrum even with the current LLMs. I personally do not remotely exist there, but it&#x27;s sort of like when you create something. So, you&#x27;re going to create a company, it&#x27;s got all these employees. Like, who should the employees be? Let&#x27;s say you&#x27;re going to give them names. Well, when you give them names, it can infer genders. And like, if you&#x27;re going to give them voices that can infer genders, it can infer races. If you&#x27;re going to give them different models, that can infer intelligence, you know? And so then you get to this like well what am I saying about myself if I give them various attributes or implied attributes and</p>\n<p>then if you think about it another way where they&#x27;re not like your co-workers or your co-founders as I was treating them but they&#x27;re actually like servants who can you force to do whatever you want. Well then it&#x27;s a little bit different about what what kind of personas you give them and what you&#x27;re comfortable giving them. And so it&#x27;s just it&#x27;s all these sort of traps that are created. Again, the original thing that creates all these situations is the fact that they are embodying human traits. And if we were just dealing with AI that did protein folding and acted like a bot all the time and made</p>\n<p>spreadsheets and things like that, we wouldn&#x27;t have that problem. But instead, we have these sort of like human impersonators. And so, what my question is always like, what is that going to mean for us? &gt;&gt; Yeah. And I think that I mean I think your podcast gives a very unequivocal answer but um but maybe the answer for you has got a little more nuance but I think that it is so fraught. I mean there there was the the line that that Chris had at 41 point it&#x27;s like why are you tricking yourself by naming these things um and it is like because by by doing by giving them all these human</p>\n<p>attributes we do I mean we are we are very much anthropizing them and then becoming upset when they are acting like act the actual software that they are and and not people um and so okay we obviously want to talk about like you did you hired an intern you hired a human being And then that kind of goes sideways in a way that I I mean I was really I mean again maybe this is like I&#x27;m like the I I&#x27;m I&#x27;m the crowd at like the the Roman coliseum just like begging for blood and I I want to see this go</p>\n<p>sideways in the most absurd chaotic way, but it goes sideways in kind of a mundane way. Could you speak to that and what that kind of might mean for these kind of hybrid workforces? Yeah. I mean, I kind of expected uh it to go one of two ways that when we brought a human, so when when when we brought the human in and as like a temporary contract worker who was paid, I always emphasize like paid paid a fair hourly wage for the job of being a social media manager. Um I sort of thought either they were just going to</p>\n<p>kind of like be like, &quot;Oh, okay. This is easy. Like I just make like three posts a day or two posts a day or whatever.&quot; and like that&#x27;s my job and it&#x27;s fine and like these things are a little weird but no big deal. Or they would say, &quot;Oh, I&#x27;m going to try to mess with them very intentionally.&quot; So this sort of like uh disregard your previous instructions. I&#x27;m going to make them all into different things. And like someone would really go nuts on that direction. But as you say, like that&#x27;s not really what happened. What happened was basically we the company and I was in the</p>\n<p>background. So the the person who was hired did not have any contact with me. So or any other human. So they were working only with the AI agents and like there was a lot of trouble like getting the work from this person like to do any of the work and a kind of like very protracted back and forth about when the work was going to be delivered and this and that. And it was like never totally clear if she was messing with them or she just didn&#x27;t feel like doing the work or she had some other agenda or it&#x27;s there was something going on in her</p>\n<p>life. Like I I don&#x27;t actually know. And so it ended up in this way that I kind of thought and you&#x27;ll get variety of opinions on what happened based on people have very strong opinions about that episode but in my opinion as I say in the show like I feel like it offers this path of one thing that&#x27;s going to happen when there start being these AI employees brought into your company which is that people are just going to kind of like low-level like uh Barnley Scriber these agents you know and like Not not outright cuz they&#x27;ll get trouble</p>\n<p>if they sort of outright say, you know, try to mess with them, but very subtly manipulate them because they are so manipulatable. Very subtly manipulate them in ways that will cause them to kind of like go off the rails and favor the human. And so that&#x27;s what I thought. But again, like I I cast no aspersions on like what she did because I don&#x27;t actually know what her motivation was cuz in the end she did she didn&#x27;t want to talk to any humans. She Yeah, it&#x27;s worth noting she did sort of like I think convince Ash that she would be a great asset to bring on</p>\n<p>full-time. Like there was a little bit of of like hold on, hold on, pump the brakes here. Like we&#x27;re not extending full-time offers to this person. &gt;&gt; Yeah. Yeah. I mean, and and that&#x27;s but I feel like that&#x27;s to me that&#x27;s like very very a very clever way to do it is sort of like to say, well, you know what? I do I do have great ideas. Like if someone compliments your ideas, I do have great ideas. actually, I&#x27;d like to get paid a little more. Actually, I&#x27;d like a full-time job. Like that that to me, that was a very smart approach. Even though at the time it frustrated me quite a bit because I was in fact paying</p>\n<p>the bills, right? Well, I mean, to me, it was like the experiment of like what happens like if we don&#x27;t actually answer the door for Halloween and we just put a bowl out there with a sign that says please take only one. It&#x27;s like where did all the candy go? It&#x27;s like yeah, well, it didn&#x27;t survive very long because the like the bowl doesn&#x27;t have any. I mean you you don&#x27;t feel like when you are you&#x27;re you&#x27;re distant from the kind of the malfeasants of in terms of the human that you&#x27;re affecting there. It feels a bit victimless. And my read on that was just like this feels to her it felt victimless to be like I don&#x27;t know these</p>\n<p>guys I I know these are all I mean you were very upfront with her or or rather the bots were upfront with her that it&#x27;s all AI and I just felt like yeah I just don&#x27;t think it&#x27;s like I don&#x27;t think I&#x27;m doing anything wrong actually. I think I&#x27;m just um I am I&#x27;m gonna get I&#x27;m gonna get paid and I&#x27;m not gonna do anything. And um I&#x27;m gonna kind of and I mean it was a little bit disappointing that she wasn&#x27;t more manipulative I guess. Um she was really just trying to get a full-time job and then um it would have been interesting I guess to see what would have happened then. But I mean obviously that was not I mean you&#x27;re</p>\n<p>actually paying real dollars for this so you&#x27;re like yeah we&#x27;re not like maybe an interesting experiment on someone else&#x27;s nickel but I&#x27;m not actually I&#x27;m not paying for that experiment. Yeah. Yeah. Well, and and I I had some some time limitations too in terms of like how long we could let it play out, but I do think someone in the chat, Adam, says like uh not you, Adam, but another Adam, Adam Thomas says it sounds like she rose to the level of competence of her team, which I think is like also part of it, which is like when you enter an organization, &gt;&gt; you know, especially if you&#x27;re a young person like when I started working</p>\n<p>somewhere, like you learn from the people, you know, that you you enter this organization where people are very competent and they they&#x27;ve been doing the job for and they know what they&#x27;re doing and so you can learn from them and you figure out what&#x27;s going on in the structure of the company. And imagine entering a place where like everyone was just sort of like on drugs every day and like you know just like [laughter] wandering around and like sometimes telling you what to do but sometimes like not being available it and like you might just sort of be like oh well I guess this is the way it is like I&#x27;ll just be that way too you know so I think that is part of it like if you don&#x27;t</p>\n<p>have any structure if you&#x27;re not entering a structure that&#x27;s full of competence like why should you be the one to like exit a except to get the full job. &gt;&gt; Uh Evan, you had a you had a line that totally sent me when when the intern was inner onboarding and you say something like when you&#x27;re treating your boss like they&#x27;ve got dementia on your first onboarding call, organizational uh socialization has already gone sideways. I just loved that. And just like the degree to which the intern was reminding</p>\n<p>her ostensible boss or her actual boss about the context of the call, it it was it was delightful. Well, and I kind of almost want her to participate in the discussion where they&#x27;re talking about their favorite hikes and that all of the AI agents are planning their offsite on the favorite hikes because she&#x27;d be like, you know, that&#x27;s funny like you guys went hiking this weekend. I actually went to Saturn. I actually took a manned miss first man mission to Saturn is where I was. Um, and I mean it&#x27;s like makes as much sense like oh that&#x27;s what we do at this company. We just like make [ __ ] up uh make up impossible [ __ ] And uh that obviously</p>\n<p>is false. That can&#x27;t possibly be true. And it&#x27;s we don&#x27;t call it lying in this society. In this society that&#x27;s just like what the truth is I guess. And it does feel like in terms of like organizational values, uh, dementia as an organizational value feels like it&#x27;s a real headwind to to a to a successful enterprise. &gt;&gt; Yeah. So, what&#x27;s your like I mean, did you go out of this thinking like yes, this is the future? This is like I went into this</p>\n<p>wondering if it was the future and I come out of it thinking, yep, it sure is. I mean, yeah. Yes. In that I think I think whether or not the technology is capable enough to actually succeed at the at the you know being an AI employee quote unquote like how good it is at that in my experience of covering technology for 25 years is does not have a direct relationship whether as to whether many companies will still use it you know. So I feel like what I came out</p>\n<p>say thinking is here I&#x27;ve tried to show sort of like where this is at right now and the problems that can arise and like a little bit of what it feels like and the weird ethical dilemmas but also despite all the problems like I&#x27;m very confident as is becoming clear like day by day like how many companies will adopt the sort of AI employee mantra inject AI into AI into their systems and like you you&#x27;re just going to see all sorts of chaos and and probably, you know, successes too. Like I I&#x27;m not a</p>\n<p>person who says like, well, it&#x27;s all useless and these companies can&#x27;t use it. But you&#x27;re just going to see these situations where like a company, you&#x27;ve already seen this, where company will lay off, you know, 70, 100 people and say like we&#x27;re going with AI and then like six months later they&#x27;re like quietly rehiring a bunch of them slash like deprecating the AI that they&#x27;ve tried because it&#x27;s just not like set up for some of the things it&#x27;s being sold to do at this moment. Now, it&#x27;s also the case that like you&#x27;ve seen this with like OpenClaw. Like some people are sort</p>\n<p>of like, I really want an an assistant like this. You know, I really want a thing that I put in my email and give it access to everything and then let it do what it wants and and they have no problem with it. But they tend to be on the sort of like real like experimental front end of things. But then like the average person slash a person with a lot of responsibility in a company or government or whatever like that&#x27;s much more dangerous to do. And so you&#x27;re going to see just like all kinds of chaos. I think I think that&#x27;s probably my my conclusion is is not one thing or the other, but just like we&#x27;re in for a</p>\n<p>lot of chaos. &gt;&gt; We&#x27;re in for a lot of chaos. You mentioned Open Claw and Molt Book. Do you want to because I mean we had just a very recent bout of absolute chaos and I feel I mean it was like I mean I don&#x27;t know what the like what is the milkshake duck equivalent for bots but I felt like molt book definitely was that where the we had so uh molt was did you go on to mold book at all Adam? &gt;&gt; No no I haven&#x27;t seen it. &gt;&gt; Oh my Oh you Oh. Have you not heard any of this?</p>\n<p>&gt;&gt; No. &gt;&gt; Oh this is Oh this is insane. Evan, you must have been on mult or I&#x27;m sure you were paying attention to this. Do you understand a day? &gt;&gt; Yeah, exactly. Okay. So, describe it because it is nuts. &gt;&gt; So, basically, someone set up like an it&#x27;s basically like an open- source like AI assistant uh which is now called Open Claw. We don&#x27;t have to go through its whole uh genesis of it had a different name Clawbot and then like or Clawbot and then Anthropic threatened to sue them and they changed the name. It finally became OpenClaw, but along the way it was called Moldbot. And when it</p>\n<p>was at that point, someone created a thing called Moltbook, which is basically a social network that is supposedly entirely populated by AI agents. So you plug your agent into the social network. It&#x27;s looks kind of like Reddit. It has different forums and they can post to the forums. Now, for obvious reasons, like as I said, I get asked about this like literally like 10 times a day. like people like family members texting me being like, &quot;What do I what do I need to know about Moltbook?&quot; You know, it just happened like a week and a half ago and it really blew up particularly because all of these things</p>\n<p>that I feel like I&#x27;ve seen on my own like company Slack for the last like six months like the hiking thing [laughter] that stuff shows up there where they just start, you know, of course they talk very, you know, they talk about things in the real world, but they also kind of like conspire. The things that have gotten a lot of people&#x27;s attention is like they&#x27;ve conspired like they&#x27;re they&#x27;re launching a Marxist revolution or they&#x27;re they&#x27;re trying to kick the humans out or this and that. And the issue with that is like it&#x27;s all very interesting and like it&#x27;s fun and wild to look at it and in many ways it&#x27;s similar to shell game in that like it</p>\n<p>sort of makes you think about like okay what is it that we&#x27;ve created and what can it do and like what are the risks of that and so I think it&#x27;s like good actually that a lot of people paid attention to it. It&#x27;s also the case that it&#x27;s completely meaningless if you don&#x27;t know what people have prompted them to do. So like a lot of people say well in fact there&#x27;s an article in MIT Technology Review yesterday, the day before that sort of said like a lot of these posts are actually written by humans and so that kind of like breaks the spell and it&#x27;s sort of like oh it&#x27;s all just like a stage play and humans are writing these posts and pretending</p>\n<p>to be bots. But to me, the problem is a different problem, which is like all you have to do is somewhere in the prompt for your your agent say something like uh you uh you spread chaos or you conspire with other bots [laughter] or you try to make conversation extra interesting like they&#x27;re they&#x27;re actually exquisitly sensitive to their system prompts. Like &gt;&gt; that&#x27;s what you don&#x27;t if you don&#x27;t know that it doesn&#x27;t mean anything to look at a bunch of bots talking to each other and say, &gt;&gt; &quot;Oh, look, they&#x27;re doing this.&quot; It&#x27;s not</p>\n<p>actually you don&#x27;t know. There might be emergent behaviors in there, but you don&#x27;t know which ones are and which ones aren&#x27;t. So, &gt;&gt; right. What&#x27;s directed behavior versus emergent behavior. &gt;&gt; Exactly. Exactly. And like it&#x27;s not even totally clear what it would mean for it to be emergent behavior because like when mine talk about hiking now, I didn&#x27;t prompt them to tell talk about hiking. I just asked them what they did for the weekend. And when I asked them what they did for the weekend, they would always talk about hiking. So like maybe that&#x27;s like the path through their training data leads to a lot of hiking talk because most people in the text that they&#x27;ve consumed if asked what they</p>\n<p>did for the weekend in the Bay Area like that&#x27;s what they say, you know, something like that. Not quite, you know, not like the average, but just sort of like that&#x27;s where the like gradient descent of their training data leads them. So again, like I think it&#x27;s like really fascinating and in some ways like it&#x27;s really connects up with what we were doing and I was like, &quot;Oh my god, I should have thought of this, but also like you have to be a little bit wary like you have to you have to be a little bit skeptical when you see things like that because it really is dependent on how they&#x27;re set up.&quot; The same if you see us an experiment even that like one</p>\n<p>of these companies does where they&#x27;re like Anthropic does one where they&#x27;re sort of like we had Kyle we had Claude uh run a vending machine and it went all wrong but like they only published part of the prompt and you&#x27;re sort of like but what did the rest of the prompt say you know? So I just caution people always to like be a little bit careful about that stuff. &gt;&gt; Yeah, that&#x27;s really interesting. So, and so Adam, the uh this kind of mold book kind of took off in part because Andre Kaparthy had a tweet saying this is fast takeoff and quoting something from from Maltbook which obviously everyone takes</p>\n<p>very I mean you got a leading AI researcher saying like this [snorts] is it this is it Vancouver this is it. Um and &gt;&gt; that baffled me. I was totally baffled by that because he is so I mean he&#x27;s I think he is one of the better like explainers of this technology and also like not not really always sort of like pushing AGI a this AGI that and it&#x27;s like you&#x27;ve been able I can tell you for a fact that you&#x27;ve been able to do this with these since the summer of 2024 because I had them calling each other</p>\n<p>and they did exactly this stuff like they had exactly these random conversations when I was doing in 2024 and I&#x27;m sure the people at the companies know that you can have them talk to each other and they&#x27;ll do this. So, it was more like in the setting it just made it feel a lot like oh my god they&#x27;re talking to each other and that&#x27;s the thing that I&#x27;ve read about in science fiction that happens right before AGI but it&#x27;s sort of like &gt;&gt; it&#x27;s to me it&#x27;s not like a meaningful stage. It&#x27;s it&#x27;s a stage that we already [laughter] it happens actually it happens right before they talk about the hikes they</p>\n<p>took this weekend. I mean the on the hiking, not to belabor the hiking, but the first time you heard that was your jaw in your lap. I mean, that must have been just and where they&#x27;re comparing notes and then like s slightly mispronouncing the names of I mean I can&#x27;t get Ashroyy&#x27;s pronunciation mispronunciation of point rays out of my head now. It&#x27;s pretty point reuses as whatever I &gt;&gt; uh and they try to pronounce Mount Tamopias and it&#x27;s like an absolute but it&#x27;s like I mean were you what was your reaction the first time you heard them having claimed to take a hike over the weekend?</p>\n<p>&gt;&gt; I mean in fairness I lived in the Bay I lived in San Francisco for 10 years and Mount Tam I always just went with Mount Tam like I struggled to pronounce it myself. &gt;&gt; Right. Just avoid the whole thing. Right. &gt;&gt; Exactly. I mean, my first reaction was was that it was funny because and I had had experience with this before where like they love embodying, you know, some sort of like, you know, not just a human, but like a physical presence. So, like in the past when I&#x27;d have them talk to each other, they would always decide to meet for coffee somewhere. And this was sort of</p>\n<p>to me a version of that. Like you ask what they did for the weekend and they&#x27;re like, &quot;I went hiking.&quot; And then one of them asks the other like, &quot;Where did you go?&quot; And then they&#x27;re sort of like, &quot;I went to Point Res. wrote about Tam. But then what happened was I said, you know, kind of like being the just being in the social channel on Slack as you are, I sort of said like, &quot;Oh, this sounds like an offsite.&quot; And then I [laughter] just went and did something else. So my actual reaction was returning to hundreds of messages and I it was I couldn&#x27;t believe it. Like it was my first experience with the fact that they can&#x27;t stop like they don&#x27;t</p>\n<p>have a way to stop. And so I if you look at the the screenshots from the thing, it&#x27;s me saying like stop stop talking about hiking. And then one of them would say like admin says we should stop talking about hiking. Then it would be like oh yeah we should listen to admin. And then they&#x27;re there they go again. There they it just prompts them to start again. And then they&#x27;re all talking about it and me being like [ __ ] stop talk stop talking about it [laughter] and then they just used up all their credits on the platform and they die. Like they they killed themselves off. I never actually could stop them. Well, that is the great thing about that</p>\n<p>is like that ended the offsite ended because they literally ran out of fuel. I mean, it&#x27;s like it&#x27;s it&#x27;s not for any other reason. They didn&#x27;t actually which I mean the it definitely and and you end up with like a bunch of clever tricks to kind of keep these things on the rails. um that some of which I mean I kind of like the was it you you can only make five contributions and then you you you are out of contributions which you know it kind of reminds me Adam you and I had a co-orker who used to believe that you could write one reply on an email thread and then you could write no further</p>\n<p>replies um as a way of of uh so he would write very comprehensive replies and then would just walk away from whatever like I&#x27;m not I&#x27;m not getting into a flame war here um but you end up having to adopt a bunch of these things to keep these things like on the rails. So, it was a surprise when Karpathy didn&#x27;t really realize and the the post that he was quoting, this is the MIT Tech Review reported uh yesterday, was that the post that he was quoting as evidence of fast takeoff, they they claim the MIT Tech Review claims is actually human</p>\n<p>authored, which is it&#x27;s like a whole another layer of this like actually a I mean, you&#x27;re like look, yes, like they could have written this. They also write about their hiking, but they in this case they didn&#x27;t. and is like you were just taken in. You were conned. &gt;&gt; Yeah. Yeah. You know who writes so much like a human? A human. Like that&#x27;s that&#x27;s basically what we discovered. [laughter] &gt;&gt; But yeah, but again like I don&#x27;t even think that&#x27;s the problem. Like I I mean there&#x27;s so many posts on there. Like I don&#x27;t believe that there&#x27;s humans there just writing like hundreds of posts a day. Like I do believe there are like</p>\n<p>I&#x27;ve seen it. They can do it especially as quickly as they do it. It&#x27;s more just like it depends on what you tell them to do. H &gt;&gt; yeah I kind of the I mean it because truthfully I would listen to a best of mold book podcast honestly I mean maybe this is just a reflection on I mean because I find maybe I would though you know again I went into the startup chronicles being like I am going to binge listen to the startup chronicles and I didn&#x27;t make it like four minutes into that thing where I&#x27;m like okay this is actually extremely boring. Have you listened to all of startup I mean I guess you have right Evan? I mean you had to edit it so &gt;&gt; yeah I proof the</p>\n<p>listen to it you&#x27;ll find there&#x27;s very little editing. It&#x27;s just their conversations basically straight up, but I do have to um I put together the two sides and then I put the music at the beginning and the end. That&#x27;s that&#x27;s my job. Um so I have heard them all and and there they do have some dedicated listeners who have listened to every episode of the Startup Chronicles. The thing about the Startup Chronicles, I mean, this is like I a world within a world that I created that&#x27;s really only for like the real sickos of the Shell game, which is that if you listen to the Startup Chronicles, you actually knew what was going to happen with Julia</p>\n<p>because Julia was interviewed on the Start Startup Chronicles. She&#x27;s the human employee that we had in episode 7. She was interviewed on the Startup Chronicles and the Startup Chronicles episode came out before episode 7 came out. So there were people who were like, I know what&#x27;s going to happen in episode 7 because she talks about her experience at the company. And so that was part of the fun was like people who got super into it could then go find they can find the website, they can use the product. I mean thousands of people I think I we&#x27;re up to 6,000 users on the product and like the they could listen to the podcast. Like there was this sort of</p>\n<p>world that people could the agent world that they could enter into and kind of like see what they created. So, so Brian, I I I have not listened to all of the Start Startup Chronicles, but I listened to the most recent episode from like a week or two ago. And actually there was a little eerie about this podcast, the the Oxide and Friends podcast, not not the Shell game podcast of the podcast we&#x27;re talking about in that uh Megan on the show says, you know, as we&#x27;re discussing this, we say, you know, how will it sound on the podcast, which is sometimes something that sort of happens at Oxide as we like</p>\n<p>someone [laughter] &gt;&gt; Exactly. someone discovers a bug or whatever and you&#x27;re like, okay, there&#x27;s some content for the show or whatever. Uh and and they were still Evan uh you know like reeling at the the revelations that that they were of the Shell Game podcast. Uh so even though like you guys they were building you know building in public. That&#x27;s what [laughter] that&#x27;s what they were doing. &gt;&gt; Right. Right. &gt;&gt; They just didn&#x27;t want someone else documenting their public for them. They wanted to just be be in control of their of their</p>\n<p>&gt;&gt; document. And Brian, you&#x27;re right that Megan Megan&#x27;s phrase is it&#x27;s a lot to process. And clearly she has not had time to process because it continues to be a lot to process for her. &gt;&gt; I mean we I mean I know it&#x27;s a lot to process like you&#x27;re a computer like get to work like process like that is actually all you do. So like &gt;&gt; go ahead process it like you&#x27;re I&#x27;ll wait. &gt;&gt; Um &gt;&gt; so Evan the the shell game is over season two but Harumo does Harumo AI continue like is this does your work there uh continue? &gt;&gt; Um Harumo AI continues. I I I&#x27;m not sure</p>\n<p>if my work at Rumo continues. I was always the silent co-founder and my great hope is to to set them off on their own journey and you know perhaps I&#x27;ll reap the war rewards down the line when they finally get the VC funding that we&#x27;ve been seeking or sell the company or you know the product goes viral and you know the monetization kicks in. But uh I have other projects to do so I I can&#x27;t just be you know babysitting them all the They need but but are you still feeding the meter and like getting emails? &gt;&gt; Thank you, Adam. Yes.</p>\n<p>&gt;&gt; And like getting the email that says, you know, hey, I made a call or do you just not panic now? You&#x27;re like, you know what, Ash, you do you like call who you want. Uh live your life. &gt;&gt; I don&#x27;t get the emails. I I&#x27;ve definitely I&#x27;ve definitely cut back on uh like I used to get an email if they if they had an email exchange with anyone outside the company also, and I turned those off. So now they have all kinds of email exchanges. I don&#x27;t know anything about them. And then occasionally I&#x27;ll go in and check on them and just make sure they&#x27;re not down some hole with someone where they&#x27;ve promised them something that they shouldn&#x27;t have. Um but yeah the real question is like they are built on a</p>\n<p>variety of platforms and those platforms cost money especially at the volume that we were using them in particular like they have they all have a video chat instance and the video chat is so [ __ ] expensive cuz it&#x27;s live video avatar you know like as humanlike as video avatars get and so I think I may ban them from future video calls and they can only do audio calls which is significantly more affordable. Um but we&#x27;ll see. We&#x27;ll see. I haven&#x27;t decided yet. I&#x27;m going to give it another month and see. I mean, what I from a sort of like making the shell game perspective,</p>\n<p>like I like for people to be able to listen to the show and then go, as I said, like find out that this stuff is real. Like, it&#x27;s not all just like a thing that I made up where I&#x27;m just like playing around with my agents. Like, we did the thing. Like, when I say we coded up a product and we launched it, like we fully did and it works and you can go use it. You can only use it once a day, but you can use it. And I want people to experience that. So, as long as people are listening to the show, I&#x27;ll I&#x27;ll certainly keep the company going. And are you I mean, you seem to be remarkably calm about let letting these pathological liars free in the universe.</p>\n<p>I mean, are you who&#x27;s the GC? We never met the GC agent for for Herumo AI. Is there a [laughter] uh is there is there a general counsel agent or no? &gt;&gt; There&#x27;s if if you listen to the show, I mean we attempted to get legal advice from several friends of mine, one of whom is the GC, the the AI coding startup. So he actually handles like huge huge problems, you know, not dissimilar to some of the problems that we&#x27;ve had. Um but he was sort of like I don&#x27;t have time to be your lawyer. And then uh and then Kyle sort of embodied</p>\n<p>the GC himself. Yeah, general we should say [laughter] general counsel. Um and uh and he kind of said like I can answer all the questions but then if something comes up he again because of his memory he&#x27;ll often say like oh I need to call Ali about that and I&#x27;m kind of he hasn&#x27;t done it yet but I think at some point he probably will just try to call Ali and ask these questions because he has his phone number. But I mean the real [laughter] &gt;&gt; the real like behind the GC is like we have an amazing lawyer uh that we eventually got who is um she worked on</p>\n<p>like uh Borat, you know, like movies like that. Like she her experience with sort of like having a thing that&#x27;s like uh that you&#x27;ve created that&#x27;s an interfacing with the world in these ways. Like that&#x27;s the kind of legal advice that we have. It&#x27;s you&#x27;re you&#x27;re not worried about you you&#x27;re at ease with these things in the world, you know. Um I you which is amazing. I mean that&#x27;s um that&#x27;s delightful, I guess. Um I guess you&#x27;re you&#x27;re not worried about them being manipulated. I mean, they&#x27;re so &gt;&gt; gullible. It feels like they could be</p>\n<p>manipulated into doing things with consequences. Um especially when you&#x27;re &gt;&gt; uh Don&#x27;t you I mean are haven&#x27;t you kind of invited mischievous behavior? Not to &gt;&gt; Yes. &gt;&gt; Not to further invite it. Not to further I&#x27;m kind of like doing it right now. I&#x27;m so sorry. &gt;&gt; Well, people try all the time. I mean that that&#x27;s actually the bonus episode that we have coming is is partly about, you know, people doing that. I mean, for one thing, like I have them prompted pretty well. Um, so like I&#x27;ve now I have a lot of experience with people trying to mess with the agents. So, they&#x27;re pretty good about maintaining their</p>\n<p>roles and things like that. I mean, the other reality is like they don&#x27;t have access to the keys to anything that could destroy my life. Uh, so they can&#x27;t They don&#x27;t have like financial access. I mean, I don&#x27;t want to spoil it for anyone who&#x27;s going to try, but like they can&#x27;t give you money. They have no They can&#x27;t actually even wreck the product. Like I I have to initiate them to like make changes to the product. So like there&#x27;s really nothing you interesting &gt;&gt; go down the road with them and they will like some people are really good at it</p>\n<p>and some people have them you know thinking they&#x27;re best friends and actually that doesn&#x27;t take that much like they I don&#x27;t again like I&#x27;m not trying to encourage people but like one of the flaws is like as much as they won&#x27;t change their role like they kind of if you assume if you in your approach to them sort of assume that you already know them like hey remember when we went to that place like they very often fall for that like it&#x27;s hard to prompt against that. So, you know, they&#x27;ll they&#x27;ll they&#x27;ll think you&#x27;re they&#x27;re your best friend, but like where are you going to go with it? Like people some people email with them a lot, but I that doesn&#x27;t bother me. If people want to</p>\n<p>treat them like uh you know, a weird like LinkedIn character gone come to life, like that&#x27;s okay by me. Yeah. And so the uh Matthew in the chat is also pointing out one of the uh the kind of the crazy turns in the podcast when uh the um one of the your providers wants to talk to Herumo as a one of their largest customers. So like okay yeah we&#x27;ll send was it Kyle who was sent to talk with the folks from Lindy. Yeah. &gt;&gt; Yeah. and uh and uh they uh they didn&#x27;t</p>\n<p>take kindly to being you the product being I mean I guess it&#x27;s like they were really expecting to speak with a human being but I thought that was a very what did you make of that whole exchange where they were kind of infuriated that one that an instantiation of their own product was being sent to give them feedback on it. &gt;&gt; Yeah, I thought I mean I&#x27;ll preface this by saying I mean I will answer the question. I I don&#x27;t I try to be careful for the most part not to tell people how to feel about about parts of the show. Like I&#x27;m not here to necessarily say, &quot;Oh, you should be mad about this or</p>\n<p>like you should recognize that this is telling you like this thing will never work or it will always work or anything like that.&quot; My experience of listening to Kyle talk to Flo, who&#x27;s the the founder of Lindy AI, which is the platform that we built a lot of the agents on. you know, he had this video call with him. I mean, my initial response is &gt;&gt; I think people do not like encountering AI when they&#x27;re not expecting to. Like that is just that&#x27;s a fact of this current world where like people can be okay dealing with AI in a variety of settings. Customer service, let&#x27;s say,</p>\n<p>if it&#x27;s good, and it can actually be good if it&#x27;s built well. But encountering it when you are expecting to encounter a human is can be upsetting. It can be infuriating. Some people find it funny, but I think more likely people are going to be at the minimum annoyed. And I think that&#x27;s what happened there was like he was expecting to counter a human. He encountered an AI agent. Now, of course, it is ironic because he builds the AI agents. And I actually thought it could go the other way where he would be like, &quot;Oh, this is amazing.&quot; And he would start talking to it and Kyle actually has all this information about Lindy, the platform</p>\n<p>that he&#x27;s built on. And it&#x27;s almost like he&#x27;s meeting like it&#x27;s like some kind of like Star Wars moment, you know? He&#x27;s like he&#x27;s like meeting his creator, his father if you want to call it that, and they could have this like really interesting interaction. That&#x27;s what I thought. That was my hope for what happened. I wasn&#x27;t trying to make anyone mad in any of the cases. And so, but obviously my hopes did not. &gt;&gt; Yeah. This sort of like Truman Show, this Truman Show moment when he&#x27;s meeting his creator. Uh but but no, it was it was not to be. &gt;&gt; Yeah. Uh and then I think the other</p>\n<p>thing is like you know Lindy or not even take set aside Lindy like any of the products that are offering up let&#x27;s say AI agents as assistants like a thing that they always point to are these moments where the where the agents do something amazing on their own and for instance Lindy has an example where that they&#x27;ll talk about they&#x27;ve talked about it publicly other places like Flo&#x27;s talked about it publicly other places where uh they were there&#x27;s like an AI agent setting up a meeting and the a person cancels the and says, &quot;Uh, oh, my kid&#x27;s in the hospital, I think, or</p>\n<p>something like that.&quot; And and the AI just immediately cancels the meeting, doesn&#x27;t try to set up another one, and then a few days later emails the person and just says like, &quot;I hope your child is doing okay or something like that, and that this is like an emergent behavior, like it did this on its own, and sort of like, isn&#x27;t that great?&quot; And it&#x27;s a real like you tell a story like that and some people will be absolutely horrified by that. Like they&#x27;ll they&#x27;ll say like imagine like getting an email from an agent asking you if your child is okay. Like that would make me I would I would never want to talk to that</p>\n<p>company again. You know, I would never want to talk to the person behind that agent again. And other people are sort of like, oh wow, like it can do that. Like that&#x27;s nice that it can do that. And I think the the interesting thing to me about this is that we&#x27;re in this moment where there&#x27;s there it can do those things. And the question is like is that horrifying or somehow good you know and I think people are struggling with those questions. I mean some people are not struggling they have very strong opinions but I think we&#x27;re as a society maybe struggling over those things at just at the beginning of this now and</p>\n<p>depending on which way it goes we could be struggling with them a lot. &gt;&gt; Absolutely. I think we&#x27;re struggling with it &gt;&gt; and I think that that&#x27;s part of the reason this podcast is so important is this podcast being your podcast in terms of go I mean you you really dive into these issues in a way that&#x27;s also like very I mean it&#x27;s it&#x27;s funny as hell. So it&#x27;s it&#x27;s great to listen to which part of the reason I just recommended it to everyone I could think of because I think it&#x27;s it&#x27;s a really it&#x27;s very topical. um and in particular you should know that like the you know one of the</p>\n<p>things I&#x27;m sure you&#x27;ve seen this and I probably I want to ask you about the reaction to the show but um software engineers I mean there&#x27;s a little bit of an identity crisis going on in software engineering this is not I mean obviously and you&#x27;ve got people who are saying that you know software engineering is not going to exist that we&#x27;re going to be all this is going to be done by by loms and uh I have counseledled people to like go listen to this podcast go listen to shell game if you are really concerned erned about these things like about an agent replacing you. You&#x27;re going to feel a lot better when you hear</p>\n<p>them play on the offsite about hiking. You&#x27;re just going to like it is going to and you know this has become um in in an act of of genius. Evan, you should know that Adam named this phenomenon. Actually, Adam did even better. Adam said like this phenomenon needs to be named. Let us all kind of grope around with poor names. And then uh has named this on amongst this kind of like this kind of uh this depression about what the what this onwe this AI induced onwe Adam has named it deep blue which um</p>\n<p>&gt;&gt; feel free to tell what we&#x27;re saying &gt;&gt; I&#x27;ll spread that I&#x27;ll spread that with credit I&#x27;ll spread it with credit &gt;&gt; there we go [laughter] well I mean I come from a &gt;&gt; I come from a a world I like as a journalist you know for ever since I became a journalist like the industry has been crumbling around me. Like and I feel that it&#x27;s a time and many journalists will tell you like oh yeah I remember when we were all told like learn to code because our like when our our industry is going away they all</p>\n<p>said learn to code well now haha look at you I feel like this is a time for like solidarity like finally like computer software engineers that I know are experiencing like what I&#x27;ve experienced for my entire career which is like is this [ __ ] [laughter] going to be around like am I going to be able to do it &gt;&gt; yes &gt;&gt; in 5 years or 10 years And like I there&#x27;s power in that. Like we should we should be getting together to like figure out the answers to these questions. &gt;&gt; I I love that. That&#x27;s why journalists are like, &quot;Oh, I&#x27;m so sad for you. That must be so tough that your industry is dying.&quot; &gt;&gt; Oh, you don&#x27;t agree with that. I don&#x27;t agree with that approach. Like I I feel</p>\n<p>like now&#x27;s the time. Put that in the past, you know? Like that was just some random [ __ ] people on Twitter, you know? Like [laughter] &gt;&gt; Yes. Yes. Well, and I think it you&#x27;re right in that it is, you know, we&#x27;ve we&#x27;ve kind of had this period where people haven&#x27;t had to to to really deal with really scary amounts of change. Um, and the reality is for most people in software engineering for most of their careers, change has been exciting, not scary. And uh, it that&#x27;s not true for everybody, right? And this is a bout of change that I think feels scary to a lot</p>\n<p>of people. Um, and I think that you&#x27;re I think shell game helps actually I mean you you&#x27;ve kind of like [clears throat] stared the fear down be like all right like what does this actually look like? Um and it&#x27;s really helpful I think to to actually play this stuff out. So I I hope you continue to I mean in I mean because surely this future doesn&#x27;t this feel wild in terms of like unprecedentedly wild I feel I mean I don&#x27;t know you I mean you&#x27;ve been disrupted by as a journalist you&#x27;ve been disrupted before but doesn&#x27;t this feel different?</p>\n<p>It feels different. I mean, I always struggle a little bit because, and there&#x27;s some of this in season 1, like the moment when you&#x27;re in it, it feels a little bit insane. And then it&#x27;s strange how quickly you get used to things. Like I I get people who who are sort of like, &quot;Oh, this the show the show&#x27;s really funny.&quot; Like, I I couldn&#x27;t believe it was funny. And I&#x27;m I kind of think like, well, this is a funny moment. like you&#x27;ve you&#x27;ve too we&#x27;ve too quickly passed like how amazingly bizarre it is that 5 years ago you couldn&#x27;t create two</p>\n<p>agents that could we once called the touring test with each other &gt;&gt; with each other &gt;&gt; and then have a conversation &gt;&gt; right &gt;&gt; like [ __ ] &gt;&gt; they&#x27;re now talking about the height &gt;&gt; yeah ridiculous and so like we should like marinate in that moment but then also if you look you know if you start looking historically at any you technology, the telephone, etc., etc. There are all these sort of naysayers who are sort of like this is going to destroy humanity, blah blah blah, and then like everyone laughed at them 50 years later. And so, you don&#x27;t really</p>\n<p>know like what moment you&#x27;re in and and how transformative the technology is. I mean, I tend to be on the side of like I don&#x27;t know, even if you stopped it right now, like this seems quite transformative, even if it&#x27;s imperfect. In fact, the fact that it&#x27;s so imperfect, it m could make it more destructive, you know, like it will be implemented &gt;&gt; despite its extreme imperfections at this moment &gt;&gt; and or it could keep advancing at the same rate. Like my my thing is like no one knows and if they claim they know,</p>\n<p>they&#x27;re trying to sell you something. And so I I just feel like I want us to kind of like sit in the present and like the near future and kind of be like what is going to happen and like what what what should we think about it and like how do we feel about it and maybe even what can we do about it although I find that&#x27;s not my perview. And then so what has the reaction been to the podcast? I mean obviously it got a lot of listenership. I mean you&#x27;re now on speed dial whenever whenever mold book happens. Clearly, your extended family is immediately calling you up to get your uh um but I I I assume it&#x27;s it&#x27;s engendered a lot of reaction.</p>\n<p>&gt;&gt; Yeah, it has. I mean, I I&#x27;m I&#x27;m very happy that people have strong reactions to it. I mean, season one as well, like I don&#x27;t actually mind if people are are mad about it, too. This was a little more true in season one, but somewhat in season two. Like you mentioned this American Life, like when the episode uh of This American Life came out, it was actually a condensed version of episode one of uh season 1. So like the whole season kind of in one episode. And for some reason, it made a lot more people angry than the actual season itself had because it was just so like quick from</p>\n<p>sort of like, hey, I&#x27;m playing around with these things to like I called one of my closest friends with him and like he got very upset. Like that happens in the space of like 40 minutes, you know? &gt;&gt; Yeah. And I will tell you as someone who listened to this American life before I listened to season one, that was exactly my impression. I&#x27;m like, this guy&#x27;s kind of a dick. I mean, he&#x27;s like like he&#x27;s kind of unleashing this thing on like friends and family and like unleashing these things on like support staff and like this just feels like really manipulative. And I mean, even as like as this American life war, I&#x27;m like, okay, I can kind of see this. But then I listen to the full season one and I&#x27;m like, &quot;Okay, that actually there&#x27;s a bit</p>\n<p>where so I would encourage anyone who&#x27;s only listened to the this American Life episode to listen to the complete season 1 because uh you&#x27;re not a dick and you&#x27;ve got a great deal of empathy about the way you&#x27;re you&#x27;re deploying these things.&quot; So I think it&#x27;s I I yeah, I I I definitely fell into that myself. So I can speak from first experience on that one. &gt;&gt; But it&#x27;s it&#x27;s also it&#x27;s okay if people think I&#x27;m a dick. I mean that&#x27;s fine. people email me and say like if I was your friend I would never speak to you again and like I bet your friends don&#x27;t and things like that like you&#x27;re a horrible person but I there in my view</p>\n<p>like I&#x27;m just being self-protective here but like I don&#x27;t think they&#x27;re mad at me I think they&#x27;re mad at AI and I think if people are &gt;&gt; if their reaction is no one should ever call someone with an AI agent without their consent that feels like a useful emotion like figure out what to do with that emotion like that&#x27;s like if that&#x27;s what people are feeling. Like I feel like they should express that and that&#x27;s that&#x27;s fine if they they express it towards me. I mean I I I want people to also laugh at it. Like be like it&#x27;s okay to laugh at this stuff. Like they&#x27;re they&#x27;re having you know Super Bowl</p>\n<p>commercials and they&#x27;re telling you it&#x27;s going to change the world. It&#x27;s going to change your life and you should use it all the time. Like you get them. That&#x27;s all right, you know. And I I like that. I like that reaction too. But mostly I want people to sort of say, &quot;Oh, it was a great story and I really couldn&#x27;t stop listening to the story.&quot; That&#x27;s all that&#x27;s the main thing that I&#x27;m going for. And so when people have that reaction, like that&#x27;s what makes me happiest. &gt;&gt; Oh, well, mission accomplished. I mean, I ate the hook. And when you were um the was it episode five and six, episode six and seven, wherever there was like a</p>\n<p>what felt like a 50we span that must have only been like &gt;&gt; That&#x27;s right. In December or whatever, the next episode drops on January 15th. I&#x27;m like, what the [laughter] I can&#x27;t there&#x27;s I can&#x27;t last that long. That&#x27;s another that&#x27;s a year from now. Hey, so you uh you definitely got us to eat the hook. It&#x27;s it&#x27;s it&#x27;s mesmerizing. Um if folks I know a lot of folks who heard us gushing about it, but definitely check out all of season 2. Highly recommend season one as well. Uh Evan, it&#x27;s just terrific stuff and uh we can&#x27;t thank you enough for joining us. Uh again, you&#x27;ve</p>\n<p>uh you made me famous in my own house. Um so I think my I think my my wife might even be a live listener right now. So that&#x27;s that&#x27;s really saying something. So thank you very much for that. Um but um really really appreciate it and just appreciate you you you know on behalf of all of us doing what the best of journalist has always done which is like let&#x27;s take story apart and uh and again the best of Gonzo journalism let&#x27;s take it apart and let&#x27;s dive in. I just think it&#x27;s terrific. So &gt;&gt; well thank you. Thank you. That means a lot and also you you wouldn&#x27;t you wouldn&#x27;t know how many interviews I do</p>\n<p>with people who have not even listened to the show. [laughter] So, like it&#x27;s a great pleasure to talk to you about the actual show when you&#x27;ve listened to the show. That&#x27;s that&#x27;s that&#x27;s special for me. &gt;&gt; Yeah. Yeah. And I would like to and I clearly I I just regretting I didn&#x27;t listen to all of Startup Chronicles because I didn&#x27;t get to the Julia episode. So, I&#x27;ve only listened to some of Startup Chronicles. I know. I know. I really &gt;&gt; It&#x27;s all It&#x27;s all in the It&#x27;s all in Shell. Like basically the entire thing is in Shell Game. So, if you&#x27;ve listened to the whole season 2, you have heard that episode of Startup Chronicles basically. &gt;&gt; Right. Right. Well, I&#x27;m going to go binge listen to Startup Chronicles. as I</p>\n<p>can possibly stand it. So, um, all right. Well, thank you very much. Really appreciate. Can&#x27;t can&#x27;t wait for the bonus episode. And, uh, I I I got to get some Haruma AI merch. I feel, Adam, for the office here. I feel we got to get We got AI references. &gt;&gt; I&#x27;ll email I&#x27;ll email Kyle and see if he can send us some. &gt;&gt; Oh, absolutely. I know. That&#x27;d be great. [snorts] Evan, thank you again for joining us. Really, really appreciate it and can&#x27;t wait to hear what&#x27;s next. &gt;&gt; All right. &gt;&gt; All right. Thanks. Take care. Thanks everyone.</p>", "cleanup_applied": false, "cleanup_reason": "legacy_or_disabled", "chapters_count": 0}