{"video_id": "qSiiatD_tIg", "title": "What (Really) Happens When You Ditch Your Smartphone? | Cal Newport", "link": "https://www.youtube.com/watch?v=qSiiatD_tIg", "published": "2026-02-02T07:00:00+00:00", "summary": "Cal Newport discusses what really happens when you ditch your smartphone, and he assesses the internet's latest self-help sensation in episode 390 of the Deep Questions podcast.\n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\n Everyone knows that excessive smartphone use can be harmful. But the question we don’t ask enough is what the advantages are of *not* using these devices. In the ideas segment, Cal examines the testimonials of four subjects who spent significant time without phones, to learn what they actually experience. Then, in the practices segment, he dissects the latest viral online self-help sensation to see if it holds up or is just fluff. Finally, in the Q&amp;A segment he tackles a surprising (and distressing) way in which technology plays a role in the violent ICE raids happening in Minnesota.\n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\nJanuary Book:\n\nThe Animated Man: A Life of Walt Disney (Michael Barrier)\n\nLinks:\nGet a signed copy of Cal’s “Slow Productivity” at https://peoplesbooktakoma.com/event/cal-newport/ \nCal’s monthly book directory: bramses.notion.site/059db2641def4a88988b4d2cee4657ba?\nhttps://www.youtube.com/watch?v=kzXOyW8Zumg\nhttps://www.youtube.com/watch?v=gh5CYvi5E40\nhttps://www.youtube.com/watch?v=C-Iewo7zUFo\nhttps://www.youtube.com/watch?v=5FI1gP_K5K0\nhttps://www.youtube.com/watch?v=FshYuO6Opwk\nhttps://x.com/thedankoe/status/2010751592346030461\nhttps://prospect.org/2026/01/27/ice-greg-bovino-minneapolis-one-battle-after-another-sean-penn/\nhttps://www.youtube.com/watch?v=elF0YmsCHvQ\n\nThanks to our Sponsors: \n\nThis episode is sponsored by Better Help:\nhttps://www.betterhelp.com/deepquestion\nhttps://www.rag-bone.com (Use code “DEEP”)\nhttps://www.calderalab.com/deep\nhttps://www.shopify.com/deep\n\n0:00 What happens when you ditch your smartphone\n3:07 Ideas segment\n31:53 Assessing the Internet’s Latest Self-Help Sensation\n53:17 What do the ICE raids in Minnesota teach us about technology and its impacts on our society? \n1:08:17 Cal gives his weekly reading update \n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<h2>What happens when you ditch your smartphone</h2>\n<p>Those of us in the technology criticism space talk a lot about the harms created by smartphones. Now, we all know what these are because we live with them. I&#x27;m talking about constant distraction or a distorted view of the world or the dumbing down of our brains or the social isolation or the gambling, the porn, the videos of random people fist fighting. None of this is good. We all agree about that. But here&#x27;s an idea that I&#x27;ve longed to believe. It&#x27;s not enough to just list the harms. The problem is that phones also have legitimate uses. And the harms</p>\n<p>when considered in isolation don&#x27;t really seem so bad in the moment. Your mind might very reasonably ask, &quot;Is anything really all that terrible going to happen if I look at Tik Tok for a little bit during my bus commute home?&quot; So, it becomes hard to convince your brain to put in the effort required for sustained behavioral changes. And this is why we tend to fall back into our old phone habit. So, what would work better? I think we need to also explore the benefits of a life without all of this digital noise. We&#x27;re wired to find</p>\n<p>motivation in positive images that seem very desirable. This can inspire much more regular action over time than simply listing harms that you want to avoid. What we need in this phone conversation, therefore, is a better understanding of what goes right when you&#x27;re away from that device. So, that&#x27;s what we&#x27;re going to explore today in our idea segment. We&#x27;re going to hear from real people who actually ditch their smartphones describing what their life actually feels like. All right. Then in our</p>\n<p>practices segment, we&#x27;re going to dissect a viral essay that has been read online an absolutely absurd amount of times over the past few weeks. I think something like 170 million times on X alone. The article is titled How to Fix Your Entire Life in One Day. And it&#x27;s written by the popular YouTuber Dan Co. So last week on the show, we debated whether or not the internet was helping our ambition or hijacking it. So this is a great case study of that discussion. So we&#x27;ll look closer at this essay. We&#x27;ll pull out the big ideas and then we&#x27;ll try to assess at the end. Is this something that&#x27;s going to make our life</p>\n<p>better or is it just clickbait bro nonsense? Then finally during the Q&amp;A segment I&#x27;m going to touch on a hot button issue, the ICE immigration crackdown raids in Minnesota. And as I&#x27;ll explain in more detail, I don&#x27;t normally talk about issues that don&#x27;t have a strong connection to technology criticism, but in this case, I think there is a strong connection to technology. And so buckle up, we&#x27;re going to get into that topic as well. So clearly we have a lot to cover today. As always, I&#x27;m Cal Newport and this is Deep Questions, the show about the fight for</p>\n<p>depth in a distracted world. And we&#x27;ll get started right after the music. All right, so the goal of our idea segment is to figure out what it&#x27;s really like to live without constant</p>\n<h2>Ideas segment</h2>\n<p>access to a smartphone. Now, to accomplish this goal, we had to find people who ditched their smartphones and who reported what it actually felt like. Where can we find such subjects? YouTube. Our crack research team here at the Deep Questions podcast tracked down four different people who reported on YouTube what it was like to live for various durations without their phone. So, here&#x27;s the plan. We&#x27;ve pulled some clips from these testimonials and we&#x27;re going to go through these clips one by one and we&#x27;re going to pull out the benefits that these subjects seem to be</p>\n<p>describing, right? Um, if you&#x27;re listening instead of just watching, you&#x27;ll actually be able to see these videos on the screen. And if you&#x27;re uh you might want to jump over to the YouTube version because, you know, these are some of them are actually in kind of scenic locations, so it&#x27;s sort of fun to watch, but you&#x27;ll be able to hear it all as well if you&#x27;re just a listener. Um, and then what we&#x27;re going to do is we&#x27;re going to make a table as we go along of the benefits. And when we&#x27;re done, we&#x27;re going to analyze what have we learned about the benefits of phone free living. And we might even do some thinking about can we get closer to that even if we still can&#x27;t get rid of our phone all together. All right, so we got a lot to do here.</p>\n<p>Let&#x27;s start with our first subject. Our first subject of phone free living is a young man named David Boland. Uh, as far as I can tell, he&#x27;s a 30-something YouTuber who last year went on a week-long trip without a smartphone and then immediately recorded a video to describe what it felt like. Um, this is the least extreme of all the phone freedom experiments that we&#x27;re going to encounter in today&#x27;s idea segment. So, I thought it was a good place to start. Uh, one week is not that long, but it&#x27;s still long enough to get a sense of, hey, what changes when you don&#x27;t have a phone? Uh, for those who are watching instead of listening, you&#x27;ll notice he&#x27;s</p>\n<p>sitting in a chair in the middle of a field while he talks, which I don&#x27;t know, seems somehow appropriate for this clip. There&#x27;s also good background music as well. All right, so I got three clips I want to play from David Bolan. Um, Jesse, let&#x27;s start with the the first one. &gt;&gt; That [music] that that that uh I was recently away in the woods for 5 days with no technology, no phone, no internet, just lovely campfires and lovely conversations with lovely people.</p>\n<p>We used the wood from the forest. We had to [music] dig holes in order to use the toilet. There were no toilets as we know it. [music] And it was an incredible time. And I didn&#x27;t [music] feel any anxiety. I mean, any crazy [music] amounts of anxiety. &gt;&gt; All right. So, there we go. Uh, the first clip we hear him talking about anxieties is reducing and him having to dig a hole for a toilet. He really</p>\n<p>emphasized that, Jesse. I guess that&#x27;s that&#x27;s a key part of that experience. All right. Um, he elaborates then on what he meant by anxiety going down. So, let&#x27;s let&#x27;s hear this second clip. &gt;&gt; The most profound thing was that while I was away, while I was off the phone, I just wasn&#x27;t thinking about people that weren&#x27;t in front of me for the most part. Maybe I had a fond thought about somebody or some memory or whatever, but fundamentally, I was dealing with what [music] was in front of me. And the moment I went back online, I saw all of these messages</p>\n<p>about things that were kind of trivial. &gt;&gt; All right. So interesting here, right? So when he talked about his anxiety being reduced specifically, he was saying when he has his phone, he&#x27;s often thinking about other people who aren&#x27;t there and what they might be thinking and what they might be thinking about him or what they&#x27;re not thinking about him. It gives you enough of a sense of sort of fake connection to lots of people that it&#x27;s hard to shake your social stimulation circuits in your brain and it makes him anxious. And when he was away from his phone, those thoughts about what are other</p>\n<p>people thinking really reduce because he was just caring about the people who were actually right there. And when you&#x27;re just dealing with people who are actually right there, things can be a lot less stressful. Um Jesse, I know we had a third clip. I&#x27;m actually going to skip that third clip because I think we got to what we need from David Bolan. Um, I&#x27;m going to load up on the screen now our table of benefits of phone-f free living and we&#x27;ll add to it reduced anxiety. I&#x27;m going to say that is the main that&#x27;s sort of the main lesson from David Boland is that he was no longer so worried about what other people were thinking and what other people were</p>\n<p>doing. He could be more present and when you&#x27;re more present you are less anxious. All right, so that was our first subject. We&#x27;ve already learned something. Our second subject, I don&#x27;t know his actual name but his YouTube handle is wheezy waiter. uh he&#x27;s in his 40s, so he&#x27;s more like Jesse and I&#x27;s age. Now, he did an experiment that was more extreme. He quit his smartphone for a year, so he really wanted to see what an extended period of life was like without his smartphone. And the what&#x27;s useful to us is he did a video log along the way. Hey, here&#x27;s what I&#x27;m feeling this day.</p>\n<p>So, he was doing a real time logging. The clip I want to play for you now actually is from very early in this experiment. I think this is day three of his experiment. and he&#x27;s already having very significant observations. So Jesse, let&#x27;s play that clip. &gt;&gt; So far, not really that hard at all and enjoyable. I&#x27;ve been reading more. I&#x27;ve texted back and forth with people. It&#x27;s a little bit more clunky with this thing. I haven&#x27;t really been leaving the house, so it hasn&#x27;t been that much of a challenge, but I&#x27;m using social media way less. The thing that&#x27;s constantly happening is I&#x27;ll want to look something up. Someone will mention a celebrity and</p>\n<p>be like, &quot;What was that person in?&quot; Or I&#x27;ll get an idea for a video and I&#x27;ll want to Google what&#x27;s already out there. Uh-oh, now you know my research secrets. I use Google. I have prevented probably like 50 rabbit holes I could have gone down and what I did instead have my own thoughts and those thoughts are less chaotic and stressful. My mind is able to focus on the ongoing conversations I&#x27;m having with people in my life rather than the ongoing conversations I&#x27;m having with everything happening in the world. &gt;&gt; All right. So, I think there&#x27;s some really good new observations there. So, he uh he was emphasizing that when he had his phone, it made his brain more</p>\n<p>chaotic, right? because you had this sort of feedback loop where as soon as you had a thought, you could actually follow that thought by googling it or going down some sort of digital rabbit hole and then you jump back to what you&#x27;re doing and back to another rabbit hole. And he didn&#x27;t realize the chaos of that cognitive space until he actually stepped away from his phone. And what did he find when that chaos had been dissipated that he could focus on whatever was happening around him? He talked about conversations where he could be fully present in the conversation, not thinking about what else do I need to look up or what thoughts is this</p>\n<p>conversation spurring that I need to chase. He could just be there in the world. He felt less frenetic. I think this is just explaining a uh a less busy mind that then allowed him to be there for everything else in a way that he hadn&#x27;t experienced in a long time. So after only three days, he was spending much more time doing things that were meaningful to him. So Jesse, I&#x27;m going to add this. If we bring up our table again, I&#x27;ll add this as our second benefit to phone free living. More time engaged in meaningful activities. All right, so we&#x27;re making progress</p>\n<p>here. Uh we&#x27;re going to move on now to our third subject. His name is Nate O&#x27;Brien. I think he&#x27;s the youngest of the people we&#x27;re going to hear from. He was uh in his mid20s when he recorded this video which was about a year ago. He was a popular personal financeoriented YouTuber. He actually left the medium a year ago and I think he just announced that he&#x27;s moving into a cabin in the woods that&#x27;s off the grid which is interesting. But when he talked about why he&#x27;s doing that, one of the big things he cited actually was his phone. And so I think this experiment he did with phone free</p>\n<p>living actually had a real impact on him. Anyways, uh his experiment was 30 days without his phone and I&#x27;m going to play a clip here where he talks about an interesting benefit of that experiment. &gt;&gt; This myself that like when if I don&#x27;t have any downtime, if I don&#x27;t have any boredom and there&#x27;s no moments for me to have like this creative kind of like mind wandering thinking about stuff, I don&#x27;t really feel good when I don&#x27;t allow myself to do that. And so this is the biggest thing that I&#x27;ve learned from not having my phone on me is that it allowed myself to be bored. It allowed</p>\n<p>myself to have that downtime and then also to to recognize things that maybe I wasn&#x27;t aware of before. Like, &gt;&gt; so this is really interesting. I hadn&#x27;t thought about this benefit before, but it was kind of profound to hear it from someone, especially someone who probably because he&#x27;s young, has probably never had any substantial quiet time alone with his brain since he was, you know, eight or nine years old because his whole life has been defined by the digital. And when he didn&#x27;t have his phone, he had downtime and boredom, right? Where it&#x27;s just my mind wandering. And he said, &#x27;Wow,</p>\n<p>I really felt myself once I let my mind actually just be bored and wander. Like when his mind was constantly having to be engaged, it was almost like you could imagine there&#x27;s a scrim between you and your internal definition of yourself. This is probably because when your mind wanders, that&#x27;s where you reflect. That&#x27;s where you integrate information and make sense of it. That&#x27;s where you update your understanding of yourself and the world around you. Without these regular occasions for contemplation, you basically become an NPC that&#x27;s just bouncing one viral content capsule after</p>\n<p>another off of yourself and throwing it towards other people. So, letting his mind actually wander and think and make sense of things on its own under its own steam allowed Nate to really feel like himself. So, let&#x27;s add this Jesse to our table here. This will be our third element. more mind wandering which helps you feel like yourself. That&#x27;s going to be our third benefit of phoneree living. All right, let&#x27;s move on now to our fourth subject here. I love this name. His name, Jesse, is Bjorn Andreas Bull Hansen. Uh he is the subject that will</p>\n<p>probably remind most of you the most of me. I would probably you&#x27;re like, &quot;Oh, that&#x27;s like a cow type character in the sense that he&#x27;s a bearded Scandinavian who hasn&#x27;t phoned a owned a phone in years and spends much of his time surviving in the wilderness.&quot; This guy&#x27;s awesome, Jesse. He makes great videos. It&#x27;s like him in the woods making a fire to like kill the the the cook the reindeer he killed with his bare hands. Anyways, this guy is a fascinating character. His videos are always shot in beautiful location. So certainly you might want to jump to the YouTube version of the podcast to see this clip. Um unlike the other subjects who ran temporary experiments,</p>\n<p>Bejorn just straight up doesn&#x27;t own a smartphone. He just doesn&#x27;t see the point. He has like a dumb phone that he&#x27;s sometime you&#x27;ll you&#x27;ll hear about it that he sometimes brings with him. All right. So, in this clip, let me set the scene for people who are listening. Uh, he&#x27;s in a shelter that he built in the woods out of logs with like a fire going. And in another clip, he&#x27;s standing by like a river near his shelter and he&#x27;s just reflecting on life without his phone. All right, so let&#x27;s let&#x27;s uh hear this clip from Bejorn. &gt;&gt; It&#x27;s uh beautiful here. And uh one of the big advantages of uh not having a</p>\n<p>smartphone is that you get to take it all in without distractions. And uh many times I don&#x27;t even uh bring my phone. I have a what I call a dumb phone, oldfashioned phone, but I don&#x27;t always bring it. All right. All right. So, what Bjorn&#x27;s talking about, which I think is important, the world can be really interesting and beautiful and a real source of gratitude and peace if you can notice it. And he says, &quot;Look, if I had a phone with me, I&#x27;m not going to notice this beauty around me.&quot; And it really is</p>\n<p>shot in a beautiful location, the Scandinavian forest or wherever he is. I think Sweden or is really beautiful. And he&#x27;s like, &quot;I couldn&#x27;t appreciate that if I was there.&quot; Interestingly, Jesse, because I watched a whole video with him later, one of the things he talks about is a little bit of like inside baseball on YouTube. He says there&#x27;s a lot of these outdoor YouTube channels where people are outdoor doing like survival stuff or camping stuff or bushcraft or whatever. And he says a lot of these outdoor YouTubers, they have their phones with them and as soon as the camera turns off, they&#x27;re on their phone checking their like YouTube whatever on</p>\n<p>social media. And he says it&#x27;s such a waste. It&#x27;s so fake. The whole point of being out there in nature is to get the psychic benefits of being alone in a Washington peace and all this greenery. And if you&#x27;re instead on the phone, you don&#x27;t get those benefits. Now, you don&#x27;t have to have the name Bejorn and live in Scandinavia to get those benefits. You don&#x27;t have to be in the middle of nowhere in the forest. I mean, walking through a city, walking through a quiet suburb, walking like after the snowstorm we just had here, while everything is covered in iced and it&#x27;s quiet and there&#x27;s no cars on the road and you can just uh hear things so clearly because</p>\n<p>of the crisp cold air without much moisture in it. These are all moments you can get lost in and have a lot of gratitude and find a lot of peace, but not if you have your phone with you. So, Jesse, let&#x27;s add this as our fourth element to our list of benefits of phone free living. It allows you to notice beauty and find peace in the moment. All right, so there&#x27;s our full table. I&#x27;m going to read all four of them here. Here&#x27;s the benefits we encountered from people who really did this. Reduced anxiety, more time engaged in meaningful activities, more mind wandering, which helps you feel like yourself, and you can notice beauty and find peace in the</p>\n<p>moment. So hopefully just me listing those benefits will motivate you to consider more sustained action about your digital life. Hopefully, this is more inspiring than me just simply listing the harms of actually using a phone too much. But there&#x27;s an elephant in the room here. The reality is that for most people, going completely smartphone free just isn&#x27;t practical. I mean, think about the examples we just gave there. Only one of those four subjects remains smartphone free to this day. The other ones did it temporarily and then went back to at</p>\n<p>least partially how they were living before. To make this difficulty uh even more clear, I&#x27;m going to play a clip that I actually find quite distressing. Um this is the acclaimed director Wernner Herzog who has long been famous for not using a smartphone, right? He&#x27;s always been too busy creating his, you know, movies and documentaries to have a smartphone. This is a clip from just three minutes ago where he goes on Conan O&#x27;Brien&#x27;s podcast. It starts with Conan praising Herzog for not owning a smartphone and then Herzog drops a very distressing bomb. So, let&#x27;s play this clip real quick, Jesse. Well, I don&#x27;t know how you</p>\n<p>survive without a cell phone in the modern era. &gt;&gt; Easily. Easily. I enjoy it. I do read. But in fact, uh I had to get myself a cell phone. Technically, I have one now because what happened uh uh in Dublin. I was filming at the train station, parked my car at the adjacent uh uh train station building and I couldn&#x27;t get out of it because uh it would open only um with a application on a cell phone.</p>\n<p>&gt;&gt; I love Herzog&#x27;s voice. &gt;&gt; Yeah. &gt;&gt; You know what I want to see? Here&#x27;s the content I want to see. Bejorn Bull Hansen and Warner Herzog trying to figure out how to make their iPhone 13 work. He&#x27;s like, they&#x27;re trying to get like the AirPods to work out in the woods somewhere. Herzog would be like, I think you need to go to the Bluetooth settings. And Bjorn would be like, nature doesn&#x27;t need Bluetooth. Nature controls all. And then Herzog would say, maybe we need pairing</p>\n<p>mode. And then uh Bejorn would uh come by, run past in the background. and you see him jump onto a reindeer and break its neck. That would be good content. Warner Herzog and Bejorn Hansen Bull Hansen figuring out an iPhone. All right, so even Warner Herzog, the one of the canonical examples of people who never owned a smartphone had to get one because the reality of modern life is there&#x27;s just too many things that requires it. I mean, this is true for me as well. I can&#x27;t even log into the course website for my courses at Georgetown anymore without having a smartphone because I have to have</p>\n<p>two-factor security, which requires an app. It&#x27;s like very difficult to go completely smartphone free. But I want to find a bright side in here because what we just did is we pulled out specific benefits of going phone free. So if we can know what we&#x27;re going for, there might be a way like if we want to think about our our smartphone habits instead of just saying smartphones are bad, try to use it less. we can say how can we design our interaction with a smartphone such that those four benefits that we just listed we can get the bulk</p>\n<p>of those in our life still if we aim at trying to move closer to benefits and instead of just trying to in general reduce usage we might be able to get like 80% of the way towards those benefits we heard from those people who were living without smartphones so I think this is possible I thought a lot about this and what I tried to do is come up with what would be the advice I could offer about how you your relationship with your phone that would most move you towards those four benefits. And I came up with uh three ideas. So I&#x27;m going to write these on</p>\n<p>the screen here. Um for those who are who are listening, what&#x27;s up on my chalkboard here, it says advice to become practically phone free. And I can kind of put practically in quotation marks, I guess, because it means both. It&#x27;s practical advice and you&#x27;re not really phone free, but it&#x27;s almost like you are. That&#x27;s why I call it practically phone free. All right. But I got three things to suggest to get us close to those benefits while you could still own a smartphone. All right. So, the the first thing that I&#x27;m going to suggest, and I&#x27;m going to I&#x27;m going to uh draw these, Jesse. Oh, god. This is always a a gamble when I try to draw</p>\n<p>things. All right. So, I&#x27;m going to draw I think I&#x27;m already proud of myself. Can you tell that&#x27;s the old Twitter logo? &gt;&gt; Yeah, &gt;&gt; kind of. All right. All right. So, I drew the old the old uh the old Twitter logo and I put a cross through it like the the circle and a cross around it. All right. So, what&#x27;s the advice here that that represents? Don&#x27;t put any social media apps on your phone. If you have on there, take them off. In general, avoid on your smartphone any app where someone makes more money the more you use it. If you need to use social media, like for work</p>\n<p>or something like this, access it on your laptop where it&#x27;s boring and it&#x27;s not with you at all times. It&#x27;s something you have to go do and load up a web page and type an URL and it&#x27;s not really that fun. It&#x27;s not default distraction. It&#x27;s more I&#x27;m specifically going to get information. The goal here is to make your phone more instrumental and less entertaining. To make it more the type of thing that sure, I have it so that I can open the parking gate of Dublin, but it&#x27;s not that interesting outside of that because there&#x27;s nothing on it that really gets my attention. All right. So,</p>\n<p>you still are doing practical things with your your smartphone, but now it&#x27;s less of a a brain warping constant companion. All right, I have a second piece of advice here. I&#x27;m going to expertly draw something. Let&#x27;s see if Jesse can figure out what I&#x27;m drawing here. Okay, let&#x27;s see here. Uh oh. Uh oh. Does it look What do you think this is, Jesse? &gt;&gt; Like a island in a kitchen. Yeah. All right. There we go. Yeah. It&#x27;s like a kitchen and I&#x27;m drawing. So I drew like</p>\n<p>a kitchen counter and then on top of that kitchen counter I am drawing an expertly rendered smartphone and we can imagine that it&#x27;s like uh plugged into I&#x27;m just going to go nuts with my drawing here. Plug into the wall. Perfect. All right. So the rule here this is the kitchen dock method. When you&#x27;re at home, you leave your phone plugged in in the kitchen. All right. If you need to listen to like an audio book or my podcast or something like that while you&#x27;re doing chores, yeah, use AirPods, like something wireless and okay, fine.</p>\n<p>If you&#x27;re at like a part of the house where the AirPods don&#x27;t reach, plug your phone in a little bit closer to where you are so you can still if you need to listen to AirPods, but otherwise the the phone lives there when you&#x27;re at home. So, if you need to look something up, uh you go to the kitchen where it&#x27;s plugged in, you look it up there. If you know you&#x27;re waiting for a call or you&#x27;re participating in a text message thread, you have to go there and stand in the kitchen to do it. It&#x27;s not with you. Now, what this gives you is a a significant stretch in your day every day, assuming you&#x27;re going to be home like at night and in the morning at the very least. It gives you a significant</p>\n<p>stretch during the day where your phone is not a constant companion, where you&#x27;re doing lots of things. You&#x27;re eating meals with your family. You&#x27;re watching TV. You&#x27;re reading. You&#x27;re doing lots of things where the phone is not in hand reach. And it begins to change that relationship you have where this is a a constant companion that you experience your day with and through that when you&#x27;re reading every four or five minutes you check in on like baseball trade rumors or when you&#x27;re watching something you&#x27;re also looking at social media and going down rabbit holes about the characters that you see in the show. It breaks you of that habit which again is going to transform the phone back to</p>\n<p>be instrumental. You still have it that that you can go have the logistical text conversation. You can still open up the gate when you&#x27;re in Dublin, whatever Warner Herzog was doing, but it&#x27;s less of a constant companion that&#x27;s warping your and distorting your view of the world. So, you&#x27;re going to begin to get a lot more of those benefits. All right. And I got one more piece of advice to offer here. So, what we&#x27;re going to start with here is a rendition of expert rendition of someone walking. He has a really long torso. Um, and then he is holding That&#x27;s not really well drawn. So, this</p>\n<p>is supposed to be if I put if I put lines around it, flip phone &gt;&gt; or a pipe or really he looks like he&#x27;s armed to be honest. Um, I drew a picture of someone walking with a dumb phone. I suggest that you buy and own a dumb phone like these people had during their experiments. It&#x27;s not that hard to do anymore. There&#x27;s a lot of websites that can help you find them and get wireless plans for them. You can do this whole thing for $15 a month or less and it&#x27;s worth it. Why do you need a dumb phone? I want you to identify more and more situations in your life where you&#x27;re</p>\n<p>leaving your house to do something constrained like you&#x27;re going for a walk, you&#x27;re going for a hike, you&#x27;re going for errands where you might need a phone for emergency contact, right? Like if your your kids might call from school or your wife needs you or you&#x27;re telling your business partner like, &quot;Hey, if we hear back from so- and so, call me because it&#x27;s very timely.&quot; So, you have a way for someone to contact you in case of emergency. But there&#x27;s nothing else interesting you can do on that. And again, you&#x27;re going to now have more experiences where you can be fully present in interesting situations. So when you&#x27;re walking the dog or you&#x27;re out in the woods because you don&#x27;t have a phone that&#x27;s interesting</p>\n<p>like Bejorn, you can get completely lost in that situation. You no longer have the excuse of I need to be in touch. It&#x27;s too dangerous not to have my phone because you do have a phone with you. It&#x27;s just not a very interesting one. And you still have your smartphone for other cases like again when you go to Dublin and need to get out of the parking garage. You&#x27;re not getting rid of the smartphone, but it&#x27;s not with you now when you don&#x27;t need it on excursions where being really present might be better. Going out with friends is another great example. I meet my friends for dinner. I don&#x27;t have a smartphone to look at. You know what happens? You get itchy for a while. That passes and then you&#x27;re fully present</p>\n<p>with those people here. And when they get up and go to the bathroom, you&#x27;re just like, I&#x27;m just going to sit here and just like see the restaurant. I&#x27;m not going to immediately start looking at things. All right. So, let&#x27;s pull this back up. We got three pieces of advice here. Nothing interesting on your phone. Keep your phone plugged into the kitchen when you&#x27;re home. Own a dumb phone that you use when you uh when you&#x27;re going somewhere where you don&#x27;t absolutely need a smartphone. I think that will actually inject into your life a lot of the phone free benefits that we talked about. You&#x27;re going to be more present in a lot of situations.</p>\n<p>You&#x27;re going to feel a lot less distracted because you don&#x27;t have you&#x27;re you&#x27;re deprogramming the constant companion. You&#x27;re going to find much more time to do other things because this this this plan has you spending a lot more time without your phone there and yet you still own a smartphone for the apps, the music apps, the audible apps, that&#x27;s still on there. When you need the text message group text messages, which is really useful on a phone, it might be plugged in the kitchen, but you can still do it. Or when you&#x27;re on you&#x27;re meeting someone, you&#x27;re trying to arrange to meet them, you can still have your phone and do that. Or you&#x27;re on a road trip, you need the map, you still have it. So, you&#x27;re still keeping those benefits of having a phone while also getting the</p>\n<p>bulk of the benefits that those subjects we talked about before experience by not having a phone. All right. So, anyways, this specific advice might not fit for you, but I I think it&#x27;s a good way to think about your relationship with your phone is not just I want to use this less because again, that&#x27;s just going to dissipate in intensity over time until you&#x27;re back to where you started. It&#x27;s figuring out the benefits of phone free living you want and figuring out what rules or constraints can I place that move me closer to those benefits. Those are much more likely to stick. Rules and constraints that move you closer to a</p>\n<p>positive vision are just much more likely to stick than rules and constraints that are trying to reduce something that you think is like generally kind of negative. So, it&#x27;s a different way of thinking about what to do with your phone. But I think we learned a lot from those case studies. Uh, and I think that led us to some interesting insights. I think Jesse, we got to play that David Borland music like all the time. It was like, &gt;&gt; yeah, the music in the background of those videos are pretty great. &gt;&gt; Isn&#x27;t that great? Like, especially that stuff. I mean, &gt;&gt; you&#x27;re in a spa. &gt;&gt; We could be doing a an ad read for a colon cleanse powder, but with that background music, people would, you</p>\n<p>know, wipe away &gt;&gt; wipe away a tear from their eye. &gt;&gt; Like, yeah, my my colon could use a regular scrub. [laughter] equivalent of 17 grams of fiber. Wow. This the music&#x27;s playing. I&#x27;m talking really slowly. That guy has got it figured out. All right. Um, so there we go. That was our uh that was our practice our idea segment for the day. Um, and now we&#x27;re going to move on to consider our practice segment. Let&#x27;s talk fashion. You&#x27;ve heard me talk</p>\n<p>before about how much I like my rag and bone jeans. Their infused denim feels soft and it&#x27;s broken in and it&#x27;s quality. Like you could wear these for years on end without wearing them out. And they also look great, right? They have this eightstep overdye process that makes the patterns look unique and interesting. Rag and Bone, however, does more than just pants. I recently got one of their denim trucker jackets, and it&#x27;s become one of my absolute favorite jackets. If you&#x27;re watching this on YouTube right now, you can see I I put it on so you can see it. Uh, rag and bone denim can make even an MI train MIT</p>\n<p>trained computer scientist look cool. So, hey, that should probably be their slogan. Actually, can make even an MIT trained computer scientist look cool. Um, here&#x27;s the thing. It&#x27;s time to upgrade your denim with Rag and Bone. For a limited time, our listeners get 20% off their entire order with code deep at rag-bone.com. That&#x27;s 20% off at rag-bone.com with promo code deep. So, that&#x27;s the word rag the wordbone.com and use that promo code deep. And when you uh if they ask you where you heard about them, please support our show and let them know we sent you. I also want to talk</p>\n<p>about our friends at Caldera Lab. Men, let me level with you. We need to take better care of our skin. We&#x27;re trained to think about our muscles and our hairline and the awesome mustaches that our wives and girlfriends won&#x27;t let us grow, but we ignore our skin. Here is the solution. Calira Lab. Calira Lab makes high performance skin care designed specifically for men&#x27;s skin. More importantly, they&#x27;ve simplified the use of their products into a straightforward three-step routine. Step one, you use the Clean Slate, which is a cleanser that gets the the dirt and oil and sweat off your skin. I love using</p>\n<p>that, by the way. You can tell your skin feels much better afterwards. Uh, step two, you use the Great, which is their serum that&#x27;s clinically proven to reduce wrinkles. And then step three, you use the hydrolayer moisturizer to lock in moisture all day. That&#x27;s it. I have them. I use these products. I, again, I mentioned I really like the cleanser. It foams and it makes me feel somehow like uh I&#x27;m not the Joker after he falls in the acid bath in the original Burton Batman movie, which is a reference all the kids get, Jesse, and I like to make it. Um, so this uh I like Caldera Labs. I like their three-step process. We&#x27;re</p>\n<p>in the winter. Your skin&#x27;s going to be super dry and whatever. This is the right time to pick it up. So go to calderab.com/deep and use code deep to get 20% off your first order. All right, let&#x27;s get back to our show. All right, so this is where we like to get super practical. Here&#x27;s what I want to do today is I&#x27;m going to take a very piece of practical internet advice and we&#x27;re going to dissect it. Let me load this on the screen here for people who are watching instead of just listening. It&#x27;s from the YouTuber Dan Co. It&#x27;s an article he posted as an essay on Twitter</p>\n<h2>Assessing the Internet’s Latest Self-Help Sensation</h2>\n<p>called How to Fix Your Entire Life in One Day. And let me zoom in on that. 173 million reads so far. That&#x27;s pretty crazy, Jesse. That&#x27;s like almost as many copies as I&#x27;ve sold of How to Become a High School Superstar. I was just gonna say &gt;&gt; not quite not quite how to become a high school superstar level, but man, that guy is getting close. &gt;&gt; He&#x27;s getting close to that level. Um I didn&#x27;t even know you could post essays on Twitter. I guess that&#x27;s a thing. Uh I&#x27;ll tell you who&#x27;s going to be doing it now. Everybody, because this one article got 173 million views. Anyways, how to</p>\n<p>fix your entire life in one day. Viral internet advice. Why are we going to look at that in the practices segment? Well, it&#x27;s practical advice and we&#x27;re going to break it apart and we&#x27;re going to go through the the seven suggestions he has. But I&#x27;m thinking about this exercise in the light of last week&#x27;s episode where we had Brad Stolberg on and he was talking about his new book, The Way of Excellence. And we were talking about in general what is the impact of in the internet on our natural instinct for ambition. And we said look it could be one of two things. Sometimes it actually can help guide us and help us fulfill our</p>\n<p>ambitions. And sometimes it can hijack our ambitions, but sort of like nonsense content that in the moment feels really good, but is actually distracting us from things that really matter. This seems like a great case study to apply this type of thinking. Is Dan Co super viral article something that&#x27;s hijacking our ambition or supporting it? So, we&#x27;re going to go through it real quick and uh I&#x27;ll get Jesse&#x27;s opinion. I&#x27;ll tell you my opinion. I actually talked to Brad about this last night, so I&#x27;ll tell you what he said. So, we&#x27;re going to kind of have a little court of inquiry at the end. All right. So, we&#x27;re going to go through</p>\n<p>this really quickly. Um I&#x27;m going to start by reading from his intro his words just to set up how he describes this and then we&#x27;ll go through a seven pieces of advice. So, here&#x27;s what Dan says. If you&#x27;re anything like me, you think New Year&#x27;s resolutions are stupid. Because most people go about changing their lives in a completely wrong way. They create these resolutions because everyone else does. We create a superficial meaning out of status games. But they don&#x27;t meet the requirements for true change, which goes a lot deeper than convincing yourself you&#x27;re going to be a more dis more disciplined or more productive this year. I&#x27;m eliding a</p>\n<p>little bit. However, as much as I think New Year&#x27;s resolutions are stupid, it&#x27;s always wise to reflect on the life you hate so you can launch yourself towards something that that&#x27;s much better, as we will discuss. So whether you want to start the business or transform your body or take the risk toward a more meaningful life without quitting after 2 weeks, I want to share seven ideas you probably haven&#x27;t heard before on behavior change, psychology, and productivity so you can do just that in 2026. All right. So, that&#x27;s a pretty lofty goal, Jesse. Um, he has seven pieces of advice. Let&#x27;s go through these one by</p>\n<p>one. I&#x27;ll give you a quick summary. All right. So, here&#x27;s piece of advice one. I&#x27;ll show it briefly on the screen. Uh, you you aren&#x27;t where you want to be because you aren&#x27;t a person who would be there. Does that kind of make sense? That&#x27;s a little bit We&#x27;re going to have to untangle a little bit of things here. Um, I read that more carefully. Here&#x27;s how I summarized it in my own notes here. Lifestyle trumps discipline. Instead of setting a surface level goal and hyping yourself to remain disciplined for a few weeks, consider creating a lifestyle that makes the outcome you desire uh much easier if or even unavoidable, right? So, I think</p>\n<p>that&#x27;s what when I when I read this closely, I think that&#x27;s what he says is lifestyle is better than discipline. All right? He doesn&#x27;t tell you to do that yet. That&#x27;s what the rest of advice is about. All right. Here&#x27;s idea two. Pull this up here. The way he his title here is you aren&#x27;t where you want to be because you don&#x27;t want to be there. You can&#x27;t do this with the English language, Jesse. There&#x27;s a lot of negatives and negative negatives and okay, it&#x27;s a little circular, but I read this carefully. Here&#x27;s my summary of idea two. Your behaviors follow your desires. Our behavior isn&#x27;t goal oriented. I&#x27;m</p>\n<p>I&#x27;m using his words here. It&#x27;s teological, meaning we do things because we want certain outcomes. For example, we procrastinate not because we lack discipline, but because we want to quote protect ourselves from the judgment that comes from finishing and sharing our work and quote, you stay in the dead-end job because you want the security and predictability, etc., etc. So what he&#x27;s saying there Jesse is that um we are doing things because for certain outcomes we tell ourselves we do things to accomplish certain goals but actually our behaviors are often not just us</p>\n<p>being undisiplined or not having a goal. there&#x27;s a the behaviors we don&#x27;t like often do have a goal that&#x27;s desirable to us. That for like a lot of people, it&#x27;s desirable not to work on these bigger projects because uh we don&#x27;t want to be in a a position to actually be assessed and be rejected or we actually like the security of this bad job. That&#x27;s why we&#x27;re not interested. So, he&#x27;s saying um behaviors follow desires. You have to think about what you actually desire in your life is more important than like what goals do you have. You should have let me help write this. I feel like I&#x27;m</p>\n<p>a clue. &gt;&gt; The whole time I was thinking, is this the stuff you were teach those Dartmouth kids when you did that summer program? &gt;&gt; I thought [snorts] those kids had a right. All right. Number three. Here&#x27;s Dan&#x27;s words. You aren&#x27;t where you want to be because you&#x27;re afraid to be there. You aren&#x27;t where you want to be because you&#x27;re afraid to be there. Okay. Uh here&#x27;s how I summarized that in my own notes. We protect the status quo for the sake of psychological consistency. Uh, so here&#x27;s this is literally in my notes, Jesse. I don&#x27;t fully understand this one. I tried to understand this</p>\n<p>one. It got a little bit complicated, but my best read is you build an identity as you grow up and then you will go through a lot to protect it for the sake of psychological consistency, even if that identity is harmful. So, you sort of build up an understanding of yourself, which not necessarily a positive one. Um, but we want to whatever our self- understanding is, we want to protect it. And we might protect it by sabotaging goals that on paper might be like, hey, that&#x27;s really good and ambitious and something you should do, but it might challenge this identity we have about ourselves. Like, I&#x27;m no good at that. I&#x27;m not smart. I people</p>\n<p>don&#x27;t respect me. And you don&#x27;t want to lose that identity. So, you you don&#x27;t pursue goals. So, there&#x27;s like a psychology there that&#x27;s important. All right. Idea four, uh, co- summarizes it this way. The life you want lies within a specific level of mind. All right. So again, here&#x27;s my notes here, Jesse. I wrote, I got fully lost in this one. Um, I&#x27;m going to read to you verbatim from a a a paragraph just so you get a sense of what I was dealing with here trying to summarize this one. This is me quoting, &quot;I&#x27;ve</p>\n<p>talked about these many times and synthesized them into my own human 3.0 model and various AI prompts to uncover your level of development and a path forward. PN open a tab to read after if you like in PNS, but here&#x27;s the 8020 of the nine stages of ego development as a refresher because repetition helps reveal things you didn&#x27;t notice before and there are new people reading these letters. He then presents this table which will make it all clear to you, Jesse. All right, this is a real thing. My god. Um, if you&#x27;re listening instead of just watching, I have never seen a more</p>\n<p>complicated. Is this a chart? It&#x27;s colors. It&#x27;s words. It&#x27;s quadrants. It looks like a little bit like you threw up Froot Loops, I guess, onto um like the printer test page. I can&#x27;t I can&#x27;t pull this apart. Uh, I&#x27;ll just read various words on here. states of consciousness, lines of development, types, interactive vision logic, integrative vision logic, uh personalistic relativistic, individualistic pluralistic, four out of five, radical relativism, rules, single</p>\n<p>system view. I don&#x27;t know. I I don&#x27;t know if this is something that uh that Dan put together or something that someone else did that he&#x27;s referencing. I didn&#x27;t really understand this one. So, let&#x27;s move on. All right. Idea five. Here&#x27;s Dan&#x27;s summary. Intelligence is the ability to get what you want out of life. All right, that&#x27;s very clear. I appreciate that. Um, he goes on to talk about cybernetics. Cybernetics is, you know, this is Norbert Weiner in the 1940s and 1950s talking about the merging of electronic mechanical machines and humans. So, you kind of like have feedback loops between like humans and machines and allows you to do something that a human by itself</p>\n<p>couldn&#x27;t do or a machine by itself couldn&#x27;t do. He was inspired by working on uh during the war like things for helping to aim anti-aircraft guns at fighter jets or not fighter jets, bombers and stuff like that. Uh so he references cybernetics to illustrate a model of goal pursuit where you keep making adjustments to your path along the way to keep coming back towards the right way forward. This is the photo. This is a useful photo. This is like a classic cybernetic thing. You constantly make adjustments. So you you kind of leave the right course but then you adjust and then that you go off the other way, you adjust again. If you keep</p>\n<p>making adjustments, you make progress where towards you&#x27;re trying to get. Um, here&#x27;s his summary of the steps for a cybernetic approach to trying to get somewhere you want to get. Have a goal, act towards that goal, sense where you are, compare it to that goal, and act again based on that feedback. So, he&#x27;s saying, and I think this is very pragmatic, you need to constantly like assess where you are and adjust. That&#x27;s how you make progress towards something. You&#x27;re not just going to have the perfect plan and just follow it and then two years later you&#x27;re there. You have to constantly be like, where am I? I&#x27;ve made some progress, but I veered off the goal. So, what adjustments do I make for</p>\n<p>going forward? Keep doing that and you&#x27;ll you&#x27;ll be moving in the general the general right direction. All right, idea piece of six. Here&#x27;s Dan&#x27;s summary. How to launch into a completely new life in one day. So now he&#x27;s going to pull together a lot of these ideas. Um I went through this and I summarized there&#x27;s three parts. Now he&#x27;s trying to summarize how do you put all these things into action your life and there&#x27;s three parts. One for what you do in the morning, one for what you do throughout the day and what one for what you do at the end of the day for trying to put all these ideas into practice. So, what he recommends briefly is during the morning you do a vision and anti-vision exercise</p>\n<p>where you spend 15 to 20 minutes reflecting on both what you like and don&#x27;t like about the path that you&#x27;re on. Like what do I want out of my life? What do I want my life to be? What would my life be like if I don&#x27;t do those things? This is like classic psychological uh possible future comparison. It&#x27;s very powerful actually. All right. So, you you you spend 15 20 minutes. He gives you some questions to answer. Then part two during the day he says you should interrupt autopilot to regularly ask yourself questions like what am I avoiding right now by doing what I&#x27;m doing and he says actually he has a list of these questions put them into calendar events so that they can</p>\n<p>pop up with notifications and just remind you like stop whatever you&#x27;re doing and ask this question so he wants to break the idea of autopilot and keep you much more conscious about how you&#x27;re spending your time. Part three at the end of the day in the evening he wants you to synthesize any insight. So, integrate any insights you had during the day into your understanding of your identity. There&#x27;s some time here for self-reflection. For example, he says, &quot;Write a single sentence that captures what you&#x27;re building towards knowing it will evolve. This is your vision MVP.&quot; Um, then he goes on and says, &quot;You should have multi-scale goals,&quot; which of course I&#x27;m a fan of. You have a daily</p>\n<p>goal, monthly goal, and one-year scale goals that you can be keeping track of. Finally, idea seven, pull it up here. This is long. Look how long how much I have to scroll. So, it&#x27;s a long article. All right. Idea [clears throat] seven, turn your life into a video game. So here he&#x27;s saying you can gify some of this advice. Um I&#x27;m going to quote from him directly here. Your because I didn&#x27;t quite understand this, but maybe this will make sense to you, Jesse. Your vision is how you win, at least until the game evolves. Your anti- vision is what&#x27;s at stake. What happens if you lose or give up? Your one-year goal is the mission. This is your sole priority</p>\n<p>in life. Your one-mon project is the boss fight, how you gain XP and acquire loot. Your daily levers are the quest, the daily process that unlocks new opportunities. Your constraints are the rules, the limitations that encourage creativity. Okay, I get this. Like you have um constraints in your life about things you do or don&#x27;t do. Each day you have certain things you do to like make that day better. On the factor of the month, you&#x27;re moving towards these one-mon goals, which move you closer to your one-year mission. And you have a vision and anti- vision to help you know this is what I want and this is what I want to avoid. And he&#x27;s talking about you can kind of think of it like a video</p>\n<p>game. All right. So, there you go. I want to start by asking the question, why did this get so popular? Why did this rack up 173 million views and counting? Here&#x27;s my assessment, and Jesse, you can tell me if this makes sense to you. In self-help literature, there&#x27;s two different camps, two different types of self-help literature. The practical and the psychological, right? Um, so the the practical it&#x27;s it&#x27;s usually about like here is like really specific advice for achieving specific goals. Like in the world of books you might think about like James</p>\n<p>Clear&#x27;s atomic habits. It&#x27;s like really specific advice for how you make progress on habits or maybe online you would think of like classic Ali Abdal. You know he&#x27;ll really talk about specific setups or configurations of your technology to make progress on certain goals. The other genre is psychological which is much more about the psychology behind your motivations and your actions. So, it&#x27;s about change your brain and you&#x27;re not going to get in the way of things that you want to do. So, in the book world, you might think about like Mark Manson&#x27;s book uh the subtle art or Mel Robbins&#x27;s new book, The Let Them theory. These are</p>\n<p>psychological self-help books. Bnee Brown, I think, would fall in here as well. Less about step by step and more about changing your mind so the psychology doesn&#x27;t get in the way of action. So, these are both two genres that both have major bestsellers. I mean, right now, if you look at the bestseller list, James Clear and Mel Robbins are right there. All right. I think what this essay did is it combined practical and psychological self-help. He has like practical ideas. You want to do this, put these events on your calendar, gamify it this way, have goals at these levels. But he also talked a lot about the</p>\n<p>psychology. The psychology that&#x27;s getting in your way, that&#x27;s preventing you from making progress. Why? What&#x27;s going on in your brain? He talked about both and he put them together and then he layered on top of that references and terminology that&#x27;s relevant to Ginz. I think that was a pretty powerful mix. Now, as you could tell by me going through it, I mean, look, I&#x27;m I&#x27;m in my, you know, 40s. I&#x27;ve been a professional writer my whole life. I write for the New Yorker. I&#x27;m a writing snob. The writing is a little hard to follow sometimes, okay? Like, it&#x27;s it&#x27;s it&#x27;s there&#x27;s ideas in there</p>\n<p>that haven&#x27;t fully been fleshed out. There&#x27;s some of them are really are and some of them I you can&#x27;t do that to the English language. This is referencing this this and this. But you put that aside and this is Dan Co&#x27;s project. Let&#x27;s talk about psychology and practical put them together and in lingo that make sense to a generation on Tik Tok and Instagram and YouTube idioms of speech and that type of movement, right? That kind of like you keep moving and say lots of things. Not not like our generation of carefully crafted writing. When I look at it that way, I say this does not hijack ambition. I think</p>\n<p>especially for a younger person, this would be useful. You start thinking about your mindset. You start thinking about practical advice. I mean, I think the system in here is pretty complicated. I think that rainbow, the Froot Loops vomit chart is going to not help be that helpful. I don&#x27;t know what the hell&#x27;s going on there. But in general, like, oh, I need to think about uh my psychology. That&#x27;s important. The practical advice seems pretty reasonable to me. vision and anti-vision planning is is actually incredibly effective. Make really clear what&#x27;ll happen if you don&#x27;t change and make really clear where you could get if you do. That&#x27;s very powerful</p>\n<p>in motivating change. This idea that you need to change your understanding of yourself before you can make progress on certain goals. I think that&#x27;s interesting. The idea that people who do really important things often they&#x27;ve set up their lives in such a way that like making progress is something that of course they do. It&#x27;s not a fight. It&#x27;s not a willpower discipline fight. you got to change your life, not just change your goals. I think that&#x27;s important. Tracking things, having goals at multiple levels, I think that&#x27;s useful as well. So, I don&#x27;t know. I&#x27;m going to if we have to choose hijack support, I think this leans for the support side. It&#x27;s not my cup of tea, but it wasn&#x27;t</p>\n<p>written for me. And uh hopefully I don&#x27;t know. I I think that could be pretty useful advice. All right, let&#x27;s take another quick break to hear from our sponsors. Starting a new business is hard. I remember what it was like starting up the media company that produces this podcast. There are so many things you have to think about. It&#x27;s nice when you come across something uh fundamental where there&#x27;s an obvious best way to do it. And when it comes to selling to customers, Shopify is the answer. Shopify is the commerce platform behind millions of businesses around the world and 10% of</p>\n<p>all e-commerce in the US. From big names like All Birds and Mattel to new brands that are just getting started. Now, you want to sell online? Get started with your own design studio. With hundreds of readytouse templates, Shopify helps you build a beautiful online store that matches your brand style. Do you need help spreading the word? Shopify can help. They have tools to help you easily create email and social media campaigns wherever your customers are scrolling or strolling. Uh, if we ever start selling products here related to the show, Jesse, I know exactly what we&#x27;re going to use to do that. It&#x27;s going to be Shopify. So, it&#x27;s time to turn those</p>\n<p>whatifs into with Shopify today. Sign up for your $1 per month trial at shopify.com/deep. Go to shopify.com/deep. That&#x27;s shopify.com/deep. I also want to talk about our friends at BetterHelp. This episode is sponsored by BetterHelp. Here&#x27;s the thing. February can be a tricky month. It&#x27;s full of flowers, candy, stuffed animals, and of course, lots of talk about relationships and dating. Now, this could be great if everything&#x27;s going well, but for a lot of people, it can bring up worries. If</p>\n<p>you&#x27;re single, you might be struggling with your sense of self-worth. If you&#x27;re in a couple and are struggling, you might find the challenges to seem insurmountable. This is where therapy can help. And if you&#x27;re intimidated by therapy and wondering how to get started, I want you to consider using BetterHelp. BetterHelp makes it easy to find and meet therapist online. They do the initial matching work for you so you can focus on your therapy goals. A short questionnaire helps identify your needs and preferences. And then their 12 plus years of experience and industryleading match fulfillment rate means they will</p>\n<p>typically find the right match the first time. But if you aren&#x27;t happy with your match, you can switch to a different therapist at any time. It&#x27;s easy to do. So, if you you can sign up now and get 10% off at betterhelp.comdeepquests. That&#x27;s betterhp.com/deepquests. All right, let&#x27;s get back to the show. What What&#x27;s your take, Jesse? &gt;&gt; I&#x27;m still flabbergasted about the 175 million views. &gt;&gt; Yeah, that&#x27;s a lot of people. I mean, I</p>\n<p>maybe they get they get seen a lot of times. I don&#x27;t really know how that works. And I kept on I keep on thinking about this with your episode earlier a couple weeks ago about Substack too. &gt;&gt; Um yeah, and the fact that he &gt;&gt; and you mentioned the essay thing &gt;&gt; and he did this on Twitter which is interesting as opposed to like on Substack or something like that. &gt;&gt; I wonder if he has a Substack. &gt;&gt; I don&#x27;t know man. This generation is not big on Substacks. There&#x27;s 8,000 replies. I I was reading through some of them and they were just like people like Yeah, it&#x27;s interesting. You know, sometimes you just catch the virality um genie in the bottle. Partially what&#x27;s happening</p>\n<p>with this essay is what we&#x27;re doing here at large. Everybody is doing segments on the essay itself. So it&#x27;s getting like huge like after aftermarket. &gt;&gt; Yeah. To put in perspective like the Super Bowl in a couple weeks will probably get 110 million. &gt;&gt; But that&#x27;s people watching for four hours. Yeah. As opposed to a Twitter view. So I don&#x27;t know how to translate that to real people. Mhm. &gt;&gt; Maybe it is though because international, right? Like this is all around the world. People could look at it. Anyways, I think it&#x27;s amazing how many people seen it. And I&#x27;m not upset that this thing is viral. Again, not my</p>\n<p>completely my cup of tea, but there&#x27;s good ideas in there. And the reason why it&#x27;s successful is not because of some weirdness or griiness. I think that&#x27;s an interesting merging of psychological practical and jinz into a a certain um potent stew. It&#x27;s a good time to announce my new book aimed at Jinzy where I will also call it how to make What did my What did my son say today? I completely misunderstood it. He said like, &quot;Oh, my my Magic the Gathering deck is now busted.&quot; And I I was like, &quot;Um, oh, sorry. So,</p>\n<p>you&#x27;re going to have to like get better cards or whatever.&quot; He&#x27;s like, &quot;No, that means good.&quot; So, I don&#x27;t know. So, I&#x27;m going to call it how to make your life busted. Escape mid and get to B from basic to busted and fix your entire life in 17 minutes. See what I&#x27;m doing there? More extreme. And I don&#x27;t know. I don&#x27;t know any other references. So, that&#x27;s it. That&#x27;s what that&#x27;s what it&#x27;s going to be. Lessons from Mr. Beast. I don&#x27;t know. I don&#x27;t know. All right. So, there we go.</p>\n<p>Uh, that&#x27;s our practices segment. We&#x27;re going to move on now to questions and comments. So, we&#x27;re just doing one question today because I think it&#x27;s worthy of a long answer. Uh, Jesse, what&#x27;s our one question for today? As a technology and culture critic, what are your thoughts about what&#x27;s going on in Minnesota with ICE raids and clashes</p>\n<h2>What do the ICE raids in Minnesota teach us about technology and its impacts on our society?</h2>\n<p>with protesters? &gt;&gt; All right, so I&#x27;m going to talk about this in our Q&amp;A segment today. uh to back up a little bit. I I want to be clear that in general when it comes to big news or political issues, I follow the Chicago model. So out of the 1967 Clavner report from the University of Chicago, which calls for higher education institutions should have institutional neutrality, right? So the the Chicago model for higher educ higher education institutions was you really shouldn&#x27;t comment on the news of</p>\n<p>the day unless it is very specifically applies to higher education and there&#x27;s a lot of reasons for this. One of the reasons for this was uh there could be a sort of chilling effect on scholars and free speech because maybe the institution stance on something conflicts with some of the scholars of the institution but there&#x27;s also a practical implication. The issue is once you start uh commenting on some things, you&#x27;re commenting on everything whether you want to or not. Like now even your silence on something becomes a comment. Once you&#x27;ve opened up the business of I&#x27;m going to assess things in the public sphere is good or bad. You&#x27;re in the</p>\n<p>business of assessing all things in the public sphere is good or bad. A lot of colleges discovered this in the 2020s. They began commenting on a lot of things that were obviously bad, but they&#x27;re like, &quot;Oh, wait a second. Now there&#x27;s a lot of other things too and our silence is just as a big of a deal as and a lot of institutions actually more recently said we&#x27;re going back to the Chicago model. So that&#x27;s what I generally do. This is a technology criticism podcast. I only want to talk about things connected to technology criticism. However, sometimes big political or otherwise world events overlap with the world of technology. So we talk about them here. It&#x27;s like after Charlie Kirk was killed, we did a podcast because I</p>\n<p>saw a a connection between that and what it told us about the role of social media in our lives. We did a podcast on that. So, this brings us back to Minnesota. I think there is a strong connection between what&#x27;s happening there and some themes about technology criticism that are important large. And so, I&#x27;m going to talk about it today because I do think it connects to the topics we cover on this show. So, we got to start by setting the stage here. Uh, what is going on in Minnesota? It&#x27;s complicated because things are changing very rapidly. But, let me just</p>\n<p>give you bring you up to speed on the my understanding and then I&#x27;m going to tell you how this connects to technology. Right? So, for those who aren&#x27;t following this closely, back in December, the Trump administration announced that they were surging a large new group of ICE and border agents, probably around 2 to 3,000, though they won&#x27;t give specific numbers, to the Minneapolis area for an intense immigration crackdown. They call this operation metro surge. Now, the result has been a series of high-profile detentions featuring swarms of masked agents that&#x27;s happening not just at homes, but like during morning commutes and outside schools and churches and at workplaces. Um, there&#x27;s also been</p>\n<p>significant reports of opportunistic stops of individuals merely because of how they look as opposed to actual like targeted enforcement efforts. The Minneapolis police chiefs had a press conference recently where he said multiple non-white officers from the Minneapolis Police Force have been hassled by agents off duty just because you know clearly these were not people who were being targeted because they aren&#x27;t immigrants and they have no criminal past and they&#x27;re on the police force but out of their uniform they&#x27;ve had multiple police officers had been hassled with agents like who are</p>\n<p>you etc etc. So we know this type of thing is going on. This has resulted in significant citizen uh push back and protest. To date, immigration officials in Minneapolis have shot and killed two protesters. One for uh trying to drive away, which seems to have annoyed one of the agents, and another one uh who was filming an arrest. He had a pistol on him. The agents took away the pistol and then after they took his pistol away, shot him in the back. So, as of the day we&#x27;re recording this, which is Tuesday, the Tuesday before. So, we&#x27;re recording</p>\n<p>this almost a week before you&#x27;re hearing this. Um, it looks like some changes might be happening. So, a lot of this might have changed a lot by the time you hear this. The president has withdrawn the controversial border control chief Gregory Bavino and is replacing them with the borders are. Greg Bavino, who&#x27;s basically the Colonel Lockjaw character from one battle after another. In fact, actually, I think we have this picture, right? Let&#x27;s put it up here, Jesse. I mean, it&#x27;s Colonel Lockjaw. Uh, he&#x27;s a he&#x27;s a border agent who really aren&#x27;t trained or have a lot of experience with</p>\n<p>doing internal enforcement. These are two completely different things. He has a bad he has a bad history of of his enforcement activities. So, they&#x27;re pulling him out of there. Um, there was some talk about reducing the number of agents. So, it&#x27;s possible things are changing in the time between when I&#x27;m recording this and when you hear it. But, that&#x27;s just what I know about what&#x27;s going on so far. All right. So, that&#x27;s kind of the ground truth. What does this have to do with technology? Well, we have to ask a key question. What did the Trump administration send all of these uh troops under the the head of this border patrol leader with</p>\n<p>little experience internal enforcement? Why did they do this search? What was the motivation for Operation Metro Surge? Now, if you talk to spokespeople from the administration, they will say it&#x27;s all just about crime, right? So, let me quote Homeland Security Assistant Secretary Trisha Mclofflin who said the following early in Operation Metro Surge. He says, &quot;Dh, arrest of murderers, rapists, pedophiles, and gang members.&quot; All right, so the official explanation is there&#x27;s undocumented immigrants who are</p>\n<p>criminals and we&#x27;re trying to get them out of the streets. But this stated goal, it doesn&#x27;t fully explain the chaos we&#x27;re seeing. So, what I want to do here, I want to really set the stage of what&#x27;s happening so I can make my technology point as clearly as possible. And I want to play you a clip here. It&#x27;s a little long. It&#x27;s 90 seconds long, but I want you to stick with it because it&#x27;s it&#x27;s really important. It comes from someone who, unlike me or the other people you see talking about this on Twitter, actually knows what she&#x27;s talking about. This is an Atlantic reporter named Caitlyn Dickerson who covers immigration. She actually won a Puliter Prize for her coverage of</p>\n<p>immigration policy in 2023. She knows all of the people. She has sources all throughout all these agencies. Um, and here she is in this clip. What she&#x27;s going to explain is two things. She&#x27;s going to start by explaining the way that uh ICE has traditionally gone about trying to find and detain especially undocumented immigrants with criminal histories and what is happening right now in Minneapolis and what the differences are. So, this is a key technical discussion from an expert. So, I&#x27;m going to play this clip here.</p>\n<p>&gt;&gt; ICE has always done lots of arrests, hundreds of thousands some years, and consistently gone after these people with serious criminal records, but central to their approach was to make arrests happen in a way that was meant to be as safe as possible and as seamless as possible. Not that this is going to sound great to people, but to describe it for you, what ICE agents did historically is that they would identify someone they wanted to arrest, do lots of work at a desk on a computer before they ever pursued this person to confirm their identity, to confirm they had no</p>\n<p>claim to legal status in the United States. Once that work was done, they would often go to the person&#x27;s house at 5 or 6 in the morning, knock on the door, and try to take them into custody, often while other relatives are still sleeping and before they leave for work for the day. So, you know, I I point out that this isn&#x27;t going to sound great because of course what I&#x27;m talking about is a situation where you&#x27;d have kids wake up in the morning and find out that their mom or dad was gone. But that approach was to minimize the kinds of chaos that we&#x27;re seeing ICE really invite now. So, I&#x27;ve talked to so many</p>\n<p>current and former ICE officials who are watching this happen and they&#x27;re really bewildered because it&#x27;s as if ICE is now going against all of its former training to make arrests as dramatic as possible to do them in the streets in front of the general public kind of inviting conflicts that then lead to protesting and to escalations. And they&#x27;re also filming a lot of these violent clashes, making it them as dramatic as &gt;&gt; So clearly, right, we know how to uh do surges of arrest. What what Dickerson</p>\n<p>talked about is maybe not during the Biden administration, there were some issues there with how they reigned in ICE, but during the Obama administration, other administrations, we had these surges where hundreds of thousands of people a year would get brought in and deported. And we knew how to do it uh in a way that you don&#x27;t make mistakes and it&#x27;s minimal impact. and you minimize the opportunity for for violence and spectacle and you get the job done. We could of course just done that or scaled that up, but it&#x27;s not what we did. Clearly, the Trump administration is trying to create a spectacle in the streets. They want protests. They want confrontation with protesters. They want a big show of mass</p>\n<p>agents pulling people out of cars while uh blue-haired progressives whale. But why? This is where we get to the technology connection. Here&#x27;s what I&#x27;m convinced is a big part of what&#x27;s going on here. They&#x27;re doing this because they want the content. I want to tell you something important about the timing about what&#x27;s happening in Minnesota. In December, a young YouTuber named Nick Shirley posted a video about alleged government fraud from within Minneapolis&#x27;s Somali immigrant community. This was fraud that centered on creating fake daycare and other service centers that didn&#x27;t really</p>\n<p>exist so that you could get government checks. Now, Shirley didn&#x27;t uncover this. This was actually something that had been investigated for a while. So sort of known this was going on. But what happened is is that the the Tim Waltz or the the governor&#x27;s office and they had sort of turned the pressure off this investigation because it was politically inconvenient. So really what was happening with the Shirley video is that he was saying we we caught you, right? Like this is a I went to these places is a big deal, right? So there was this was like an actual scandal and this YouTuber um helped point it out. Okay, that video</p>\n<p>went super viral because it pressed a lot of buttons, you know, uh, right-wing righteousness and it put left-wing people in a in sort of a hard situation. And so it went super viral. It was like a week or two after that that the president said, &quot;Oh, we&#x27;re going to send, you know, Colonel Lock Jaw and a bunch of our troops with masks on to that same city.&quot; I think he saw that content and said, &quot;That played really well with the only people I care about, which are the people who voted for me, and they voted for me largely because they don&#x27;t like the other side. I want to get in on that type of virality. We can create even</p>\n<p>bigger spectacles that are going to press the buttons of our base and going to make the left-wing progressives bad. We can do that even bigger than this. And we want to, this is what we&#x27;re going to do. We&#x27;re going to create the type of content that would do well online.&quot; And so it was right after the Shirley video, they said, &quot;Oh, this is where we need to go.&quot; And of course, of all the, you know, Minneapolis is not a a does not have a massive undocumented immigrant population. They&#x27;re all criminals. They do have a large Somali immigrant population, but 87% of that population are naturalized citizens. Half of them are born here in the US. There&#x27;s way</p>\n<p>more. California, Texas, Florida, Arizona. There&#x27;s way places that have way bigger populations of undocumented immigrants and gang activities and criminals. But we go there because the Shirley video did well online. The algorithm treated it well. It pressed the buttons of my base. I want to create a similar type of spectacle. This is an example of what I call algorithmic politics. Put simply, when politicians like our current president become heavy users of social media, they start to think about all of their actions through the lens of what will produce the type of optics that a social media algorithm</p>\n<p>would reward. you begin to do things in the real world that match the properties that the social media algorithms that you have internalized, you know, reward. This typically means things like pushing things towards the extremes because if you&#x27;re too nuanced or in the middle that you&#x27;re not going to catch the viral juice online. It typically means pump up confrontation with an out group. That&#x27;s a very successful strategy that was learned in the social media space. Put out the table on the campus and say, &quot;Prove them wrong.&quot; a confrontation with an out group. This was at the core of Charlie Kirk&#x27;s online success and stomp</p>\n<p>on taboos. This is another thing that is done really well virally online. Take a taboo, especially if it&#x27;s taboo that&#x27;s set from someone, a team you don&#x27;t like, and then step on it. That transgression has a thrill. That does really well online, especially in the the the looser regulated spaces online. Taboo and transgression uh taboo stomping and transgression um engagement. That&#x27;s what works in that world of social media. And now we have actual political action that&#x27;s just like a real live tweet that&#x27;s trying to match those same properties. What&#x27;s going to spread well among the people that I care about</p>\n<p>seeing this? It&#x27;s as if you now have the administration be like, &quot;Hey, we killed a lesbian mom and a male ICU nurse on camera. Then we doubled down and said they were terrorist assassins. Let&#x27;s go check our likes.&quot; So this is something new in politics and it was something that was shaped by specific technologies. People often treat Marshall McLuhan&#x27;s claim that the medium is the message as some sort of metaphor like an oversimplification of a more complicated reality, but sometimes it&#x27;s just directly true. Reorganizing civic and political life around algorithmic</p>\n<p>attention economy platforms like Twitter and Facebook and Tik Tok wasn&#x27;t costless. It reshaped how we engaged in the world, and it did so in a terrible way. Technology critics used to reassure themselves by saying Twitter is not real life, but now it is and it&#x27;s even more depraved than we could have imagined. So that&#x27;s what I think&#x27;s going on here, Jesse, is I think a big part of this is we have a government or a leader of a government that often thinks about the real world in terms of social media algorithms. Like what would actually what type of things would play well on</p>\n<p>social media? That&#x27;s where my power came from. Let&#x27;s follow that even if it leads to cruelty and death or whatever it comes down to. So, I think that&#x27;s a big part of it. If that technology did not exist, it doesn&#x27;t mean that political leaders wouldn&#x27;t still do horrible things, but they would have a different form. I think social media has shaped our civic and political life in a way that I think we all look at and say, &quot;This is much worse than it was before.&quot; &gt;&gt; And you and Brad were kind of talking about that last week too in your interview when you were kind of talked about that Elon clip. &gt;&gt; Yeah. Yeah. Same idea where it was Yeah. with the chainsaw and the whole thing</p>\n<p>was like set up to be a spectacle like to the extreme. you&#x27;re annoying an out group and being transgressive. Like those things do really well on social media, so they became a political strategy. I don&#x27;t think that&#x27;s great. So, you know, there we go. All right, so let&#x27;s change gears completely. We&#x27;re going to wrap up here. I like to end each show by talking about what I&#x27;ve been reading. Um, I just finished a book. It&#x27;s a a big one, a 400 pager that I&#x27;ve been reading off and on since last year. I finished uh Michael Barrier&#x27;s biography of Walt</p>\n<p>Disney called The Animated Man, which was the second major biography of Walt Disney I&#x27;ve read. The first was Neil</p>\n<h2>Cal gives his weekly reading update</h2>\n<p>Gabber&#x27;s biography, which is like a classic in the genre. It&#x27;s 900 pages long. It it you know, it was u won all the awards and it&#x27;s a fantastic biography, especially if you care about the psychology of the person. the barrier biography, which I I picked up after we visited Disneyland for the first time last year. What it&#x27;s known for is that he did a lot of research on the technical innovations of the actual films being produced, especially in the early period of the of Disney&#x27;s career. So, that book supposedly does a really good job of like what how the sound</p>\n<p>synchronization worked, etc. And that was actually that that part was really interesting. And then it goes much faster for the other stuff. Um, I consumed a lot of Disney content this month is what it comes down. I really did. &gt;&gt; I just was a hard month, man. I don&#x27;t know. We had a lot going on all December. It was a stressful month. We had a lot of things happening in January. I was just done. Coming into January, I&#x27;ve been done. I&#x27; I&#x27;ve I&#x27;ve like cleared all major events off of my my calendar. Um I&#x27;m saying no to everything. I just had a really hard fall. And so, uh it&#x27;s been great actually. I&#x27;m just we don&#x27;t I don&#x27;t have anything major looming on my schedule at</p>\n<p>all. And that&#x27;s been like great. And where have I been going? It&#x27;s like I just want to read Disney stuff. That&#x27;s like my romance novel, I guess. I don&#x27;t know. Um, I mean, I have some, you know, I&#x27;m also reading like a a great biblical criticism book. I have a great uh technology criticisms book I miss. Like, I&#x27;m I&#x27;m now slowly [music] back into sort of more like grown-up reading. But, [laughter] I don&#x27;t know, man. I needed a month of reading too many books about Walt Disney. All right, that&#x27;s all the time we have for today. Thank you for listening, putting up with my rants and everything else. Uh, we&#x27;ll be back next</p>\n<p>week with another episode. And until then, as always, stay deep. Hey, if you like today&#x27;s discussions about what it&#x27;s like to live without a phone, you might also like episode 388, where we look at some new technological dangers that are starting to worry the experts. Check it out. I think you&#x27;ll like it. We went back through all of the articles that height has published since the anxious generation came out and we pulled out three new technologies that height and his collaborators are worried about.</p>", "chapters_count": 5}