{"video_id": "rjeqNUqfeHk", "title": "How To Read More Books? | Cal Newport", "link": "https://www.youtube.com/watch?v=rjeqNUqfeHk", "published": "2026-01-08T15:26:14+00:00", "summary": "Cal Newport details his process on how to read more books.\n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\n0:00 Why it's important to read books\n2:30 Different types of reading\n7:55 Reading physical books\n12:25 7 suggestions to integrate reading\n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<p><strong>[00:01]</strong></p>\n<p>Why is it important to read books? So, let's look at some quotes from this article. There's a lot of different things going on here. And I've pulled some quotes out of here, not in their order that they appeared, but in the order that I think they're important to our discussion. So, let me grab the first quote I want to start with here. All right. Here is Maryanne. And again, I have this on the screen. If you're at youtube.com/calport media, this is episode 238. All right. So let's start with this quote. No human was born to read.</p>\n<p>Literacy requires a new plastic brain circuit. Plasticity allows the circuit to adapt to any writing system and any medium. The catch is that circuits reflect a medium's charact characteristics whatever they are. So we'll start with this point. It's a big point that was made in P and the squid. Humans aren't meant to read. It's a highly unnatural activity. We hijack significant portions of our brain that were originally evolved to do other things and we retrain them to do this reading this reading activity that humans invented. It's a cultural innovation that's relatively recent in</p>\n<p>the history of our species. But what Maryanne is saying here is we're reshaping our brain to this new activity. So specific the specifics of this activity matter. So what we're reading, how we're reading it, what format we're reading in actually can have an impact on how the brain is shaped. All right. Second quote I want to read here. This is now about let's dive into how different mediums can affect how our brain is shaped around reading. The medium of print advantages slower, more attention and time</p>\n<p>requiring processes. The digital medium, by contrast, advantages fast processes and multitasking. Uh, both well suited for skimming information's daily bombardments. Marian has a little interesting piece here where she says, \"Stop for a moment and think about that sentence you just read. Did you really read the whole sentence or did you skim and bounce around some words?\" Because as she goes on to clarify, that's really how we engage with words on screens and web</p>\n<p>browsers, on social media, etc. We skim, we jump around. There's things called Z patterns and F patterns. We'll read the first line to middle section. We our eyes jump around. We feel like we're going fast, but we're missing a lot of information. So, different types of reading, digital verse physical, requires different types of processes. Um, so does this matter? Well, let's see. Here's what Maryannne says. To skim to inform, as we do when we read on digital,</p>\n<p>is the new norm for reading. What goes missing, however, are deep reading processes, which require a quality of attention increasingly at risk in a culture and on a medium in which constant distraction bifurcates our attention. These processes include</p>\n<p><strong>[03:01]</strong></p>\n<p>connecting background knowledge to new information, making analogies, drawing inferences, examining truth value, passing over into the perspectives of other, expanding our empathy and knowledge and integration and critical analysis. Here is the the key quote about summarizing all these things we get from reading a physical book. Deep reading is our species bridge to insight and novel thought. All right. So, let's think about what they're saying. What what Maryannne is saying here. We have to reshape our</p>\n<p>brain to read. If we're reading on a screen, we tend to do what she calls skim to inform. We jump around and uh see ideas, try to get the gist of what's going on. When we instead read on a physical page, we instead are prioritizing processes that give us all of these all of these advanced human cognition behaviors. Here's where we get the analogies, inferences, truth, value, passing over perspective, empathetic, putting ourselves into the shoes of others, integration, critical analysis, the</p>\n<p>things that she describes as our bridge to insight and novel thought. As Maryanne Wolf goes on to summarize those traits we get from physical books but not digital. To deploy these interactive processes requires nearly automatic decoding skills and purposeful attention that moves as William James once put it from flight to purchase for thought. Imperceptible pauses and reading can lead to lightning speed leaps in our</p>\n<p>thoughts furthest reaches. By contrast, when we skim, we literally physiologically don't have time to think or feel. So, this is a a big a big idea that's being made here. Slowly reading full sentences one after a time as we do when we look at a physical page is supporting and kicking off all of these incredibly advanced deep thinking processes that are at the key of what makes humans</p>\n<p>human. And it's not just being able to think clear. It's also being able to be more empathetic. It's being able to integrate the ideas you're seeing into other ideas. What she's emphasizing here is just the ability to pause and just think for a moment about that sentence before you move on to the next allows you to integrate it successfully into existing structures of thought. Therefore, growing a much more sophisticated understanding of the world. All of this comes from the pace of reading. The style of reading that happens on physical pages. On a screen, on a phone, on an iPad, we don't get</p>\n<p>that. We're skimming around and we literally physiologically don't have time to think or feel. So, we're not able to integrate the thoughts we're reading. We're not able to examine them successfully for truth value or understand how they fit in or challenge existing schemas. We do not have the physiological or psychological space for empathy for the other people. So, what we look for is uh arousal. Hey, this makes me mad. This makes me laugh. This</p>\n<p><strong>[06:02]</strong></p>\n<p>makes me, you know, excited about something. This makes me, you know, scared. Emotional arousal kind of captures our attention and we look for key words about do I like this person or not? Is this on my team? Do I agree with this idea or not? It's a primitive engagement with information. Does this affect other types of thinking? So if we spend most of our time reading in a digital screen instead of reading on a physical screen, will that impact the way we think not just when we're engaging with text, but when we're trying to do other type of thinking in other aspects of our life?</p>\n<p>Here the article provides evidence that yes, the answer there is yes. Maryanne points towards a recent study that was published in Jamba Pediatrics by a group of researchers from Singapore, McGill and Harvard. It looked at over 500 young children. And what they found is increased screen time at a young age was associated with weaker development of the brain regions responsible for the executive function skills that govern attention impulse inhibition and some aspects of memory.</p>\n<p>So they're not getting the cognitive training that book reading in physical books gives you. And without the training you're not developing those skills. So, it's not just the act of reading itself while you're reading allows you to do this deeper thinking. It's cognitive strength training. It's making those parts of your brains able to do that type of thinking better in the future when you're doing other cognitive activities. Now, is this just for young kids? Well, no. Maryanne goes on to say, \"This same sentence, she's</p>\n<p>referencing a sentence that summarized what I just said, could as easily describe the experience of older children and indeed adults.\" So to me, these are important points. Reading a physical book in a slow, deliberative, and careful manner sharpens a type of innovative, empathetic, creative, and critical thinking that is otherwise hard for humans to access. It requires us to literally rewire our brain to do that type of thinking. And without a</p>\n<p>concerted effort, we will not develop those skills. If we avoid the slow and deliberate reading of actual physical books, if we mainly consume information on screens, constantly keeping up with the news, on Twitter, looking at what's going on on Instagram, jumping around highly engaging websites or following links on social media. Even very highly educated people will do this and convince themselves, I'm really up on things. I know what's going on. I'm jumping back and forth between these</p>\n<p>Substack quotes that I saw quoted on other tweets. you feel like you're really engaged, but you're not doing the type of reading that supports innovative, empathetic, creative, and critical thinking. So, what happens is the sophistication with which you understand and later make sense of information is decreased, and your ability to apply sophisticated thinking in other contexts is also atrophied. Avoiding books is like being in ancient</p>\n<p><strong>[09:05]</strong></p>\n<p>Sparta and avoiding doing any physical training. you're going to be bad at the main activity that your civilization prioritizes. For the Spartans, it was physical war. For us, it's cognition. You're making yourself much worse at that if you avoid physical books. Now, if we think about this even more literally and we we go with this idea that Wolf pushes that training our brain to do this type of innovative and empathetic and creative and critical thinking is something that's unnatural. We have to</p>\n<p>hijack huge portions of our brain and doing this very difficult unnatural activity that is sitting there and holding a codeex and trying to decode the sentences that we have to do something incredibly unnatural again and again to train our brains to be this higher order of human. If we're not doing that, if we're substituting that time with screens, we are in a literal sense evolving our brain backwards towards our pre-iterate tribal selves. We're going backwards to the type of brains we had before the advent of literacy and the impact that had on the plastic formation of how our brain actually</p>\n<p>functions. I spent all day last Wednesday sick on the internet and here was my uh my conclusion. It's a terrible place. Seriously, there's no empathy. The thinking is simplistic. there is a automatic knee-jerk meanness to any perceived outsiders. In other words, if you're bouncing around Twitter and social media and substack fights going back and forth, it's a digital paleolithic tribe. And so, exactly what Wolf would predict, if you don't do this</p>\n<p>effort that makes us more than our what we used to be, we're going to go right back to what we used to be. And when I see Twitter today or what 10 years ago would have been Tumblr fighting with 4chan uh and before that, you know, who knows? Um what I see there is the human brain going backwards. It's going back to where it's comfortable. Where's my tribe? How does this make me feel? Who's the bad guy? I want to feel something big right now.</p>\n<p>And when we do that, we get away from what characterizes and distinguishes humans, the modern human from any other any other animal or beast that's ever come before. You know, Aristotle identified in the Nikmachian ethics concentrated deep thought, the ability to sit here and manipulate ideas just within our head as the essence of what it means to be human, what separates humans, art, our teological end point. So to voluntarily move backwards from</p>\n<p>that is something that we should be cautious of. All right. So I'm being pretty philosophical here. Let's get more concrete. What is my recommendation for, you know, my listeners here to the show? I think we need to think about a serious reading habit as an exceptional activity, one that you need to isolate and support and really prioritize in</p>\n<p><strong>[12:06]</strong></p>\n<p>your life. No matter what else you think is important in your personal definition of a deep life. I'm increasingly convinced, the serious reading of good books needs to be in there. So, I have seven suggestions I want to give. Seven suggestions about integrating real reading into your life. All right. Number one, uh always be reading something challenging. I don't care if it's fiction or non-fiction, but something that's challenging. uh ideas you have to grapple with, characters whose psychological reality is uh</p>\n<p>difficult or pushes you into new psychological or emotional places like in fiction, but challenging. Number two, read real books, not on a phone, not on an iPad. Kindle, I think, is okay. We're going to get into this later with a question later in the the program. We have a good collection of questions coming up, but for now, I'll just say Kindle's okay. Physical books are okay. Don't read on your phone. Don't read on your iPad. Wolf goes into this in this article. It's where the other distractions are, and you're going to</p>\n<p>read in those old ways. If you're trying to read on those same devices, you're going to read in the skim style. Number three, uh, read when possible in awesome, awe inspiring locations. I don't like this mindset that reading is a take your cod liver oil type of grin and barrett ice bath type self- flagagillation behavior. Make it awesome. It's sunny out. I'm going to go to a park and sit on a bench or hike into the woods for 20 minutes and bring a book by, you know, thorough read at a coffee shop in the morning or as I would occasionally do when I lived in Beacon</p>\n<p>Hill for a while when I was at MIT, go to a pub. That's it. We we The British are great at this. Americans are terrible at this. The the art of being a grad student that has a book that's a little bit too hard, but you have a hefty in a back corner of a pub. It's great. It opens up. You're like, \"Great. I'm excited to read. This feels like the right place to be doing it.\" Um, take your time. This number four. Take your time when you read. Go slow. Seek to understand. If you're reading a complicated book, use secondary sources</p>\n<p>to push yourself. So, read books about the book you're reading. It'll give you things to look for. It'll push your understanding. You'll come back to the book and be able to come at it more sophisticated. Again, I'm not a big believer of just immerse yourself in a complicated thing and and you will just grow. No, don't just grab Ulyses. Read a book about Ulyses so you have some understanding of what was going on with modernist English literature in this point. Why is this so important? What are you looking for? Uh number five, the quantity of books</p>\n<p>finished in the reading life is less important than the time spent actually reading. So reading regularly, slowly and deliberately is what matters. The quantity of books that translates to will depend on two things. One, happen stance, the length of the books you happen to be reading. And two, just as your skill increases, as you get better at reading, you might finish books</p>\n<p><strong>[15:06]</strong></p>\n<p>faster. Uh, six, keep notes. Keep notes. When you are tackling an idea that's important, maybe you've read multiple books on it, start a document somewhere, keep notes. This helps you practice, puts you in the mindset of, I'm not just reading the sentences. I want to actually try to extract information from these sentences. You're going to slow down. You're going to allow those purchase for thought that William James talked about that pause in between that allows you to say, \"hm, what was said here reminds me of what was said there.\" and it changes the way I think about what I wrote the other</p>\n<p>day. That's where real interesting synthesis happens. And finally, to support all of this reading, when it comes to your life with screens, especially phones and iPads, try to reduce the use of screens as a default response to boredom. That should be a plan thing. It's okay if you say tonight I'm going to watch a show uh that I'm going to stream or there was a baseball game today and at breakfast I am going to check on this site that site and this site to get the</p>\n<p>analysis of what happened there. That's perfectly fine. What you want to avoid is when I'm bored, whip this out. Hey uh Tik Tok algorithm or Twitter social dynamic, show me some stuff that makes me feel big. That you want to avoid. You want your brain to not crave that so much. You want your brain to be more comfortable with not having the big feelings at all moments so that when it comes time to do deep reading, it doesn't complain. All right, so that's my advice. So here's my summary here. The reading life is a deep life. The screen life, the screen fil life can be</p>\n<p>downright primitive. Which one do you want? Hey, if you like this video, I think you'll really like this one as well. Check it</p>"}