{"video_id": "Z0x99Uu4rJc", "title": "AGI Might Not Need Continual Learning – Dario Amodei", "link": "https://www.youtube.com/watch?v=Z0x99Uu4rJc", "published": "2026-02-13T20:45:02+00:00", "summary": "Full episode: https://youtu.be/n1E9IZfvGMA\nMe on twitter: https://x.com/dwarkesh_sp\n\nDario Amodei thinks we are just a few years away from “a country of geniuses in a data center”. In this episode, we discuss what to make of the scaling hypothesis in the current RL regime, how AI will diffuse throughout the economy, whether Anthropic is underinvesting in compute given their timelines, how frontier labs will ever make money, whether regulation will destroy the boons of this technology, US-China competition, and much more.", "transcript_html": "<h2>Transcript</h2>\n<p>A million tokens is a lot. That&#x27;s that&#x27;s you know that can be days of human learning, right? You know, if you think about the model, you know, you know, kind of read reading reading a million words, you know, you know, it takes me how long would it take me to read a million I mean, you know, like days or weeks at least. Um uh so you have these two things and and I think these two these two things within the existing paradigm may just be enough to get you the country of geniuses in the data center. I don&#x27;t know for sure, but I think they&#x27;re going to get you a large fraction of it. There may be gaps, but I I certainly think just as things are,</p>\n<p>this I believe is enough to generate trillions of dollars of revenue. That&#x27;s one that&#x27;s all one. Two is this idea of continual learning. This idea of a single model learning on the job. Um I think we&#x27;re working on that too. And I think there&#x27;s a good chance that in the next year or two we also make we also solve that. Um I I again I I I I you know I think you get most of the way there without it. I think the trillions of dollars of of you know the the I think the trillions of dollars a year</p>\n<p>market maybe all the national security implications and the safety implications that I wrote about in adolescence if technology can happen without it. But I I I also think we and I imagine others are working on it. And I think there&#x27;s a good chance that that you know that we get there within the next year or two. There are a bunch of ideas. I won&#x27;t go into all of them in detail but um you know one is just make the context longer. There&#x27;s there&#x27;s nothing preventing longer context from working. You just have to train at longer context and then learn to to serve them at</p>\n<p>inference. And both of those are engineering problems that we are working on and that I would assume others are working on as well. &gt;&gt; Yeah. So this context lines increase, it seemed like there was a period from 2020 to 2023 where from GBD3 to GBD4 Turbo, there was an increase from like 2,000 context lines to 128K. I feel like for the next for the twoish years since then, we&#x27;ve been in the sameish ballpark. Yeah. &gt;&gt; And when model context lines get much longer than that, people report qualitative degradation in the ability of the model to consider that full context. Um, so I&#x27;m curious what you&#x27;re internally seeing that makes you think</p>\n<p>like, oh, 10 million contexts, 100 million contexts to get human like six months learning billion billion context. &gt;&gt; This isn&#x27;t a research problem. This is a this is an engineering and inference problem, right? If you want to serve long contexts, you have to like store your entire KV cache. You have to, you know, um, uh, you know, it&#x27;s it&#x27;s it&#x27;s it&#x27;s difficult to store all the memory in the GPUs to juggle the memory around. I don&#x27;t even know the detail, you know, at this point. this is at a level of detail that that that that I&#x27;m no longer able to follow although you know I I knew it in the GPD3 era of like you know these are the weights these are the</p>\n<p>activations you have to store um uh but you know &gt;&gt; you know these days the whole thing is flipped because we have models and and and kind of all of that but um uh and and this degradation you&#x27;re talking about like again without getting too specific like a question I would ask is like there&#x27;s two things there&#x27;s the context length you train at and there&#x27;s a context length that you serve at if If you train at a small context length and then try to serve at a long contract length like maybe you get these degradations. &gt;&gt; It&#x27;s better than nothing. You might still offer it but you get these degradations and maybe it&#x27;s harder to train at a long context length. Yeah.</p>\n<p>So, you know, there&#x27;s there&#x27;s a lot. If you enjoyed this clip, you can watch the full episode here and subscribe for more clips. Thanks.</p>", "chapters_count": 0}