{"video_id": "DmtyjU4C7Pc", "title": "How To Build A Morning Routine That Works | Cal Newport", "link": "https://www.youtube.com/watch?v=DmtyjU4C7Pc", "published": "2026-02-19T12:00:00+00:00", "summary": "Cal Newport provides the details of effective morning routines in this clip from episode 391 of the Deep Questions podcast.\n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\n0:00 Effective morning routines\n1:20 Resurgence of morning routines\n4:00 Principles that work\n8:40 Eliminate expectations\n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<p><em>No transcript available for this video.</em></p>", "cleanup_applied": false, "cleanup_reason": "no_transcript"}