{"video_id": "O18IcnyGEmw", "title": "AI Will Hit Trillions Before 2030 — Dario Amodei", "link": "https://www.youtube.com/watch?v=O18IcnyGEmw", "published": "2026-02-15T16:15:02+00:00", "summary": "Full episode: https://youtu.be/n1E9IZfvGMA\nMe on twitter: https://x.com/dwarkesh_sp\n\nDario Amodei thinks we are just a few years away from “a country of geniuses in a data center”. In this episode, we discuss what to make of the scaling hypothesis in the current RL regime, how AI will diffuse throughout the economy, whether Anthropic is underinvesting in compute given their timelines, how frontier labs will ever make money, whether regulation will destroy the boons of this technology, US-China competition, and much more.", "transcript_html": "<h2>Transcript</h2>\n<p>It seems like your worldview is compatible with somebody who says uh we&#x27;re like 10 years away from a world in which like we&#x27;re generating trillions. &gt;&gt; That&#x27;s just that&#x27;s just not my view. Yeah, that is that is not my view. Like I I so so I&#x27;ll like I&#x27;ll like make another prediction. It is hard for me to see that that there won&#x27;t be trillions of dollars in revenue before 2030. Um like uh I can I can construct a plausible world. It takes maybe three years. So that that you know that would be the end of what I think it&#x27;s plausible like in 2028 we get the the real country of geniuses in a data</p>\n<p>center. You know the revenue&#x27;s been been go you know the revenue has been going into the maybe is is in the low hundreds of billions by by by by 2028 and and and then the country of geniuses accelerates it to trillions you know and and we&#x27;re basically we&#x27;re basically on the slow end of diffusion. It takes two years to get to the trillions. that that that would that that that would be the world where it takes until that would be the world where it takes until 2030. I I I suspect even composing the technical exponential and diffusion exponential will get there before 2030. So you laid out a model where anthropic makes profit</p>\n<p>because it seems like fundamentally we&#x27;re in a computed world and so it&#x27;s like eventually we keep growing comput. No, I think I think the way the profit comes is again and and you know, let&#x27;s let&#x27;s just abstract the whole industry here. Like we have a you know, let&#x27;s just imagine we&#x27;re we&#x27;re in like an economics textbook. We have a small number of firms each can invest a limited amount in you or or or like each can invest some fra fraction in R&amp;D. They have some marginal cost to serve. the margins on that the profit margin the gross profit margins on that marginal cost are like very high because</p>\n<p>because because inference is efficient there&#x27;s some competition but the models are also differentiated there&#x27;s some there&#x27;s some um you know companies will compete to push their research budgets up but like because there&#x27;s a small number of players you know we have the what is it called in the corno equilibrium I think is what the what the small number of firm equilibrium is it the point is it it doesn&#x27;t equilibrate to perfect competition with with with with with with zero margins. If there&#x27;s like three firms, if there&#x27;s three firms in the</p>\n<p>economy, all are kind of independently behaving behaving rationally, it doesn&#x27;t equilibrate to zero. &gt;&gt; Um, help me understand that because right now we do have three leading firms and they&#x27;re not making profit. Um, and so what what uh yeah, what what is changing? Yeah. So the the again the gross margins right now are very positive. What&#x27;s happen what what&#x27;s happening is a combination of two things. One is we&#x27;re still in the exponential scale up phase of compute. Um so what basically what that means is we&#x27;re training like a model gets trained</p>\n<p>it costs you know let&#x27;s say a model got trained that costs uh a billion last year um and then uh this year it produced uh $4 billion of revenue and cost $1 billion to to uh to to to inference from. Um so you know again I&#x27;m using stylized number here but you know that would be 75% you know gross gross gross margins and you know this this 25% tax. So that model as a whole makes $2 billion. Um but at the same time we&#x27;re spending $10 billion to train the next</p>\n<p>model because there&#x27;s an exponential scale up and so the company loses money. Each model makes money but the company loses money. The equilibrium I&#x27;m talking about is an equilibrium where we have the country of geniuses. We have the country of geniuses in a data center, but that that um model training scale up has equilibrated more. Maybe maybe it&#x27;s still it&#x27;s still going up. We&#x27;re still trying to predict the demand, but it&#x27;s more it&#x27;s more um leveled out. If you enjoyed this clip, you can watch the full episode here and subscribe for more clips. Thanks.</p>", "chapters_count": 0}