{"video_id": "JU4m7Lm6TlM", "title": "Replacing admin hours with teaching time", "link": "https://www.youtube.com/watch?v=JU4m7Lm6TlM", "published": "2025-11-18T16:55:03+00:00", "summary": "Brightwheel is a leading childcare management software provider and supports the small businesses that make up the $100 billion early education market. The software removes administrative tasks like billing, enrollment, and payroll—giving educators more time with children each day.\n\nLearn more about brightwheel: http://stripe.com/customers/brightwheel", "transcript_html": "<p><strong>[00:08]</strong></p>\n<p>Even before families come to our school, before they even step foot in the building, we are interacting with\nthem on Brightwheel. But then when the kiddos actually\narrive, throughout their kids' day, they can see kind of a ticker\ntape of what's going on. It gives them peace of mind. They know that once they've checked their\nchild in that they're well taken care of. The moment you have kids \nthat becomes your life. Like, you have your work, sleep, and your children. We can be very demanding to really develop them to be\nkind great human beings and that demands go to the school.</p>\n<p>And that's where we as Brightwheel come in. We are the leading childcare\nmanagement software providers. We take a lot of the admin and problems\nthat a school has to deal with away, which allows them to actually\nfocus on what matters the most and that's the development of\nthe students in their care. As a director, harnessing this technology, it has freed up literally hours \nupon hours within my week to spend time in the classrooms, getting to know the kids and\nsupporting teachers. With Brightwheel, you can set up \nwhatever billing structure that you want.</p>\n<p>Previously, my billing might've taken \nfour to five hours in one given day. Now it's just 20 minutes. On the payment side, we're able to provide an amazing\nexperience there because we partner with Stripe. Receiving those payments on time\nare hugely important for our schools. They rely on that to the next day, already use those payments to\npay the rent, to issue payroll. That is like an entire payment\ninfrastructure that we would have had to build ourselves. Our goal is that parents and schools\nnever even have to talk about these payments.</p>\n<p>It's hugely important, but\nthey don't have to worry about it. My conversation with families\nis 'How was your day?’ ‘Tell me about Grandma coming into town.' I can actually build a relationship because I'm no longer hounding\nfamilies for payments. We've grown massively in terms of scale. Today, we are all over the US and Canada, schools from Australia to\nAfrica to South America, millions of students on our platform. Onboarding is a really key\naspect of our business. We have tools like Stripe\nConnect embedded in our platform</p>\n<p>and the customer-facing verification\nbecomes a super seamless process for them. We've made enormous progress, but there's still so many things we could\ndo in terms of increasing the quality, but also the accessibility of\nearly education around the world. Handling our subscriptions and payment\nand financial aspects of the business through Stripe allows us to use our\ncash flows that come in reliably and consistently to actually reinvest\nit in R&D and innovation. It allows us to deploy our engineers\nto other aspects of our platform,</p>\n<p>building more products or making our\nexisting products even more accessible, and our brand has become synonymous\nwith high quality and reliable childcare. The extra time that\nBrightwheel has given back, really having that time with the kids\nto support that learning journey and having that interaction\nis literally my job</p>\n<p><strong>[03:13]</strong></p>\n<p>and the best part of my \nday if I could say so.</p>"}