{"video_id": "RH-tW89Kgzo", "title": "Trump SPARKS Culture Wars MELTDOWN to Bury the Epstein Scandal", "link": "https://www.youtube.com/watch?v=RH-tW89Kgzo", "published": "2026-02-11T09:00:43+00:00", "summary": "Scott Galloway and Jessica Tarlov explore a weekend that showcased two very different Americas: Bad Bunny celebrated unity across the continent, while Donald Trump leaned into culture wars, attacking an Olympic skier for expressing mixed feelings about representing the U.S. and amplifying a racist video of the Obamas. At the same time, Congress is reviewing Epstein files, Ghislaine Maxwell is publicly hinting at clemency deals, and Trump’s allies are facing political scrutiny. They also break down Trump’s economic message ahead of the midterms — from AI-driven growth claims to foreign investment promises — and whether everyday Americans are actually seeing the benefits. Plus, they tackle the skyrocketing cost of NYC private schools, now topping $70,000 a year at elite institutions, and what it means for families navigating a struggling public system.\n\n\n00:21 How Trump stirs culture wars to distract from Epstein \n22:41 Trump’s economic pitch ahead of November elections\n32:47 If private school is worth it\n\n\nFollow Jessica Tarlov, @JessicaTarlov\nFollow Prof G, @TheProfGPod \nFollow Raging Moderates, @RagingModerates \n\nSubscribe to our YouTube Channel: https://www.youtube.com/@RagingModerates", "transcript_html": "<p><strong>[00:04]</strong></p>\n<p>Welcome to Raging Moderates. I'm Scott Callaway >> and I'm Jessica Tarlov. >> Today we're going to talk about how Trump stirs culture wars to distract from Epstein, Trump's economic pitch ahead of November elections, and if private school is worth it. If you haven't already, please make sure to subscribe to our YouTube page to get up-to-date coverage on everything happening. All right, let's get into it. Over the weekend, two very different versions of America on display. One on stage, Bad Bunny turned a major pop moment into a celebration of joy and unity, naming every country across the Americas and reminding audiences that America is bigger than any one flag or administration. At the same time,</p>\n<p>President Trump was doing what he's done for years, picking cultural fights. He went after an Olympic skier for expressing mixed feelings about representing the US, amplified a racist video depicting the Obamas, and once again leaned into grievance and division. And the timing matters because as Trump fuels these outrage cycles, Congress is quietly reviewing unredacted Epstein files, we should put unredacted around in quotes, Gelain Maxwell is publicly floating clemency for silence and senior figures tied to Trump, including his commerce secretary, are facing bipartisan calls to resign over</p>\n<p>their Epstein ties. Jess, before we get into Ebstein, what stood out to you about the wave of culture war fights Trump picked over the weekend? What really stood out to me is how ineffective I feel like he's become. Like he's really lost his fast ball. You know, they think they call it the weave that he does, right? Where he like finds a way to get a question that he doesn't like and then he goes some other path and you know, somehow his base plus the extra 10% that voted for him or whatever, like understands what he really meant and all is forgiven. And it</p>\n<p>doesn't really feel like that's happening anymore. um or at least when it comes to these culture war things like Epste, which we'll get into, people actually do care about it even though he continually tells them not to um on the Bad Bunny performance. Uh you don't spend a lot of time on Twitter. I think you spent zero time on Twitter actually. Um but it was really interesting to see prominent conservatives coming out and defending Bad Bunny's halftime show. um including Alexis Wilkins who's Cash Patel's girlfriend, the one that he's flying all</p>\n<p>over the country to see on our dime. But she said Republicans need to unite and get on better messaging because this branding is fantastic and allows all Dems to get behind it also super aesthetic. Uh Chris Rufo uh super right-wing defended it. Um Nick Fuentes uh who does go through many phases um but he said it's literally fake outrage self ghettoizing being overly political pretending to like the things we have become the far-left that's about the obsession with you know the kid rock show and he said that looked like me</p>\n<p>familiar that's like all my cousins I think I recognized a few people there and on the horrible racist video of the Obamas depicting them as apes that came out Laura Ingram um who hosts the 7 o'clock show on Fox had Caroline Levit on and asked her about it, said, \"Can you really throw a staffer under the bus?\" And Levit tried this, \"Oh, well,</p>\n<p><strong>[03:05]</strong></p>\n<p>this is a leftist media narrative.\" And she's staring at Laura Ingram, right? Saying that this is a leftist media narrative. So, it feels like the [ __ ] is being called a bit more. I I'm not predicting some downfall of the Trump administration, but it it does feel like he is not hitting his marks in the same way and he's not able to dangle like one trans swimmer in front of people to get them to come over to his side and the people are actually</p>\n<p>observing what's going on on the ground and uh formulating a not so positive view of Trump and co as a result. What did you think about the uh outrage over all the the cultural war stuff that's going on? >> Well, I first off, I have absolutely no interest in Bad Bunny. I couldn't name a song that he sings. But at the same time, I look at the economics of it. It was a brilliant move by the NFL. The NFL is investing in the future. People under the age of 18 are the majority are non-white and this is the most popular artist in the world. So, of course, they should have him as their halftime show.</p>\n<p>And I thought the halftime show was optimistic and well produced. I I watched it the next day. So, I think this was a big win for the NFL. Um, and a big win. And I just, you know, I'm no no one on the Republican side has asked me, but for them for them in their carnival barkers to come out and say he wasn't speaking English, and how's that going to help them with the Latino vote? And >> yeah, >> these cultural icons have such a huge followership and these artists that to</p>\n<p>not kind of and then I think what was even worse and again I'm biased here but Kid Rock's thing looks so sad. >> Yeah. >> It just looked like okay this is you know this is sort of what like if meth had a concert. It just felt really desperate. It felt really you know not very well produced and kind of weird. Um, so I don't I I think he picked the wrong culture war. They picked the wrong culture war here. The other observations, the things I found</p>\n<p>most fascinating about the Super Bowl had nothing to do with Bad Bunny. But by the way, I think the the threads account of Elmo had it perfectly that Elmo just hopes both teams have a really fun time. And he said, \"Bad Bunny isn't a bad bunny, he's a good bunny.\" Both both those made me laugh. But the thing I noticed was that a quarter of the ads were AI. >> Yeah. >> So it was sort of the AI bull. And the last time tech dominated was in 2022. It was called the cryptob because a quarter of the ads were crypto things like FTX</p>\n<p>and Binance. We know what happened there. And then the time before that where you breached 25% of the Super Bowl ads being from tech companies was in 2000 and we know what happened there. So if economic history repeats itself, we're about to see a major draw down in AI. And the other thing that the Super Bowl kind of conoted for me was I think there's been an enormous transfer in</p>\n<p><strong>[06:06]</strong></p>\n<p>power and value from the betting sites. Remember the big ad a few years ago with Salahek as as um Cleopatra, it was bet MGM and companies like Flutter have been on a roll. Flutter [ __ ] the bed and missed its earnings. I think everyone's moving from wagering to these speculation markets. And I think you saw that in the Super Bowl, but I I think they're on, and again, I'm biased here. I think they're on the wrong end of the I I think it would have been genius for them to say, \"Love the Super Bowl was great. Bad Bunny was was great.\" I I</p>\n<p>just think they I I think being associated with Kid Rock, you just look lame. >> Yeah. But they like >> there is an inability to ever be graceful about absolutely anything. I mean they couldn't even I'm talking about the administration, not the examples that I read out, but they couldn't even deal with reality that like a straight couple got married at the Super Bowl show, right? like there's nothing more pro pro- family and a lot of people are pointing that out like this is quote your quote unquote</p>\n<p>conservative values and you know I've seen the translations of the lyrics like yeah Bad Bunny says some dirty things like Kid Rock saying one of his original hits which is completely profane I know it was supposed to be his redemptive arc for when he found Jesus or whatever but like it's just [ __ ] entertainment for what like I >> you like some shows you don't like other ones. I certainly thought it was less politically hostile or whatever you want to call it than Kendrick Lamar's was. I mean, his message was together we are</p>\n<p>America, God bless America, led with the American flag. >> It seemed lovely. It reminded me of uh Ronald Reagan's great speech where he said, \"You can be an Italian and move to Switzerland, but you'll never be Swiss. You can be Japanese and move to Mexico, but you'll never be Mexico. But all of these people can move to America and be Americans.\" I just I love that and it's true, right? And seeing all those flags, you know, our our strength is that essentially we're the operating system</p>\n<p>for every other country that aspires to be democratic and prosperous. The US used to be the operating system legally, morally, economically for the entire West and people who aspire to be like the West. And when I saw those flags, I just thought of it as, you know, their their different cultures mostly operating or aspiring to our operating system. Let's move on. Trump's commerce secretary, Howard Lutnik, is under bipartisan pressure over alleged lies about his relationship with Epstein. I don't know if you've seen here in the UK, there's calls uh Ky thinks there's a</p>\n<p>70% chance that Kier Starmer is going down. Not because he's in the Epstein Files, but because he recommended a cabinet poster for someone who's in the Epstein Files. I mean, that's that's the bar here versus our president, who, by the way, this is just some fun facts. Trump is mentioned</p>\n<p><strong>[09:06]</strong></p>\n<p>in the Epstein Files more than Jesus is mentioned in the Bible or the term meth is mentioned in all eight seasons of Breaking Bad. >> That's my fun fact for the day >> as the main character energy. What do you think's going to any thoughts on what's going to happen with Secretary Lutnik here? >> Well, we're recording this mid testimony. So, I don't know what else will come out, but I people are going to be looking into whether he perjured himself, whether he said in any sort of official forum that he didn't associate with Jeffrey Epstein past 2005. I think it was in his confirmation hearing. Um</p>\n<p>but he went to the island to have lunch with his brought all his kids there um in 2012. And I really think that you know it needs to be a far bigger part of the discourse on this that so much of this is happening after Jeffrey Abstein is a convicted sex offender that he is a registered sex offender in 2009 and business continued as usual um in many respects. Um, so I, you know, I think Letic would be an easy person to push</p>\n<p>out. He seems dug in about Christy Gnome. Um, but Letick doesn't really bring a lot of positivity, um, or glow to the administration. And remember early on we were talking about how he was giving the worst interviews of anybody and they actually had to take him off of TV um, because he was doing such a crap job. Um, so I could see that happening. It's all part of just this overwhelming narrative um that's taking shape and you know three million documents that's</p>\n<p>going to take months and months to be able to sift through and then also to be able to connect dots between things because sometimes you you know you see an email and you don't know what it's a response to, right? Or where it fits into the whole story. Um but I was watching uh Roana has done a couple long form podcast interviews with Shawn Ryan. Have you ever watched the Shawn Ryan show? >> I haven't. He's really interesting. He's a former Navy Seal. Um was a Blackwater contractor uh with the CIA. He has a podcast. They have like 5.5 million</p>\n<p>subscribers on YouTube. Um very conservative guy and he is part of this new cadre of traditional Trump supporters that are losing their minds over the Epstein files. and not looking at this at all through a partisan lens, but just saying how is it possible that people in positions of power are not interested in getting to the roots of all of this to understanding what went on here, especially when it has to do with the abuse of children in many cases. Uh Jamie Rascin came out of the</p>\n<p>viewing room and said that the youngest victim that they saw was 9 years old, >> right? We're talking a 9year-old. And I was thinking back, remember Megan Kelly a few months ago made that crazy comment like, \"Well, we're not talking about 5-year-olds. We're talking about 14year-olds.\" And she was, you know, said, \"I'm not justifying it.\" But well, now you're talking about a 9-year-old. So a 9-year-old is more like a 5-year-old, right, than is like a</p>\n<p><strong>[12:07]</strong></p>\n<p>14-year-old. They haven't gone through puberty, right? You're talking about a kid. And Roana was talking about how he and Thomas Massie uh want like a truth and reconciliation committee to be enacted to get to the bottom of this Epstein web, which I think would be interesting. It doesn't get people any solutions right off the bat, but it feels like it's very necessary because the questions you're getting more questions than answers from all of this. Like who is Jeffrey Abstein? John Ryan thinks he was a Mossad agent. I mean,</p>\n<p>the connectivity to other nations. Um, oh my god. And the difference also in his business pre and post conviction is fascinating too. How he shifted to older girls, a lot of Russians and Eastern Europeans and was working in that part of the world. The kind of business deals that he was doing with heads of major financial institutions, his relationship with the Rothschilds, for instance, these titans of tech. I mean, Roana said he's I represent a lot of these guys, right? He's the Silicon Valley</p>\n<p>congressman and there splatter Elon Musk, Peter Teal all over it. So, you know, questions. Was he a foreign intelligence asset? Was he a US intelligence asset? He had access to the CIA for God's sakes. Like, he was in skiffs. So, who is this guy? And I've also shifted and I don't know if you have as well. Like we were talking about pedophile last week and now I guess my tinfoil hat is on a bit more and you're looking at all of the stuff that's coming out in the emails and thinking was this guy also just like a straight</p>\n<p>up murderer like ordering 330 gallons of sulfuric acid. Do you know that he had a trapoor in his house that went to the sea which is like the perfect place to dump bodies? We now know that the FBI never searched his New Mexico ranch where it's rumored that he has bodies buried there, that the FBI wiped the footage from his prison cell and that they might have taken a dummy body and put it in the cell and that they slipped him out so no one would notice. Um, these quarterly payments to the head of</p>\n<p>Ohio State's gynecology department that he was paying him thousands of dollars. Like what the [ __ ] is going on here? And also, this is very QAnon, but like all of the code words that they're using, things like white tuna potentially meaning a dead white woman. I feel a little Clare Danes and Homeland. Yeah, it's I think this is such a an erosion and degradation of our institutions because my understanding is the FBI</p>\n<p>files or the Epstein files were compiled and aggregated by a law enforcement agency. And my sense is when a law enforcement agency uh aggregates a file, the output is supposed to be indictments, not a 1% semi, you know, sclerotic</p>\n<p><strong>[15:08]</strong></p>\n<p>release, non-release, redaction. We didn't redact things. We did such that millions of bloggers with a ring light could interpret it to their political advantage and find outrage where there shouldn't be any or excuse child rape as being mixed in with other outrage. And having Silicon Valley tech bros say, \"Oh, well, you were there more times than me.\" And this is an unpopular opinion, but I think a criminal file should speak to the public. I think it's their job to use all their tools and go</p>\n<p>through and say, \"Okay, what warrants public disclosure and what doesn't?\" Because I think what we've ended up doing is diluting all the crime. Now, whether or not information on Howard Lutnik, a cabinet secretary who lied about his involvement, and it was clearly more than that, whether that should be released, I can see justification for releasing that. But did he commit a crime? And if he didn't commit a crime and it's a criminal investigation, then it's fun to shame these people. And it's great fodder for interpreting it. It makes for great media and great clicks. And it's great for the Trump administration because</p>\n<p>it's diluted the fear here that the president was involved in potentially um enabling a pedophile ring. But this has just eroded these institutions where it's like, okay, who can we trust to parse through this and figure out who is criminally liable here and get a subpoena from a a grand or indictment from a grand jury and who is on the wrong invite list. I think this whole thing has just been handled so poorly and will be looked back on as something</p>\n<p>that absolutely molested and dented and just perverted the reputation of our institutions because we don't even know how to conduct an investigation and then parse it out and what the outcome should be. And it's something something that I've been thinking a lot about. Derek Thompson, who I had on Profy Conversation, said just as we've only been skirting along the surface of the atmosphere at 710 the speed of sound for about 30 or 40 years, 95% of the public was not taking supersonic travel or or</p>\n<p>subsonic travel. Jet lag. Our species just doesn't know how to react to the sun coming up 5 hours before it's supposed to. So, our bodies get whacked with jet lag. Eventually, over, I don't know, 100, 200, 500 years, we'll adapt. Is our species ready for all of us to be broadcasters and for files like this to be released to all these people who think of themselves as people who can parse through this stuff and then broadcast it in a thoughtful way? They can't. And so this just seems like a melee where who gets caught in the scrum</p>\n<p>is our institutions. And I think the FBI under a competent president with distinct branches of government charged with fidelity to their oath and what they're supposed to do would have come out with a subreport saying, \"Okay, today we are announcing 24 criminal indictments against the following people</p>\n<p><strong>[18:09]</strong></p>\n<p>and this is the evidence against them. We have also disclosed the following people who are in positions where it's important to the public.\" Yeah. I just I think so much of this is just gossip and people not gossip but people who just love one of the things I don't like about our brothers and sisters on the left is we seem I think we need a massive redistribution of income and they're much more interested in a massive redistribution of virtue and yeah this person's a creep. Yeah, it's it makes your skin crawl but that the FBI isn't in the business of disclosing things</p>\n<p>that make your skin crawl and make people look like creeps. That's not what they're there for. They're there for criminal indictments. And all of this what I'll call redistribution of virtue is diluting from the premise from from the whole shooting match here. And that is we need to put in place a series of incentives where no matter how rich and powerful you are, if you any way provide the infrastructure, traffic, or enable or conduct child rape, we're coming for you.</p>\n<p>And it it strikes me that this is the best thing that happened. The way this has been parsed out sclerotically was a gift to the people who have actually committed crimes here because it's diluted the whole thing. Let's talk about Gelain Maxwell. Where do you think her case goes from here? >> I don't think anywhere that she wants it to. I mean, it's been really interesting to see the folks coming out of the DOJ's reading room. So, I don't know if you know about how it's designed, but it has just four computers in it. And there's</p>\n<p>no way to your point about how poorly this has been done or or rolled out that there's no easy way to search through it. I mean, people are basically just taking what they can and reading it and you have to do it in the room. So, people are spending, you know, hours in there. Um, Rascin said that by his uh his team's calculations that it would take seven years to get through the files in the current conditions established by the DOJ. So, you have</p>\n<p>that going on, which basically allows the administration to say it's all out there, even though redactions were done apparently by just like blurring out any female's name, which is is certainly not how to do this when someone like Colleen Maxwell is such a central player in this, but she's over there saying, \"Oh, I want clemency.\" And pleading the fifth to everything. And you're seeing the response of people coming out like Lauren Boowbert remember was really outfront about the Epstein files and that's where she was breaking with the Trump administration and then he personally called her asked her to pull back. She had been quieter. She's not</p>\n<p>quiet anymore coming out of that room um saying that uh obviously she can't be granted any kind of clemency. Representative Paulina Luna uh said according to the files we saw, Galen Maxwell was engaged in trafficking and rape. I don't think she deserves special treatment. She's a monster. Um, so I think that if the administration was thinking that they could pull another move like what Todd Blanch did and getting her to that cushy prison because she quote unquote was going to exonerate</p>\n<p><strong>[21:10]</strong></p>\n<p>both Donald Trump and Bill Clinton because I guess they think that the two sides are as partisan dug in which I have not seen to be the case. Obviously, Bill Clinton, and I'm not alleging that either of them did anything with an underage girl, but you don't see liberals getting their back up against the wall in in a partisan crouch, right? They're just saying, \"Let the chips fall where they may. Let's just find out what's going on here.\" But I hope that there's some world in which Maxwell is moved back to the bad prison and has to rot in there for the rest of her life. I</p>\n<p>don't think you can trust a single word that comes out of her mouth. I think her testimony is meaningless at this point. Um, she committed psychological and physical torture on these girls. I don't know if I really mean this, but to some degree, the person who is recruiting and feeding these girls to Jeffrey Epstein almost feels worse in some way. And you know how I am about women that do things like this where I just think that there</p>\n<p>is something built into us as the people who bring other people into the world that you should not be this depraved and sick. And I I think that if Trump is reading any tea leaves or Susie Wilds is, she knows that there can be no kind treatment for Galen Maxwell and that no one trusts anything that she says. >> Let's leave it there. We're going to take a quick break. Stay with us. Welcome back. Trump is proudly claiming we're already living in the Trump</p>\n<p>economy. In an NBC interview that aired during the Super Bowl, he touted strong growth, foreign investment, and a boom fueled by AIdriven productivity while insisting that any economic problems are Biden's fault. >> Let's stay on the economy. You just mentioned it. You said you inherited a mess from President Biden when it comes to the economy. >> But at what point is it on you? At what point are we in the Trump economy? >> Oh, I'd say we're there now. I'm I'm very proud of it. 5.6 6%. You know, we have a GDP of 5.6 despite a shutdown. >> But the reality is more mixed. Most Americans disapprove of his handling of</p>\n<p>the economy. Consumer sentiment is still low and some of his growth claims are inflated. As Trump rolls out this barnstorming economic message ahead of the midterms, the question is whether voters will buy it or if rising costs and skepticism about his numbers could undercut Republican prospects. What do you think Americans think about the Trump economy? >> They don't like it. Everybody doesn't like it. I mean, maybe the richest of the rich. Um, but when doesn't matter the survey, the pollster. I mean, this been an interesting week because</p>\n<p>right-leaning polls have now moved squarely into negative territory about Trump. Um, Ras Mutant's pollster has been posting a lot on Twitter about how dangerous the territory is that they are now. Um, so his net approval is minus 18. Um, 26 points lower than it was in his first term. um 53 points lower with independence. Um</p>\n<p><strong>[24:11]</strong></p>\n<p>House and now Senate is widely talked about as being in play. We assume that about the House obviously um but Senate is a big deal. Tax Foundation just came out uh with their appraisal of the Trump tariffs. American households paid $1,000 more last year because of the tariffs. Um the Journal did an analysis that the American consumer is bearing up to 43% of the burden. So, yes, the corporations are taking some of the hit, but the average American is feeling it. Um, too, and there were great special election results for Democrats again, you know, 30 point plus overperformances in</p>\n<p>Louisiana and Texas, right? Like this wasn't happening in deep blue territory. I think that people know what's up. What are your observations about the economy and how how people are reacting? >> Well, 36% of adults say they approve of his handling of the economy while 59% disapprove. That's according to NPR and the Maris PBS News survey. Um about three in 10 adults rate economic conditions in the country as excellent or good while roughly 7 and 10 rate them as only fair or poor. And 71% are concerned about the cost of health</p>\n<p>care. 71% also say say the income gap between the richest and middle class in the US is increasing and consumer confidence is lowest since 2014. In addition, the genie coefficient which measures I guess variance and it's applied to wealth. Zero would be everyone has exactly the same. If one person owned everything that would be 100. When the French Revolution happened or the kind of you know let them eat cake era uh the genie coefficient was at</p>\n<p>about uh somewhere between 80 and 85. Today in America the genie coefficient around around wealth is 83. We are literally at the point where revolutions happen. Uh the number of billionaires has surpassed 3,000 for the first time. It's higher the level of wealth is higher than any time in history. Meanwhile, one in four people globally face hunger. Billionaires are over 4,000 times more likely to hold political office. The one I like is that if you're a kid from a top 1% income</p>\n<p>earning household, you're 77 times more likely to get into an elite university. What I don't get though is that the billionaires themselves seem to be handling their own PR really poorly. That they [ __ ] post America or they seem to think that, you know, they're just not they don't come across as really grateful or civic-minded is the way the ones that get the most press are the tech bros who credit their grit and character for their success and then blame the markets for anything that's</p>\n<p>gone wrong or blame the country. Uh Trump families pocketed more than 1.8 billion in cash and gifts since the 2024 re-election. But for other things, as you pointed out, things have got or other people things have gotten better. Um tariffs show that only about 4% of the tariff burden is shouldered by foreign firms and that a near complete pass through of 96% to US buyers. folks, this notion</p>\n<p><strong>[27:11]</strong></p>\n<p>that the firm itself or the uh exporter uh shipping goods into the US would pay for tariffs. No, 96% of those tariffs are being passed on to American consumers. The other big winners have been Silicon Valley's tech titans. Musk spent at least 55 million on supporting conservative candidates last year and he accumulated roughly a quarter of a trillion dollars under Trump in terms of wealth growth. Yeah, it's pretty bleak. And I think that that's the reason that their PR has not been going well because I think those</p>\n<p>stories are actually being covered and that people are very conscious of it. Even if Yeah. Well, they feel it. They feel what's going on in their pocket and then that the upper class is walking around like nothing happened. And I wanted to get your take on this. So John Oaf, who is a vulnerable Democratic senator in Georgia, he kind of appears every few months and does a great rally and reminds people um that he's awesome. Um but he's been talking about income inequality and going against the</p>\n<p>billionaires and you know the corporate class, but he rolled out the Epstein class at his rally over the weekend. We were told that MAGA was for workingclass Americans. But this is a government of, by, and for the ultra rich. It is the wealthiest cabinet ever. This is the Epstein class ruling our country. They are the elites they pretend to hate. If you're Steve Bannon and your pitch,</p>\n<p>>> your pitch was Trump for the forgotten man and woman, how do you sell any of this? Trump was supposed to fight for the working class. Instead, he's literally closing rural clinics and hospitals to cut taxes for George Soros and Elon Musk. >> So, he threw in the left-leaning billionaire right into all of this who puts a lot of money into those DA races across the country, etc. And I thought it was such smart framing, right, to make really putting this as us versus them and we're willing to sacrifice</p>\n<p>Soros in pursuit of that. What do you make about the Epstein class as a term? Um, and then also, how do you think do you think Democrats are doing a decent job of seizing the moment or we're kind of still just like receiving results rather than going out and making them ourselves? Yeah, I think that I think I think it's brilliant and and the reason it's brilliant is that I think if Democrats try to say all men are violent, all white people are racist, and all billionaires are evil, well, don't be surprised if you know you're</p>\n<p>stuck with very left-leaning female non-whites, which you cannot win an election with. Those people will leave you. The donors will leave you. They'll believe you, but you're saying I'm evil. I I thought Mark Benoff took way too much [ __ ] He said something off, you know, dumb in my view about San Francisco politics. The guy's been an incredible civic donor and there's this</p>\n<p><strong>[30:12]</strong></p>\n<p>notion that, okay, all billionaires are evil because we have some tech billionaires that just seem incredibly weird and ungrateful. So, I love the idea and not only that, I think Democrats should wrap their arms around successful people and people who make a lot of money. And what they need to do is all right, you've controlled the House, the Senate, and the White House for periods of time, and yet every time you're in there, you lower taxes on these people. So stop stop bitching about the officiating. You're wearing a black and white striped shirt. Figure out more progressive tax structure and stop demonizing</p>\n<p>people who make a lot of money. Stop demonizing young men. Stop demonizing or having a bias against white people. I there that's just not a winning recipe for elections. What is brilliant about this is what he manages to do is say there is a virus in America amongst people who tend to be wealthy, tend to be white, tend to be male, not all of them, who believe they're not subject to the same standards as everybody else, and believe they can get away with anything and believe they're</p>\n<p>entitled to a level of depravity that no one else would would dare uh take these sorts of risk. and he's classified them as the Epstein class, which I think is brilliant cuz what it's saying is no, not not every rich white guy is a pedophile. I get that. But there is amongst this this group of people an Epstein class. So I think it's brilliant positioning because what it does is it doesn't alienate the Howard Schultz's of the world. you know, the it doesn't alienate</p>\n<p>wealthy white guys who have traditionally been supporters of the Democratic party who at some point are like, you know, I I'm sick of trying to be your ally and you want to hang me at Dawn because I'm pointing the gun incorrectly. So, I think it's I think it's brilliant positioning. He's been very good. He's very vottoenic. Uh I'm going to give him some money just you bring it up. I like him. I hope >> he's had the before and afters. really fun discourse online about his glow up.</p>\n<p>>> We had a glow up. >> He definitely lifted some weights and uh his hair's a bit different. I mean, >> he looks good. >> Yeah. >> Is his race close? I haven't been following it. >> It is. I think it's now at lean D when it was more tops, but they're not fielding a great situation on the right against him. I mean, it's it's just incredible that we have Waro and Oaf, frankly. >> Yeah. Especially in Georgia. Yeah. Fingers crossed, right? Okay. Yep. >> Let's take a quick break. Stay with us. >> Welcome back. Before we go, private</p>\n<p>school tuition in New York City has officially crossed jaw-dropping territory. Several elite schools are now charging more than $70,000 a year, more than many top colleges, as families flee a struggling public system embraced from major changes under the new mayor. For some parents, it's sticker shock. For others, it's the price of peace of mind. Jess, this is something we both deal with. This is a story of privilege. >> This is why I submitted it to David. I</p>\n<p><strong>[33:13]</strong></p>\n<p>was like, Scott's going to want to talk about this. >> But what do I I got a I got I got a lot to say about this or a lot of thoughts. >> You go first. I always go first. I want to hear you first. >> Well, I think Okay, so I'm going through this right now on both levels. My son just applied to college. They have this total racket called early decision where you say this is my top choice and they say rather than a 9% admissions rate we'll bump it up to 15% in exchange for the following. If we let you in, you withdraw all applications from every other college. They immediately get</p>\n<p>withdrawn. Now what does that do? Okay, in exchange for us saying to you greater chance of getting in, you lose all negotiating all all leverage for financial aid. So in a desperate move to please your parents, please yourself, go to a good school where they artificially sequester supply, not all schools, but most most of the top schools such that they can raise rates faster than inflation. We're going to enter into this corrupt cartel-like system of saying you can get a better chance of getting in, but once you're in, no leverage. Syracuse</p>\n<p>couldn't fill their class. And so they started offering scholarships. And the people who got an early decision said, \"Where are scholarships?\" and they said, \"Sorry, you're [ __ ] You've committed to go here.\" So, there is all sorts of griff going on here. Now, with respect to K through 12, the reason I left New York is because my son got shut out of seven schools because he was speech delayed. You know, the story ends well. Just got into an elite school. But that was really upsetting that no one would let us in, our son in, our four-year-old into a school and let us pay them</p>\n<p>$58,000 to play with blocks. And they artificially against sequester supply. And the math I did is that I think every private school should be required to say the following. All right. Say you're right and you your kid you decide to send your kid to the public school. By the way, there's a lot of research showing the best school for your kid is the closest public or private and reinvest that commute time back into study, sleep, play, time with parents. But let's say you send them to their local public school and you were wrong.</p>\n<p>They don't get as good an education. And to be clear, the average public school in America spends $15,000. The average private school 75. So over the course of 12 years, $720,000 funneled through an education system is going to pay off for your kids, as evidenced by the SAT, where lower income kids score 150 points less than middle- inome kids. And then hold your hats. Upper income kids score 250 points higher than middle class kids because for 12 years they've had another $60,000 in education, tutoring, counseling. uh you know, athletics</p>\n<p>invested in them. You have this situation where okay, everyone there's a massive overinvestment. Say you took that $50,000 or that I'm sorry, now it's $70,000. If you took that $70,000 and you were disciplined and you sent it to Vanguard every year and sent them to the local public schools, say you [ __ ] up. They don't get into an elite school. They don't get into an elite college.</p>\n<p><strong>[36:14]</strong></p>\n<p>Okay, people will say elite college doesn't matter. Yeah, it does, folks. I hate to break it to you. It does. And any parent telling you college doesn't matter anymore just found out their little Susie got a 22 on the ACT and is trying to make himself feel better. But say fine, okay, we put that $72,000 a year aside. The kid doesn't get into an elite school, doesn't get out of the gate strong, can't get a house. We [ __ ] up sending them to public school. If you had taken that $72,000 and over 12 years were disciplined about putting it in an index fund and the market went up 9% which it has since the beginning</p>\n<p>of the market at 35 you can ease your guilt and your kids pain by giving them $4.5 million. So, it is very hard to argue that if you were to be disciplined and to take that money that you would spend on private school, especially in New York, and put it into index funds, you're going to be able to buy back a lot of potential mistakes and economic harm for that kid. Now, there are other reasons to send them to that school. And also, just so I can get the progressives angry, there needs to be more accountability from public school officials because New York</p>\n<p>is not short on money spent per child. It's short on positive outcomes. it just we continue to have kids who are not doing well even despite the fact we spend more than a lot of places do. So the the sequestering of the 1% who have their own transportation, their own security, their own neighborhoods, their own education, their own health care creates a situation where the most powerful and some of the most talented among us are no longer invested in</p>\n<p>America. And the number one indicator of a strong school in terms of outcomes isn't money, isn't isn't the kids, it's how engaged the parents are. And I saw this happen. I went to junior high in the 70s. In my seventh grade, you know, me and all my friends were there. And then in the eighth grade, they started busing. And all of a sudden, overnight, 40% of our class, a thousand kids, literally a thousand kids from Compton, black kids were bust in an hour each way. you know, in a bad [ __ ] mood</p>\n<p>when they got there. And I wish it had been a Hallmark commercial. We hated each other. It was violent. It was ugly. We used to have black against white softball games and the faculty allowed that. >> That's the bad news. The good news is by the time we got to high school, we were all getting along. So, integration did pay off. And I actually think it's one of the reasons I have more empathy for people. My two closest friends was a Mormon kid who went to Stanford and a black kid who had to get a football scholarship to get to a school in Oregon. Immediately in the eighth grade,</p>\n<p>my two best friends, Adam and David, their parents pulled them out and sent them to Winward, this Tony school. And I had one of those talks with my mom. So I'm like, \"Mom, I need to go to Winward. All my friends are going there.\" And she's like, \"No, we're I had one of those word different talks.\" >> Yeah. But the the wealthy the school system is yet another means of enforcing the cast system. And the only solution I</p>\n<p><strong>[39:15]</strong></p>\n<p>can come up with is to take that $70,000 price tag and make it a h 100,000 >> and redistribute that income back into public schools with distinctly harsher standards on teachers, administrators, and unions that if you don't get your scores up, it's going to a charter school and we're firing all of you. Uh but something needs to happen here. It's become the new enforcer, the cast system. Anyways, that's my TED talk. >> I agree with everything that you said and most happy, I guess, to hear that the marker of the best school for your child is proximity because we're opting</p>\n<p>to send our oldest will go to public school next year. She'll start kindergarten. And it was a very hard decision for us to make because she has a December birthday. And inexplicably, the New York City public school system just puts all the kids who are born in the same year in the class. So, she'll >> Oh, so she'll be one of the youngest. It's not as bad for girls as it is for boys. There's I'm sorry to interrupt you, but there's research that shows the youngest boys in a class are more likely to be depressed because they're smaller</p>\n<p>and they get picked on. But the same data is not as evident with girls who are the youngest in their class. >> Okay. Well, that's good news. And she's very tall. Uh she she has good tall jeans. Um, but so we're opting to do that. And as a New York City private school graduate, I had a lot of feelings about what kind of educational opportunities I was giving my child versus the ones that I was afforded. And this chart about the tuition costs really popped out at me cuz the school that I went to for high school was on it, place called the Dalton School. It was $35,000 when I went. It's $70,000</p>\n<p>now. And I look at the world, right? I'm I'm out here functioning. I work with people who are paid tremendous amounts of money. My husband works in finance. He went to public school. A lot of his friends have huge jobs, right? Like leading big divisions at financial institutions who the people that I went to school with report to them, right? And these are your average good public school, but just, you know, normal thing that a</p>\n<p>parents that parents move to a certain place because they have a great school and they want their kids >> state. Yeah. >> Yeah. And they're they're not just fine. In most cases, I find that they're better human beings. A lot of them are more successful, but I've been much more focused on the quality of human than the level of academic achievement necessarily because I've just met so many and grew up with so many people who I don't want to be the folks surrounding my kids. And we'll see what happens. I I</p>\n<p>hope that the school is fantastic for her and at some point we will end up in the private school system, but you look at that price tag and going back to what you were just saying about the genie coefficient for the US. It's just wrong at a certain age. >> But especially at that age, they're playing >> for five. Yes, I get it. And most of these schools go through the really good ones in New York City at least, they go through fifth grade and then most kids filter into the private school system</p>\n<p><strong>[42:15]</strong></p>\n<p>and they're set up for success with that. But the system needs to be smashed because you say, you know, take that 70k and invest it. A lot of for most people, they don't have the 70k, right? Or that they would be taking out loans to be able to do this and putting themselves into debt. But there has to be a real reckoning. And this goes back to the Epstein class, you know, formulation, right? Where you just say it shouldn't be this way. And a majority of people who are doing this, and this is happening in cities all across the country, it's not just New York City. It's because their parents have</p>\n<p>generational wealth that they can help them. Can't even tell you how many people I know that are like, \"Well, we're not paying for it, right? This is money that was set aside by grandparents.\" And it's creating this false sense of uh financial security and ego for these kids who are walking around like they're all, you know, like too big for their britches. We're saying, \"Yeah, your granddad founded X, Y, or Z thing, right? or your your grandparents came from or your great-grandparents this incredible immigrant class and was able to pass</p>\n<p>down this wealth so you could go to this school, but what are you going to make of it? Of course, people at the top, they're going to go to the Harvards and the Yales of the world, but there are plenty of kids are going to go to just average schools, right, colleges out of this. And then I'm thinking, you know, you spent hundreds and hundreds of thousands of dollars for them to probably not have as good of a or as fun certainly or well-rounded experience while they were in school. and they ended up at exactly the same place with no guarantee that they're going to have a better job when they're coming out of it. Um, so all for a meritocracy in this</p>\n<p>of smashing the system that allows schools to be $70,000 a year and and hearing about also, you know, school just doesn't feel like it should be for profit. I I just I hate that, especially going down to the dirty secrets. The dirty secret is the nonprofits are four prophets wrapped in a sheep's clothing. >> So now you've just ruined everything for me. >> There's 16 administrators for every one person that teaches at MIT. I can tell you my colleagues are obsessed with artificial scarcity and means of every</p>\n<p>every morning, not everyone, but the majority of administrators, the majority of faculty members are capitalists like everywhere else. And they wake up in the morning and they say, \"How do I increase my compensation while reducing my accountability?\" and they wrap themselves in nobility and raise tuition faster than inflation every year. When I I went to public school all the way through graduate school and seven years of tuition of undergrad at UCLA and graduate school at Berkeley, the total tuition was $7,000. And the UC system is still doing God's work. Yeah.</p>\n<p>>> Still exceptional value. Probably the one of the best actors in the space. And now that would be aboutund the tuition for seven years would be $120,000. Now 7 to 120 even as old as I am has vastly outpaced inflation. I mean it's a longer conversation but a lot of it comes back to cheap credit governmentbacked student loans accreditation that won't let competition</p>\n<p><strong>[45:17]</strong></p>\n<p>in. And also they in my view we need to revoke the taxfree status of any university whether it's Dartmouth or Harvard that has an endowment over a billion dollars that's not growing its freshman class faster than population growth because they've decided they're a hedge fund offering classes no longer a public servant. But we fall under the illusion that me and my colleagues are like nice, noble, good people. No, we're capitalists like everyone else. And unless we're regulated, we're going to [ __ ] the middle class. And that is exactly what we've been doing for the last 40 years. >> Thanks a lot, Scott. >> There you go. All right, Jess, that's</p>\n<p>the episode. Before we go, if you're watching us on YouTube, make sure you hit subscribe. Thank you for listening to Raging Moderates.</p>"}