{"video_id": "eD1bI4LGobw", "title": "Tacit: Fingal Ferguson, Master Knifemaker", "link": "https://www.youtube.com/watch?v=eD1bI4LGobw", "published": "2025-12-18T16:45:08+00:00", "summary": "In this episode of Tacit, we follow Fingal Ferguson, a fifth-generation farmer and master knifemaker in West Cork, Ireland. Fingal divides his time between the farm and the forge, where he handcrafts knives prized by chefs around the world. His work reflects a form of expertise that cannot be fully written down or automated. You can study metallurgy or knife design on paper, but knowing when steel is ready to move or how a blade should feel in the hand comes only through years of practice and close attention to materials.\n\nFingal’s craft is an example of tacit knowledge: expertise that develops through repetition and proximity to other makers. In an era of AI-generated output, his knives show what machines still struggle to replicate: judgment shaped by experience, care, and embodied understanding. Tacit is a series about that kind of mastery, and why it matters.\n\nLearn more about Tacit, a mini-documentary series from Stripe Press about mastery and the value of craft: https://stripe.press/tacit", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=eD1bI4LGobw\">https://www.youtube.com/watch?v=eD1bI4LGobw</a></p>\n<h2>Transcript</h2>\n<p>The biggest honor there is as a knife maker is to actually see some guy who bought your knife. And you see years later you go back there and you see the worn used handle and the blade from sharpening. Out of all the knives there it was one being used. And that&#x27;s a beat your chest moment. The Fergusons make</p>\n<p>Gubbeen cheese in the townland of Gubbeen in West Cork in Ireland. My name is Fingal Ferguson. I&#x27;m the fifth generation on the farm. On my father&#x27;s side a long line of farmers. And my mom&#x27;s side is probably more of an interested one of more worldliness. Dad has a security and amazing steadfast way of being so efficient and logical in such a casual way. And mom was so creative</p>\n<p>and quite brilliant and such a strong character. My sister Clovis I jokingly refer to her as the white witch of Gubbeen. She can heal you through food. I have kids. I want them to be proud of where they grew up and what they do. And you know one of the Fergusons being me also happens to make knives. As a butcher</p>\n<p>through this whole process I always worked with a knife. This physical object this thing that basically wasn&#x27;t eaten and didn&#x27;t disappear. All my friends through the cheese and through everything else, they were chefs. The tool of the trade to all of these people that I had come to love was the knife. Knife making in general is a very simple process that actually you can complicate and simplify as much as you want.</p>\n<p>You have to find the metal. You have to make it hard. And you have to make it into the shape and put a handle on it. And there&#x27;s no such thing as the best knife steel in the world. There&#x27;s just the best knife steel for that one job. You&#x27;re gonna forge out a thickness into this steel. There&#x27;s a point where the steel is softened. It&#x27;s annealed. It&#x27;s in this point where you can bend and you can straighten it and you can do all these things to it. When you violently change the temperature of a piece of steel and shooting it up to 1080 degrees centigrade and then crash it back down to sort</p>\n<p>of room temperature in three seconds, it&#x27;s so hard that it&#x27;s actually brittle. It&#x27;s fragile. So at this stage you now have a blade that isn&#x27;t finished, but it has been transformed. Muscle memory is I think, to me, a knife maker&#x27;s tool of instinct. What I mean by that is you&#x27;re on the grinder. You&#x27;re holding something in your hand. You close your eyes and you almost will automatically put it back in the same place, at the same angle, at the same pitch, at the same yaw.</p>\n<p>The whole thing. You&#x27;re looking at the shadow that&#x27;s being cast from the light that&#x27;s behind you against the product. And using that shadow as a guide to see how close or how far you are from the platens. It&#x27;s a subconscious means of sort of knowing things and that helps you through the longevity of a process where you can disappear into that. Hello? Sorry there&#x27;s actually a crisis</p>\n<p>going on at the moment. Is there any way you could courier it to us and let us know the cost of that? Or should I arrange a collection? I suppose. I feel very connected to to the chaordic word. To some people that could be an insult. To me it&#x27;s like it&#x27;s a sign of winging it moving forward. And maybe probably moving faster than you should be. Hot, hot, hot. That is not</p>\n<p>normally how it happens. The knives don&#x27;t go off. They don&#x27;t go stagnant or stale. So I need to basically know that I can stop here and go and prioritize the farm and anything else that needs my attention. And I do that willingly. You can see that there&#x27;s a family relationship that leads me to a certain shape of the blade. I find that</p>\n<p>your first impulse the first thing that comes to your mind usually 90% of the time is the one you should go with. The first instincts are very powerful. These are some lovely Damascus blades. I have some high-carbon steel ones here. These knives are worthy of a little accent a little twist. This is the spine of a Spinosaurus. I&#x27;ve got pieces of mammoth ivory. That little piece of it can slip in between the bolster and the handle. There is an element of personal choice. You&#x27;re going to shape the handle.</p>\n<p>This is all about ergonomics. There&#x27;s a balance and there&#x27;s a weight and there&#x27;s a feel. There&#x27;s a thickness you can feel in the fingertips. This step is something very unique to myself that I&#x27;m proud of because it&#x27;s both functional but also visually appealing. At the very end when you feel like it&#x27;s finished really you&#x27;re probably still at 80%. You have to go over it. You have to look at it closely. Find those imperfections. Test it. The fact that it can</p>\n<p>cut paper is one thing. What&#x27;s really interesting is actually the sound it&#x27;s making while you&#x27;re cutting it. So there is a point of maybe tear, if that&#x27;s amplified. It&#x27;s one element of what you&#x27;re listening for. Or sometimes if there&#x27;s just one little part of the edge that isn&#x27;t quite right, you can hear it. And I think I can see a bit there that maybe I&#x27;d nearly touch up. So that&#x27;s one of the knives.</p>\n<p>And then this is a knife I haven&#x27;t fully sharpened yet, properly. Are you hearing a difference? Slightly. And also one of the things that&#x27;s kind of important and a nice test as well is the push cut. If I&#x27;m going to push on the exact same place as opposed to the pull, a pull cut. So all of these elements are are telling me something. So it&#x27;s a tool. It&#x27;s also fun and it</p>\n<p>makes an incredible mess. Beauty to me wasn&#x27;t somebody wearing a wonderful outfit very elegant and beautiful in respects of the eye of the beholder. Beauty also came from a wildness and originality and seeing beauty in something very simple and them wanting to master that. If I was to be asked</p>\n<p>if I&#x27;d mastered knife making, I hope not. It&#x27;s lovely to see an evolution. And I&#x27;m very curious to see how that evolution will be in the future.</p>", "chapters_count": 0}