{"video_id": "QEvv_MK-blo", "title": "Why SpaceX abandoned carbon fiber – Elon Musk", "link": "https://www.youtube.com/watch?v=QEvv_MK-blo", "published": "2026-02-12T17:30:09+00:00", "summary": "Full episode: https://www.youtube.com/watch?v=BYXbuik3dgA\nMe on twitter: https://x.com/dwarkesh_sp\n\nIn the full episode, John and I got to do a real deep-dive with Elon. We discuss the economics of orbital data centers, the difficulties of scaling power on Earth, what it would take to manufacture humanoids at high-volume in America, xAI’s business and alignment plans, DOGE, and much more.", "transcript_html": "<h2>Transcript</h2>\n<p>Originally, yeah, we were going to make stashup out of uh carbon fiber. Um and um carbon fiber is pretty expensive. Like the the the you know, you can generally uh when you do volume production, you can get any given thing to be to start to approach its material cost. The problem with with common fibers is that material cost is still very high. Um um so um it&#x27;s about it&#x27;s about 50 times particularly if you go for a high</p>\n<p>strength specialized carbon fiber that can handle um cryogenic oxygen. It&#x27;s it&#x27;s it&#x27;s like quot roughly 50 times the cost of steel. Um and at least uh in theory it would be lighter. People generally think of steel as being heavy and carbon fiber as being uh light. Um and for room temp room temperature applications um you know like say uh more or less room temperature applications like a Formula 1 car uh static aeros structure or any any kind of aeros structure really uh is is going to you&#x27;re going to</p>\n<p>probably be better off with carbon fiber. Um now the problem is that we were trying to make this enormous rocket out of carbon fiber and uh our progress was extremely slow &gt;&gt; and it had been picked in the first place just because it&#x27;s light. Yes. Um like at first glance um like most people would think that the the the choice for making uh something light would be carbon fiber. Um the um now now the thing is that um we we when you make something very</p>\n<p>enormous out of carbon fiber and then you try to have the carbon fiber um be efficiently cured mainly not not room temperature cured because like you&#x27;ve got you know sometimes you got like 50 flies of of of carbon fiber and and carbon fiber is really carbon string and glue. Um and uh and you in order to have um high strength, you need an autoclave. So something that that can that&#x27;s essentially high pressure oven. And if if um if you have something that&#x27;s uh a gigantic</p>\n<p>uh the oven&#x27;s got to be bigger than the rocket. Um so be trying to make the the autoclave that&#x27;s bigger than any autoclave that&#x27;s ever existed. Uh or do room temperature cure, which takes a long time and and has issues. Um but but the fundamental issue is that we&#x27;re just making very slow progress uh with uh with cotton fiber. Um so um &gt;&gt; I think the meta question is u why it had to be you who made that decision. There&#x27;s many engineers on your team. &gt;&gt; Yeah. How did the team not arrive at the steel?</p>\n<p>&gt;&gt; Yeah. Exactly. This is a part of a broader question like understanding your comparative advantage at your companies. &gt;&gt; Um so it was because we were making very slow progress with with carbon fiber. I was like, &quot;Okay, we&#x27;ve got to try something else.&quot; Now, for the Falcon 9, the the primary airframe is made of aluminum lithium, which is has very very good strength weight. Um, and um actually it has uh about the same maybe maybe better strength weight for its application than carbon fiber. But aluminum lithium is very difficult to</p>\n<p>work with. In order to weld it, you have to do something called friction stir welding where you join the you join the metal without it entering the liquid base. Um so it&#x27;s kind of wild that you could do that. Uh but with this particular type of welding you can do that. Um but uh it&#x27;s very difficult to like say let&#x27;s say you want to make a modification or attach something to um aluminum lithium. You now have to use mechanical attachment with seals. Um you can&#x27;t uh weld it on. Um so we want to I want to avoid using aluminum lithium for</p>\n<p>the primary structure for uh for Starship. Um and uh and and there was this very special grade of uh carbon fiber that that had you know very good mass properties. So with rock rocket you&#x27;re really trying to maximize the percentage of the of the rocket that is propellant minimize the the mass obviously and um the but like I said we&#x27;re making very slow progress um and and and I said at this rate we&#x27;re never going to get to Mars so we&#x27;re going to</p>\n<p>think of something else um I didn&#x27;t want to use aluminum lithium because of the difficulty of friction still welding um especially doing that at at at scale was hard enough um at 3.6 m in diameter, let alone at 9 m or above. Um then um I said, well, what about steel? And and so the the now I I I had a clue here because some of the early um US rockets had used very thin steel. The Atlas rockets had used a steel balloon tank. Um so it&#x27;s not like steel never been</p>\n<p>used before. It actually had been used. Um and when you look at the at the material properties of stainless steel um especially uh very uh if it&#x27;s been very like full hard uh strain hardened stainless steel uh at cryogenic temperature uh the the strength weight is actually similar to carbon fiber. So if you if you look at the so if you look at material properties at room temperature um it looks like the steel is uh is going to be twice as heavy. But if you look at the material properties</p>\n<p>at cryogenic temperature of full hard steel stainless of of particular grades uh then the the you actually get to a similar strength weight as carbon fiber and and in the case of Starship both the fuel and the oxidizer are cryogenic. So for for uh Falcon 9, the fuel is rocket propelled grade kerosene basically pure like a a very pure form of jet fuel. &gt;&gt; Um which is but but that is that is roughly room temperature. Um although we do actually we do actually chill it</p>\n<p>slightly below we chill it like a beer. Um delicious. &gt;&gt; We do we do chill it but um but but it&#x27;s not cryogenic. In fact if we made it cryogenic it would just turn to wax. So um but but for Sasha the it&#x27;s liquid methane and and liquid oxygen they they uh they&#x27;re liquid at at similar temperatures. Uh so uh so basically almost the entire primary structure is a cryogenic temperature. So then you&#x27;ve got uh uh a 300 series stainless that&#x27;s that&#x27;s um strain hardened uh because</p>\n<p>it&#x27;s at almost the whole things at crying temperature actually has a similar strength to weight as u carbon fiber but costs uh 50 times less than raw material and is very easy to work with. You you can weld stainless steel outdoors. You could smoke a cigar while welding stainless steel. It&#x27;s it&#x27;s like it&#x27;s it&#x27;s very resilient. &gt;&gt; Um you you can modify it easily. It&#x27;s it&#x27;s uh if you want if you want to attach something, you just weld it right on. So um very easy to work with uh very low cost u and um and like I said at</p>\n<p>cryogenic temperature, similar strength to weight uh to carbon fiber. Um then when you factor in that uh that we don&#x27;t need we don&#x27;t we we have a much reduced uh heat shield mass uh because the melting point of steel is much greater than the melting point of aluminum um it&#x27;s about twice the melting point of aluminum and &gt;&gt; so you can just run the rocket much hotter. &gt;&gt; Yes. So especially for the ship um which is coming in like a fl a blazing meteor uh it is uh the you you you can greatly reduce the mass of the heat shield um so</p>\n<p>the so you can call it cut the mass of the windward uh part of the heat shield in in maybe in half &gt;&gt; and you don&#x27;t need any heat shielding on the on the leeward side. Um so um the the net if net result is actually the steel rocket weighs less than the carbon fiber rocket &gt;&gt; because the the resin in the carbon fiber rocket uh uh um starts to melt. Um so basically carbon fiber and aluminum</p>\n<p>have about the same operating temperature capabilities um and whereas steel can operate at twice temperature. I mean, these are very rough approximations. People will &gt;&gt; I won&#x27;t go to rocket base. &gt;&gt; What happens is like people will say, &quot;Oh, he said it&#x27;s twice. It&#x27;s actually it&#x27;s actually point8.&quot; Shut up, &gt;&gt; That&#x27;s what the main comment is going to be about. Yeah. &gt;&gt; God damn it. Okay. The point is the the actually in retrospect the we should have started with done steel in the beginning. It was dumb not to do steel. &gt;&gt; If you enjoyed this clip, you can watch the full episode here and subscribe for more clips. Thanks.</p>", "chapters_count": 0}