{"video_id": "y8ZEJe2Ss9k", "title": "Avoiding Bankruptcy Before AGI – Dario Amodei", "link": "https://www.youtube.com/watch?v=y8ZEJe2Ss9k", "published": "2026-02-14T16:45:02+00:00", "summary": "Full episode: https://youtu.be/n1E9IZfvGMA\nMe on twitter: https://x.com/dwarkesh_sp\n\nDario Amodei thinks we are just a few years away from “a country of geniuses in a data center”. In this episode, we discuss what to make of the scaling hypothesis in the current RL regime, how AI will diffuse throughout the economy, whether Anthropic is underinvesting in compute given their timelines, how frontier labs will ever make money, whether regulation will destroy the boons of this technology, US-China competition, and much more.", "transcript_html": "<h2>Transcript</h2>\n<p>Even if the technology goes as fast as I suspect that it will, we we don&#x27;t know exactly how fast it&#x27;s going to drive revenue. We we know it&#x27;s coming, but with the way you buy these data centers, if you&#x27;re off by a couple years, that can be ruinous. It is just like how I wrote, you know, in machines of loving grace, I said, look, I think we might get this powerful AI, this country of genius in the data center, that description you gave comes from the machines of loving grace. I said, &quot;We&#x27;ll get that 2026, maybe 2027.&quot; Again, that is that is my hunch. Wouldn&#x27;t be surprised if I&#x27;m off by a year or two,</p>\n<p>but like that is my hunch. Let&#x27;s say that happens. That&#x27;s the starting gun. How long does it take to cure all the diseases, right? That&#x27;s that&#x27;s one of the ways that like drives a huge amount of of of of economic value, right? Like you cure you cure every disease. You know there&#x27;s a question of how much of that goes to the pharmaceutical company to the AI company but there&#x27;s an enormous consumer surplus because everyone you know assuming we can get access for everyone which I care about greatly we you know we we cure all of these diseases how long does it take you have to do the biological discovery you have to you know go you have to you know</p>\n<p>manufacture the new drug you have to you know go through the regulatory process I mean we saw this with like vaccines and co right like it there&#x27;s just this we we got the vaccine out to everyone but it took a year and a half, right? And and so my question is, how long does it take to get the cure for everything, which AI is the genius that can in theory invent out to everyone? How long from when that AI first exists in the lab to when diseases have actually been cured for everyone, right? In in you know, we&#x27;ve had a polio vaccine for 50 years. We&#x27;re</p>\n<p>still trying to eradicate it in the most remote corners of Africa. And you know, the Gates Foundation is trying as hard as they can. others are trying as hard as they can but you know that&#x27;s difficult again I you know I don&#x27;t expect most of the economic diffusion to be as difficult as that right that&#x27;s like the most difficult case but but there&#x27;s a there&#x27;s a real dilemma here and and where I&#x27;ve settled on it is it will be it will be it will be faster than anything we&#x27;ve seen in the world but it still has its limits and and so then when we go to buying data centers you know you again again the curve I&#x27;m</p>\n<p>looking at is okay. We you know we&#x27;ve had a 10x a year increase every year. So beginning of this year we&#x27;re looking at 10 billion in in in annual in you know rate of annualized revenue. At the beginning of the year we have to decide how much compute to buy. Um and you know it takes a year or two to actually build out the data centers to reserve the data centers. So basically I&#x27;m saying like in uh 2027 how much compute do I get? Well, I could assume um uh that uh the uh revenue will</p>\n<p>continue growing 10x a year. So it&#x27;ll be uh one uh one 100 billion at the end of 2026 and 1 trillion at the end of 2027. And so I could buy a trillion dollars. Actually, it would be like5 trillion dollars of compute because it would be a trillion dollar a year for for five years, right? I could buy a trillion dollars of compute that starts at the end of 2027. And if my if my revenue is not a trillion dollars, if it&#x27;s even 800 billion, there&#x27;s no force on earth. There&#x27;s there&#x27;s no hedge on earth that</p>\n<p>could stop me from going bankrupt if I if I buy that much compute. And and so even though a part of my brain wonders if it&#x27;s going to keep growing 10x, I can&#x27;t buy a trillion dollars a year of compute in in in in in in in in 2027. Uh if I&#x27;m just off by a year in that rate of growth, or if the the growth rate is 5x a year instead of 10x a year, then then you know you go bankrupt. Um and and and so you end up in a world where you know you&#x27;re supporting hundreds of billions not</p>\n<p>trillions and you accept you accept some risk that there&#x27;s so much demand that you can&#x27;t support the revenue and you accept still some risk that you know you got it wrong and it&#x27;s still slow and so when I talked about behaving responsibly what I meant actually was not the absolute amount that that actually was not um you know I think it is true we&#x27;re spending somewhat less than some of the other players. It&#x27;s actually the other things like have we been thoughtful about it or are we yoloing and saying, &quot;Oh, we&#x27;re going to do hundred billion here or hundred billion dollars there.&quot;</p>\n<p>I kind of get the impression that, you know, some of the other companies have not written down the spreadsheet that they don&#x27;t really understand the risk they&#x27;re taking. They&#x27;re just kind of doing stuff because it sounds cool. If you enjoyed this clip, you can watch the full episode here and subscribe for more clips. Thanks.</p>", "chapters_count": 0}