{"video_id": "cPt1dcq58Q8", "title": "Trump has become “Ineffective”", "link": "https://www.youtube.com/shorts/cPt1dcq58Q8", "published": "2026-02-11T18:00:43+00:00", "summary": "Whether he’s posting racist videos, or blaming it on the media, Trump’s old playbook isn’t hitting the same marks anymore. Jessica Tarlov and Scott Galloway discuss, on Raging Moderates.", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/shorts/cPt1dcq58Q8\">https://www.youtube.com/shorts/cPt1dcq58Q8</a></p>\n<h2>Transcript</h2>\n<p>The is being called a bit more. &gt;&gt; Over the weekend, President Trump was doing what he&#x27;s done for years, picking cultural fights. He went after an Olympic skier for expressing mixed feelings about representing the US. I think that skier probably represents most of us right now. Amplified a racist video depicting the Obamas and once again leaned into grievance and division. &gt;&gt; What really stood out to me is how ineffective I feel like he&#x27;s become. Like he&#x27;s really lost his fastball. I think they call it the weave that he does, right? where he like finds a way to get a question that he doesn&#x27;t like and then he goes some other path and</p>\n<p>somehow his base plus the extra 10% that voted for him understands what he really meant and all is forgiven and it doesn&#x27;t really feel like that&#x27;s happening anymore at least when it comes to these culture war things and on the horrible racist video of the Obamas depicting them as apes that came out Laura Ingram had Caroline Levit on and asked her about it said can you really throw a staffer under the bus and Levit tried this. Oh well, this is a leftist media narrative and she&#x27;s staring at Laura Ingram. So, it feels like the is being called a bit more. I&#x27;m not</p>\n<p>predicting some downfall of the Trump administration, but it does feel like he is not hitting his marks in the same way. And he&#x27;s not able to dangle one trans swimmer in front of people to get them to come over to his side. and that people are actually observing what&#x27;s going on on the ground and formulating a not so positive view of Trump and co as a result.</p>", "chapters_count": 0}