{"video_id": "3BiiWPotBtc", "title": "The Astounding Result Of A Shorter Work Week Experiment | Cal Newport", "link": "https://www.youtube.com/watch?v=3BiiWPotBtc", "published": "2026-01-15T11:00:10+00:00", "summary": "Cal Newport explains the astounding result of a shorter work week experiment in this clip from an earlier Deep Questions podcast episode in the spring of 2025.\n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\n0:00 A shorter work week experiment\n2:38 The workload fairytale\n4:50 Workload management\n8:10 Filling your time with optional work\n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<p><strong>[00:00]</strong></p>\n<p>One of the biggest beliefs about our current high- techch, always on, very busy age is that the key to succeeding professionally is to work more. You want to get ahead, put in more hours. You want your company to overcome its competitors, increase the weekends you're there, increase the evenings that you're there. But is this actually true? Well, last spring in an episode of my podcast, I took a look at a collection of really interesting studies that were done in the aftermath of the COVID pandemic that looked at experiments with shortening</p>\n<p>the work week, working less, and trying to see what the impact was on lots of different factors. There was a really astounding result that emerged from this research that I think completely changes the way we think about the relationship between busyness and actually producing things that matters. And so the clip you're about to see is from that episode where I go in specifically and I walk through those studies and I point out that result and I try to uh give you a whole new way of thinking about what</p>\n<p>really matters for doing work that is going to make a difference. I think you're going to like this clip. Check it out. Over the past four years, a remarkable story has been quietly unfolding in the knowledge sector. A growing interest in the viability of a 4day work week. Iceland helped spark this movement with a series of government sponsored trials that unfolded between 2015 and 2019. The experiment eventually included more than</p>\n<p>2500 workers, which believe it or not is actually about 1% of Iceland's total working population. The UK followed suit. They had a six-month trial that included over 60 companies and close to 3,000 total employees. This concluded in 2023. A year later, 45 firms in Germany participated in a similar half-year experiment with a reduced work week. And these are far from the only such experiments being conducted. According to a 2024 KPMG survey, close to a third of large US companies are at the very</p>\n<p>least considering the idea of experimenting with 4day work weeks, at least for some employees. All right. So, the reason I'm bringing these up is not to directly assess whether a 4day work week [clears throat] is a good idea, though I will return to that to the at the end of the discussion here. but instead because as I'll show these studies if you look deeper have a important data point in them that I think points to a really important conclusion an idea that is critical if we want to understand knowledge work in</p>\n<p>our current moment. It's an idea that I call the workload fairy tale. All right, so let's get to this hidden point that shows up in every one of these studies. Um I'm going to switch over now to some of these studies. Let's see. These are probably in what? The browser, Jesse? >> Yep. All right. Um, let's start with a claim from the Iceland study. For those who are watching, uh, I have a summary of the Iceland study up here. Here's a key claim from the beginning of this</p>\n<p><strong>[03:01]</strong></p>\n<p>article. Productivity remained the same or improved in the majority of workplaces. So, of the 1% of population of Iceland participate in this, they did not see a decrease in productivity. All right, let's look at what happened in the UK. Here is a summary of the UK study. This is coming from the Guardian. This has a similar quote. Across a wide variety of sectors, well-being has improved dramatically for staff and business productivity has either been maintained</p>\n<p>or improved in nearly every case. And remember, these are experiments in which they are taking 5 to eight hours out of the work week, keeping the salary the same, making no other changes. The German study, let me load up a summary here from a German newspaper. They report something similar. I'm reading now. Employees generally felt better with fewer hours and remained just as productive as they were with a 5day week and in some cases were even more productive. Participants reported</p>\n<p>significant improvements in mental and physical health and showed low stress and burnout symptoms as confirmed by data from smartwatches tracking daily stress minutes. step back. All right, let's step back and uh consider this for a moment. These are outst uh astonishing findings. How is it possible that with changing nothing else, just telling people you now have to work notably less hours per week that the overall value of what they are producing, their overall productivity</p>\n<p>didn't go down? A big part of this answer, I'm convinced, is a an idea that's pretty important from my book, Slow Productivity, and it's the idea of the overlooked importance of workload management. Here's the normal setup. Most knowledge workers have a surprising amount of autonomy over their workload, especially as compared to like a service worker or someone in an industrial context. Right? If I'm a service worker, here's what you need to do. Clock in and do this. It's very prescribed, right? If</p>\n<p>you're the the barista at Starbucks, it's very clear what the responsibilities are. If I work on an assembly line, it's very clear like what I am doing. I don't have a lot of say in what I want to or not work on. In knowledge work, this is different. You have freedom to say yes or no. There's a sort of unstructured way that commitments come to you. Know some stuff maybe you can't say no to, but ultimately you are the source of triage of incoming potential commitments. There's also no transparency or direct supervision of your workload. You grab the average knowledgework manager and take one of their charges and say, \"What</p>\n<p>are they working on right now?\" They don't know. They can't say, \"Here's the six things that this person is working on.\" There's no transparency in this. What you're working on is up to you to keep track of. In fact, most workers themselves don't even know at any one moment the full slate of their commitments. They sort of get prodded into action with like email or Slack prompts or meeting invites. Oo, I need to start doing something on this. So there's no direct supervision or</p>\n<p><strong>[06:01]</strong></p>\n<p>transparency of workload as well. Now most knowledge workers in this I got to say like pretty unusual situation for the economic the world of economics this unusual situation of workload autonomy tell themselves what I call the workload fairy tale and the workload fairy tale claims that the amount of work that you're doing right now is the exact right amount needed to be successful in your position that somehow it is all just worked out that like whatever it is you're doing this is what you need to be doing it's the exact right amount, not</p>\n<p>more, but if you do less, it's going to be a big problem. The results of these 4day work week studies undermine this claim. Productivity did not generally go down for these research subjects even after the amount of time they had to work was substantially reduced. And if we think about why this is, the answers are actually not that surprising. uh especially if you've read like Slow Productivity or listened to the show before, the the key work in most jobs,</p>\n<p>the efforts that actually drive those pure economic productivity measures, you know, dollars produced per worker hours employed, the key work in most jobs requires much less than a 40-hour work week to complete. Just go back. If you do something like time block planning, go back and highlight with a highlighter every time block from the last week in which you were working on something that directly produced value for your organization. You're not going to have full columns marked with highlighter. You're going to say, you know what, there was like 15 hours this week. Maybe there was 10</p>\n<p>hours this week where I was actually directly doing the things that create value. This course is very different than the service sector, the industrial sector where outside of breaks and lunch like everything you're doing is directly producing value. So everything else you're doing is uh either more opt it's more optional like you're doing it for social reasons or it's make work or it's non-promotable activities or it's just a embrace of pseudo productivity. I want to show some activities. I'm going to kind of bounce around emails and and make some unnecessary meetings. Now look, not all of this is bad, but there's no reason to fill, you know,</p>\n<p>every available minute of your day with this optional work. The stuff that really matters doesn't actually need that much time. This is what's being revealed by these 4day work week studies. The workload fairy tale is in fact a fairy tale. You're actually probably doing a lot more extra stuff than you really need to to do your job well. So, if we return to the original question here, hey, but what about this 4-day work week? Is it itself a good idea? I have nothing against it, but it seems to me that if we solve the</p>\n<p>underlying workload problem, if we get rid of the workload fairy tale and have more control over, well, how much work should we be doing and what are the key factors and how much of the option work should I be doing on my plate? A lot of the issues with burnout that drive ideas like the 4-day work week are actually going to go away. a 4-day work week itself is not going to have a problem that it is solving. So once we recognize</p>\n<p><strong>[09:03]</strong></p>\n<p>there's only so much we're doing that really matters, we should be able to have a lot more variation and flexibility when we think about what work could be. Different types of schedules, different number of hours, less intensity, more breaks, or hey, maybe more key work and you produce more value but less make work. There's a lot of options on the table here, but these studies, I think, point to this really key thing. You are not most of what you're doing in your job is probably not actually that directly useful. That's taking place in less total time than you think, which means you should feel some cover to actually uh slow down and take</p>\n<p>a breath. Interesting. 4 day work week. You know what type of work week Network runs? >> Two. >> 14 minutes. [laughter] He gets after it. Deep work, deep laser focus. 14 minutes. And you know what? He gets a round of applause for it. Cal Network is so impressive that when uh he attends the theater, when the show is over, the actors applaud him. Get some Cal Network. That's kind of that's a catchphrase. Get some.</p>\n<p>>> Yeah, >> get some Cal Network. So, there we go. Interesting research. I think this we kind of slept on this this 4 day work week stuff because a lot of it kind of was coming in the immediate post-pandemic times. enough other stuff on our on our minds. >> But I think it's a a scandalous result that they said, \"Hey, stop working a week and nothing really changed with productivity.\" The message that we should get out of that is like, \"Oh my god, what are we doing during this time then?\" Like clearly we have a lot of make work and non-promotable activities going on. Like we should be able to be better. We don't think enough about workloads. Hey, if you like this video, I think you'll</p>\n<p>really like this one as well. Check it out.</p>"}