{"video_id": "A_fKlWPcgPs", "title": "Elon explains his “infinite money glitch”", "link": "https://www.youtube.com/watch?v=A_fKlWPcgPs", "published": "2026-02-06T16:50:44+00:00", "summary": "Full episode: https://www.youtube.com/watch?v=BYXbuik3dgA\nMe on twitter: https://x.com/dwarkesh_sp\n\nIn the full episode, John and I got to do a real deep-dive with Elon. We discuss the economics of orbital data centers, the difficulties of scaling power on Earth, what it would take to manufacture humanoids at high-volume in America, xAI’s business and alignment plans, DOGE, and much more.", "transcript_html": "<h2>Transcript</h2>\n<p>Once you have physical robots, then then you can um then you essentially have unlimited capability. Physical robots I I I call Optimus the infinite money glitch. U because um &gt;&gt; you can use them to make more optimuses. &gt;&gt; Yeah. Um you said like humanoid robots will improve um as will basically be three exponentials, three things that growing exponentially multiplied by by each other. Yes. &gt;&gt; Um recursively. So you&#x27;re going to have um you have exponential increase in digital intelligence. uh exponential increase in the the chip capability, the AI chip capability um and exponential</p>\n<p>increase in the electro mechanical dexterity. Uh the usefulness of the robot is roughly those three things multiplied by each other. But then uh the robot can start making the robot. So you have a recursive multiplicative exponential. Um this is a supernova. And do land prices not factor into the math there where like labor is one of the four factors of production but not the others? And so like if ultimately you&#x27;re limited by copper or you know pick your input just it&#x27;s not quite an infinite money glitch because</p>\n<p>&gt;&gt; well infinite infinity is big. So no not infinite but but let&#x27;s just say &gt;&gt; you you could you know do do many many orders magnitude of &gt;&gt; earth&#x27;s kind of current economy &gt;&gt; like a a million you know is this why so if if you &gt;&gt; you know ju just just to get to like that&#x27;s why I think like just just to get to a millionth a harnessing length of the sun&#x27;s energy would be roughly give or take an order of magnitude 100 thousand times bigger than earth&#x27;s entire economy. today.</p>\n<p>&gt;&gt; Mhm. &gt;&gt; And you&#x27;ve you&#x27;re only at 1 millionth of the sun. &gt;&gt; Before we went to Optimus, I have a lot of questions on that, but um &gt;&gt; every time I say order of magnitude, we&#x27;re saying [laughter] 10 &gt;&gt; drinks. Take take a shot. Every time I say that too often the next time, 100 time after that. &gt;&gt; Yeah. Order of magnitude more more wasted. &gt;&gt; I do have one more question about XAI. Um this strategy of building a digital uh or remote worker co-orker replacement. &gt;&gt; Everyone&#x27;s going to do by the way, not</p>\n<p>just us. &gt;&gt; So, what is actually plan to win? &gt;&gt; You should me tell you on a on a podcast. &gt;&gt; Yeah. [laughter] &gt;&gt; Spill all the beans. Have another Guinness. &gt;&gt; It&#x27;s a good system. [laughter] &gt;&gt; People sing like a canary. &gt;&gt; Um, all the secrets, but just &gt;&gt; Okay, but in a nonsecret spilling way. What&#x27;s the plan? [laughter] &gt;&gt; What a hack. Well, when you put it that way, um I think the way that Tesla solved uh self-driving is is the way to do it. So,</p>\n<p>I&#x27;m I&#x27;m pretty pretty sure that&#x27;s the way. &gt;&gt; Unrelated question. How did Tesla solve self drive? [laughter] &gt;&gt; Yeah, it sounds like you&#x27;re talking about data like Tesla driving because of the &gt;&gt; I we&#x27;re going to we&#x27;re going to try data and we&#x27;re going to try algorithms. But isn&#x27;t that what all the other lines are trying? Like [laughter] what&#x27;s And if those don&#x27;t work, I&#x27;m not sure what. [laughter] We&#x27;ve tried data. We&#x27;ve tried algorithms. &gt;&gt; If you enjoyed this clip, you can watch the full episode here and subscribe for more clips. Thanks.</p>", "chapters_count": 0}