{"video_id": "s9P98Uq3vLo", "title": "Is the Internet Making You Lazy? (Here’s How to Reclaim Your Ambition.)", "link": "https://www.youtube.com/watch?v=s9P98Uq3vLo", "published": "2026-01-26T13:20:14+00:00", "summary": "Cal Newport explains how the internet is making you lazing in episode 389 of the Deep Questions podcast.\n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\nIt’s natural to feel ambition, as we’re wired to find great satisfaction in accomplishing hard goals. But what impact has the internet had on this instinct? To help explore this question, author Brad Stulberg, author of the new book THE WAY OF EXCELLENCE, joins Cal during the ideas segment to explore ways in which the internet hijacks our drive, and what we can do about it. Then, in the practice segment, Cal provides the 2026 of his evolving advice for escaping email and IM overload in your job.\n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\nJanuary Books:\n\nFuture Boy (Michael J. Fox)\nThe Unauthorized Story of Disney’s Haunted Mansion (Jeff Baham)\n\nLinks:\nBuy Cal’s latest book, “Slow Productivity” at www.calnewport.com/slow \nGet a signed copy of Cal’s “Slow Productivity” at https://peoplesbooktakoma.com/event/cal-newport/ \nCal’s monthly book directory: bramses.notion.site/059db2641def4a88988b4d2cee4657ba?\nThe Way of Excellence: A Guide to True Greatness and Deep Satisfaction in a Chaotic World\nhttps://www.amazon.com/gp/product/0063385945/ref=sw_img_1?smid=ATVPDKIKX0DER&amp;psc=1\nhttps://podcasts.apple.com/us/podcast/old-school-with-shilo-brooks/id1841566275 \nhttps://www.instagram.com/p/DFh_mNGSvuZ/?img_index=2\nhttps://www.microsoft.com/en-us/worklab/work-trend-index/breaking-down-infinite-workday\nhttps://www.reddit.com/r/AskReddit/comments/1o2g1xq/with_all_the_billions_trillions_going_into_it/\nhttps://calnewport.com/a-world-without-email/\n\nThanks to our Sponsors: \n\nhttps://www.mybodytutor.com\nhttps://www.monarch.com (Use code “DEEP”)\nhttps://www.pipedrive.com/deep\nhttps://www.meetfabric.com/deep\n\n0:00 Ambition\n4:16 Is the internet hijacking ambition?\n1:03:05 Escaping messaging hell\n1:23:49 Have new AI tools actually been as transformative as claimed? \n1:38:18 Cal responds to comments\n1:44:52 Cal gives his weekly reading update \n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<h2>Ambition</h2>\n<p>Let&#x27;s talk about ambition. We all have an instinct to want to accomplish things that are hard and impressive. This is something that comes from our paleolithic genes. Impress your tribe so that you&#x27;ll get more opportunities for food and for mates. But regardless of the source, this impulse is strong and if you can integrate it into your life, you are going to feel more satisfied. So here&#x27;s a question I&#x27;ve been thinking about a lot lately. What&#x27;s the impact of the internet on our ambition instinct? Now, there are two possible stories to</p>\n<p>be told in answering this question. The first story is positive. The best way to support your ambition is to surround yourself by people with a similar vision. And the internet makes it possible to find and create virtual tribes centered on whatever it is you care about. Like, let&#x27;s do an example here. Let&#x27;s say like you&#x27;re a you&#x27;re a young man who uh aspires to be a serious reader. 30 years ago, you might be living in a small town and not know a single other guy who reads beyond the occasional Gisham or Clancy novel. But now, you could, for example, uh, listen to a podcast like Old School, which is</p>\n<p>hosted by Shiloh Brooks, and each week features well-known men discussing books that changed their lives. Like, look, I&#x27;ll I&#x27;ll bring this up on the screen here for people who are watching. Uh, look at these conversations. Uh, America&#x27;s Most Righteous War produces best anti-war novel. Why middlem Mars changed his Catholic priest life. Read this book instead of catcher in the ride. George Orwell&#x27;s lessons on the class divide and so on. Right? This would now make it possible for you to actually surround yourself with people who care about reading. That&#x27;s pretty amazing. But there&#x27;s a second story about the internet and ambition that</p>\n<p>there are whole corners of the internet that play on your instinct for ambition but lead you to weird or unhealthy or extreme places. Like, let me load up another example here on the screen. This is Brian Johnson. This is an Instagram post. All right. So, it says here, &quot;Brian Johnson spends $2 million plus per year on health optimization, tracking every detail, taking 100 plus supplements daily, and following an ultra strict routine to slow aging.&quot; Uh that&#x27;s the type of I&#x27;m going to put air</p>\n<p>quotes around this guidance that maybe makes you feel productive in the moment like you&#x27;re crushing it maybe for a little while but ultimately you&#x27;re really going to waste a lot of time and money. This then is what I&#x27;m worried about. Is the internet hijacking our ambition and aiming us towards nonsense. And if that&#x27;s the case, how do we avoid that trap? This is the question I want to investigate in the idea segment of today&#x27;s show. And to help me with this quest, I&#x27;m going to bring in a ringer, my longtime friend and longtime friend of the show, Brad Stolberg. He&#x27;s going to join us here in a second that makes sense of all of this. Um, I invited Brad</p>\n<p>because he has a new book out. It comes out this week and it&#x27;s called The Way of Excellence: A Guide to True Greatness and Deep Satisfaction in a Chaotic World. Uh, Steve Kerr blurbed this book and said, quote, &quot;It&#x27;s an absolutely beautiful book.&quot; End quote. Um, I also blurred this book and called it a must readad. Jesse, I don&#x27;t want to brag, but between the two of us, Steve Kerr and I have won nine NBA championships. So, you know, I don&#x27;t know what you&#x27;ve been doing, but we&#x27;ve been we&#x27;ve been racking up rings, buddy. Um, anyways, uh, who who better to help me untangle online</p>\n<p>hustle, culture, ambition, and the search for true greatness than someone who really just wrote a book about what&#x27;s really entailed in authentic excellence. All right. Um, then in our practice segments, we&#x27;re going to switch gears. A lot of you have been asking for some ideas about how to reinvigorate your efforts to work deeply in our increasingly distracted world. We haven&#x27;t talked work about work recently. So, I&#x27;m going to revisit some of my absolute favorite topics, in particular, email. I have some new ideas to share for how to tame your inbox in 2026. All right, so I&#x27;m excited for all of this. As always, I&#x27;m Cal Newport and this is</p>\n<p>Deep Questions, the show about the fight for depth in an increasingly distracted world. and we&#x27;ll get started right after the music. &gt;&gt; Hey Brad, welcome back to the show. &gt;&gt; Cal, it&#x27;s always great to be back.</p>\n<h2>Is the internet hijacking ambition?</h2>\n<p>&gt;&gt; Um, I thought a good place to start if we want to understand what the internet is doing to our ambition is this idea that comes from both your book, but your writing and talking more generally about pseudo excellence. Why don&#x27;t you like bring us up to speed on what you mean by that and then we&#x27;ll deploy it to help understand our issue here? &gt;&gt; I think about pseudo excellence as individuals who are more concerned with the performance of greatness than the actual habits, mindsets, and practices that are required to be great. So, these are the people that wake up at 4:00</p>\n<p>a.m., do seven cold plunges, take 39 supplements, eat a restrictive diet, have extremely intricate morning routines. And they are purveying all these things as if it&#x27;s necessary to be excellent, if it&#x27;s necessary to be great, which one it&#x27;s not. And two, there&#x27;s a difference between being the world champion of having the most elaborate morning routine and being the best you can be in an actual craft or pursuit or activity that you care about. And too often those things get confused. Pseudo excellence is more about the elaborate dance. Actual excellence is</p>\n<p>about caring deeply and doing the thing that matters to you. So you&#x27;re saying result matters in the sense of if you&#x27;re not really aiming towards a particular direction that&#x27;s meaningful you&#x27;re just doing the steps without any particular place you&#x27;re aiming that throws you more I mean is it the case that these people who talk about their 100 supplements what are they even trying to do I guess let&#x27;s be clear about it &gt;&gt; I think that&#x27;s the first question and I think a lot of them the answer is they&#x27;re trying to make money by grabbing your attention on the internet and they&#x27;re quite good at that uh but they&#x27;re not trying to be a great</p>\n<p>athlete. They&#x27;re not trying to be a phenomenal researcher or physician or knowledge worker because the individuals that are trying to actually master and develop competence and skill at a pursuit. They don&#x27;t have time for the 47step routine because they&#x27;re focused on keeping the main things the main things and nailing the fundamentals of their craft over and over and over again. And what happens is people get caught up in this internet ambition, this pseudo excellence, and it just drives them from one cycle to the next, from one fad to the next, and they never really make progress because often times</p>\n<p>they don&#x27;t really know where they&#x27;re trying to go. &gt;&gt; There&#x27;s an appeal to just being focused on the performance, I would assume, because it&#x27;s a goal you can succeed with, right? So, I can do a 50step morning routine. I&#x27;m not going to there&#x27;s no one who&#x27;s going to tell me I&#x27;m not good enough. there&#x27;s no bar, I&#x27;m going to fail. So, it seems safer somehow. Then I might not actually win the race I&#x27;m preparing for. My book might not actually get published. There&#x27;s a sort of uh safety in the sort of checklist productivity of like if I&#x27;m I&#x27;m doing things I know I can do these things and I&#x27;m just going to get reward</p>\n<p>by doing a large quantity of them. That&#x27;s 100% right. And I think that oftentimes what happens is when individuals feel insecurity, which we all feel insecurity, it&#x27;s the human condition to feel insecure, is sometimes we lean on these super elaborate processes. Uh because they give us a sense of control in an inherently uncertain uncontrollable world. Uh but again like we have to ask are we just running around exerting energy for the sake of running around and exerting energy or are these things actually working towards our values and goals in developing skill and competence and</p>\n<p>mastery. Um generally speaking the individuals who are the best at what they do uh they have relatively simple and mundane approaches. They&#x27;re just relentlessly consistent and they stick to those simple and mundane approaches over the long haul. I&#x27;m going to put on my Mel Robbins hat here for a second and say, Brad, you just made me think about something that blew me away. That&#x27;s my male impression here. But I I want to I just had an idea I hadn&#x27;t had before. I want to run by you. An example of something in my own life that now I&#x27;m realizing, oh, maybe this is a pseudo excellence uh performance and action.</p>\n<p>I&#x27;m always hearing from people in the world of ideas like writers, aspiring writers, who build these incredibly elaborate idea capture and management systems where they have all sorts of custom setups where it will make automatic connections and use AI and will show you new ideas that you didn&#x27;t even know existed for books. And there&#x27;s there&#x27;s uh notion and zapier and chatbt APIs, these really complex systems. And I&#x27;ve always said, look, I know I&#x27;m a professional idea guy. I know professional idea people. You&#x27;re a professional idea person. The way we</p>\n<p>deal with ideas is not technically speaking that interesting. I mean, we read and think a lot and the stuff that&#x27;s good sticks with us and we end up writing something about it. We don&#x27;t need really complicated systems. Is that complicated sort of idea management systems? Is this just another example of uh pseudo excellence instead of excellence? &gt;&gt; I think it depends. It certainly can be. If you&#x27;re spending more time and energy thinking about your idea system than actually executing on the good ideas, then absolutely uh many of the best idea people that I&#x27;ve been around that I reported on for this book, whether they</p>\n<p>are intellects, whether they are writers, but also physicians, entrepreneurs, business people, um they all tell me some version of the same thing, which is their idea capture system is a pen in a notebook. It&#x27;s pretty low tech. &gt;&gt; Yeah. I mean, I&#x27;ve always had that sense that it&#x27;s when an idea won&#x27;t go away, that&#x27;s what matters. That&#x27;s the signal. In fact, you don&#x27;t even want to write it down because the point is if you can&#x27;t forget it, then that probably means something good. All right, so let&#x27;s try this. I want to load up a couple examples here and we&#x27;ll do a little bit of analysis of are these pseudo excellence, who are these people, what&#x27;s</p>\n<p>going on. I really want to understand better, not abstractly, but concretely, what&#x27;s actually happening on the internet. So, I&#x27;m going to click on something here. Here, I&#x27;m going to share it uh jointly on our screen. All right. And here we go. I&#x27;m going to play this. &gt;&gt; My day is 6:00 a.m. to noon. And I&#x27;m not crazy. You&#x27;re crazy for thinking it takes 24 hours, just like some dude in the cave did 300 years ago. My second day starts at noon and goes till 6:00 p.m. That&#x27;s day 2. And then the next day is 6:00 p.m. to midnight. What I&#x27;ve done now is I have changed the manipulated time. I now get 21 days a week.</p>\n<p>&gt;&gt; All right. Well, there we go. Um, what is going on there? I mean, that&#x27;s a muscular man. Is he spending all three of his 21 days a week lifting weights? Like what&#x27;s going what how do you read this video, Brad? &gt;&gt; I read this video as um very very insane. So what he&#x27;s essentially saying is he works an 18-hour day and he works an 18-hour day 7 days a week. And for the vast vast vast vast majority of people that is impossible. That&#x27;s a fool&#x27;s errand. That&#x27;s going to lead to a degragation in quality of work and also a degragation in your longevity because</p>\n<p>you are going to burn out. The reason I say the vast majority of people &gt;&gt; What does he do? What does he do for those 18 hours a day? I don&#x27;t actually know who this is. What would you imagine he&#x27;s not like running a hedge fund? &gt;&gt; I don&#x27;t think he&#x27;s working 18 hours a day. I think it&#x27;s I think it&#x27;s BS. I think that it it&#x27;s just like this hustle culture where people want to feel super motivated and inspired uh to go crush it. But I don&#x27;t think that guy&#x27;s working 18 hours a day. Um and I think that that&#x27;s part of the problem. like it&#x27;s it&#x27;s nonsense. Uh and if he is working 18 hours a day, then he&#x27;s he&#x27;s working on building an online platform 18 hours a day, which sounds like a a really um I</p>\n<p>don&#x27;t know, for me at least, that would not be a very fulfilling way to spend my 21 days a week. &gt;&gt; Uh that&#x27;s that&#x27;s that is probably right. Okay. Because some people look, if you&#x27;re a James Cameron or the six months that you&#x27;re filming Avatar, &gt;&gt; you work 18 hours. That&#x27;s just how that works. Because &gt;&gt; even then, I don&#x27;t think he&#x27;s working an 18 hour day. I think he&#x27;s probably working a little bit less. And the reason I said the vast majority, like the exceptions that I think of, um, if you&#x27;re a soldier that&#x27;s deployed at war, you&#x27;re going to probably have stretches of 18 hour days. Uh, if you&#x27;re a trauma physician and there&#x27;s a natural disaster in in your locality, you&#x27;re going to</p>\n<p>have 18 hour days. But this notion that you should voluntarily set yourself up to work an 18-hour day. Like, it&#x27;s it&#x27;s pseudo excellence. Uh, none of the best founders that I know are constantly working 18our days. None of the best athletes, you know, this guy&#x27;s muscular. like actual powerlifters, they&#x27;re not training 18 hours a day. Um they&#x27;re they&#x27;re very very periodized in their approaches. When they&#x27;re on, they&#x27;re on and when they&#x27;re off, they&#x27;re off. Uh rest and renewal is a part of excellence, and you need more than six hours of rest and renewal a day, and it&#x27;s very hard to work seven days a</p>\n<p>week. &gt;&gt; All right, let&#x27;s see. Uh let me load up another example here. All right, now this one, I think you might just say, &quot;Actually, this is very reasonable, and there&#x27;s a lot we could learn from this gentleman.&quot; All right. People are listening. It says 3:53 a.m. He&#x27;s brushing his teeth shirtless. Now he&#x27;s drinking water at 3:54 a.m. He&#x27;s 4:00 a.m. He goes outside to do push-ups. 4:17 a.m. I don&#x27;t know what he&#x27;s doing. He&#x27;s flexing. 4:38 a.m. He&#x27;s meditating. 4:40 a.m. He&#x27;s writing in a journal.</p>\n<p>&gt;&gt; BE SERIOUS ABOUT THE LORD. &gt;&gt; 4:55 a.m. He&#x27;s listening to religious radio. Man, it&#x27;s only 5:00 a.m. and he&#x27;s already done more things than I do. um in a typical day. I will say this about him though. Uh like him, I do most of my day shirtless flexing because I think I find that&#x27;s another very strong gentleman. Uh all right, so what&#x27;s going on with this? This guy woke up at 3 and has been doing nonwork-related stuff for two hours so far in this video. &gt;&gt; I would ask uh what&#x27;s the point of all</p>\n<p>this? And if it takes you a two-hour routine to feel primed and ready to go, honestly, I&#x27;d say that you&#x27;re quite fragile. Uh because then you become reliant on this super elaborate, complex routine just to get activated and you&#x27;re wasting all this time and energy getting ready to perform at what you actually care about versus showing up and performing at what you actually care about. Uh another misnomer around excellence is that all the greats have these super complex routines. They actually don&#x27;t. What you find is that influencers on the internet have super complex routines and people who are</p>\n<p>actually great at what they do tend to have very simple and compact routines. It&#x27;s often I wake up, I make a cup of coffee and I journal for 5 minutes or I wake up and I meditate for 10 minutes or I wake up and I hit the snooze button on my alarm and then it rings again and I wake up and I drag myself out of sleep and I go on a little walk. Um, those are the the actual routines of the CEOs of companies that I&#x27;ve reported on, of the Olympians, uh, the Grammyinning artist, so on and so forth. Again, this comes up, I sound like a broken record. We</p>\n<p>want to separate being great. It&#x27;s something that matters to you and aligns with your values and goals versus being the world champion of motivation or having this kind of elaborate routine. Those are very different things. &gt;&gt; I mean, I think people, they used to ask me a lot these sort of morning routine type interviews or blogs or whatever. They stopped asking me I think because my answer is so boring. It&#x27;s well I I kind of scramble to get my kids ready for school and then we walk them to the bus stop and then after I get my kids to the bus stop I work. That was the morning routine is like I get my kids fed and we go to school and then you</p>\n<p>know it&#x27;s like 8 something and I start working. It&#x27;s just not that exciting. &gt;&gt; Yeah. Yeah. And as a result, you get those extra hour or two hours of sleep, which uh you know, study after study would say that that&#x27;s much more important for your performance than anything you&#x27;re going to be doing between 4 and 6 a.m. &gt;&gt; What is the role of muscles in this? Right. So, we&#x27;ve seen two examples so far where the the gentlemen involved are very muscular. Um, is this some notion of like I&#x27;m wondering if what&#x27;s going on here is that especially if you&#x27;re like a young male watcher of these videos. The thing that&#x27;s actually hijacking your</p>\n<p>brain is seeing the very strong other man. That&#x27;s what&#x27;s like makes them appealing or a leader. You think like, okay, that that&#x27;s what I want. But then what they serve you is something that&#x27;s much easier to get, which is, oh, do this routine. But really, like in your lizard brain, you&#x27;re admiring this guy because, you know, he&#x27;s jacked and then he&#x27;s laundering that admiration for something that was very hard for him to do and probably took years and years of of concerted nutrition and working out. It&#x27;s hijacking that uh and then aiming it at things that much more approximate</p>\n<p>like, oh, I&#x27;ll I&#x27;ll wake up early. I&#x27;ll gargle water or whatever. &gt;&gt; I think you&#x27;ve got part of that right and part of that wrong. I think the part of it that you have right is um the rationale behind like the aesthetic of the really muscular guy that hijacks especially a masculine lizard brain. I think the part that you have wrong is that those people had a really good approach and worked really hard. I think an easier answer is that steroids work very well. Um and I don&#x27;t think that either of those two gentlemen would ever be able to compete in any kind of</p>\n<p>sanctioned athletic event with drug testing. &gt;&gt; Can I ask you how steroids work? This just I&#x27;m just curious now. I mean, it&#x27;s still like what would happen? All right, here&#x27;s my thought experiment. I don&#x27;t know how steroids work, but like what would be possible if I wanted to be a shirtless influencer giving my morning routine? How long would it take and what would be involved? Like if to be notably sort of bulbous, that&#x27;s like a year of taking steroids and exercising. I I&#x27;ve heard steroids allows you to recover faster, you can work out harder or something, but I don&#x27;t know. &gt;&gt; I&#x27;m not an expert on steroids. What I do know is that there&#x27;s research that shows</p>\n<p>that simply taking steroids without even training uh can increase hypertrophy, which is just a fancy way of saying muscle size by up to 20%. So, if you got the right steroids, you could just take the steroids and do nothing and be 20% bigger and stronger. And then if you took a ton of steroids and you trained really hard twice a week for an hour, you would get jacked. &gt;&gt; Really? &gt;&gt; Yeah. Oh, yeah. Stero steroids really really work. Um they&#x27;re also extremely unregulated. Uh there&#x27;s a lot of research that shows that they lead to uh negative adverse cardiovascular events,</p>\n<p>cancer, all sorts of bad things. Uh they&#x27;re not allowed if you want to compete. But if your goal is to just look really really jacked and you don&#x27;t care about your longevity in your health or your ability to assess risk properly, then take steroids. But I&#x27;m not condoning that. &gt;&gt; If you&#x27;re in a Marvel movie, then you&#x27;re definitely doing that, right? &gt;&gt; I think so. I think that I I again I don&#x27;t know because I I I I I&#x27;m not working with those actors, but I I would sense that they&#x27;re getting some help uh to to get into those kinds of bodies for those for those movies. And you could</p>\n<p>argue that that&#x27;s just part of their job. And sometimes jobs require you to make trade-offs with health. They&#x27;re not competing in a sanctioned sport, so it&#x27;s not against the rules. However, big however, the problem becomes when 19-year-old Bill or Joey is looking at those guys and those guys aren&#x27;t disclosing all the steroids that they&#x27;re taking. And 19-year-old Bill or Joey says, &quot;The way that I get that body is by waking up at 3:00 a.m. and meditating and journaling and doing a cold plunge and taking these 19 supplements.&quot; That, by the way, the guys that are using the steroids are always selling supplements. It&#x27;s never the supplements. It&#x27;s always</p>\n<p>the steroids that they&#x27;re not telling you about that make them look like that. That&#x27;s the problem. That&#x27;s the grift. And it&#x27;s a grift as old as time. &gt;&gt; Uh, one of the funnier tweets someone sent me recently was a picture of Himsworth with his Thor body and it said, this was Chris Himsworth at age 42. What&#x27;s your excuse? And someone replied, I&#x27;m not yet 42 yet. I appreciated that. &gt;&gt; That&#x27;s great. But it&#x27;s it&#x27;s a real thing. And and and I don&#x27;t mean to sound like a kaggen. It&#x27;s just like I&#x27;ve been around elite athletes for a long enough time where um it&#x27;s very apparent who&#x27;s working extremely hard in doing it</p>\n<p>naturally in what they look like and someone who might not be working very hard at all but who has a very serious steroid regimen. &gt;&gt; And a good way to tell the difference is to ask does this person have hard athletic competitions that they&#x27;re preparing for? In which case it&#x27;s a diff a completely different mindset for a lot of these things because steroid muscles that&#x27;s not what you need to compete. you need like the actual functional strength, the actual cardio base, and it looks really different. &gt;&gt; Yeah, that&#x27;s right. And and I think the ultimate way to ask is essentially, does this person look superhuman? And if the answer is yes, then they&#x27;re probably not</p>\n<p>human. Uh, is this person telling you that they only sleep six hours a night, but they look like that, then they&#x27;re either lying about how much they sleep or they&#x27;re taking steroids or some combination of the two. All right, so we&#x27;ve been talking a lot about muscles, so let&#x27;s do one more example that has nothing to do with muscles, but also ties in the pseudo excellence because you&#x27;ve written about this example before. I think we&#x27;ve talked about this before. All right, let me load this up. All right, here we go. This is Elon Musk. He&#x27;s at CPAC. He&#x27;s been given a chainsaw for the president of Argentina and is holding it in the air roaring as the crowd cheers.</p>\n<p>&gt;&gt; The chainsaw for bureaucracy. Chainsaw. &gt;&gt; That&#x27;s how I start every one of my classes, actually. So, I think I &gt;&gt; with the chainsaw for bureaucracy. &gt;&gt; Yeah. All right. So here&#x27;s a gentleman who is I can say for sure is not taking steroids. So he is not using his body to lure in young men to be attracted. But I&#x27;ve heard you write and talk about this in the context of pseudo excellence. So what what&#x27;s the variant we&#x27;re seeing here? &gt;&gt; Well, a couple things. I think that Elon Musk um is is clearly a maniac and an outlier figure and I think that some of the things that he&#x27;s done in his career</p>\n<p>have been genuinely excellent. Uh, I think that building Tesla, building SpaceX, I mean, maybe you get lucky once, but it&#x27;s extremely hard to get lucky with multiple companies that are truly revolutionary. Um, I don&#x27;t want to diagnose Elon Musk. I think what happened is he got addicted to social media and it really changed his brain in negative ways and made him in many ways less serious. Um, so in this particular clip, uh, we&#x27;re marching around with a chainsaw talking about, you know, cuts to bureaucracy and look at how tough I am. And it&#x27;s just like it&#x27;s all it&#x27;s all</p>\n<p>show. It&#x27;s very performative. It doesn&#x27;t say actually anything about what are you doing to make government better. Um, the the metaphor that I used when I wrote about that was it&#x27;s the difference between WWE wrestling and the best wrestlers who are actually in these Midwest Big 10 schools like Iowa and Penn State in Purdue. Um, there&#x27;s those are two very different things, right? The WWE wrestlers are taking steroids and they&#x27;re acting and they&#x27;re playing a role and it&#x27;s all a performance and it&#x27;s invigorating and it hooks your attention, but they&#x27;re not actually good wrestlers. the best wrestlers in the</p>\n<p>world are competing in dink gyms and could beat the crap out of any of those WWE guys and are winning medals at the Olympics in in an actual serious genuine heartfelt sport. &gt;&gt; So, here&#x27;s a big question I want to try to figure out about all of this. There&#x27;s a couple different ways of trying to understand the appeal of pseudo excellence. I I think there&#x27;s a tendency for a lot of commentators to look at it from the point of view of like shallow vanities like well I don&#x27;t know this like this type of stuff appeals to people&#x27;s um shallow vanities it&#x27;s I want to look great that I want to</p>\n<p>attract women or what have you. There&#x27;s the other argument that I&#x27;ve been exploring as well, which is well actually no, people are wired for ambition, right? Because it&#x27;s our paleolithic past. If you are doing stuff that&#x27;s hard and impressive, you people are going to share food, you&#x27;re going to get mates. Like we&#x27;re wired to want to pursue things that are hard and visibly hard. Uh that&#x27;s a deep drive. And that what&#x27;s really happening here is that these types of pseudo excellent purveyors are hijacking a deeper completely nonp problematic like just like a like hunger thirst or whatever just like a human drive we have are</p>\n<p>hijacking it for other purposes like getting more uh engagement on their particular channels. Where do you fall on this? Hey, you know, shame on you for being attracted to this. This is just you being vain versus like, no, no, this is hijacking a deeper drive, just like pornography does that or Tik Tok hijacks your boredom drive, etc. &gt;&gt; I&#x27;m very much on the it&#x27;s hijacking a drive. I actually don&#x27;t think most people are vain. I think a lot of people feel confused, lost, numbed out, alienated, going through the motions. And I think you come across videos like those and they&#x27;re extremely motivating</p>\n<p>and they&#x27;re inspiring and they&#x27;re energizing and they create this kind of illusion that yeah, like I can do it. I can be a tough guy. Like I&#x27;m going to go crush. Uh and that feeling is what people are chasing. And again, like you said, it&#x27;s it&#x27;s a superficial version of actually crushing it. And it does great for the people purveying it because it draws so much attention. uh but it doesn&#x27;t actually lead to sustainable progress or excellence for for the people that fall prey to it. But I don&#x27;t think it&#x27;s a vanity thing. I don&#x27;t think it&#x27;s an evil thing. Uh I think people just are desperate to exert themselves</p>\n<p>and to feel good and to try to find mastery and skill and meaning and mattering in their life and you come across a video like that and if you&#x27;ve been struggling uh I can see why it would be very alluring and very enticing and very motivating. &gt;&gt; How much does the format matter? Because when there&#x27;s video involved, not just video, let&#x27;s put it this way. When there&#x27;s engagement metrics involved and there&#x27;s virality possible, so Instagram, so YouTube, etc., it feels like you get more shirtless guys with the big muscles. But on the other hand, if you sample like podcasts for within the what might be part of what people would</p>\n<p>deride as the manosphere, but like um you know, the the order of man or the art of manliness or or some of these whatever these podcasts are like, hey, we want to help men be better men. If you listen to the rhetoric on those podcasts, it&#x27;s often very grounded. It&#x27;s like you want to provide for your family, you want to be a good husband and dad, you want to be there for your kids, it&#x27;s good to be in shape so that you know you can you can play ball with your kid and not be winded or whatever. And then as soon as you move out of that slower format where you do slow growth of audiences over time and towards something where virality is at play, you&#x27;re putting your face in ice water at</p>\n<p>3 in the morning. Is this am I oversimplifying things by saying this is like a the technology format matters? No, you&#x27;re not. I think the format matters a lot. I think if you have a podcast that is dependent on virality and your goal is growth. So the top of your values hierarchy is growth. It&#x27;s not integrity. It&#x27;s not the truth. It&#x27;s not mission. It&#x27;s I just want to grow. You&#x27;re going to end up reverse engineering your shows to chase whatever is the most attentiongrabbing and viral on the internet at that moment. And that&#x27;s why you see some of the the biggest podcast essentially just cycle from one fad to the next and one trend</p>\n<p>to the next and they grow and they have tons of listeners but their listeners are often caught up in this this cyclical nature and not really making much progress in their life. Um so I think the the deep to use your term slow approach to progress to building an audience like that that&#x27;s where we should be gravitating towards. &gt;&gt; Yeah. And we&#x27;ve gendered this with our examples. Like these seem like men appealing examples, but women generally speaking have their own share of pseudo excellence. Some of the themes are different. I think they&#x27;re less interested in well maybe they are interested in giant shirtless</p>\n<p>men, but there&#x27;s other types of things that are appealing to them. Like what goes on? This is a dangerous question. What does uh female gender pseudo excellence look like online? &gt;&gt; I think it looks like a couple of things. Um, I think that there&#x27;s a lot of uh body dysmorphia and body image things. So, um, these are the people that are selling all of these very restrictive diets or ways to have a body that looks a certain way. I think sometimes it&#x27;s also the person that&#x27;s saying like, &quot;Look, I eat this cheeseburger and fries and I still have a size two dress.&quot; And, you know, it&#x27;s</p>\n<p>just like nonsense. You don&#x27;t really know what&#x27;s going on in that person&#x27;s life, but it it surrounds body image. Um there&#x27;s a whole very interesting area of the internet called the trad wife uh sphere. Yeah. Where it&#x27;s about like being this traditional wife. Um where you know you you stay at home and you take care of the kids and you don&#x27;t have to work because the man&#x27;s making income, but what&#x27;s interesting is the the biggest trades have very intense, rigorous jobs. They&#x27;re working 12 hours a day producing content for the internet, which is a job in and of itself. Um, so I think that that&#x27;s another another place that this happens</p>\n<p>with women. And then I think that um what&#x27;s incredible is that especially in sport and athletics, women&#x27;s sport has come such a long way um that you actually see a lot of the same, you know, elaborate kabuki that dudes do with their shirt off with women and, you know, they have a sports bra on, but that&#x27;s the only difference. They&#x27;re flexing their muscles. They&#x27;re talking about how they&#x27;re superwoman and they just take these 19 supplements and they just wake up at 2 a.m. Um, and then I think that there&#x27;s this third area that you perhaps know um about as well, Cal, which is this like uh study habits kind of like I&#x27;m going to wake up, you know,</p>\n<p>6 hours before the sun comes up to study. I&#x27;m going to take four Celsius energy drinks. Uh I&#x27;m going to get an Adderall prescription stolen from my best friend. and like look at all the studying I can cram in to to these four hours before my competition is ready. Uh makes for great content on the internet. Maybe is sustainable for a week or two. Uh but I don&#x27;t think anyone created groundbreaking theory or got through medical school uh you know between 3 and 10 in the morning studying for seven hours straight. &gt;&gt; I mean I don&#x27;t know what they&#x27;re</p>\n<p>studying. This is my area right? I mean, not only have I written books on this, but when I was at Dartmouth, I got basically the highest grades you can possibly get, right? I mean, I think I was in like the top handful of GPA of over a thousand students there. You couldn&#x27;t get higher grades than I got. I didn&#x27;t study that much. I certainly never studied all night long. I certainly wasn&#x27;t ever sitting in a room for 12 hours at a time. And and I was a computer science major. I had hard classes. So, I always wonder that&#x27;s how I know that&#x27;s Kabuki. There&#x27;s not enough stuff to study in college to require</p>\n<p>that much time. I don&#x27;t know what they&#x27;re doing, but yeah, that to me that that hits home as one of the more ridiculous. &gt;&gt; Yeah. And but it&#x27;s the same theme, right? It&#x27;s the performance of the thing versus actually doing the thing. &gt;&gt; Yeah. All right. So, let&#x27;s let&#x27;s switch to what we should do instead. This is where your book comes into the picture, right? The way of excellence is all about how to get sustainable excellence in your life. how to make it a a source of ongoing meaning and satisfaction. How to avoid both the traps of pseudo excellence and the trap of</p>\n<p>non-engagement. The trap of just sort of of of of non-action and feeling that sort of um inefficacious frustration. So, let&#x27;s let&#x27;s talk about I have a few factors I want to go through, but let&#x27;s do like the the the over the highlevel picture first. What is the big mindset shift we need to make if we&#x27;re coming from pseudo excellence land to excellence land? The same drive is there. We want to but we want to put it somewhere that&#x27;s actually going to work that&#x27;s sustainable. What&#x27;s the big mindset shift we need to make? Let&#x27;s take a quick break to hear from our sponsors. It&#x27;s the new year. This means that it&#x27;s</p>\n<p>time to make progress on those critical things you know are important but that you have been putting off. For a lot of people, this list includes life insurance. You know you need it. You got to take care of the people who depend on you. But we still procrastinate. Why? Because the task is complicated and ambiguous. Here&#x27;s the good news. It doesn&#x27;t have to be if you sign up for Fabric by Gerber Life. Fabric by Gerber Life is term life insurance you can get done today. It&#x27;s made for busy parents like you. It&#x27;s all online on your schedule right from your couch. You</p>\n<p>could be covered in under 10 minutes with no health exam required. Fabric has flexible, high-quality policies that fit your family and your budget, like a million dollars in coverage for less than a dollar a day. There&#x27;s no risk. They offer a 30-day money back guarantee, and you can cancel at any time. So, join the thousands of parents who trust Fabric to protect their family. Apply today in just minutes at meetfabric.comdeep. That&#x27;s meetfabric.comdeep. mefabric.com/deep</p>\n<p>policies issued by Western Southern Life Insurance Company not available in certain states prices subject to underwriting and health questions. I also want to talk about our friends at Pipe Drive. I&#x27;ve spoken to hundreds of entrepreneurs and one thing I constantly see them struggle with is their sales process. It&#x27;s a total mess. A bunch of scattered information spread across tools and systems with no clear way or clear view of what&#x27;s moving. That&#x27;s where today&#x27;s sponsor, Pipe Drive, comes in. It&#x27;s the number one CRM tool for small and medium businesses. Here&#x27;s why I love Pipe Drive. It&#x27;s all about one of my favorite productivity strategies,</p>\n<p>automation. With Pipe Drive, you can automate just about any step of your sales process for your entire team, from scheduling sales calls to email marketing, allowing you to dedicate more of your precious attention to high priority task. And this matters. Teams using automations are working 40% faster and closing three times more deals per month. Pipeline is a powerful, simple CRM built by salespeople for salespeople. So, you should consider joining the over 100,000 companies already using Piperive. Right now, when</p>\n<p>you use my link, you will get a 30-day free trial. No credit card payment needed. Just head to piperive.com/deep to get started. That&#x27;s piperive.com/deep and you can be up and running in minutes. All right, Jesse, let&#x27;s get back to the show. There&#x27;s a few. The first is how we define excellence. So, excellence is not a standard. It&#x27;s a process of becoming and it&#x27;s becoming the best performer that you can be, but also the best person that you can be. It&#x27;s shaping</p>\n<p>your character. &gt;&gt; Define excellence. &gt;&gt; I want to stop you, Brad, because I want to do another Mel Robbins moment because I think that&#x27;s important. It&#x27;s not a standard. I think people often think about that excellence is, oh, you&#x27;re ranked X out of this many people. You&#x27;re placing this high in the races. It&#x27;s like an objective standard towards which you&#x27;re competing. You&#x27;re saying no. &gt;&gt; No, it&#x27;s a process and and in and the byproduct of that process might be that you attain a certain level or a certain ranking, but there is no arriving with excellence. It&#x27;s it&#x27;s an ongoing</p>\n<p>pursuit. That&#x27;s what makes it so endlessly fascinating and fulfilling. Um, it is involved engagement, caring deeply about worthwhile pursuits that align with your values and goals. And both parts of those definitions are really important. So the involved engagement, the caring deeply is intention. It&#x27;s focus. It&#x27;s actually giving a damn. It&#x27;s not just mimicking what someone else is doing. It is giving a damn. Not feigning nonchalants. not being too cool to care, but saying I&#x27;m going to give this thing my all. And then how do you select the thing? It&#x27;s</p>\n<p>not go on the internet and look at what everyone else is doing. It&#x27;s ask yourself what are my values? Like what kind of person do I want to become? How do I want to spend my time? What do I want to grow from? Uh what challenges do I want to undertake that are going to help shape me as a person? And then selecting goals that align with those values and those challenges. And you put those two things together, caring, deeply involved engagement and things that align with your values and goals. And that puts you on the path to excellence, to fulfillment, to life satisfaction, to mastery, to mattering, to contribution, to all these things that we long for.</p>\n<p>&gt;&gt; So once you get in that the habit, you learn how to do that to be like, &quot;Okay, this thing seems worthwhile. I&#x27;ve chosen it well. Align with my values. Then I&#x27;m really going to go into I&#x27;m going to be involved engagement. I&#x27;m not going to be embarrassed about it. I&#x27;m not going to hide it. I&#x27;m just going to go in all in it.&quot; Throughout life, you&#x27;ll have many different occasions to apply that. And overall, it&#x27;s going to lead to a lot of these other good things. &gt;&gt; That&#x27;s right. Um, one of my favorite uh pieces of reporting I did for the book is with the the master craftsman Peter Korn. And he talks about that how for the longest time he thought that he was trying to make a table in his wood shop that was really durable and had</p>\n<p>integrity, but then he realized that what he was actually after was instilling the qualities of durability and integrity in himself. So, it&#x27;s an orientation toward what you&#x27;re doing that you love the craft and the craft is going to love you back. And you can get this as a researcher, as a coach, as a teacher, as an executive, as an athlete, as an artist, as a musician. And you can get this if you&#x27;ve won three Grammys, but you can also get this if you&#x27;re just picking up guitar for the first time as a 45-year-old adult.</p>\n<p>&gt;&gt; That&#x27;s interesting. I think it&#x27;s important this idea of it&#x27;s not just what you chose, it&#x27;s about how you approach it. and what you&#x27;re trying to get out of it. Can we use you as a case study? Right. So, so, uh, one of your big hobbies is is you do powerlifting. Is that the right term? &gt;&gt; That is the right term. Really, the deadlift is is is my favorite movement to use as an example because it&#x27;s actually my favorite movement. And you could argue it&#x27;s the most meaningless thing in the world. It&#x27;s literally just spending hours and hours and hours perfecting the technique of picking a barbell from the ground to your hips. You don&#x27;t even have to put it above your</p>\n<p>head. It&#x27;s just, can you lift this thing from the ground to your hips? But there&#x27;s there&#x27;s multiple ways you could approach even that same activity. Right. So I knowing you well I know you sort of see a lot of values about life reflected in it and and I I&#x27;ll let you speak to those. But also there&#x27;s like another way you could approach that as well which would involve like I guess I don&#x27;t know constantly bragging to I don&#x27;t know what you I&#x27;m I&#x27;m I just know in the gym there&#x27;s many ways people could approach that that they&#x27;re approaching it entirely for the numbers they can brag about the the body they can show off by walking shirtless all the time. You know</p>\n<p>same activity but the approach matters. You approach it in a way that generates a lot of meaning. And I&#x27;m sure you&#x27;ve met people on the powerlifting circuit who uh are approaching this for other reasons. And that makes a big difference about how it impacts your life. &gt;&gt; I think that&#x27;s right. I think in the case of powerlifting, the people that are more superficial about it where it&#x27;s just about bragging and like looking like really strong. Uh those are the people that tend to do steroids and when I compete, uh it&#x27;s just a matter of of my own ethics. I always compete in drug tested divisions. So the people that I come across are actually like all philosophers because to spend that much time trying to lift a heavy weight from</p>\n<p>the ground to your hips, you kind of have to become a philosopher. Uh but that&#x27;s just right. Like what I&#x27;ve gotten out of deadlifting 530 lbs is not bigger quadriceps or a bigger back. What I&#x27;ve gotten out of that is learning about feeling uncomfortable in making myself vulnerable in failing and overcoming setbacks in dealing with the fear that you face before you step up to a bar that has more weight on it than you&#x27;ve ever had before. It&#x27;s taught me how to be patient when all you want is for that bar to get moving, but it&#x27;s not. Like, how do you stay with the lift? How do you not freak out? Um, it&#x27;s taught me</p>\n<p>about community and the power of training partners. It&#x27;s taught me about coaching and mentorship. Both the people who have coached and mentored me and the people that I help coach and mentor. Um, that&#x27;s what I get out of it. It&#x27;s not about picking the bar up from my feet to my hips. It&#x27;s about all of those things. And I&#x27;m not a world champion deadlifter, but Lane Norton is. And I interviewed him for the book. And even though he lifts, you know, 723 lbs, significantly more than me, when he talks about what keeps him coming back to the pursuit, it&#x27;s not the medals. It&#x27;s all the things that he learns about himself. It&#x27;s the</p>\n<p>endless curiosity. Greg Papovich, the winningest basketball coach of all time, in his Hall of Fame induction speech, literally said, Cal, &quot;Forget the wins and losses. You think they matter. They don&#x27;t matter nearly as much as you think. What matters is who you become along the way and the relationships that you forge.&quot; This is the winningest coach ever saying that. Hillary Han, Grammy-winning musician, she talks about how the violin and practicing the violin is really a way to practice being who she authentically is and to shape herself. So, it&#x27;s not just let&#x27;s all hold hands and sing kumbaya and be a philosopher like Brad in the gym. This</p>\n<p>is also true for people who are the best in the world at what they do. And it&#x27;s so different than the going through the motions mimicry that defines pseudo excellence. Um, and that&#x27;s why I get so fired up about this. It&#x27;s why I wrote the book. Like excellence is a beautiful thing. We can&#x27;t throw the baby out with the bathwater. We need to reclaim the real thing and try to make it a part of all of our lives. &gt;&gt; All right, I want to do a couple scenarios to help people think about how to concretely do this in their own life. Um because I think the answers differ a little bit based on what scenario we&#x27;re talking about. So um I&#x27;ll give a scenario and then my question is going to be if you&#x27;re this person and you don&#x27;t have excellence in your</p>\n<p>life, maybe you have some pseudo excellence but you feel that drive, how do you get started? So, the first scenario I want to give is let&#x27;s think about like a young person. Uh, you&#x27;re in your 20s, maybe you&#x27;re in like your first or second, you know, you&#x27;re in your first job out of college, and it&#x27;s, you know, you&#x27;re you&#x27;re working, you&#x27;re playing video games, you&#x27;re hanging out with your friends, you know, going out a few nights a week, and you&#x27;re you&#x27;re starting to feel this itch to like, I want to be doing something more impressive, right? I&#x27;m just answering emails and like drinking with my friends. In that scenario, what is the right few steps towards injecting true excellence into your life?</p>\n<p>&gt;&gt; I think the first thing is to ask yourself, are you feigning an attitude of nonchalants? Like, I&#x27;m kind of too cool to care. Uh, and if so, is it because you&#x27;re scared to step into the arena and to potentially fail? And if that&#x27;s the case, you have to get over that fear of stepping into the arena and failing and say, you know what, I&#x27;m willing to embarrass myself. I&#x27;m willing to risk failure because I know that on the other side of caring deeply, I&#x27;m going to unlock my potential and I&#x27;m going to find a lot of meaning and satisfaction. The second thing that I would say is, have you defined your goals in a way that makes sense? Like,</p>\n<p>do you know what your values are? Do you know how you want to spend your time? Again, are you just pursuing things because it&#x27;s what the cool people do or because it&#x27;s what your parents think you should do or what you&#x27;ve been told that you should do? Have you actually stepped back and say, &quot;Hey, you know, these are the things that I&#x27;m reasonably good at. this is how I like to spend my time. What would it look like to actually spend my time this way? And I can speak from personal experience. I mean, I went to the University of Michigan and I was a really smart student, good enough to get in. I was a very good athlete in high school and I got to school in the first two years of school. I did well because I&#x27;m smart, but like I drank a</p>\n<p>lot of beer. I smoked a lot of pot. And um my junior year, I read Zen in the Art of Motorcycle Maintenance. And it kind of clicked that like, wow, like I could have an intellectual life and I could I could write and I could do these things and instead of smoking pot and listening to Pink Floyd, I actually want to start reading the classics. And I got made fun of by all my housemates. They said like Brad is anti-fun because when they went to smoke pot and listen to Pink Floyd, I read the classics. And I&#x27;m not judging. A lot of people smoke pot throughout all of college and end up having great lives. But for me, it kind of took that leap of faith to be like, &quot;No, that</p>\n<p>that&#x27;s not who I am. At least it&#x27;s not who I am anymore.&quot; and it&#x27;s okay if it&#x27;s not cool, but I want to throw myself into this thing that really interests me and excites me and um see see what I can get out of it. So it sounds like if you&#x27;re in that age bracket, something that might help would be get off social media because that is going to create that&#x27;s like your issue with your housemates times a billion because now in your mind you&#x27;re like, &quot;Oh, I am in this arena where everyone is scrutinizing me and waiting for me to make the slightest move to show that I&#x27;m too earnest or too cool or if I do this</p>\n<p>activity, maybe this activity associated with this person and this person is associated with a problematic belief and oh my god and everything is you&#x27;re so careful. I see this a lot in 20-year-olds. you become so careful about everything you put that away then maybe that is going to be an important precondition like okay I can just actually have involved engagement in something because I&#x27;m not actually at the center of like a massive attention firestorm people don&#x27;t really care so I can care about what I want to care about &gt;&gt; I think that&#x27;s right and and and I want to give an example from someone in that age group that&#x27;s a a pretty um extreme example is the Heisman Trophy winner</p>\n<p>this year in college football uh Fernando Mendoza quarterback of of Indiana and Mendoza is known for like really caring deeply. He&#x27;ll even cry in postgame interviews. And after they beat Ohio State to win the Big 10 and to be ranked number one in the country and probably uh Mendoza gave this onfield interview and like he was just so freaking earnest. Like you could just tell like this guy was living his excellence. And afterwards on the internet he just got made fun of so hard. All the Bartow still sports guys were like, &quot;Did Mendoza just lose the</p>\n<p>Heisman with that interview?&quot; Well, you know what happened a week later? Mendoza won the Heisman. And as of this recording, Indiana&#x27;s one of two teams left in football. Those losers on Bar Stool that are making fun of him are sitting being talking heads. Well, this guy&#x27;s the best freaking quarterback in the sport. So, like, yeah, you got to step outside of that bubble because if you&#x27;re in that bubble and you&#x27;re letting it affect who you are and how you show up, you&#x27;re never going to get the best out of yourself. &gt;&gt; Yeah. Yeah, it&#x27;s like when we were young, remember Tim Tibo was getting all sorts of crap for being like having open like religious displays of celebration</p>\n<p>or whatever where clearly he was just like super gracious. He&#x27;s like, man, the fact that I&#x27;m here and I get to play this and I just made a good play. And so, you know, he was thanking God, but more importantly, he was like showing like immense emotional gratitude for this is, you know, a fantastic thing I get to do and I&#x27;m lucky and this is fantastic. And just was so gracious about what was happening. And the reaction, and this was even pre-ocial media, was like, &quot;Oh, that&#x27;s a loser thing to do.&quot; You know? &gt;&gt; That&#x27;s right. Because he&#x27;s not the cool</p>\n<p>guy with the the the mouth tape and the nose strip waking up at 4 a.m. with his steroid muscles. He&#x27;s too busy winning a national championship in college football. &gt;&gt; Yeah. All right. So, now let&#x27;s say um we&#x27;ll go fully hypothetical. You&#x27;re like a 43 year old male with a with with three kids and you&#x27;re busy and work and you know you you wake up one day and you&#x27;re like, I want more excellence in my life. I think I have a lot of listeners who are more of our stage of life. So now you don&#x27;t have as much time and you&#x27;re in a place where culture is saying like no man&#x27;s dad bod time. Like let&#x27;s roll. Like this is fine. like you you have your job and you you know you</p>\n<p>have your kids and now it&#x27;s time to you can let the other things go and relax when you can. What is like reintegrating excellence look like you know early mid-E? &gt;&gt; I think it depends on whether or not you have the opportunity to pursue these things in your workplace. Um, if you do and there&#x27;s an opportunity to job craft and to to make your job a real challenge that is pushing you, that&#x27;s allowing you to work toward big goals that align with your values, then I think that&#x27;s a really fortunate position to be in. And you should take your work very seriously. And you should remember that the things that you work on also work on</p>\n<p>you. So, you&#x27;re not just trying to build, you know, your team at the office or get the promotion to senior vice president because of the salary or because of the success for the company. you&#x27;re also doing it in a way that&#x27;s going to make you a better person. It&#x27;s going to make you a better leader. Uh this is true if you&#x27;re a salesperson. This is true if you are an individual knowledge worker contributor. This is true if you&#x27;re a leader of a team. For another cohort of individuals who might say, you know what, Brad, I work a 9 to5. My job is really boring, but it pays the bills. I can send my kids uh to to to public schools and the good</p>\n<p>extracurriculars and like I just I&#x27;m never going to find that in my job. But that&#x27;s okay. Um, what I would say is that you can have a craft in your leisure time, a hobby, an activity that you pursue with this mindset of involved engagement in something that aligns with your values and goals. We talked about how for me it&#x27;s powerlifting. There are people for which this is guitar or coding or watercolor or sculpting or gardening, you know, on and on. Woodworking. The activity doesn&#x27;t matter. What matters is that you have this thing where you can put your concrete effortful exertion in and see</p>\n<p>progress that you can trace back to yourself. That is so satisfying. And again, that helps shape you as a person. And I think that when you do this in in leisure and in hobbies, in some ways, it can be even more advantageous than in the workplace because in your leisure time, you have full agency. Like you don&#x27;t have to worry about the opinions of your co colleagues or a boss telling you what to do. you can really set up the craft to get exactly what you want out of it. So, I find myself to be very, very fortunate. I think writing is a craft and I totally pursue excellence professionally. However, I get just as much out of how I pursue deadlifting,</p>\n<p>even though I&#x27;m never going to win a state championship, let alone a national championship. Like, I&#x27;m good, but I&#x27;m not that good. But because I can tailor it in a way that I am getting these characteristics and I&#x27;m working on myself, not just the barbell, I find it so gratifying and so fulfilling. I I think it&#x27;s a really good point about you can find excellence within your professional world. It&#x27;s a thing I&#x27;ve observed is that for prior generations like our parents&#x27; generation and the generations before that this was just a given. It was like yeah if you have a job as you advance into like your 40s and 50s you look to step up and to be</p>\n<p>like this is very meaningful. I&#x27;m a leader. These are my people. I manage. This is like a family. Like I take this very seriously. I would remember going to like my dad&#x27;s office and he knew he would knew the backstory and name of every single person he would pass like oh so you know how is like your kid doing with the test he was taking last week or whatever it was this is a big source of meaning is like yeah you&#x27;re a leader of a like economically productive tribe our generation the millennials we went through this phase with the economic crisis post 911 that really uh shifted us I&#x27;ve written about this</p>\n<p>before hardcore towards like lifestyle design and and you know thinking about what exactly do I want in my life and trying to craft your life in very careful ways which had a lot of benefits to it&#x27;s how we it was a smart reaction when we were in our 20s and dealing with like the economy imploding but I think it&#x27;s taken us longer to rediscover for a lot of people it&#x27;s like well actually now that I&#x27;m you know promoted to be head of this school or I&#x27;m in charge of this large team or something like that that could become a real source of excellence and meaning if I&#x27;m willing to be engaged in it in a meaningful way and</p>\n<p>say this is important this is these people&#x27;s livelihoods. This is a company with a long history and I want to be a really good leader. Uh we we I&#x27;m rediscovering that as well. I think a lot of us from our generation sort of lost that play that was part of the standard playbook. Uh and tell &gt;&gt; Yeah, that&#x27;s right. And and I think what we lose and I think the the kind of dismissive way to think about this is oh you&#x27;re just talking about like the company man that gives your life to the company or the company woman. And that&#x27;s one way to think about it. But the other way to think about it is actually uh yeah, I want the company to do well</p>\n<p>because I work for them, but what I really want is to challenge myself as a leader because that&#x27;s going to affect how I show up as a husband or wife, as a mom or dad, as a friend, as a community member, uh so on and so forth. So the best cultures, the the person shaping the organization, but the way that the person shows up is also um excuse me, the way that the person shows up in the organization is shaping the organization, but the organization is also shaping the person. It&#x27;s it&#x27;s a two-way street. And some people just don&#x27;t have it. Some people just work a boring nineto-five where you&#x27;re filling out a couple spreadsheets and maybe it&#x27;s</p>\n<p>actually like a nineto and maybe you could get that job done in 3 hours and then that&#x27;s awesome because now you&#x27;ve got all this time and agency where you get to choose. You could numb yourself out with passive scrolling and consumption or you could define a craft that you want to work towards mastery in and pursue excellence in that craft in a way that is every bit as gratifying as someone who gets to do it professionally. All right. So, final thing I want to ask you about. We talked about how the internet can hijack this drive and keep us away from this true excellence and put us towards pseudo excellence. So, what is the technology prescription here? Is it to to think</p>\n<p>about true excellence as a largely offline endeavor? Um or is it to have a a different way more careful way or more targeted way of using the internet? What is the role of internet in true excellence? Um, do we use it carefully or do we separate these two? &gt;&gt; I mean, the internet, Cal, you know better than anyone. It&#x27;s such a a broad amorphous being, a broad amorphous term. I think is a source of information and a place to educate oneself. I think that</p>\n<p>the internet can be really powerful because it has so much good information. But I also think it can be really dangerous. Forget social media. you could just go down the wrong rabbit holes of websites and be completely thrown uh off the path because the information that you have is garbage. Um so I guess the way that I like to think about the internet is it&#x27;s a tool with potential benefit but also with a lot of harm and you have to be really careful about how you use the tool and I think the internet should be a a way station instead of a terminal endpoint. So what I mean by that is if you go to the</p>\n<p>internet and you find a community great then meet those people in real life. If you go to the internet and you find a lot of information then great find a real life coach and go discuss that information with them. I think when we end up terminally online bad things tend to happen and we tend to get thrown astray. When we use the internet as a way station I think it&#x27;s an incredible source of excellence. I mean I met you some 10 years ago over the internet. Now we are best of friends in real life and you&#x27;ve imbued my life with so much meaning both intellectually and just as a great friend. The internet empowered</p>\n<p>that but it was a way station right like that&#x27;s where we kind of met and then it wasn&#x27;t the terminal point. The terminal point is our friendship. And I think that increasingly we&#x27;ve got to think about the internet is a means to a different terminal end and that terminal end is probably somewhere in the analog world. Ironically, the way we first discovered ourselves was the the video I put up of me shirtless saying, &quot;You need to put your your head in scalding water for 10 minutes at a time to get your day started, right?&quot; So, that that viral content. Um, &gt;&gt; that&#x27;s why I have no hair on my head, Cal, because I took your advice and I</p>\n<p>burned it all off. &gt;&gt; Yeah. You didn&#x27;t realize I was faking it. I That was CGI water. You were the You took the mistakes. &gt;&gt; Exactly. &gt;&gt; Um, all right. I That I love that idea, by the way, is like the internet can only be a way if it&#x27;s where you end up problem. If it gives you stuff you&#x27;re using in the real life, then like it could be completely useful. All right, I want to add one more final question because it&#x27;s just relevant to you and I. We both have sons um you know, young boys and uh that we&#x27;re parenting. But let&#x27;s say you&#x27;re a parent and you know, you&#x27;re looking around and there&#x27;s like young kids around you. They&#x27;re on their phones. It&#x27;s now like 75% of the</p>\n<p>whatever the generation younger than Jinz&#x27;s ambition is to be like an influencer because it&#x27;s the only thing they really know. What&#x27;s the parenting advice to set someone who is young on a path away from internet pseudo excellence and towards the the joys of real excellence? &gt;&gt; Be about it. Don&#x27;t just talk about it. Like let your young child see you pursuing uh some sort of craft. Uh let them see you training at the gym. Let them see you trying to learn an instrument. Let them see you are in the garden uh trying to to become a master gardener. Um, I think that we do a lot</p>\n<p>of telling and talking to our kids about these problems, but then if we&#x27;re just constantly consuming media on our phone all day, like talk is cheap. Uh, I think the best way to role model a life orientation or a philosophy of excellence in your kid is to to do it in yourself. So, if you want this for your kid, then you&#x27;ve got to find an activity or a craft or a job or some combination of those things that allows you to show your kid what it looks like to care deeply and give something your all and work really hard at it um in a way that is not superficial or performative, but</p>\n<p>is deep and real. This is my problem is that I do have things I show my kids that I work really hard on, but I also have one of those YouTube way to get a 100,000 subscriber plaques up in my office. like that is sending them the wrong message. I constantly give them lectures about do not do this. This is not a job. Like whenever they&#x27;re at my studio, it&#x27;s like do not aspire to do this. This is it&#x27;s one thing if you&#x27;re like a writer and you have like a podcast that goes on there, but like don&#x27;t this is not a destination. I feel like I have to constantly try to anti- glorify</p>\n<p>staring into a camera and recording YouTube videos because that that&#x27;s they do pick up what you show. I was like, forget that. Watch me writing in the office. That&#x27;s the thing that matters &gt;&gt; and that&#x27;s what enables the YouTube channel. So, I think like that plaque on the wall like that was never the goal. You know, your goal wasn&#x27;t to be a YouTuber or an influencer. Your goal was to be uh a really freaking good computer scientist and then the best ideas writer that you could be. And the the YouTube like that&#x27;s uh that is secondary. That&#x27;s like a byproduct. It&#x27;s like when you go to the gym, you know, you do your deadlift or your squat or your shoulder</p>\n<p>press and then you do a secondary exercise. So, maybe a Romanian deadlift. Um, uh, maybe something for your back. And then at the very end of your workout, you do your biceps and triceps, okay? But like that&#x27;s the stuff that if you don&#x27;t have time, you don&#x27;t do to me. Like the big YouTube platform is your biceps and triceps. And as long as you&#x27;re doing that deadlift, and if that&#x27;s leads to you having the YouTube platform, that&#x27;s great. Uh, but I think it&#x27;s an interesting metaphor because I think there&#x27;s a lot of people with really big YouTube platforms that have really big biceps, but they can&#x27;t deadlift anything. Well, the metaphor works because if you look on the wall, and you&#x27;ve seen this, you&#x27;ve been at my</p>\n<p>studio a bunch of times, but at there&#x27;s the YouTube plaque is on the wall. Above it, so symbolically above it is a a a framed cover of one of my books and its appearance uh up high on the New York Times bestseller list. So, it&#x27;s like that was actually the thing that lets this other thing happen downstream uh which could take her leave. Yeah. &gt;&gt; Yeah. And it&#x27;s just it&#x27;s just talking to our kids. I mean, I think we&#x27;re lucky like the parents that I feel for and I&#x27;m sure there&#x27;s many listening are are parents whose kids are like in high school or early college right now um who like we&#x27;re just starting to really grasp</p>\n<p>like what this internet culture does and what these technologies do. So now we can reckon with it. Um, but the the kids who are kind of like the initial uh the initial subjects in the experiment of mass algorithmic distraction. Um, I mean I feel for those parents because it&#x27;s it&#x27;s a it&#x27;s got to be a really challenging situation, especially if you&#x27;re, you know, you&#x27;re listening to to this podcast and the other parents are just like, &quot;Yeah, take the phone, take the iPad, get on the social media, whatever.&quot; I could imagine that also causes a lot of tension. Um, so I think you just got to love the crap out of your kids. And you&#x27;ve got to not just</p>\n<p>talk about it, be about it. Um, and then sometimes make the choice that might lead to some short-term tension with your child, but is in their best long-term interest. &gt;&gt; All right, I love this. This has been great. This has been a good idea segment. Uh, Brad, thank you. And probably the best approximate advice we can give everyone in the audience is that if you want to get away from internet field of excellence towards true excellence by the way of excellence, Brad&#x27;s book just came out. As I mentioned, you know, Steve Kerr is right there on the cover, but the back is all sorts of like incredibly accomplished performers plus me, who is</p>\n<p>by far the the least skilled person on your book, Brad. kind of I&#x27;m glad there&#x27;s not photos with blurbs because you have like these world champion athletes and then you have an idea writer but buy that book way of excellence the way is uh everywhere everywhere you can buy books and you also have what&#x27;s the website for them to immediately find out all the information wayof excellence.com &gt;&gt; I should know this uh see I&#x27;m about the main thing not about the marketing of it &gt;&gt; I think it&#x27;s important &gt;&gt; it is wayof excellencebook.com &gt;&gt; excellent okay so there you go uh read the book it it is fantastic Fantastic.</p>\n<p>And it will help guide you if you&#x27;re interested in this through the transition. All right, Brad. Um, I&#x27;m sure we&#x27;ll have you on again soon. But thanks again. &gt;&gt; Thank you, Cal. This is a pleasure. &gt;&gt; All right, so there we go, Jesse. That was my conversation with Brad. I don&#x27;t know if I&#x27;m convinced that the internet is hijacking your ambition or if my message from that interview was like you and I should do more hustle culture content. It needs to be a lot more. What I imagine is is a table full of supplements and I&#x27;m in a a sleeveless shirt just kind of flexing furiously as</p>\n<p>I walk through my anti-aging routine. I think we would kill it &gt;&gt; possibly. &gt;&gt; I think I need to look younger though. That&#x27;s the problem. &gt;&gt; I&#x27;m still trying to think about the Steve Kerr cuz he won championships as a player and as a coach. I think he won five with Golden State then four with the Bulls. &gt;&gt; But that would track because the Bulls won how many? &gt;&gt; They won six. &gt;&gt; Yeah. And he wasn&#x27;t there in the very He wasn&#x27;t there in the very early days. &gt;&gt; Maybe he won three and six. Yeah, Steve Kerr always gave me hope because like he&#x27;s we&#x27;re roughly the same height. So like it, you know, as a kid I was like, &quot;Yeah, I could still be an NBA champion. You know, he could shoot uh he could shoot three points. You could shoot</p>\n<p>three-pointers.&quot; Yeah. Anyways, that was great. Check out Brad&#x27;s book, The Way of Excellence. Okay, so as mentioned, we&#x27;re now going to shift gears to our practice segment. So if the idea segment is ideas about the fight for depth in an attractive world, the practice segment is actual advice that you can consider in your own life for making that fight personal. Uh we&#x27;re going to shift gears from the world of ambition to the world of work. We got a good one. So uh let&#x27;s get started with our practices. Let&#x27;s take another quick break to hear from our sponsors. One of my big goals for the new year is</p>\n<p>trying to get my finances back under control. You probably have a similar sort of ambition. Well, here&#x27;s the good news. Managing your money doesn&#x27;t have to be a struggle this year if you use Monarch. Monarch is the all-in-one personal finance tool designed to make your life easier. It brings your entire financial life, budgeting, accounts, investments, networks, net net worth rather, and future planning together in one dashboard, which you can access from your laptop or your phone. Interested? Well, you can start your new year on the right foot financially and get 50% off your Monarch</p>\n<p>subscription if you use code deep. Now, here are two reasons why I like Monarch. One, its interface is beautiful. It really makes it a pleasure to check in on what&#x27;s happening with my money, which means I check in more often. And two, they continue to add new features and tools. For example, they just added an AI assistant. You can ask questions about your own finances. It&#x27;s like having a financial coach accessible 247. This new year, achieve your financial goals for good. Monarch is the all-in-one tool that makes proactive money management simple all year long.</p>\n<p>Remember to use code deep at monarch.com for half off your first year. That&#x27;s 50% off your first year at monarch.com with code deep. I also want to talk about our longtime friends at MyBody Tutor. Do you want to be healthier this year? I can tell you exactly how to accomplish this goal. Sign up for MyBody Tutor. Mybody tutor is a 100% online coaching program that solves the biggest problem in health and fitness. Lack of consistency. Here&#x27;s how it works. When you sign up for MyBody Tutor, you&#x27;re</p>\n<p>assigned a coach who helps you come up with a plan for your nutrition and exercise that fits your life and your goals. You then check in with your coach every day using the My Body Tutor app. Now, this accountability helps you stay consistent, but also your coach can help you adjust as needed. You have a trip coming up or holidays or something&#x27;s not working for you, they adjust your plan for you right there. Put simply, mybody tutor works. So check it out at mybbodytutor tu.com today. And if you mention deep questions</p>\n<p>when you sign up, you will get $50 off your first month. That&#x27;s mybodytutor.com. Mention deep questions and get $50 off your first month. All right, Jesse, let&#x27;s get back to the show. All right. So, those of us who study the intersection of work and technology are always excited when each</p>\n<h2>Escaping messaging hell</h2>\n<p>year Microsoft puts out an annual study called the work trends index. Now, here&#x27;s what makes this study interesting is where they get their data from. One of their big sources of data points is the Microsoft 365 software suites like Microsoft Word, Microsoft Excel, Microsoft Outlook, you know, those tools that so many people use to work on their computers. They gather trillions of observations from people using that software. They anonymize them and analyze them and you get this snapshot of how are actual knowledge workers</p>\n<p>using their computer. So they released their 2025 report sometime last year. Here I&#x27;ll load it up on the screen here uh for people to who are watching instead of just listening. I mean like typically these reports it&#x27;s it&#x27;s a thinly veiled blueprint for why you should use their products. But buried in there is always really good observations. Here are a couple numbers I pulled out of the 2025 report. The average worker in 2025 received 117 emails daily, most of them skimmed in under 60 seconds. Here&#x27;s another data point. The</p>\n<p>average worker receives 153 Teams messages, that&#x27;s like Slack, Instant Messenger, per weekday. That adds up to 270 interruptions a day when you only have about 480 total minutes to work with. So when are people actually getting their work done if they&#x27;re being interrupted this much? Well, there is an insight in this question as well from the report. They found, and I&#x27;ll I&#x27;ll read here, over the weekend, usage of WXP, so Microsoft Word, Microsoft Excel, and Microsoft PowerPoint, the</p>\n<p>non-communication tools, overtakes teams messages as employees finally carve out time for uninterrupted focus work. By the way, notice how all these people have they don&#x27;t want to use my term deep work. So, everyone uses the phrase focus work, which is, I guess, good or bad. Um they found perhaps not surprisingly that half of the employees that they they did a survey as well as part of this report. Half the employee survey described their jobs as quote chaotic and fragmented end quote. All right. So let me state the obvious here. I think these numbers are insane. Right?</p>\n<p>You&#x27;re paying these knowledge workers huge amounts of money uh to essentially answer messages. I want you to spend all day answering emails or answering teams messages and then maybe on the weekend you can get a little bit of actual work done. This can&#x27;t possibly be the most cost-effective way of paying for a lot of human brains than asking them to create value. I&#x27;ve been talking about this problem for a long time, but what what kind of distresses me is that this issue of constant workplace distractions is getting worse. These are some of the worst numbers I&#x27;ve seen in the decade or so that I have studied this. So we need</p>\n<p>good advice about how to push back against our current knowledge work culture of constant digital distractions. All right. So what I want to do is offer as this new year is still new. I want to go through um I&#x27;m going to go through my main ideas. I have one, two, three, four, five. I want to go through my five main ideas for how to tame the digital communication problem in your work. whether you work for a huge company or for yourself. And so here&#x27;s how I&#x27;m going to do it. I&#x27;ll load this on the screen for people who are uh watching</p>\n<p>instead of just listening. I have five things here, one, two, three, four, five. Um I&#x27;m going to go through these one by one and uh give you my advice about them. All right? And hopefully this will help you prepare for the new year. So let&#x27;s start with the first idea was eliminate threads. So I&#x27;m going to bring up a couple bullet points about this. All right. So eliminate threads. What do I mean by that? Here is my explanation I put up on the screen. Anything that requires more than one message in response should be moved to synchronous communication. All right.</p>\n<p>So, what do I mean by that? Think about all the different types of messages you receive in a typical day. Some of them are informational. This is the new parking lot&#x27;s going to be closed. The new policy for the cafeteria. All right, that&#x27;s one type of message. Another type of message is quick questions. Can you remind me what time the meeting is tomorrow? Right? The third category of communication you get in the workplace is going to be the beginning of a back and forth discussion. So when I say in my notes here, anything that requires more than one message in</p>\n<p>response, that&#x27;s what I&#x27;m talking about. So communication threads where you ask a question, I have to answer, you have to get back to me, I have to get back to you. You&#x27;re basically taking a conversation and you&#x27;re spreading it out over back and forth messages, be them emails or instant messengers. Those type of threads are the main disruption interruption generator when it comes to digital communication. When it comes toformational things, email&#x27;s great. I&#x27;ll read this memo when I get around to it. That&#x27;s a perfect use of email. When it comes to questions that can be answered with a quick question, uh quick answer. That&#x27;s another great use of a tool like email because it can sit in my</p>\n<p>inbox until I&#x27;m ready to answer it. I can answer it quickly and then it&#x27;s done. But when it comes to threads that require back and forth communication, this is what creates all the disruptions. Why? Because now we have a conversation going on. There is a time constraint to this conversation. We have to resolve it in a reasonable amount of time. Presumably, whatever conversation you started with that message, you do not want to unfold over the next 10 days. But in order for this back and forth conversation to be finished in a timely manner, we have to see each other&#x27;s latest message soon after it arrives.</p>\n<p>So now I have to be checking whether it&#x27;s Teams or Slack or email, I have to be checking it constantly so that when your next message gets to me, I see it quick enough to bounce a message back to you and you see that quick enough to get back to me. And it&#x27;s that need to service back and forth digital conversations that takes the interruptions of things like email and chat and it metastasizes it until it&#x27;s all you&#x27;re doing all day long. So going back to my table here, my advice is to eliminate threads. So what I&#x27;m saying is anything that requires</p>\n<p>more than one message and response, move to synchronous communication. That is real time communication. And there&#x27;s different ways you can do this. If you&#x27;re in an office, walk down the hallway and actually talk to the person or have office hours, which I talk about commonly, a set time each day where your door is open, your phone is on, you have a Zoom room open, and you can just say, &quot;Hey, um, come by my next office hours. will chat about this. That&#x27;s your one response when someone wants to start one of these back and forth threads. Or you can have a new concept which I&#x27;m introducing for 2026 which is the idea of a phone zone. I heard this from uh a</p>\n<p>listener suggested this and I thought it was a great idea. You can have a much broader amount of time each day in which you can say uh I&#x27;m not dedicating this just to communicating but my phone&#x27;s going to be on. So a lot of people might say for example I don&#x27;t know 2 to 5 the end of my day I keep my phone on. So you can just call me at some point in that part of the afternoon. I don&#x27;t really schedule long deep work. Then I&#x27;m sort of like finishing things up. You can always just call me at some point in that broader zone and we&#x27;ll talk about this. You move things back to the phone. Synchronous when done this way is much more efficient than back and forth</p>\n<p>communication because now what would have been 10 back and forth messages we could resolve in about four or five minutes of actually talking to each other. A word of warning here. Don&#x27;t allow your attraction to synchronicity mean that you create meetings. Now, that&#x27;s a problem. If I take what would have been 10 back and forth messages and said, &quot;Let&#x27;s just throw a Zoom meeting onto our schedule.&quot; Well, now I&#x27;ve just eaten up a half hour of time just for this one conversation, and that could be worse. One of the most uh the new and most distressing numbers I saw in this Microsoft trend uh study was that of the</p>\n<p>meetings they were study so they they have all the meetings they can track meetings that happen on their meeting software 60% were quote ad hoc meaning that like someone that day was like hey let&#x27;s have a quick meeting to talk about it and then that puts a huge like 30 minute plus footprint on your schedule. So synchronous communication is good, but not when you need a full meeting to discuss something. You want to have be able to call you three minutes, you take care of it. You want someone to stop by your office during office hours, three or four minutes, you take care of it. That&#x27;s what we&#x27;re looking for. All right, second idea. Let&#x27;s load this up here. Jesse, relocate for deep work. All right, let me put up my bullet point for</p>\n<p>that. I&#x27;m going to make people motion sick with all my scrolling here. Jesse, protecting deep work on your calendar helps relocating to a different location without access to email and messaging is even better. So, I&#x27;ve talked about before the importance of when it comes to uninterrupted focus, you need to actually have that time put aside in advance. If you&#x27;re just waiting for when&#x27;s the next time when I have nothing to do and I feel like concentrating, if that&#x27;s what you&#x27;re waiting for to get your deep work done, you&#x27;re not going to do any deep work. You got to actually put aside the time, put on your calendar, schedule it like another</p>\n<p>meeting or appointment and say, &quot;I don&#x27;t do email or or messaging during that period.&quot; So, you differentiate between times when you&#x27;re doing communication and times when you&#x27;re trying to make progress on things. And if people get mad at you, you say, &quot;I was working on the report. I don&#x27;t have my communication channels open when I&#x27;m working on my report.&quot; And stand by that. That&#x27;s a very reasonable thing. But what I&#x27;m arguing here, here&#x27;s my new for 2026 advice. It&#x27;s good to protect the time. It&#x27;s better to also have a location you go to that&#x27;s dedicated for that type of uninterrupted work. This really helps the mind lock into what</p>\n<p>you&#x27;re doing. So, for example, if you can go to a place that does not have Wi-Fi or you can turn off your Wi-Fi as you go to like a conference room on another floor in your office and that&#x27;s where you go for the time you put aside to work on something that requires focus, it&#x27;s going to be so much easier because now you don&#x27;t have the option of quickly jumping on to your email or quickly jumping on to Teams or Slack because you literally don&#x27;t have the internet access you need to do that. And two, because it&#x27;s a separate location that you dedicate for doing deep work</p>\n<p>type tasks, it&#x27;s much easier for your mind to understand that, oh, this is what we&#x27;re doing now. This is very different than if you do all of your work at the same desk, the same desk in which you do have to do email and you do have to jump on online meetings. If you&#x27;re also doing your deep work there, your mind can be very clever at saying, look, we spend a lot of time here checking email. Why not right now? And then you have to have that debate. But if you go to like the coffee shop, you go to the special conference room, you go to a a different part of town, you go to the special office you set up in your attic, when it comes time just to do deep work, your mind says, &quot;Oh, we know this. We know this drill. When we&#x27;re in</p>\n<p>this location, we don&#x27;t do communication. And when we&#x27;re at our desk, we do.&quot; And so, don&#x27;t just protect deep work time, relocate, and make it logistically difficult to do communication in that location. This will really help you conquer the the communication problem as well. All right, we&#x27;re making progress here. Let&#x27;s jump on to number three. Load this up here. Batch group discussion. Um, I&#x27;m pushing here docket clearing meetings. And I say if you do this two or three times a week, you can eliminate 90% of group email threads and at least 50% of</p>\n<p>one-off meetings. Those are two big promises. So, what are we talking about here? Well, docka clearing meetings, you can think of it as a collaborative office hours. Two or three times a week, your team gets together to say what uh what open loops, new tasks, new ideas, things we have to tackle have come up since our last docket clearing meeting. Let&#x27;s go through them all. Where do you find these? Well, you actually open up what I call a docket, but is actually just a shared document shared by the whole group. Whenever something comes up during your day that is relevant to the</p>\n<p>group, a client asks a question, you have an idea, you hear about a new deadline coming up, there&#x27;s an RFP that you think maybe we should look at, you have a concern about an ongoing project, instead of immediately jumping to email and doing a group email to everyone, you write it into that shared document. That&#x27;s the docket. It grows as everyone in the team adds things to that that need to be discussed. Then at your next docket clearing meeting, you go through the things in that document together and for each you can defer it or you can delete it like this is not that important. Or you can say, &quot;Let&#x27;s actually work on this and figure out right there who&#x27;s going to do what?&quot;</p>\n<p>That&#x27;s where you can be like, &quot;All right, Jesse, why don&#x27;t you handle this? What do you need from us?&quot; Okay, you need this information from Cal. All right, great. Uh, when&#x27;s he going to get it to you? By the close of business tomorrow. Great. So, Cal, you agree you&#x27;ll get that to him by close of business tomorrow. Uh, Jesse, when are you going to finish this thing? Okay, you&#x27;ll have it done by Thursday. Great. Put it in our shared drive. So, everyone else, let&#x27;s agree. On Friday, take a look at the document that Jesse put into the shared drive and put all your comments in there by the end of the day. You can figure out right there how to deal with the things so that you don&#x27;t</p>\n<p>have to work that out with email. Because again, remember, if we have to figure that all out with email, that&#x27;s not just a lot of messages. It&#x27;s exponentially more inbox checks to try to keep up with those messages and to keep that that conversation going. All right. Well, that one leads us to my fourth suggestion, which is create processes. Now, I wrote here that you should spend more time in the moment to prevent many distractions down the line. I just gave you an example of the process uh process when I talked about our hypothetical about Jesse and that report. So, what was critical about what I just described</p>\n<p>there? Well, it included, and I&#x27;ll highlight these, uh, who will deliver what, where they will put it, and when it will arrive. So, taking the time to talk with someone when a task comes up about who&#x27;s working on this, what is it that they&#x27;re going to produce, where will they put it when it&#x27;s done, when will it be there? You answer those questions, right? Four W&#x27;s. That saves a massive amount of communication because almost all of the emails that require us to keep checking</p>\n<p>that inbox, almost all of the chats that pull out of our attention are figuring this out on the fly in an ad hoc manner and generating lots of distractions. People avoid creating a process for tasks because in the moment it requires a little bit more time and we want to just in the moment move through things and play inbox hot potato and just write thoughts question mark and hit send and now that&#x27;s off our plate. temporarily. That&#x27;s in the moment. We want to get these things out of our life. But if you spend a little bit more time to say what are we actually talking about here and what is our 4W plan for making progress</p>\n<p>that structure is saving you interruption and interruptions are the productivity poison here. It is worth taking more time. It is worth taking more time. All right, we got one last suggestion. Reduce active projects. Each active project generates messages. Therefore, reducing active projects reduces messages. This is something I really came to understand when working on my last book, Slow Productivity. The connection between workload and messages. There is</p>\n<p>a uh a certain amount of communication that any sort of active project will generate. I mean, I there&#x27;s logistics. I need to talk to people about things. We have to pass information around. If you increase the number of things you&#x27;re working on actively, you&#x27;re increasing the amount of this necessary communication that has to happen. It&#x27;s actually a major driver of of overload and communication is actually it&#x27;s overload in projects and the communication overload is a side effect of that deeper issue. We need to be working on less things at the same time. That is critical to reducing the amount of communication</p>\n<p>that we have to deal with. And I think we miss that. Now, there&#x27;s a couple ways to do this. The obvious way to do this is to say no more often. If you&#x27;re in a situation where you can do that, like you&#x27;re an entrepreneur and you&#x27;re in charge of like what client projects you take on or whatever, just have a clear rule about how many you do at the same time. If you&#x27;re in a situation where saying no is hard, the key idea for my book, Slow Productivity, is to differentiate when it comes to things you&#x27;ve agreed to. differentiate between things that you are actively working on right now and things that are in a</p>\n<p>holding pattern until you&#x27;re ready to work on them. Only be working on two or three things at once and everything else is on a list of I&#x27;m waiting to do. And any communication or meeting request or whatever that&#x27;s generated about things in the waiting pin, you say that is on hold right now. Uh I will let you know as soon as I actively start working on I estimate that&#x27;ll be in about two or three weeks and then we can start talking about and having meetings about it. But like right now it&#x27;s not one of my targets I&#x27;m working on. That works just as well because what we&#x27;re trying to avoid here is things too many things</p>\n<p>generating messages and meetings. So in a holding pattern even though you&#x27;ve agreed to do it, it&#x27;s not generating message and meetings. So that that is okay. That can work as well. So I put a note about that on my table here where I said there&#x27;s a difference between saying no and putting something in a holding status. Both will give you the benefit. Uh but one is a little bit less severe than the other. All right. So, here are my five things. I&#x27;ll put the whole list zoomed out on the screen here. Eliminate. We got eliminate threads, relocate for deep work, batch group discussion, create processes, reduce</p>\n<p>active projects. These five things will help you find a lot of freedom in 2026 from feeling like you&#x27;re constantly servicing communication channels. Here&#x27;s what I want you to notice about this advice, because I think this goes back to a lot of my advice about wrangling technology in the workplace. None of these are technological. None of these is advice about changing notification settings. None of this is advice about advanced filtering for your messages. None of this is about using more complicated software tools to try to compensate for the work that&#x27;s moving</p>\n<p>back and forth uh through email. None of this is advice, God help us, for deploying, you know, AI and really complicated ways to try to uh summarize your messages. It&#x27;s it&#x27;s crazy, Jesse, how much it seems like companies working on AI productivity software thinks the number one issue facing people is taking email messages and summarizing them the bullet points. That&#x27;s not my problem. My problem is that I have 117 email messages to answer today. Emails by definition are already summaries of whatever the issue is, right? That&#x27;s not I know that&#x27;s what we know how to do, but that&#x27;s not what we actually have uh</p>\n<p>problems doing. All of these are procedural structural uh scaffolding style solutions. Change your rules for what you communicate where. Have certain times for certain types of coordination versus other types of times. Have more processes. Be more careful about your workload. So we have this purely digital problem like low friction digital communications creating this overload. And our solutions are not adding more technology on top of that technology. is changing the underlying way we work so that we still get value out of that technology</p>\n<p>but it&#x27;s not overwhelming us. So I just wanted to point that out that sometimes the problems created by technology aren&#x27;t solved by more complicated configurations of your technology but uh instead can come from having better processes or ways of thinking uh about your work. All right, so I&#x27;m going to load just one last little recommendation here. Um if you want to find out more about this, I wrote this book during the pandemic. I&#x27;m going to recommend it. Uh, it&#x27;s called A World Without Email: Reimagining Work in an Age of Communication Overload. As you&#x27;ll see, it was one of the best non-fiction books</p>\n<p>of the year, Jesse, as selected by Amazon. It was also a New York Times bestselling book. This book is like my magnum opus on this question of where did the overload of communication come from? Why is it not making us productive? and what are I call them the protocols that uh you would put into place as an individual, a small team or a big organization to try to free yourself from communication overload. So listen to my advice. If you want to go deeper, check out a world without email. That book has a lot of big ideas. That</p>\n<p>book kind of disappeared, Jesse, because it came out in the heart of the pandemic. Yep. &gt;&gt; And people were just &gt;&gt; not at that moment saying, you know what my number one concern is right now? uh our meeting structure or like my I really want to work on my my email habits or whatever, you know, that wasn&#x27;t wasn&#x27;t the top of mind at the time. So, um I&#x27;m telling people about it now. Check out that book. All right, I think that&#x27;s it for our practice segment. Jesse, I think we&#x27;ll move on now to question and comments. All right, we got one question this</p>\n<p>week. Is that right? We&#x27;re doing something a little bit different. One question that&#x27;s going to take up a lot of our time. Let&#x27;s hear it. Everyone keeps talking about how AI has suddenly changed everything, but outside of computer programmers, most of the</p>\n<h2>Have new AI tools actually been as transformative as claimed?</h2>\n<p>examples I hear of people using new AI tools are pretty narrow and niche. Am I missing something? I uh I like this question. I think uh it gets to something I&#x27;ve been thinking about a lot recently that&#x27;s maybe like a dangerous thought, but it&#x27;s worth us actually exploring a little bit here. Clearly, a huge amount of money is being invested into new generative AI tools built on large language models such as chatbots. And it&#x27;s just goes without saying this has been massively disruptive. Most of the conversation is about how do we deal</p>\n<p>with the disruption that has been caused by this new technology. But think about this question for a second. What actually are the things that this massive investment in generative AI through language models, what actually are the things that this has changed? Because if you ask people, they don&#x27;t always have an immediate answer to offer up. Is that possible? Well, I want to investigate this. So, here&#x27;s the way I&#x27;m going to do this. Um, I found a Reddit thread that was from three months ago. I&#x27;ll put this on the screen here for</p>\n<p>people who are watching. It says the same question. with all the billions or trillions going into it, what has AI actually done other than as a search engine and funny pictures. So, this is a thread where people from all over the internet are going to write in and do their best to explain all the various things that we&#x27;ve gotten from this massive investment in new AI technologies. So, whatever these benefits are, you would think they&#x27;re in this very popular thread. So, what we&#x27;re going to do is I want to go through this Reddit thread to try to come up with uh a list of the</p>\n<p>things that this recent massive invest in AI has produced. Now, a couple ground rules to this. I&#x27;m not going to include things uh AI applications. I&#x27;m not going to include AI applications that are based um aren&#x27;t based primarily on the new large language models that have received the bulk of this investment. So the type of models that OpenAI and Enthropic have been producing, there&#x27;s a lot of existing machine learning driven AI tools that we&#x27;ve been working on for year after year and and over the time those have made progress. I&#x27;m going to separate that because that&#x27;s not that&#x27;s</p>\n<p>just the standard progress in AI and it&#x27;s not connected to anything new that has happened. I also want to separate into its own category the one obvious place where we hear most often about language models making an impact which is computer programming. Computer programming is like a best case scenario for gender of AI. It&#x27;s a highly structured language and we have a huge amount of very uh relevant data on which to train these. So we know it&#x27;s been really uh impactful there. So we&#x27;ll kind of keep that as its own column. What I&#x27;m looking for as we go through here then what I&#x27;m actually going to write down as we go through here is examples that depend on the generative AI models that</p>\n<p>we put billions of dollars in the last three or four years. But it&#x27;s not computer programming because clearly if this has really changed our world that list should be really long. All right. So I&#x27;m going to load this back up again. Um, and I&#x27;m going to go through I this is a very long thread, so I&#x27;m just going to pull do the best I can to go through this. All right, so the first thing we see here is assisting medical and scientific research and translating ancient documents written in dead languages. Um, none of the neither of those are really from generative AI assisting medical and scientific research. I mean, there are a lot of tools that we&#x27;re using in for</p>\n<p>medical research. We&#x27;re building AI tools, but that&#x27;s using existing technology that that&#x27;s been around pre uh the Gen AI boom. um translation documents. That&#x27;s also machine learning tools have been around. We&#x27;ve been getting better at them, but that&#x27;s not directly related to the recent boom. All right, let&#x27;s keep going here. Um AI as a tool is incredible at very specific things, mostly things human finds to be incredibly mind-numbing and meticulous. Uh its best use by far is pattern finding in wide data sets that are hard to pick up by hand. So, I&#x27;m going to put that down. Pattern finding, I&#x27;m just writing this on paper here. So, pattern</p>\n<p>finding, I I&#x27;ve heard this. You can give some data to a chatbot and it can perhaps find you some patterns. Um, let&#x27;s keep going. Alphafold protein structure database. Uh, Alphafold is not based off of directly based off of the recent investments in Generative AI. They&#x27;ve been working on that model for well before the LLM breakthrough when it uses um its own technologies that have it has some new versions have some overlap with transformer attention ideas. But that is sort of a separate trajectory. That&#x27;s not a result of the billions and billions that have been invested in large language models. So,</p>\n<p>um I&#x27;m going to put that to the side. All right. Next thing. It speeds up a lot of menial computer task. I had it make a PowerPoint from six MSWordsized document pages for me. It made 60 slides like a minute. Would have taken me an hour to do the same thing. I&#x27;m going to write that down. Like I&#x27;ll I&#x27;ll put down slide production. Uh it&#x27;s more generally it can produce slides. Uh, I&#x27;ve seen that in PowerPoint. That&#x27;s a good that and that that required the investments that have happened. So, we&#x27;ll put that down. Um, let&#x27;s see. It&#x27;s incredible tool for programming. Okay, so we&#x27;re putting that</p>\n<p>aside. There&#x27;s an argument about that. Someone else says it&#x27;s a lot of bad code and then all the cloud code. People come out with their their torches and get mad at them. Um, here&#x27;s a different one. I mean, it really is useful for quickly disseminating a large volume of boring info into bite-sized pieces and identifying points of interest. I think this is right. So, I&#x27;m going to put down summarizing text. So, we&#x27;ve seen this a lot. Like, you can take a a bunch of notes, like a meeting transcript, and say, &quot;Let&#x27;s let&#x27;s give me the give me the main points here. Summarize this in the bullet points.&quot; Um, language model is very good at that.</p>\n<p>All right, let&#x27;s keep rolling here. Translation of any language to another. That&#x27;s not primarily a language model based thing. We&#x27;ve been doing that for a while. It&#x27;s being used to help detect cancer earlier than humans detect it. All of that sort of medical prediction model research is not those are not underlying it language models. That&#x27;s something people have been working on for decades and we keep getting a little bit better at it. But that&#x27;s sort of unrelated to the billions being invested in large language models. So I&#x27;ll put that aside. Um discussion discussion mapped every protein. We talked about that. That&#x27;s not large language models. Let&#x27;s uh keep moving here. Someone else</p>\n<p>described a bunch of stuff and then a response to that said most of this stuff you&#x27;re describing isn&#x27;t break us from the last three years. a slow incremental process over the last 20 or more years. Um, that&#x27;s right. So, he was pointing out a whole long example of things that uh was not actually generative AI. Someone says take customer support. Call centers are already so heavily scripted they might as well be AI. Make AI good enough to hold a rudimentary guided conversation and it can replace basically every first level support person. That&#x27;s some speculation into the future, but I will put down uh customer support agents because there are more of</p>\n<p>those. I don&#x27;t think it&#x27;s necessarily replacing the industry as quickly as people predicted, but there are better sort of firstline chat agents that language models in particular made those good enough to deploy in a way that they wouldn&#x27;t have been before. All right, let&#x27;s go here. Um, a teacher in my family uses it to create a live avatar of himself that speaks fluently in multiple different languages as it records him teach in his native language. She&#x27;s been able to teach multiple classes in multiple countries at the same time. I guess that&#x27;s partially language models are probably</p>\n<p>involved in that. Uh the language translation is something we&#x27;ve been doing from before. In the medical field, AI does a decent job transcribing notes. It&#x27;s not really a generative AI breakthrough though OpenAI has been working on voice to text. They have a special model for that, their sort of whisper model which they then have on the front end of chat GBT. So like if you talk to your phone into the chat GPT app app, you really have a separate smaller model that&#x27;s been trained. It&#x27;s a different type of architecture than a language model that converts that to text and then the text is submitted to the large language models. So that&#x27;s</p>\n<p>cool, but again that is not a result of the billions invested in large language models. We were already doing that. Um then someone came along, this is interesting, and said you can do things like tell it read this congressional bill and note anything that seems illegal, unconstitutional, or would adversely affect separation of powers, checks and balances or civil liberties ranked by risk. Then describe the worst case scenario, the worst possible abuse of the change considering an executive branch intent on consolidating power for itself. And the guy&#x27;s like, &quot;Oh, that&#x27;s the type of thing you could you could ask GPT5 to do.&quot; But then someone else wrote back and said, &quot;LM can&#x27;t actually do that though, right? There&#x27;s no</p>\n<p>reason, no imagination. They can&#x27;t create and explore scenarios in the way you&#x27;re explaining. They&#x27;re not going to give you good advice. So, I&#x27;m not going to write anything down. Someone else said, &quot;Check this year&#x27;s Nobel Prize in chemistry.&quot; Well, that was given to Deep Mind for AlphaFold, which again is non- language model technology that predates the billions invested. Someone else says it can make pretty good uh hint. And someone else said actually it&#x27;s slop. So, I guess I won&#x27;t write that down. Someone else said, &quot;Write the answers to my stupid quarterly self-review questions.&quot; That is true. write boring text. Yeah. So, it is really good</p>\n<p>for that. Like, oh my god, no one cares about this. I have to write a self-review. It&#x27;ll write boring, you know, good enough text that covers what you want. It&#x27;s very good at that. All right. Uh, let&#x27;s just do a couple more because I think we&#x27;re seeing some patterns here. Someone else says there&#x27;s thousands of AI projects you don&#x27;t hear about because they&#x27;re corporate trade secrets. That&#x27;s not true. Uh, there&#x27;s a lot of that push of like, no, there&#x27;s all these amazing things you just don&#x27;t know about yet. They&#x27;re coming. Let me tell you, as someone who&#x27;s studied this for the last five years, they&#x27;ve we&#x27;ve always been quote unquote three months away from learning about the amazing thing that OpenAI or Anthropic or Google</p>\n<p>or Microsoft are doing behind the scenes. I have a lot of sources at these places. There aren&#x27;t magic projects. There isn&#x27;t. I mean, we heard this two years ago that OpenAI had AI was now doing all their programming and within a few months they&#x27;re going to start like leaping ahead in models completely made by AI. That was just made up. It&#x27;s just not true. They&#x27;re using the same coding agents that anyone else is using. So, uh, I get that. Um, we&#x27;ll do one or two more small QL improvements for businesses, automatically sending text messages to confirm appointments a few days prior, things like that. Sure, you can call it AI, but none of that has to do with</p>\n<p>advances in language models that have taken all these billions of uh, investments. And then someone says, uh, fake videos and influencers pushing fascism. There is a lot of fake videos. That&#x27;s not a good thing though. That&#x27;s a bad thing. Um, and then I saw something else in here. I&#x27;ll just write this down because I can&#x27;t quite find it, but basically someone was talking about it&#x27;s good for pulling out or summarizing complicated information. And they talked about taking the municipal parking rules for where they lived and then chat GPT could kind of summarize them into</p>\n<p>something that&#x27;s easier. So, make sense of complicated text. All right, whatever. We&#x27;ve been going for a while here, right? Let me look at this list I just wrote. So this is, you know, AI is a the world is going to be unrecognizable. It&#x27;s the biggest thing that&#x27;s ever happened to us. How why are our kids even going to college? Like this is where we are now. Here is the list of things from this open discussion on the internet. Anyone who can come and tell us how the billions invested recently AI have changed the world. Here is the the total list of non-computer programming uh ideas that came out of this. Pattern</p>\n<p>finding, producing slides, summarizing text in the bullet points, customer service agents, writing uh boring text automatically, and helping to make sense of complicated text. Those are cool, Jesse. But if I just if I five years ago said, imagine a tool that could do those six things. you weren&#x27;t gonna like Simpson style crash out of the window and then like jump on the back of a horse and ride off. It&#x27;s like oh that&#x27;s yeah it sounds like that good. I&#x27;m glad we&#x27;re making progress on</p>\n<p>that. So it&#x27;s kind of interesting and look I don&#x27;t want to go too far here and be like this revolution doesn&#x27;t matter. But when you put aside the computer programming stuff which is a discussion for another time it&#x27;s complicated more complicated than people make it out to be but that&#x27;s a discussion for another time. And when you put aside other AI stuff that&#x27;s unrelated to all these billions we invested, what we are getting right now out of the whatever it is $500 billion that have been invested uh into Generative AI, there&#x27;s not a ton of home runs yet. And I think this is an a a difficult point</p>\n<p>for AI boosters is why there&#x27;s a lot of like what is going to happen next year? And we&#x27;ve done this five years in a row now almost. What is going to happen next year is where the conversation goes because I think it&#x27;s hard not to admit the real concrete things are coming a little slower than we think. Now there we we see these amazing demos. We see these things do great on benchmarks and we have all these scary scenarios which are real like look at these fake videos. What&#x27;s going to happen to truth or students can produce their papers on these things? But if we really think about it the stuff that like what&#x27;s changing your mind people are using this</p>\n<p>like a better version of Google and then they&#x27;re very narrow right now. Now, this doesn&#x27;t mean much bigger changes aren&#x27;t coming, but I thought this was an interesting sort of experiment to do that when we actually look at what has already come specifically from investing all of this money into gener. It&#x27;s hard not to conclude that like so far um it&#x27;s not massive yet. I don&#x27;t think people realize that until you actually start trying to answer that question of what have we gotten so far.</p>\n<p>So, I don&#x27;t know, Jesse. Everyone thinks I&#x27;m being too conservative on AI, and I&#x27;m not saying it&#x27;s not a really big deal, but it you would think that thread would have a lot more like, oh my god, that did change everything. I mean, if we did that same post on the internet in like the year 2001, it would be like, the yellow pages don&#x27;t exist anymore. You can get direct information about like every company that exists. You can communicate with anyone on Earth for free and you can buy things without having to go to a store and like see it in like these are huge things. Those are huge things and you</p>\n<p>don&#x27;t necessarily have to drive your car. You &gt;&gt; don&#x27;t have to drive your car. That&#x27;s that is a bigger scale than producing slides or summarizing text, right? So like we&#x27;re not if we put this in scale, I know big changes are coming and it&#x27;s all very scary, but it hasn&#x27;t yet. We&#x27;re going to get a lot of angry emails about that one, but that&#x27;s fine. You can send them all to Jesse and he&#x27;ll he&#x27;ll summarize them for me. &gt;&gt; I&#x27;ll pass him on to Ed Zitron. &gt;&gt; Ed Zitron. Yeah. There we go. Let&#x27;s get in here. Let&#x27;s have him do a rant. People like Ed. He&#x27;s very polarizing. That&#x27;s what makes him a good guest. &gt;&gt; Yeah. &gt;&gt; Yeah. Um All right. We got a couple comments to respond to as well. We try</p>\n<p>to respond to some of the comments for our most recent uh episodes. I haven&#x27;t seen these yet. So, here we go. We&#x27;re load them up on the screen. These are comments. What? From YouTube, Jesse.</p>\n<h2>Cal responds to comments</h2>\n<p>from the YouTube version of last week&#x27;s episode which was on the things that are worrying John height now um after the anxious generation. All right. So the first comment we have here comes from Stephvens 2 who says I don&#x27;t have children but if I ever did I would be so nervous about giving them any tech beyond a brick phone from the &#x27;9s. That&#x27;s not a bad instinct. I mean this was the the whole point of the practices segment last week. singlepurpose technology has a lot of advantages because you can control and curate it much more effectively than putting</p>\n<p>everything on the one device that you package together. So yeah, brick phone is great. I mean, as we mentioned, we have a landline at our house for our kids and a a pushb button cell phone that they can bring with them if they need to be able to communicate with us. the what I wish existed. Here&#x27;s my company, Jesse. A a a dumb phone that looks exactly like the phone Michael Douglas uses in the movie Wall Street. &gt;&gt; I remember that phone. &gt;&gt; Oh, I love this idea. So, if I tell my kids like, &quot;All right, you can bring a phone with you.&quot; They&#x27;re like, &quot;Yeah.&quot; And then you give them what it is. Like,</p>\n<p>oh, I bet you I bet that company would do well. A Michael Douglas style brick phone. I just see kids everywhere having to like call call their parents on it. I love that idea. Um, is that our only comment? Let&#x27;s see. Oh, I see. &gt;&gt; Yeah. &gt;&gt; All right. So, I loaded one. All right. Here&#x27;s another. See if I can figure out computers. All right. Uh, this one is from Andre Valdez. Every year, I&#x27;m more convinced the Amish got it right. I&#x27;m with you, Andre. I mean, I wrote about the Amish in my</p>\n<p>book, Digital Minimalism. Uh, as everyone always reminds me when I talk about the Amish, they have their own issues and the way they run their society. But the one thing I do think they do well is their general approach to technology. People often get this wrong. People think that the Amish&#x27;s approach to technology was we will freeze technology in the year 1874 and won&#x27;t use any technologies after that. Like that they&#x27;re somehow like they they decided that there was some perfect year and they just froze time there and said we&#x27;re not going to go forward. That&#x27;s not what the Amish do. Instead, they have a rigorous</p>\n<p>methodology for how do they consider each new technology that they might potentially use as a community. So, when a new technology comes along that might be relevant, they will often have one or two people, Kevin Kelly calls this like alpha users go out and try the technology and they observe what is the impact of this on them, on their life, and on their connection to the community. And if the benefits are clear and the harms are small, then like they&#x27;ll go ahead and use that technology. But if the harms seem big compared to the benefits, they&#x27;ll say, &quot;Okay, we will now decree as a community, we are not going to use that</p>\n<p>technology.&quot; So they actually run new technologies through a valuebased system for evaluating whether they&#x27;re useful or not. So there&#x27;s actually like a lot of technology in modern technology in Amish worlds. Like they&#x27;ll use modern diapers, for example. There&#x27;s no particular harm to using a modern diaper and it has huge amounts of advantages, right? Um, or you&#x27;ll see Amish rollerblading because it&#x27;s, you know, they can get between places, you know, quicker and it&#x27;s kind of fun and it doesn&#x27;t hurt it, but they&#x27;re not going to use a car because they realized when they brought in cars, people left the community all together to go do other things and that was bad</p>\n<p>for community uh cohesion. They might have a phone that everyone uses, but they don&#x27;t use smartphones typically, and again, this is community by community, but most communities don&#x27;t use smartphones because when people had their individual phones, they had less need to come together and that hurt community cohesion. So the lesson from the Amish is not to follow their particular decisions, but to follow their methodology and be willing to say convenience is not my number one goal. Functionality is not my number one goal. Living a life true to my values is. And</p>\n<p>that&#x27;s how I&#x27;m going to evaluate technology. And yeah, sure, it&#x27;s a pain that I can&#x27;t use a car, but I&#x27;m not trying to avoid things that are a pain. I&#x27;m trying to emphasize the things that are a joy. And that is community living. So living your life true to values. That&#x27;s what the Amish pointed out. My book digital minimalism basically lays out a whole approach to doing that with your own technology in your own life. So yeah, the Amish are on to something. Uh we got one more here. This one is from Slav Marovic who says in 2026 the one who will win is not the one who has quote better tools in quotes but the</p>\n<p>one who has better boundaries short relief now an expensive price in the future. The smartest strategy is to remove unnecessary access points. That&#x27;s why the idea of a landline phone is not nostalgia but environmental engineering. Freedom begins when there are default limits. I think that goes to what we were just saying about the Amish. I think it&#x27;s a smart idea. What are your constraints? And if you don&#x27;t have constraints, then someone else is controlling your experience of your life. I I this is a common idea. This is going to be weird connection, Jesse, but this is a common idea in the world of uh financial planning, right? When it comes to your</p>\n<p>personal finances, there&#x27;s a there&#x27;s a common idea there that says if there&#x27;s nothing you ever say no to that you want to do and spend money on, if there&#x27;s nothing you can say, I wanted to do this, but I didn&#x27;t. I didn&#x27;t spend money on this, then you don&#x27;t have a budget. Doesn&#x27;t matter how many things you track or how many things you write down. If you&#x27;re not actually at some point saying, &quot;I&#x27;m not going to do that even though I want to,&quot; you don&#x27;t really have a budget. You just have spreadsheets. Well, I think the same thing is true for technology. If you don&#x27;t have constraints that are based on your values that are important to you, that lead you at least occasionally to not</p>\n<p>use or use less frequently a technology that would be useful or interesting or entertaining in the moment, then you have no coherent philosophy for technology in your life. And you&#x27;re letting not just the technologies, but more accurately the technology companies take control of your marionette strings. That&#x27;s what happens if you don&#x27;t have rules. You&#x27;re basically now toiling in Mark Zuckerberg&#x27;s attention factory. You&#x27;re you&#x27;re your life is serving the major stockholders of like the the fang companies, like six different</p>\n<p>companies that like a lot of your day now is dedicated to helping Mark Zuckerberg buy the second half of Kawaii. So if there&#x27;s nothing you say no to that what might be interesting or useful or is popular, you don&#x27;t have a technology philosophy. That means you&#x27;re an unpaid employee of the technology company. So I like this idea. What are your constraints? and they&#x27;ll be different from person to person. But if you don&#x27;t have clear constraints, then you&#x27;re not in charge of your life. You&#x27;re letting the technology companies be there. And I think more and more people are fed up with that that reality. So, I appreciate that comment. All right, that&#x27;s all the time we have for comments. Uh, I like to end each</p>\n<p>episode just bringing people up to speed with what I&#x27;m reading. I finished two</p>\n<h2>Cal gives his weekly reading update</h2>\n<p>books last week, Jesse. They&#x27;re both weird. I I was So, here&#x27;s Let me say this about reading. You gota You gotta admit this, Jesse. Um, a lot of people, this a problem I don&#x27;t have. A lot of people use public declarations of what they&#x27;re reading to signal positive things about themselves. Not me. I I want to present a realistic I read for interest. I read for information, but I read for stress relief. I read for I need to, you know, escape. I read weird stuff. And this week, I think, is a good example of that. So, what I was, you</p>\n<p>know, I had some stuff going on with stress. I was like, I need to get my mind off of work. I don&#x27;t want to be reading about technology or complicated history. So, uh, two random books. One, Future Boy by Michael J. Fox, which actually actually pretty interesting. You know, I like movie stuff, right? So, it was about the making of Back to the Future. &gt;&gt; I listen to it because Michael J. Fox narrates it. &gt;&gt; Um, but I this is one of my things I go to when I&#x27;m stressed is cinema books because it&#x27;s a world that&#x27;s so different from mine and I love movies. It&#x27;s just like I can be escape into there. &gt;&gt; And you&#x27;re pretty much reading a cinema</p>\n<p>book every month anyway, right? &gt;&gt; I read a bunch of cinema. It I mean it just depends on my stress. Okay. Then the next thing I read, this is where I really go when I&#x27;m stressed. Um I read Jeff Baham&#x27;s unauthorized history of Disneyland&#x27;s Haunted Mansion dark ride. Dark ride stuff. That&#x27;s like my romance novel, you know? Like how did they just engineering? You&#x27;re sitting in like an Imagineering room like figuring out different like effects and ride capacities. so separate from my life that like that is my I remember I was like stressed out. I was</p>\n<p>like I&#x27;m going to read this book and it was great and I enjoyed it. &gt;&gt; So going into the month so now I couple things. One, you&#x27;re doing updates pretty much every episode now about what you&#x27;re reading. &gt;&gt; Yeah, kind of in real time. &gt;&gt; And then secondly, say you had your books for January. Was this one of them or you were stressed and you pulled another one? &gt;&gt; Oh, I don&#x27;t know. I kind of just figure out what I want to read next. Right. So like right now the things I&#x27;m reading are um more intellectual because I&#x27;m I that moment passed. &gt;&gt; Okay, I guess that makes sense. &gt;&gt; So I probably pushed those I pushed those aside. Maybe I delayed them. I But</p>\n<p>actually one of the books I&#x27;m reading now um it&#x27;s a more like an academic book. I guess I kind of knew about it but I started and then another one is coming today. I just ordered a tech a tech criticism book that I missed last year and it was a big deal and so I am excited to read that. Uh but last week I was that&#x27;s not where I was. &gt;&gt; Yeah. And plus you finish a book, you know, weekly so you can easily just pick something else if you&#x27;re stressed. &gt;&gt; Yeah. But like the point I want to emphasize is, you know, reading doesn&#x27;t have to be about I want this to look good when I post it on whatever,</p>\n<p>&gt;&gt; you know, good reason. &gt;&gt; We don&#x27;t we don&#x27;t have a lot of good models for that. I mean, I I think there&#x27;s like two approach to reading. There&#x27;s like the novel approach to reading where it&#x27;s like I just all I do is read novels and I want to read the the good new novels and those novelists make a lot of money because there&#x27;s a lot of people who read novels. and this novel was good, this was less good. And that&#x27;s one approach to reading, but for non-fiction readers, there&#x27;s not a lot of models. Um, to read diversely in non-fiction, we don&#x27;t hear a lot about this. And so, you know, I try to keep that open. All right, so that&#x27;s all the time we have for today. Thank you for listening. We&#x27;ll be back next week with another episode. And until then, as</p>\n<p>always, stay deep. Hey, if you like today&#x27;s discussion about ambition and the internet, you might also like episode 384 where I talked about a collection of books you could read to help inspire you to have a deeper, more ambitious new year. Check it out. I think you&#x27;ll like it. And I pulled six books off the shelf that I all think have been uh played an important role in my own development and my own quest for a deep life. And I want to briefly talk about</p>", "chapters_count": 6}