{"video_id": "CmFtnXYsGcY", "title": "Overwhelmed By Work Messages? Do This Instead | Cal Newport", "link": "https://www.youtube.com/watch?v=CmFtnXYsGcY", "published": "2026-02-05T13:41:05+00:00", "summary": "Cal Newport explains how work messages can be overwhelming while also providing concrete advice on how to cope.\n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\nThis clip is from episode 389 of the Deep Questions podcast.\n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\n0:00 Work trends index\n4:30 Communication threads\n9:30 Dedicated locations for uninterrupted work\n15:27 Overload in projects\n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<h2>Work trends index</h2>\n<p>All right. So, those of us who study the intersection of work and technology are always excited when each year Microsoft puts out an annual study called the work trends index. Now, here&#x27;s what makes this study interesting is where they get their data from. One of their big sources of data points is the Microsoft 365 software suites like Microsoft Word, Microsoft Excel, Microsoft Outlook, you know, those tools that so many people use to work on their computers. They gather trillions of observations from people using that software. They</p>\n<p>anonymize them and analyze them and you get this snapshot of how are actual knowledge workers using their computer. So they released their 2025 report sometime last year. Here I&#x27;ll load it up on the screen here uh for people to who are watching instead of just listening. I mean like typically these reports it&#x27;s it&#x27;s a thinly veiled blueprint for why you should use their products. But buried in there is always really good observations. Here are a couple numbers I pulled out of the 2025 report. The average worker in 2025 received 117 emails daily,</p>\n<p>most of them skimmed in under 60 seconds. It&#x27;s another data point. The average worker receives 153 Teams messages. That&#x27;s like Slack, Instant Messenger, per weekday. That adds up to 270 interruptions a day when you only have about 480 total minutes to work with. So when are people actually getting their work done if they&#x27;re being interrupted this much? Well, there is an insight in this question as well from the report. They found I&#x27;ll read here over the weekend usage of WXP. So,</p>\n<p>Microsoft Word, Microsoft Excel, and Microsoft PowerPoint, the non-communication tools overtakes Teams messages as employees finally carve out time for uninterrupted focus work. &gt;&gt; By the way, notice how all these people have they don&#x27;t want to use my term deep work. So, everyone uses the phrase focus work, which is I guess good or bad. Um they found perhaps not surprisingly that half of the employees that they they did a survey as well as part of this report. Half the employee survey described their jobs as quote chaotic and fragmented end quote. All right. So let me state the obvious here. I think these numbers are</p>\n<p>insane. Right? You&#x27;re paying these knowledge workers huge amounts of money uh to essentially answer messages. I want you to spend all day answering emails or answering teams messages and then maybe on the weekend you can get a little bit of actual work done. This can&#x27;t possibly be the most cost-effective way of paying for a lot of human brains than asking them to create value. I&#x27;ve been talking about this problem for a long time, but what what kind of distresses me is that this issue of constant workplace distractions is getting worse. These are some of the</p>\n<p>worst numbers I&#x27;ve seen in the decade or so that I have studied this. So we need good advice about how to push back against our current knowledge work culture of constant digital distractions. All right. So what I want to do is offer as this new year is still new. I want to go through um I&#x27;m going to go through my main ideas. I have one, two, three, four, five. I want to go through my five main ideas for how to tame the digital communication problem in your work. whether you work for a huge company or</p>\n<p>for yourself. And so here&#x27;s how I&#x27;m going to do it. I&#x27;ll load this on the screen for people who are uh watching instead of just listening. I have five things here, one, two, three, four, five. Um I&#x27;m going to go through these one by one and uh give you my advice about them. All right? And hopefully this will help you prepare for the new year. So let&#x27;s start with the first idea was eliminate threads. So I&#x27;m going to bring up a couple bullet points about this. All right. So eliminate threads. What do I mean by that? Here is my explanation I put up on the screen. Anything that requires more than one</p>\n<p>message in response should be moved to synchronous communication. All right. So, what do I mean by that? Think about all the different types of messages you receive in a typical day. Some of them areformational. This is the new parking lot&#x27;s going to be closed. New policy for the cafeteria. All right, that&#x27;s one type of message. Another type of message is quick questions. Can you remind me what time the meeting is tomorrow? Right? The third category of communication you get in the</p>\n<p>workplace is going to be the beginning of a back and forth discussion. So when</p>\n<h2>Communication threads</h2>\n<p>I say in my notes here, anything that requires more than one message in response, that&#x27;s what I&#x27;m talking about. So communication threads where you ask a question, I have to answer, you have to get back to me, I have to get back to you. You&#x27;re basically taking a conversation and you&#x27;re spreading it out over back and forth messages, be them emails or instant messengers. Those type of threads are the main disruption interruption generator when it comes to digital communication. When it comes to informational things, email&#x27;s great. I&#x27;ll read this memo when I get around to it. That&#x27;s a perfect use of email. When it comes to questions that can be</p>\n<p>answered with a quick question, uh, quick answer. That&#x27;s another great use of a tool like email because it can sit in my inbox until I&#x27;m ready to answer it. I can answer it quickly and then it&#x27;s done. But when it comes to threads that require back and forth communication, this is what creates all the disruptions. Why? Because now we have a conversation going on. There is a time constraint to this conversation. We have to resolve it in a reasonable amount of time. Presumably, whatever conversation you started with that message, you do not want to unfold over the next 10 days. But in order for this back and forth conversation to be finished in a timely manner, we have to</p>\n<p>see each other&#x27;s latest message soon after it arrives. So now I have to be checking whether it&#x27;s Teams or Slack or email, I have to be checking it constantly so that when your next message gets to me, I see it quick enough to bounce a message back to you and you see that quick enough to get back to me. And it&#x27;s that need to service back and forth digital conversations that takes the interruptions of things like email and chat and it metastasizes it until it&#x27;s all you&#x27;re doing all day long. So going back to my table here, my</p>\n<p>advice is to eliminate threads. So what I&#x27;m saying is anything that requires more than one message or response, move to synchronous communication. That is real time communication. And there&#x27;s different ways you can do this. If you&#x27;re in an office, walk down the hallway and actually talk to the person or have office hours, which I talk about commonly, a set time each day where your door is open, your phone is on, you have a Zoom room open, and you can just say, &quot;Hey, um, come by my next office hours. will chat about this. That&#x27;s your one response when someone wants to start one of these back and forth threads. Or you can have a new concept which I&#x27;m</p>\n<p>introducing for 2026 which is the idea of a phone zone. I heard this from uh a listener suggested this and I thought it was a great idea. You can have a much broader amount of time each day in which you can say uh I&#x27;m not dedicating this just to communicating but my phone&#x27;s going to be on. So a lot of people might say for example I don&#x27;t know 2 to 5 the end of my day I keep my phone on. So you can just call me at some point in that part of the afternoon. I don&#x27;t really schedule long deep work. Then I&#x27;m sort of like finishing things up. You can always just call me at some point in that broader zone and we&#x27;ll talk about</p>\n<p>this. You move things back to the phone. Synchronous when done this way is much more efficient than back and forth communication because now what would have been 10 back and forth messages we could resolve in about four or five minutes of actually talking to each other. A word of warning here. Don&#x27;t allow your attraction to synchronicity mean that you create meetings. Now, that&#x27;s a problem. If I take what would have been 10 back and forth messages and said, &quot;Let&#x27;s just throw a Zoom meeting onto our schedule.&quot; Well, now I&#x27;ve just eaten up a half hour of time just for this one conversation, and that could be</p>\n<p>worse. One of the most uh the new and most distressing numbers I saw in this Microsoft trend uh study was that of the meetings they were studying so they they have all the meetings they can track meetings that happen on their meeting software 60% were quote ad hoc meaning that like someone that day was like hey let&#x27;s have a quick meeting to talk about it and then that puts a huge like 30 minute plus footprint on your schedule. So synchronous communication is good, but not when you need a full meeting to discuss something. You want to have be someone to call you. Three minutes, you take care of it. You want someone to</p>\n<p>stop by your office during office hours. Three or four minutes, you take care of it. That&#x27;s what we&#x27;re looking for. All right, second idea. Let&#x27;s load this up here. Jesse, relocate for deep work. All right, let me put up my bullet point for that. I&#x27;m going to make people motion sick with all my scrolling here. Protecting deep work on your calendar helps relocating to a different location without access to email and messaging is even better. So, I&#x27;ve talked about before the importance of when it comes to uninterrupted focus, you need to actually have that time put aside in advance. If you&#x27;re just waiting for when&#x27;s the next time when I have nothing</p>\n<p>to do and I feel like concentrating, if that&#x27;s what you&#x27;re waiting for to get your deep work done, you&#x27;re not going to do any deep work. You got to actually put aside the time, put on your calendar, schedule it like another meeting or appointment and say, &quot;I don&#x27;t do email or or messaging during that period.&quot; So, you differentiate between times when you&#x27;re doing communication and times when you&#x27;re trying to make progress on things. And if people get mad at you, you say, &quot;I was working on the report. I don&#x27;t have my communication channels open when I&#x27;m working on my report.&quot; And stand by that. That&#x27;s a very reasonable thing. But what I&#x27;m arguing here, here&#x27;s my new for 2026 advice. It&#x27;s good to protect the time. It&#x27;s better to also have a</p>\n<p>location you go to that&#x27;s dedicated for</p>\n<h2>Dedicated locations for uninterrupted work</h2>\n<p>that type of uninterrupted work. This really helps the mind lock into what you&#x27;re doing. So, for example, if you can go to a place that does not have Wi-Fi or you can turn off your Wi-Fi as you go to like a conference room on another floor in your office and that&#x27;s where you go for the time you put aside to work on something that requires focus, it&#x27;s going to be so much easier because now you don&#x27;t have the option of quickly jumping on to your email or quickly jumping on to Teams or Slack because you literally don&#x27;t have the</p>\n<p>internet access you need to do that. And two, because it&#x27;s a separate location that you dedicate for doing deep work type tasks, it&#x27;s much easier for your mind to understand that, oh, this is what we&#x27;re doing now. This is very different than if you do all of your work at the same desk, the same desk in which you do have to do email and you do have to jump on online meetings. If you&#x27;re also doing your deep work there, your mind can be very clever at saying, look, we spend a lot of time here checking email. Why not right now? And then you have to have that debate. But if you go to like the coffee shop, you go to the special conference room, you go to a a different part of town, you go to the special office you set up in your</p>\n<p>attic, when it comes time just to do deep work, your mind says, &quot;Oh, we know this. We know this drill. When we&#x27;re in this location, we don&#x27;t do communication. And when we&#x27;re at our desk, we do.&quot; And so, don&#x27;t just protect deep work time. Relocate and make it logistically difficult to do communication in that location. This will really help you conquer the the communication problem as well. All right, we&#x27;re making progress here. Let&#x27;s jump on to number three. Load this up here. Batch group discussion. Um, I&#x27;m pushing here docket clearing meetings. And I say if you do this two or three</p>\n<p>times a week, you can eliminate 90% of group email threads and at least 50% of one-off meetings. Those are two big promises. So, what are we talking about here? Well, docket clearing meetings, you can think of it as a collaborative office hours. Two or three times a week, your team gets together to say, &quot;What uh what open loops, new tasks, new ideas, things we have to tackle have come up since our last docket clearing meeting. Let&#x27;s go through them all.&quot; Where do you find these? Well, you actually open up what I call a docket, but is actually just a</p>\n<p>shared document shared by the whole group. Whenever something comes up during your day that is relevant to the group, a client asks a question, you have an idea, you hear about a new deadline coming up, there&#x27;s an RFP that you think maybe we should look at, you have a concern about an ongoing project, instead of immediately jumping to email and doing a group email to everyone, you write it into that shared document. That&#x27;s the docket. It grows as everyone in the team adds things to that that need to be discussed. Then at your next docket clearing meeting, you go through the things in that document together and for each you can defer it or you can</p>\n<p>delete it like this is not that important. Or you can say, &quot;Let&#x27;s actually work on this and figure out right there who&#x27;s going to do what?&quot; That&#x27;s where you be like, &quot;All right, Jesse, why don&#x27;t you handle this? What do you need from us?&quot; Okay, you need this information from Cal. All right, great. Uh, when&#x27;s he going to get it to you? By the close of business tomorrow. Great. So, Cal, you agreed you&#x27;ll get that to him by close of business tomorrow. Uh, Jesse, when are you going to finish this thing? Okay, you&#x27;ll have it done by Thursday. Great. Put it in our shared drive. So, everyone else, let&#x27;s agree on Friday, take a look at the document that Jesse put into the shared drive and put all your comments</p>\n<p>in there by the end of the day. You can figure out right there how to deal with the things so that you don&#x27;t have to work that out with email. Because again, remember, if we have to figure that all out with email, that&#x27;s not just a lot of messages. It&#x27;s exponentially more inbox checks to try to keep up with those messages and to keep that that conversation going. All right. Well, that one leads us to my fourth suggestion, which is create processes. Now, I wrote here that you should spend more time in the moment to prevent many distractions down the line. I just gave you an example of the process process</p>\n<p>when I talked about our hypothetical about Jesse and that report. So, what was critical about what I just described there? Well, it included, and I&#x27;ll highlight these, uh, who will deliver what, where they will put it, and when it will arrive. So, taking the time to talk with someone when a task comes up about who&#x27;s working on this, what is it that they&#x27;re going to produce, where will they put it when it&#x27;s done, when will it be there? You answer those questions, right? Four W&#x27;s. That saves a massive amount of</p>\n<p>communication because almost all of the emails that require us to keep checking that inbox, almost all of the chats that pull out of our attention are figuring this out on the fly in an ad hoc manner and generating lots of distractions. People avoid creating a process for tasks because in the moment it requires a little bit more time and we want to just in the moment move through things and play inbox hot potato and just write thoughts question mark and hit send. And now that&#x27;s off our plate temporarily. That&#x27;s in the moment we want to get these things out of our life. But if you spend a little bit more time to say what</p>\n<p>are we actually talking about here and what is our 4W plan for making progress that structure is saving you interruption and interruptions are the productivity poison here. It is worth taking more time. It is worth taking more time. All right we got one last suggestion. Reduce active projects. Each active project generates messages. Therefore, reducing active projects reduces messages. This is something I really came to</p>\n<p>understand when working on my last book, Slow Productivity. The connection between workload and messages. There is a uh a certain amount of communication that any sort of active project will generate. I mean, I there&#x27;s logistics. I need to talk to people about things. We have to pass information around. If you increase the number of things you&#x27;re working on actively, you&#x27;re increasing the amount of this necessary communication that has to happen. It&#x27;s actually a major driver of of overload and communication is actually it&#x27;s overload in projects and the</p>\n<h2>Overload in projects</h2>\n<p>communication overload is a side effect of that deeper issue. We need to be working on less things at the same time that is critical to reducing the amount of communication that we have to deal with. And I think we miss that. Now, there&#x27;s a couple ways to do this. The obvious way to do this is to say no more often. If you&#x27;re in a situation where you can do that, like you&#x27;re an entrepreneur and you&#x27;re in charge of like what client projects you take on or whatever, just have a clear rule about how many you do at the same time. If you&#x27;re in a situation where saying no is</p>\n<p>hard, the key idea for my book, Slow Productivity, is to differentiate when it comes to things you&#x27;ve agreed to. differentiate between things that you are actively working on right now and things that are in a holding pattern until you&#x27;re ready to work on them. Only be working on two or three things at once and everything else is on a list of I&#x27;m waiting to do. And any communication or meeting request or whatever that&#x27;s generated about things in the waiting pin, you say that is on hold right now. Uh I will let you know as soon as I actively start working on I estimate</p>\n<p>that&#x27;ll be in about two or three weeks and then we can start talking about and having meetings about it. But like right now it&#x27;s not one of my targets I&#x27;m working on. That works just as well because what we&#x27;re trying to avoid here is things too many things generating messages and meetings. So in a holding pattern even though you&#x27;ve agreed to do it, it&#x27;s not generating message and meeting. So that that is okay. That can work as well. So I I put a note about that on my table here where I said there&#x27;s a difference between saying no and putting something in a holding status. Both will give you the benefit. Uh but one is a little bit less severe than the other. All right. So, here are</p>\n<p>my five things. I&#x27;ll put the whole list zoomed out on the screen here. Eliminate. We got eliminate threads, relocate for deep work, batch group discussion, create processes, reduce active projects. These five things will help you find a lot of freedom in 2026 from feeling like you&#x27;re constantly servicing communication channels. Here&#x27;s what I want you to notice about this advice, because I think this goes back to a lot of my advice about wrangling technology in the workplace. None of these are technological. None of these is advice about changing</p>\n<p>notification settings. None of this is advice about advanced filtering for your messages. None of this is about using more complicated software tools to try to compensate for the work that&#x27;s moving back and forth uh through email. None of this is advice, God help us, for deploying, you know, AI and really complicated ways to try to uh summarize your messages. It&#x27;s it&#x27;s crazy, Jesse, how much it seems like companies working on AI productivity software thinks the number one issue facing people is taking email messages and summarizing them the bullet points. That&#x27;s not my problem. My</p>\n<p>problem is that I have 117 email messages to answer today. Emails by definition are already summaries of whatever the issue is, right? That&#x27;s not I know that&#x27;s what we know how to do, but that&#x27;s not what we actually have uh problems doing. All of these are procedural structural uh scaffolding style solutions. Change your rules for what you communicate where. Have certain times for certain types of coordination versus other types of times. Have more processes. Be more careful about your workload. So we have this purely digital problem like</p>\n<p>low friction digital communications creating this overload. And our solutions are not adding more technology on top of that technology. is changing the underlying way we work so that we still get value out of that technology but it&#x27;s not overwhelming us. So I just wanted to point that out that sometimes the problems created by technology aren&#x27;t solved by more complicated configurations of your technology but uh instead can come from having better processes or ways of thinking uh about your work. All right, so I&#x27;m going to load just one last little recommendation here. Um if you want to find out more about this, I wrote this book during the</p>\n<p>pandemic. I&#x27;m going to recommend it. Uh, it&#x27;s called A World Without Email: Reimagining Work in an Age of Communication Overload. As you&#x27;ll see, it was one of the best non-fiction books of the year, Jesse, as selected by Amazon. It was also a New York Times bestselling book. This book is like my magnum opus on this question of where did the overload of communication come from? Why is it not making us productive? and what are I call them the protocols that uh you would put into place as an individual, a small team or a big organization to try to free</p>\n<p>yourself from communication overload. So listen to my advice. If you want to go deeper, check out a world without email. That book has a lot of big ideas. That book kind of disappeared, Jesse, because it came out in the heart of the pandemic. Y &gt;&gt; and people were just &gt;&gt; not at that moment saying, you know what my number one concern is right now? uh our meeting structure or like my I really want to work on my my email habits or whatever, you know, that wasn&#x27;t wasn&#x27;t the top of mind at the time. So, um I&#x27;m telling people about it now. Check out that book. Hey, if you</p>\n<p>like this video, I think you&#x27;ll really like this one as well. Check it out.</p>", "chapters_count": 4}