{"video_id": "zP8P7hJXwE0", "title": "⚡️Context Graphs: according to the authors — Jaya Gupta, Ashu Garg, Foundation Capital", "link": "https://www.youtube.com/watch?v=zP8P7hJXwE0", "published": "2026-02-04T02:59:23+00:00", "summary": "In this Lightning pod, swyx hosts Jaya Gupta and Ashu Garg from Foundation Capital to discuss the emergence of context graphs. They define this new framework as the institutional memory of \"the why\" behind business decisions, captured through decision traces—the sequence of steps and human reasoning that models often miss. The conversation explores how these graphs will become the defensible moat for the next generation of applied AI companies and systems of agents.\n\nSection Timestamps\n[00:03] – Introductions and the early \"vibe\" of AI hackathons post-ChatGPT.\n\n[02:00] – The origin story of the Context Graph thesis at Foundation Capital.\n\n[04:59] – Defining the Context Graph and the Decision Trace.\n\n[07:32] – Who is building this today? Examples like Player Zero and Glean.\n\n[09:37] – Technical implementation: Is there an ideal data structure?\n\n[12:09] – Explaining \"Systems of Agents\" vs. standard chatbots.\n\n[15:26] – The importance of the \"Right Path\" (operational) vs. the \"Read Path\" (analytical).\n\n[18:46] – Why these will be new platforms rather than features in Slack or GitHub.\n\n[21:48] – Addressing pushbacks: Can you truly capture the \"Why\" or just the \"How\"?\n\n[24:04] – Privacy, data governance, and \"Metadata 3.0.\"\n\n[26:43] – Context Graphs vs. Data Mesh: Why universal graphs are unlikely.\n\n[31:18] – 2026 Predictions: The \"Context Graph Stack\" and production scale.\n\nshow notes\nhttps://foundationcapital.com/context-graphs-ais-trillion-dollar-opportunity/\nhttps://x.com/JayaGup10/status/2003525933534179480\nhttps://simple.ai/p/what-are-context-graphs", "transcript_html": "<h2>&lt;Untitled Chapter 1&gt;</h2>\n<p>[music]</p>\n<h2>Introductions and the early &quot;vibe&quot; of AI hackathons post-ChatGPT.</h2>\n<p>All right, we are starting uh with the uh lin space pod in [music] a remote studio. Welcome to Jay Gupta and Ashgar from uh Foundation Capital. &gt;&gt; Thank you for having us. &gt;&gt; Thanks for having us. &gt;&gt; Uh Jay, we apparently met 3 years ago at the Langchain hackathon where uh Factory was born. Were you were you also actively thinking about like context stuff back then or like what what was the what was the vibe 3 years ago? Yeah, I think 3 years ago was probably like the first uh AI hackathon and I cannot say I was thinking about context things at that time. I was just thinking about</p>\n<p>like and I think it was actually like before even agents took off like it was like literally right after chat PT and I think the only things that really existed were Langchain, Llama Index and like Perplexity were like sort of the three companies that came out right after and so anything that they were doing I think all the AI builders were going and running there and going into like whether it was like notion&#x27;s office I&#x27;m pretty sure had a hackathon but definitely it was not context back then it was even pre Asians and so it&#x27;s like crazy to see where we&#x27;ve come in just a short amount of time. &gt;&gt; Yeah, I mean abstractly I guess like</p>\n<p>lang chain llama index and to some extent perplexity also they the funnel context into LLMs and we weren&#x27;t working on agents back then but you know obviously at some point we would start like even even back then there was discussion already. Ashu what&#x27;s your what&#x27;s your uh sort of uh AI story as well like I&#x27;d love to introduce the audience. Yeah, sort of the very short version, you know, I used to run a machine learning team at Microsoft in 2006. We were doing ad targeting and after you&#x27;ve done ad targeting for a few years, you want to do something that&#x27;s better for the soul. So I I left with a variety of ideas. I bumped into a guy</p>\n<p>called Yan Stoka at Canviva, which was my first portfolio company. And they were doing applied AI at the time, but they ran into a bunch of data infrastructure problems. And that led to, you know, data bricks and any scale and then a whole series of other applied AI companies. So, I&#x27;m lucky enough to hang out with J and Yan and other smart people. That&#x27;s that&#x27;s my claim to fame.</p>\n<h2>The origin story of the Context Graph thesis at Foundation Capital.</h2>\n<p>&gt;&gt; Well, you guys uh uh work on really really smart things and congrats again on having the early hit of 2026. Uh I would say so I&#x27;m going to bring this up on screen right now which is the context graph discussion which is what we&#x27;re here to have. So J actually tweeted basically like the article version of this but obviously there is there&#x27;s the um there&#x27;s the actual formal blog post. I&#x27;m just kind of curious what the origin story of this is. Like what were we sitting in a room and you were talking like hey we need a name for this thing. We see an opportunity. What was going on in</p>\n<p>December that you started working on this? &gt;&gt; Go for it Jeff. &gt;&gt; It&#x27;s a good question. So, you know, I think, you know, we sort of throughout December and I would say more broadly like the last 6 to 12 months, like you know, we you know, Foundation Capital like we spent a lot of time with our companies very up close and so you know, one of the things that Ashu and I kept continuously talking about like and what we were thinking about is like what is actually missing as AI agents move into production. Like if you think back like everyone said 2025 would be the year of agents and and in some ways it was you</p>\n<p>know we got cloud code we got like Devon we got all these customer support agents Sierra Decagon and I think you know at the same time the models also got dramatically more capable but I think you know we when you think deeply about like what is missing you you kind of realize like you know that they still can&#x27;t reliably do enterprise work some of these agents and so you know we started thinking about it and like it kind of struck us that, you know, one of the reasons is that because they don&#x27;t actually capture like why we do certain things like and the human reasoning behind decisions. And so like</p>\n<p>specifically what do we mean like why exceptions are granted, how conflicts are resolved, what precedents are applied and that&#x27;s sort of kind of what the thinking was over the last 6 months and I think in December we we got to writing about it and and published sort of last thing right before the year ended. &gt;&gt; Yeah. I think the thing I would add to that is you know the the subtext at least for us and I think for a lot of other people over the last year has been that as so much of the IP is captured in the model itself what is the role of applied AI companies broadly systems of</p>\n<p>agents company systems of record and and what is the defensible mode and and I think we&#x27;ve been debating that with anime at player zero with Ishan at olive with Kabir and so many of our founders and they were all talking about the same thing but using different languages or different words and so I think it was that series of conversations that gave us this insight that there is an intermediate abstraction which we call context graphs which is the accumulation of decision traces and this intermediate abstraction in our opinion will be the one that will matter the most over the</p>\n<p>next decade it&#x27;s the enduring layer for the most successful application companies or systems of agents companies and we also believe and we&#x27;ll talk about it more that it&#x27;s it&#x27;s unique and new and it&#x27;s not well suited for incumbents.</p>\n<h2>Defining the Context Graph and the Decision Trace.</h2>\n<p>&gt;&gt; That is actually very key because obviously the incumbents could also capitalize on it if they see the opportunity. You you did you did name job Animesh. Uh I did have him categorize in our discord. We have a discord where we discuss all these like trends and stuff and so like yeah I didn&#x27;t know he was your portfolio company. Yeah know he&#x27;s he&#x27;s been a part of coming over the thesis along with a bunch of other founders like you know Kabir as I said it to Sarah and Ishan at Olive but anime is definitely uh a brilliant technical founder who&#x27;s helped push our thinking okay how about let&#x27;s let&#x27;s do like a very Chris like you we</p>\n<p>have a deck that you guys uh Kylie sort of put together I think definitions always help motivate a discussion so let&#x27;s let&#x27;s just go right into how do we define a context graph and and all the other sort of related concepts go for it &gt;&gt; you go for definitions. &gt;&gt; You know, look, I think I we can we can we can describe the it&#x27;s a concept and so you can describe it in a variety of ways, but at its essence, a context graph is the institutional memory of all the why behind the set of decisions. And we think of that core unit as a decision</p>\n<p>trace. When when when an agent or a system of agents executes a business process, it goes through a dozen maybe multiple dozen steps. It may have humans in the loop once or many times. And the tracking, these exceptions, these overrides, this cross-system context which sits in both structured and unstructured systems and very often in people&#x27;s heads. And that&#x27;s where the human in the loop comes in. Uh capturing that is a decision trace. And</p>\n<p>when you aggregate decision traces in a way that you can then learn from them as an agent and you can use them to make the agent better, that&#x27;s that fabric or becomes what we call the decision graph. &gt;&gt; Uh sorry, decision graph or decision trace. &gt;&gt; Sorry, that my apologies. That that that layer becomes a context route. My mistake. The context. I I &gt;&gt; So context graph is made up of a lot of decision traces. It&#x27;s made up of a lot of decision traces and it&#x27;s also you know when you implement that you will have to implement it in a way that you can actually extract insight from this</p>\n<p>and you can make it machine usable by the agents themselves. And one thing I want to get clear up front like this is kind of like a conceptual thing right like do we has anyone claimed to like have this working yet because it seems like very very big.</p>\n<h2>Who is building this today? Examples like Player Zero and Glean.</h2>\n<p>What do you think, J? You talked to a lot of people. &gt;&gt; I do talked to a lot of people. I would say that if you look at Twitter today and you look at LinkedIn, thousands of people claim to have it working. I&#x27;ve had like maybe 30. &gt;&gt; There&#x27;s this guy and he mentions like how to build a contest. So, he&#x27;s he seems very confident. &gt;&gt; Yes, he is. He&#x27;s I think player zero is actually one of the examples that you know that you know that actually has some version of this working. I think that what&#x27;s interesting about this is that you there&#x27;s going to be a lot of different implementations of it. And so</p>\n<p>I think you have like you have companies like Glean that have come out and say that you know we&#x27;re the ones that are building this. You have companies like Atlan like data cataloging companies has have said that we&#x27;re going going to own this. You have application companies that have put out their version of this. I think Harvey not not Harvey but rocks put out approach actively put out approach. there&#x27;s companies across the app layer that have also you know said that they&#x27;re building this and so I think you will see info companies application companies security companies octa put out something as well and so but in terms of like seeing like this actually</p>\n<p>deployed at scale like I think there are very few examples today and some of that is because it&#x27;s a very you know new concept &gt;&gt; so I think the only thing I would add to that is don&#x27;t think of context graphs as a technology architecture think of it as a framework and there will be multiple technology implementations and those will evolve over time and and different companies will use different components, different databases, different data fabrics in order to build that context graph and it&#x27;ll depend on the on the use case and the situation. What we are</p>\n<p>seeing from our portfolio at least is that the common theme across these systems of agent companies that we think are doing revolutionary stuff is they are building a context graph. They&#x27;re early but we&#x27;re seeing it. We we we see that at player zero. We see that at Tacera. We see that at olive. We see that at analogic in the security context. Now there are varying degrees of sophistication because it&#x27;s a concept as against a specific product. And so</p>\n<h2>Technical implementation: Is there an ideal data structure?</h2>\n<p>this very sort of flexible concept is there like a an ideal data structure I guess for a context graph like is it is it just uh you know like the sort of triplet entities of a knowledge graph or anything like that? &gt;&gt; Go for it. Yeah. &gt;&gt; I think no and I think that&#x27;s because it&#x27;s more of a framework for now. I think that uh you will see you know I would say it&#x27;s like um the concept of decision traces especially like I think that is going to be implemented by like many different types of companies and there will be also many different types</p>\n<p>of companies that will emerge because of this like thinking about like security governance I think you&#x27;ll see companies that pop up there and we&#x27;re already starting to see a few pitches there where we&#x27;re going to see like companies that are going to reimagine different sorts of applications so I think with this logic you could reimagine how do you build Sierra today versus you know a lot of these application companies started three years ago and so if you were to rebuild them starting today I think that&#x27;s also what we&#x27;re seeing and I think as well as on infra like we&#x27;re going to see we&#x27;ve already started to see like different people like imagine you know how do you think of you know</p>\n<p>data cataloges of the future databases of the future I think those are approaches are are quite early um I think you also see like a lot of the graph database people come out of the woodworks and and say that you know this is us as well. So, &gt;&gt; we&#x27;ve been doing this the whole time. &gt;&gt; I&#x27;ve been doing this for the last 10 years. I think most of my notifications when I get tagged and I press and it&#x27;s like this is a great this is what I&#x27;ve been trying to articulate for the last 10 years like and here it is. &gt;&gt; At the same time, there are some common themes of people who are building context graphs and you know the underlying infrastructure or technology</p>\n<p>implementation will vary depending on your starting point and your scale but they tend to be crossfunctional. They tend to be crossprocess. They tend to sort of these decision traces are stitching together data that goes across multiple existing systems of record. Uh they tend to be in the right path which is you&#x27;re actually you&#x27;re executing a decision and it&#x27;s not an analytical it&#x27;s not analytical decision. It&#x27;s the actual operational decisions you&#x27;re making. you know, existing systems of agents, startups actually have a very unique</p>\n<p>advantage because they&#x27;re not bound by a business process. They&#x27;re not bound by an existing uh data store. They&#x27;re in the orchestration path. In being in the orchestration path for automation of a business process positions you uniquely capture decision traces and therefore build a context graph.</p>\n<h2>Explaining &quot;Systems of Agents&quot; vs. standard chatbots.</h2>\n<p>&gt;&gt; Yeah, you have that in this in this slide here. Uh and also I guess in your in your post where you talked a little bit about the uh why the incumbents uh don&#x27;t do it. I I think like one of the interesting things uh I want to sort of double click on. First of all, systems of agents. I&#x27;ve heard this uh terminology. Is that widely adopted? Cuz uh I would say that you&#x27;re the first in recent months that I&#x27;ve that I&#x27;ve heard actually use this term. What is the system of agent startup? Go for it. Well, I guess out of curiosity, what term have you heard um you know to to</p>\n<p>describe systems of agents? &gt;&gt; Don&#x27;t know. I mean, I think that that&#x27;s that&#x27;s also like up for interpretation as to like what what exactly means. I do think like people have like system of record system, you know, as like a baseline of like okay, we all agree what a system of record is beyond that like people try to modify it in some way. system of like context or whatever. Uh system of agents like sure you have like I guess a group of agents I guess and they all do different things but I don&#x27;t know if if if this is like a a deeper</p>\n<p>origin or community around this term yet. So you know the way I would think about it is and and look these terms are all collided and it&#x27;s it&#x27;s a little bit like you know a cloud of words. The notion of a system of agent is a company uh that has a collection of agents that are automating a process or a set of processes. It was it was initially we came up with that last year to differentiate from you know more basic chatbot like systems. So if you know a lot of a lot of systems a</p>\n<p>lot of AI companies are single player mode more like a chatbot and to the extent that you&#x27;re starting to build something that&#x27;s multi- aent multiplayer mode has humans in the loop and is driving decisions across a business process we want to distinguish that with this notion of a system of agent. The underlying mode that these systems of agents are building is a context graph and the way they build the context graph is by capturing the decision traces that they inherently sort of you know execute. So it is a mouthful and any any</p>\n<p>advice on how to simplify would be appreciated. The term that I&#x27;ve been working on is mostly just agent lab the company that produces agents. Uh but I think those are those are like slightly different things in any way as well. So it&#x27;s it&#x27;s hard to describe. I think I just I just want to like like double click on a few of these things so that people can get a sense of like what you mean when you say those things. I think the other thing that&#x27;s also super interesting is being in the read path not the right path. Obviously with your background with data bricks you understand the the read path very very well. I think the right path is also interesting like context is mostly a read jog.</p>\n<p>right? Mostly just like introduces a higher demand for uptime and lower latency and all those things. But I&#x27;m also curious like basically you know the way that this creates a waterfall in my mind of exceptions override precedence cross system context also I I put here approval chains which uh which you had in your original document.</p>\n<h2>The importance of the &quot;Right Path&quot; (operational) vs. the &quot;Read Path&quot; (analytical).</h2>\n<p>It feels more like IM like AWS IM like a some authorization sort of a logic system that cascades down and you you know hopefully you like I derive some kind of formal logic reasoning that you can um that you can sort of inspect and version control maybe because like the I think the the worst thing is like when you when you capture all decision traces and you look at all the overrides and all the precedents it looks like Swiss cheese like people contradict themselves all the time and you&#x27;re like, &quot;Okay, well, what&#x27;s the truth of it?&quot; And and</p>\n<p>LM&#x27;s going to be completely confused, reasonably. So, look, I think it&#x27;s a great point and I think when you think about read versus write, you know, it can mean a very different thing when you&#x27;re very very if you&#x27;re being precise and technical. I think when we think about the read versus right path is analytical systems which are in the read path are ultimately and you ultimately have to write to an analytical system. So there&#x27;s some right path in that sense that&#x27;s why technically it&#x27;s it means something very different but analytical systems like data warehouses and even</p>\n<p>systems of record capture the end point of a decision. They know what happened. So they may know what the revenue of a company is. They may know what the deal size was. is they may know what the discount offered was. They may know sort of what was the patch applied in the case of of a bug fix. What they don&#x27;t know so that&#x27;s because that&#x27;s ultimately stored in some analytical system whatever that system might be. And to that extent systems of records are more analytical in nature than they are in the right path where aentic systems or systems of agents actually capture the sequence of steps.</p>\n<p>What did you do? So if you&#x27;re using player zero, there&#x27;s a support ticket that comes in. That support ticket then you know someone picks it up, some agent, not even a human being first. It does some some analysis. It starts to run some queries. All of that is stitched together. It then at some point pulls a human being into the loop. That human being is then doing a bunch of queries themselves because they look at what the s the agents have presented to them and they start to query the system. All of those queries then ultimately lead to some decision or some hypothesis</p>\n<p>around what the root cause of the problem is and therefore what the bug fixes. That whole starting with a ticket as an example through auto triaging to hypothesis generation to sort of bug fixes to ultimately then then translates into a piece of code that code that gets pushed into production and it either works or it doesn&#x27;t. you complete that loop. That loop is the right path. The way we think about right path &gt;&gt; yeah I see &gt;&gt; as against the narrowly defined readr path in a database which is I think</p>\n<p>where you&#x27;re coming from. &gt;&gt; Yes. Because uh you know I &gt;&gt; which is technically more which is technically more precise. &gt;&gt; Yeah. But here you&#x27;re you&#x27;re you&#x27;re writing code. So you know it&#x27;s still still the right path but it&#x27;s different. Yeah. And I think I think my question there would be like you know do people want to use a separate platform for it or should it just be inside of GitHub and Slack and you know those things will still continue to win or you know basically obviously people want to prefer their defaults the things that they&#x27;re used to. Is there a case to be made for putting these onto like a new thing like whether it&#x27;s player zero or</p>\n<h2>Why these will be new platforms rather than features in Slack or GitHub.</h2>\n<p>something else? &gt;&gt; Why don&#x27;t I get to have J and then you to jump in as well. So I absolutely think it&#x27;ll be a new thing. Now the key is that these new platforms whether it&#x27;s player zero or or olive or tar or pick pick your favorite one they will have to coexist with existing systems and so the system of engagement may end up being Slack. You may communicate with player zero through Slack. You may communicate with it through other systems you have because you&#x27;re not going to replace those at least not overnight. But these existing systems don&#x27;t actually</p>\n<p>orchestrate across an entire business process. To some extent, systems of record do. But even in systems of record, what you see is systems of record were very historically all designed for structured data. So even if you&#x27;re running a a deal process through Salesforce as an example, very quickly you find the data is not in Salesforce, it&#x27;s in Slack in part, it&#x27;s in email. Actually the number one system of record for most organizational data is email. You see email. Yeah. &gt;&gt; And Slack. So but email and Slack just captures data. I mean as a blob. And</p>\n<p>again technically not as a blob. I mean if if you get into sort of data structures but but the but the data is is is dark data in a sense in Slack and in email. And an agentic system that has a real context graph will capture this the pieces of data that are appropriate across email, across Salesforce, across your account management system, across a conversation and across a Zoom call. All of these have data, some structured,</p>\n<p>some unstructured. And most of the value is actually in the unstructured data. And this is part of why s context graphs are so hard to build that you have to figure out how to parse the unstructured data in a way that you capture value and insight because if you started uploading every Zoom call you have in a sales situation, you&#x27;ve done like a million Zoom calls and only noise. And so where the unstructured data is such a large part of it and conversation data is such a large part, most likely the context graph will actually consist of small models. The context graph itself is a model layer like you use that data to</p>\n<p>train a set of models but then become part of your context graph. In the case of player zero actually the data set is much more semistructure. It&#x27;s it&#x27;s less zoom calls and more code and tickets and observability which all has some level of structure very large data sets but with more implied structure. And so the way you would implement a context graph is very different. It&#x27;s more of a traditional graph structure. Maybe it&#x27;s a relational database with a graph layer on top. &gt;&gt; Yeah. Jay, I don&#x27;t know if you have any notes to add on that. &gt;&gt; Yeah, I don&#x27;t think any more to add. &gt;&gt; Got it. One thing I wanted to move on to also is obviously there&#x27;s a huge amount</p>\n<p>of community discussion. You also dedicated a slide to just the push backs. I actually wouldn&#x27;t say push backs, but feel free to just capture push backs like let&#x27;s let&#x27;s go directly and address the elephants in the room.</p>\n<h2>Addressing pushbacks: Can you truly capture the &quot;Why&quot; or just the &quot;How&quot;?</h2>\n<p>&gt;&gt; Yeah. So, I can take this one. So I think you know um a lot of the you know I don&#x27;t know if it&#x27;s push back but like a lot of the people that are say you know maybe taking other opinions and sides which I I love uh cuz it pushes our thinking too is that you know one of the things that we keep hearing is like well you actually can&#x27;t capture the real why and like you can and you can only capture the how. Um, and that true, you know, intent is actually like really internal to the human and the only thing you can actually capture is a sequence of actions and interactions. I think</p>\n<p>Glean actually uses those exact words and they say that you can capture the how. You know, I think that some of that is like in some cases, you know, that&#x27;s true, but I also think that there&#x27;s a way to get to like, you know, I think Anime talks about in his blog post, but like the partial why and start to be able to reconstruct the why. And and I think that you know the reason that is is because like you know I think before AI agents well humans are making these decisions and you know now that agents are going to do the work they sort of</p>\n<p>need some sort of access to that sort of memory and then two I think LLMs also made some of this capture more feasible. You know prels you kind of needed humans to maybe manually uh structure sort of every decision and no one wants to do that. Like I think they sort of it takes a lot of work to write down why I did something. That&#x27;s why sometimes like you go through Salesforce and you look at like the there&#x27;s a bunch of text boxes about like you know notes and like those notes are probably all always empty is my guess.</p>\n<p>&gt;&gt; Yeah. Yeah. Someday we&#x27;ll we&#x27;ll force all employees to wear a B uh BCI device uh so we can read their thoughts and capture everything. &gt;&gt; Exactly. I will not name the company but I have a portfolio CEO Raj that he and everyone and his team you know just they have this watch thing that they wear that captures and it auto it autoconnects the data back to their calendar. &gt;&gt; Yeah. Auto auto transcribing I think is is actually honestly like a reasonable thing. The privacy has to be like worked out but honestly you know it&#x27;s no</p>\n<p>different than like an employer owning all the Slack conversations and all that. &gt;&gt; Totally. Yeah.</p>\n<h2>Privacy, data governance, and &quot;Metadata 3.0.&quot;</h2>\n<p>you talk you refer to privacy and I would say one of the one of the really critical things which is both there&#x27;s some push back but I also think you know we we acknowledge right in the original post is going to be critical is you&#x27;ve got to manage there&#x27;s data governance issues you know there&#x27;s there&#x27;s there&#x27;s there&#x27;s is sensitive data that is organization specific so in order to effectively capture these decision traces and then operationalize them in the form of context graph There&#x27;s a lot of work that companies will have to do around data governance</p>\n<p>and data management and you know we have a company that&#x27;s sky flow that J and I worked with that does a lot of work in PII and sensitive data management. &gt;&gt; Yeah. &gt;&gt; Again it&#x27;s sky flow. &gt;&gt; Yeah. Yeah. I &gt;&gt; purpose. Yes. &gt;&gt; So you know again they&#x27;re pioneering an approach to addressing this issue. There&#x27;s still a lot to be figured out but key to success in building a context graph will be data management data security &gt;&gt; and then I think that the second point that is interesting as well related to</p>\n<p>that is you know a lot of people kind of like said uh said hey this is like you know metadata 3.0 and this is like I forgot what someone used it was very funny language but I think it&#x27;s like you know metadata this is metadata 3.0 point was like the new sparkling water of France or something. I don&#x27;t know what Gen Z praise is going around. Um but what was interesting I think about that and you know what a lot of people responded to it well hey the same objection was raised about you know CRM about observability</p>\n<p>and about data warehouses as well and so new categories I think they emerge when there&#x27;s a new unit of value worth you know storing and I think the difference here is that decision traces are sort of captured as part of the execution path and not sort of defined up front in all these is like workshops and reconstructs it after the fact via ETL and they&#x27;re more like emerging as a byproduct of agents doing work which I think is architecturally like a little bit different than metadata layers and I think</p>\n<p>&gt;&gt; the second point there is like the difference is also when and how it&#x27;s sort of captured like I think with um with metadata and you know this also goes to ontologies I think that&#x27;s like another point that&#x27;s coming up is that you know there&#x27;s a lot of like pre-upfront tax of like hey I need to go model a bunch of stuff out with like you know a bunch of consultants, a bunch of stakeholders um and do a bunch of workshops where I think this is a little bit different.</p>\n<h2>Context Graphs vs. Data Mesh: Why universal graphs are unlikely.</h2>\n<p>&gt;&gt; I think that&#x27;s that all makes sense. Uh I&#x27;m entertained to see this mentioned as data mesh again. I wonder if the data mesh discussion is is is like um like a bad comparison or actually a pretty good one because in a large enough enterprise company and this piece was very focused on enterprise You do have silos that emerge and sometimes for good reason and sometimes they should not be joined. Yeah, &gt;&gt; I don&#x27;t know. So, so you know you&#x27;re on to something that D and I talk about a lot which is and you know the last slide</p>\n<p>just references this a little bit. You know the word data mesh can mean whatever you want it to mean. So arguably a contest graph is one form of a data mesh but typically when people have talked about data meshes they have this notion of one universal data mesh across a large enterprise. Yes. And we don&#x27;t actually believe that that will be the case. We think context graphs because they have to emerge from the automation of a specific set of tasks or business processes like no one&#x27;s going to do or can do the work to say let me</p>\n<p>capture all the decision traces in organization and put them in one universal context graph sounds a little bit like solving world hunger and it&#x27;s a good idea but very hard to implement. Yes, our core thesis is these context graphs will emerge organically and they&#x27;ll emerge organically because just as as as processes get automated and human beings are incentivized through be humans in the loop because really they are providing a lot of the training data. The why is coming from the actions that human beings take as part of a decision in an existing business process</p>\n<p>automation. And so player zero is doing that for the whole process of code from going into you know testing all the way to code in production and there&#x27;s an entire workflow once you generate code and they touch every part of that workflow. Similarly, Olive does the same thing for sales. And those are just two different workflows of business process in a company. Like there&#x27;s no reason why companies would want to put both data sets or both context graph in one universal context graph in companies or people who are selling context graphs</p>\n<p>can sell to both of these companies. But ultimately, no one&#x27;s going to no company&#x27;s going to wake up one day and say, I want to build a universal content craft. And then if you look at some of the things that Arvin from Blleen has said and Ble&#x27;s an amazing company and I have a lot of respect for Arvin but it&#x27;s so horizontal like it&#x27;s a very powerful chatbot and it allows people to build some agentic applications or systems of agents on top of them but really the deep crossf functional crossprocess automation problems are going to be solved I think by companies that are</p>\n<p>dedicated to solving that problem. You know you can call it vertical specific and call horizontal. You know my partner Joanne the J and I work with has a company called Tenor. Tenor is solving the process of automating uh you know the intake process for patients in specialized healthcare situations, specialized clinics, whether it&#x27;s sleep clinics, specialized testing processes. So again they&#x27;re capturing very similar workflow. It&#x27;s almost like in the old world we call it CRM for for specialized healthcare clinics, but it&#x27;s so much</p>\n<p>more today. And they&#x27;re capturing those decision traces and they&#x27;ll build the context graph for that. And what Jay and I think about all day every day is you how do we how do we identify which use cases, business processes, verticals have will have the deepest mopes over the next decade. We could we can build the way we&#x27;re going to build universal context graph is by having a 100 portfolio companies that have context graphs and the winning ones hopefully hopefully the winning contest graphs. &gt;&gt; Yeah. Yeah. Yeah. Yeah. Okay. I think I think a very useful concept. We&#x27;re we&#x27;re</p>\n<p>coming up on time and I just want to make sure that we&#x27;ve like sort of adequately addressed or cap encapsulated everything that we know or like the community is excited about. There&#x27;s there&#x27;s a lot of like discussions and I think people are going to build out different versions of this. you know what is what is uh do you have any predictions on what we&#x27;re going to see by your end that are falsifiable that has a chance of being wrong you know like I I think that these are my ways of trying to test have we have we sort of progressed in our understanding of what is what we need to build &gt;&gt; I think that&#x27;s the alpha I feel like that&#x27;s the alpha can we give it away &gt;&gt; that&#x27;s the</p>\n<p>&gt;&gt; it&#x27;s the alpha I don&#x27;t know if we can give that away &gt;&gt; okay</p>\n<h2>2026 Predictions: The &quot;Context Graph Stack&quot; and production scale.</h2>\n<p>&gt;&gt; I&#x27;m kidding &gt;&gt; you know I would say some things are easy to you know there&#x27;s a lot that we&#x27;re talking about what&#x27;s next and so so you know as as J said there&#x27;s a lot of alpha there but uh look we believe that a year from now you will actually have hundreds of context graphs in production at scale yeah you said that yeah so so that&#x27;s belief number one two I think the the enabling infrastructure stack for context graphs will be well defined and and there will be variations and flavors but you know I totally anticipate that</p>\n<p>this time next year we&#x27;ll be writing Okay, here&#x27;s here&#x27;s the way here&#x27;s the best practice stack. Just like once upon a time there was the modern data stack, there&#x27;ll be the context graph stack and it will be 10 times more important and 10 times more valuable. And and lastly, I would say you know the debate about what is a context graph and what are decision traces and what they why they matter will go away and the question will be how do we extract value from context graphs? But we&#x27;re merely scratching the surface. Once you have a context graph, it&#x27;s a little bit my context graph versus yours and different people will do different things to</p>\n<p>extract value and drive further automation cuz automation is always a staircase. Like the more value you can extract from the context graph, the more you can automate and the more you automate, the more more decision traces you capture, the more you know you will capture your context graph. So the best companies will be debating how to sort of accelerate that flywheel 12 months from now. That&#x27;s a good uh challenge to folks. Uh you know sometimes I also use these as kind of a call to action like you know if if people are working on these problems they resonate with it they should reach out to you obviously</p>\n<p>but I&#x27;m sure you have a lot of people reaching out reaching out as well. &gt;&gt; Yeah. &gt;&gt; Well J and I are open for business 247 definite holidays. So give us a shout. &gt;&gt; Yeah we&#x27;re we&#x27;re recording on a holiday for those listening uh later. But no thank you so much for joining and uh congrats on like basically creating this category. I I&#x27;m excited to see what you do with it. Uh I think it&#x27;s early days still. I think we&#x27;ll still be checking back on this uh you know 6 months, 12 months from now and uh and we&#x27;ll hope to see like a lot more people uh building out what they see as contests within their organizations. So thank you.</p>\n<p>&gt;&gt; Thank you so much. Take care. [music]</p>", "chapters_count": 13}