{"video_id": "SbWeHOAKHPc", "title": "Censoring Stephen Colbert BACKFIRES", "link": "https://www.youtube.com/watch?v=SbWeHOAKHPc", "published": "2026-02-18T09:00:41+00:00", "summary": "Scott Galloway and Jessica Tarlov break down how censoring Colbert backfired on CBS — after Texas state Rep. James Talarico’s scheduled appearance on The Late Show with Stephen Colbert was abruptly pulled off the air. Is this corporate media caving to Trump-era pressure — and is Paramount the real loser? Then: the DOJ says it’s done releasing the Epstein files — but reports suggest the public has seen just 2% of them. If that’s true, who’s still exposed, and why is the department claiming mission accomplished? Plus: a DHS funding showdown is underway in Congress. With ICE funding already secured, and public trust in government near historic lows, which party blinks first? \n\n00:25 Talarico-gate\n10:28 How the DOJ has only released 2% of the Epstein files and what’s still hiding\n35:55 The future of ICE\n\n\nFollow Jessica Tarlov, @JessicaTarlov\nFollow Prof G, @TheProfGPod \nFollow Raging Moderates, @RagingModerates \n\nSubscribe to our YouTube Channel: https://www.youtube.com/@RagingModerates", "transcript_html": "<p><strong>[00:04]</strong></p>\n<p>Welcome to Raging Moderates. I'm Scott Callaway. >> And I'm Jessica Tarliff. >> In today's episode, we're going to discuss Taller Rico Gate, how the DOJ has only released 2% of the Epstein files, and what it's still hiding, and the future of ICE. Uh, if you haven't already, please make sure to subscribe to our YouTube page to get up-to-date coverage on everything happening. All right, let's get into it. James Terico, the charismatic Texas state representative, was scheduled to be interviewed by Steven Colbear on his show this past Monday night, but at the last minute, CBS told the host that the interview would not air and that he</p>\n<p>shouldn't talk about it on the show. Colbear called out FCC Chair Brendan Carr by name. It's another case where corporate media is responding to Trump administration policies. Jess, what's your take here? >> Paging Ted Cruz. Remember how Ted Cruz was the voice of reason when this happened with Jimmy Kimmel just a few months ago? It feels like forever ago, but it was just a few months. They're obviously, you know, trying to run the same playbook. They attempted this with The View. Taller Rico was on the View um a couple of weeks ago. And you know,</p>\n<p>it's disappointing that corporate media keeps bending the knee. Corporate law firms, corporate me, anything with corporate in front of it uh seems to not be doing that well, finding their spine in the Trump era. But I thought it was very well handled by Co Bear. And you know, I was one of the millions of people that immediately clicked that YouTube link and listened to the interview uh this morning as I was walking down here to record this podcast. And you know, it gave them a bit of a badass sheen that uh two kind</p>\n<p>of arguably, you know, dorky guys like Steven Colbear and James Tarico wouldn't normally have. But I, you know, I think it's just another lesson in how things go during the Trump era. it will continue down this path and people need to continue to find their voice against it. I just like don't understand though why the Trump administration keeps committing these own goals, right? Cuz it's just going to drive people. I mean, I was going to watch James Terico no</p>\n<p>matter what, but there are a lot of people who wouldn't normally tune into Colbear who don't particularly care about James Terrier or even know what's going on in the Texas Senate primary on the Democratic side who are now more interested in him. So, doesn't it just completely defeat the purpose of what they were trying to do in getting Terico off the air? >> I can't imagine if there were a conspiracy here, it would be that the biggest funer of Terico or the biggest uh proponent of the Tal Rico campaign, planted someone at the FCC and convinced</p>\n<p>them to do this. >> Should we make Brendan Carr for Terico t-shirts? >> This is all of a sudden. So, first off, let's talk about the losers. Paramount CBS spiked a 60 Minutes story. Appears to have By the way, Anderson Cooper announced he's leaving 60 Minutes. >> I saw that's so sad. 20 years. >> Oh, I I'm I'm name dropping right now. I</p>\n<p><strong>[03:04]</strong></p>\n<p>know I know Anderson and I text him like smart move. He's He spent 20 years there. It's built his brand. He did a great job and leaving on his terms absolutely the right thing to do and it sends a very strong signal. And quite frankly, if there was an enterprising producer could probably call half the producers at 60 Minutes and raise $50 million from a from a Democratic uh billionaire and say, \"I'm going to start something called um, you know, 3600 seconds and basically re, you know, reimagine 60 Minutes like it used to</p>\n<p>be.\" I think that's a big opportunity. But it Paramount CBS keeps saying, \"Oh, we're no longer an independent news network. We are the propaganda arm of the Trump administration and it's just not going to serve them well.\" And as evidence of that, the first week that they had their new anchor for CBS News, their viewership went from 5 million a night to 4 million. Now, I will see say this, it's keeping CBS in the news, which is literally going from irrelevant to less than irrelevant. So they're in</p>\n<p>the news a lot, but for the wrong reasons. And uh so Paramount CBS, huge loser here, no doubt about it. The Trump administration cementss the notion they don't believe in a free press, which only massively juices the viewership of this interview. Uh the other loser, unfortunately, through no fault of her own, is Representative Crockett, who Tarico just got this wind in his sales where he's seen as this resistance fighter that everyone is so scared of. The Empire has put out all sorts of hits on him which makes him look like a</p>\n<p>bigger threat. And obviously Cole Bear is an enormous winner here because he continues to look like, you know, his hat is just starched bright white. But this was effectively, you know, this wasn't censorship. Um, this was amplification. Brendan Carr just made Terico famous in Texas. Terico could have raised 20 or $30 million. it wouldn't have done as much for his campaign as Brendan Carr just did. >> It's also an interesting contrast. You know, we just had the Munich Security</p>\n<p>Conference and the right-wing and Republican party here is always bitching about censorship abroad, right? And how we're the bastion of free speech here. And I'm I'm pretty sure that there's stuff on TV in Germany and in England that Brendan Carr would have his panties in a bunch about here. Um it's super embarrassing on that front. And you just see I mean no matter what story we're covering and you know we're going to</p>\n<p>talk about the Epstein files, we're going to talk about what's going on with immigration enforcement and ICE. You just like tick down the line of lines of the Constitution and say, \"Oh, guess this is irrelevant now. Oh, guess this is irrelevant now. Oh, guess this is irrelevant now. And it's such a huge opportunity for Democrats to come out and just be on the side of the Constitution, right? Like that these are</p>\n<p><strong>[06:05]</strong></p>\n<p>our core values that speech is protected. And I mean, hiding behind the equal time rule is not going to get you anywhere since Jasmine Crockett has been on Colar. And I'm sure Stephven Colbear would welcome Ken Paxton on to the show could talk about, you know, his legislative career, also his affairs, or John Cornin, who I think would have a much more successful interview, and he doesn't have any skeletons in his closet as far as I know, but he doesn't want to have his feet held to the proverbial fire over the Trump administration's policies. So, they're not interested in it. But this idea that, and this is why</p>\n<p>I started with paging Ted Cruz, that there's no slippery slope here, and I hope that Democrats always stand on the side of the Constitution, but there are going to be ruthless people out there that once the Democrats come back into power are saying we should do exactly to them what they did to us. And they wouldn't be wrong for it. And the Republicans that are speaking out at this moment saying like, \"Cool it, guys.\" You know, this is not a third, fourth, fifth, sixth, seventh, eighth, ninth term for Donald Trump in the</p>\n<p>hopper, right? Like there's a big chance that we're going to lose the midterm. This is me being them, not me being a Democrat. Lose the midterms. Definitely the House. Maybe a lot of smart people think the Senate's in play. And then 2028, not a foregone conclusion at all, especially if you have JD Vance on top of the ticket. This is a very narrow way to be governing at this particular moment. And it's such a petty small fight. What do you care about 7 and 1/2 minutes of Steven Colbear talking to James Tarico about Christ? I mean,</p>\n<p>that's literally what they were talking about. Like that billionaires are bad and that it reduces the importance of Jesus to make him a political issue. That that was the content that they were so afraid of. >> Yeah, I'm now comfortable calling the Trump administration fascist. That's the bad news. The good news is the really [ __ ] stupid fascists. They continue to make these sort of own goals around that just nobody thought to if you type this into an LLM and say</p>\n<p>what are the risks of the FCC chair trying to spike an interview with a Democratic Senate candidate. I mean, every LLM would go would come back and say, \"No, that's a stupid idea.\" So, they get their tariff numbers from AI, but they don't bother to run this through. I can't imagine the PR executive or the strategist at the Trump administration saying, \"Yeah, Co Bear won't say anything. This won't this</p>\n<p>won't bring more heat.\" >> Like Coar isn't even afraid of his own boss at this point. He's like, \"I have three months left to go.\" Like, yolo. And Colbear is going to I mean his show is ending. If they had just ignored Co Bear, quite frankly, he just wouldn't be nearly as relevant right now because his show does not his show loses a lot of money. And this is a cap, you know,</p>\n<p><strong>[09:06]</strong></p>\n<p>media companies are capitalist, but this comes across as just such um and we're beating a dead I'm beating a dead horse here. So um such extraordinary censorship. And what'll be interesting is to see how many Republicans come out and say this was a bad move. Cuz it won't be a litmus test of their backbone. It'll be a litmus test of their assessment if whether Trump is losing >> popularity and losing a step. Because I find these guys start to find their</p>\n<p>testicles when they think there's less and less danger of a blowback from the Trump administration. It's sort of almost like a weakness indicator of whether they think that the Trump fever is about to break. >> Yeah. And it's also an easy one. You know what I mean? Like you don't have to come out against his immigration policy if you just say, >> \"Yeah, I believe in free speech. >> Let Telerico be on Co Bear and air it on a regular network instead of it being a YouTube thing.\" But it is a good precursor for whatever YouTube show or podcast or whatever Co Bear is going to</p>\n<p>be uh doing it come May when he no longer has this job anymore. Though, I feel like you should take a few months off at least. Everyone needs needs a break. >> All right, let's take a quick break. Stay with us. Welcome back. The Justice Department says it's wrapped its final release of the Epstein files under the transparency law, but new reporting suggests the public has seen maybe just 2% of the total data seized. And already executives, politicians, academics, and</p>\n<p>even a sitting cabinet secretary are facing the threat of resignations, investigations, and serious reputational damage. Jess, if this is only a fraction of the evidence, why is the DOJ saying they fulfilled the Epstein Files Transparency Act? >> Well, because they're lying. But >> that makes sense. >> Okay. Is that the end of the show? Because they're lying. >> Don, correct? >> Yeah. Ding, ding, ding. So, the past couple of weeks, you know, I've been very down about this, which I think anyone who's consuming the news as it relates to the Epstein files would be.</p>\n<p>And you're, you know, horrified and sad and it's so harrowing what happened to these victims and the frustration about so few people caring and there being consequences. And I felt for a couple weeks there that something was going to change. I'm not saying everybody was going to be prosecuted, but it did feel like there was some momentum and seeing now that the DOJ is saying we're done and you know doing crazy things like releasing</p>\n<p>all the names involved and then they put out like Janice Joplain on a list who was Epste was 17 when she passed away and you know crowding names together like Joplain and Larry Nasser for instance you realize nothing's going to happen. And I'm getting really sick of</p>\n<p><strong>[12:08]</strong></p>\n<p>seeing headlines from around the world like last night, you know, breaking French police raid multiple locations in Jeffrey Epstein criminal probe, including the Arab World Institute, right? You're having resignations of people out of foreign governments because they were just in contact with this guy. Kier Starmer may not be the UK prime minister anymore over bad judgment as it relates to putting, you know, someone in uh in government who was linked to him. And I just think like we're not going to do anything. Like</p>\n<p>Brad Karp doesn't have his job anymore. I saw Casey Wasserman, the you know, the mega agent stepping down. But it put Pam Bondi's performance last week in a new light to me. Like I actually I thought it was so bad and it was so embarrassing. Not just the stuff everyone's been making fun of, like you got asked a question about a pedophile and you screamed Dow 50,000. Like that's funny in an SNL sense, but I really thought that the image of this attorney general not even turning around to make</p>\n<p>eye contact with the survivors, women who have endured something that no one should have to would show Trump that she was not up to this job or that she was just going to be enough of a PR nightmare that she should be gone. But honestly, like looking at it now a few days later, I think it's what Trump wanted. I think that he has made it clear and that Marjgery Taylor Green has been talking about this in interviews that he is the one who has been blocking this and he told her to go out there and be as ridiculous as she</p>\n<p>needs to be as long as she is stonewalling. And so I have basically no faith in the idea that there will be any substantive consequences from this or that we're going to find out that much more. Um, so that's I don't want to be Debbie Downer, but that's where I am. >> I'm more hopeful in the sense that I do think there are going to be consequences here, but I think they're going to happen in 2029. And also, I think Democrats and Merrick Garland have to take some responsibility for why these files weren't released</p>\n<p>earlier, why there haven't been any indictments, why there hasn't been more aggressive push to get to the bottom of what's gone on here during Democratic administrations. What's come to light here is that the Republican party, I mean that that was a real moment that you just referenced when um Representative Jipal asked the survivors or survivors to stand up and all of them had reached out to the DOJ and none of them uh had their uh overtures. The DOJ has no interest in interviewing these victims. I mean,</p>\n<p>you'd think that one they would provide insight into crimes and possibly even exonerate some people, but it's clear it's no longer the Department of Justice. It's the Department of Delay and obfuscation. And quite frankly, I think someone did type this into AI and said these in some form are going to come out in some format. What's the best way to do it? They said confuse the [ __ ] out of everyone. Release a ton of [ __ ] that makes no sense. Then drip it out and</p>\n<p><strong>[15:11]</strong></p>\n<p>create a ton of confusion. And this is what's happened. Um there is like you said just total confusion. This is a total GRU propaganda technique and that is overwhelm and flood the zone with information some true information some false information and make it such that everyone just fed up and shrugs their shoulders. And where I part from the majority of my progressive brothers and sisters is that I don't believe they should have released the files. I think the way they the Department of Justice and the other agencies who have compiled this data should be communicating with the public is through indictments and</p>\n<p>saying we are indicting the following people uh for what we believe uh is criminal activity specifically child rape or trafficking trafficking girls or providing infrastructure for the abuse of children. But instead they let out everything and we're all like, \"Oh, you know what is what does a spiritual guru guru think?\" And by the way, if a cabinet member purggers himself under oath and is all indignant about having nothing to do with him and then it comes</p>\n<p>out that he had a lot to do with him, that's criminal activity. But this has worked out perfectly or near perfectly in my view. Perfect is the wrong word. It's been less bad than it should be for the Trump administration because they have weaponized our institutions. our institutions. The Department of Justice is the most poorly named government agency in the world right now. This has nothing to do with justice. It's the Department of Propaganda. It's the Department of Delay and obuscation. And I do actually think they're doing a really good job because well, while we're focused on what creeps, spiritual</p>\n<p>guru or wellness longevity doctors are, the government officials or grown men who have engaged in child rape, nothing's going to happen. I am fairly confident that there's enough anger out there that a new attorney general in 28/29 is going to come for some of these people. I think that there's enough thirst out there for blood and some sort of justice uh that you're going to see something happen. It's just not going to happen for another 3 years. And I don't know</p>\n<p>what the I don't know what the statute of limitations is on some of these things. >> Yeah. I mean, that's the problem with a lot of it anyway. And I think where some folks that have been implicated have been taking some degree of solace in the situation. But you know it's it's a criminal question but it's also a moral question right about the type of people who should be in leadership positions. And I don't want to paint too broad of a brush. There are obviously people that</p>\n<p>are just you know casually like went to a dinner party there. Um, you know, maybe their EAS didn't mention you're going to dinner at a convicted sex offender's house who was soliciting prostitution from a minor, but you know, plenty of people who also were in communication after he was prosecuted again, right, for the stuff that ended him in a jail cell and, you know,</p>\n<p><strong>[18:14]</strong></p>\n<p>murdered. I mean, it was really interesting. Julie K. Brown, the pioneering journalist on this from the Miami Herald, said she doesn't think that he killed himself. And now that we know about like the erased tapes from the cell and you know that there are entries into the files about dummy bodies coming out different sides of the prisons to distract from the whole situation. There is obviously a lot more to this story and I think that it would be nice if we could get those details and that people could be reading from the same playbook because there's also a ton of bad information in these files to</p>\n<p>your point about everything getting released or not really everything. um since it's only going to be 2% of it. Um, but you know, I get very tinfoil hat e about these things and I'm going down a lot of rabbit holes around, you know, the dentist chair that was in his house and the girlfriend that he had, the Bellarusian woman who got into Colombia dental school and, you know, had no business being there. Two administrators I believe have been fired in connection with that. But there's a whole section</p>\n<p>of the internet that is, you know, talking about how the dental chair was to remove girls teeth so that they wouldn't bite back. You know, like you could go down a number of really scary paths. Um, I guess I do want to be hopeful though for a second and talk about what's going on in New Mexico. So, you saw how there was an exchange uh in the files about how there might be bodies buried at Epstein Zoro Ranch, which is in New Mexico. That ranch is now owned um by this big MAGA guy who's</p>\n<p>running for Texas controller. His son works in the White House, by the way. As an aside, he's endorsed by Turning Point at this point. He was refusing to let people come um and look for the bodies on the ranch. Uh but New Mexico lawmakers last night voted unanimously to approve a truth commission with subpoena power um to probe trafficking and sexual assault at the ranch and that starts effective today. So that testimony actually could lead to prosecution. So I I hope that state lawmakers across the country are taking</p>\n<p>note of what is possible even without the DOJ wanting to help out. Maybe you'll get some answers when it comes to that. But, you know, I it's all kind of comical, right, when you think like the guy who owns it now is, you know, his son works in the White House and he's not letting people on there. Like, why wouldn't you let people on there to see if there are dead girls buried on your property? Also, why would you want to live on a property that might have dead girls buried on it? >> Yeah. The the problem with all these</p>\n<p>rabbit holes is I I worry that they're weapons of mass distraction and that we're all falling into it. So for I thought Ro Kana, Representative Kana summarized it perfectly. He said, open quote to have Janice Joplain who died when Epstein was 17 in the same list as Larry Nasser who went to prison for sexual abuse of hundreds of young women in child pornography with no clarification of how either was mentioned in the files is absurd. The key to the Epstein files, but the</p>\n<p><strong>[21:15]</strong></p>\n<p>American public wants it all. I actually think the key to the power of investigatory agencies and justice is what's not released and that is the Department of Justice is there to create incentives specifically or in this case an incentive that tells people if you engage in child rape you're going to pay a huge price. I don't think they're there to ruin you mentioned Casey Wasserman. As far as I can tell Casey Wasserman sent flirtatious emails to Gelain Maxwell before he was even convicted the first time in 2008. Everyone becomes the [ __ ] pope and Jesus when they get behind a keyboard</p>\n<p>and they want to engage in this ringlight virtue that the algorithms love of tearing down people. I even saw this one person putting out Tik Toks about how we should not endorse the brands of the I won't even mention their names cuz I but these two famous models because they had email interaction with Jeffrey Epstein. Look, the guy the guy had a yacht and threw great parties. I hate to break it to you folks, but a lot of wealthy men and models really enjoy those things and will email with people. That doesn't mean we should be ruining</p>\n<p>their careers. And all we are doing by creating this like citizen ringlight, I wouldn't even call it journalism, but gossip/ slander is deluding from the focus of the department or what should be the focus of the department of justice. And that is to indict, convict, and imprison criminals. and instead we're trying to instead we're talking about oh this guy this you know this guy should resign or this guy should or shouldn't be on CVS. I I I</p>\n<p>think it's I think it's an incredible miscarriage of justice and we are falling into the exact trap that the Trump administration has laid for us and that is the Department of Justice isn't in the business of finding out what emails out you as a total [ __ ] creep. Okay, that's bad. It's really distasteful. It's not the business that the Department of Justice should be in. The Department of Justice should be in the business of putting a man who is alleged to have impregnated an 11-year-old on this island, putting him in prison for the rest of his life, such</p>\n<p>that the next time a an Epstein class of person believes that they can rape children, thinks twice, and says, you know, maybe I shouldn't do this because someone's going to come for me and put me in prison. and that women who are abused like this or girls who are abused think the department of justice has my back. They may be slow but that the arc of the department of justice bends towards truth and justice. This this department has lost so much credibility</p>\n<p>but they are doing this and to a certain extent the Trump administration is getting a lot of flack. I think they've put on a master class here, courtesy of Professor GRU on how to distract from pedophilia and crimes potentially committed by some of the most powerful people in the world. And instead, we're focused on all of the fun and all of the gossip and oh, this guy, this guy's a creep. Okay? Or this individual had</p>\n<p><strong>[24:18]</strong></p>\n<p>contact with this person. let's talk about it and let's pass judgment on it because from a from a keyboard I'm really [ __ ] virtuous and can judge other people. This has been in my view the Trump administration if they are trying to create uh diversion, confusion, delusion. We've fallen into that trap. They have played us. >> Now I feel sad because I've been played. But I I just wanted to add well two things. Um, on the Peter Aia front, cuz you, you know, referenced that I do</p>\n<p>think that there is a difference between people who have been caught up in this and had a few exchanges with him or, you know, flirted a little with Galen Maxwell before anyone was convicted and someone who exchanged what was like 1,850 emails uh with the person and seems to have from those emails some understanding of who Jeffrey Epstein actually was. And you know, being a a medical contributor, somebody that</p>\n<p>people go to for health advice should, I think, carry even like an extra level of weight or importance to it. And I'm not accusing him of doing anything with little girls or anything like that, but I think it is going to be very hard and this would turn into a business decision, which Barry Weiss has decided as of now that she is keeping him. that when you turn on the TV and he's talking to you about longevity that you hear echoes in your mind of someone saying, you know, I but we can't tell anyone</p>\n<p>about who you actually are and that he was with Epstein when his baby was in the ICU, which he wrote about in his book. Like, I I'm not with you on some of these. People have been caught up in it. I I think that you need to as a full-g grown adult express some better judgment when you are clearly aware of at least a few details about this guy that indicate that he is no good and of and of zero moral fiber at the very</p>\n<p>least. The second component about people needing to be convicted of things and to pay some sort of price. It is interesting in the latest trunch of documents that came out that there is evidence that the FBI interviewed a victim who credibly accused Donald Trump of sexual assault and this happened in 2019. And there will be a question this DOJ, you know, isn't going to do anything about it. And again, I am not saying I have no evidence that Donald Trump do did this. I'm saying that there</p>\n<p>is an interview in these in the latest trunch of uh Epstein files on this and that Bondi may have perjured herself when she was testifying because she said that Trump was not implicated in anything and that might be a legal question that the Democrats make something of. That was the only thing that kind of stood out on the legal front from her testimony. I think if</p>\n<p><strong>[27:18]</strong></p>\n<p>somebody has perjured themselves, the Department of Justice has an obligation to indict them or say, \"We believe this person perjured themselves.\" Whether it was, >> you think Todd Blanch is going to be like, \"Pam, you've gone too far.\" Now, >> look, and that might be that'll probably be a a different Department of Justice. Um, when it comes to someone like uh Peter Aia, the department, and this is the gray zone, the Department of Justice might feel that if a medical doctor who's been licensed and accredited by certain medical boards, do they have an</p>\n<p>obligation to inform them of what might have been criminal activity? Look, President Trump was found guilty of 34 felony counts and he was found civily liable for sexual abuse. I believe that warrants additional investigation by the Department of Justice for what appears to be evidence that he may have engaged in more criminal activity, which I believe gives the Department of Justice a fact pattern where they probably want to further investigate the president and his activities</p>\n<p>with respect to somebody just being an abysmal human being who is also providing medical advice and it's handled themselves incredibly poorly and has probably no business giving other people medical advice and having a big platform. I agree with that. I think that's hard to argue against. The question is, is that the business that the DOJ is in? >> Is that what they do? Uh because how far down do we go? And my view is the</p>\n<p>following litmus test. Is this person guilty or is there evidence that warrants government resources to file a criminal indictment against this person? That's it. And as much fun as it is to call these people out deservedly for what incredible [ __ ] hypocrats hypocrites they are. I mean, Secretary Lutnik, my view is he's such an idiot that he committed a crime trying to cover up what wasn't a crime. If he had just said, \"Really poor judgment. This guy was my neighbor. He seemed like a</p>\n<p>baller. I thought he was wellconed. Me and my kids went to his island. Just really poor judgment. It'd be over. Instead, he testified under oath that he was he immediately smelled a rat and wanted nothing to do. Okay, that's called perjury. Sir, where is the line here? What is the Department of Justice in the business of and what are they not in the business of? >> I totally agree with you. Um, I think it's a real question also about our quality of</p>\n<p>journalists and how few people trust anyone in any sort of position of power, whether it's government or the quote unquote mainstream media. And that was part of the drive for getting all these files out here. But the problem is you have, you know, citizen journalists or just anyone with an access with access to an ex account or whatever whatever social media channel you happen to be on</p>\n<p><strong>[30:18]</strong></p>\n<p>and then that becomes Bible to you and it splinters us even more. Um, but there's no question that these survivors deserve a lot more than they are getting and probably than they are ever to get. Um, in terms of even recognition for what they went through and we should make sure that the focus always stays on that cuz it it's it's just terrible. and to see the pain in their eyes and to listen to these interviews. Um, it's it's sickening and it it's just really</p>\n<p>sad. I think a decent opening statement or confirmation for a nominee for the next attorney general, hopefully under a Democratic administration, would be, \"I am laser-like focused on bringing justice to the victims of Jeffrey Epstein and criminally indicting the people who engage in criminal activity, who engaged in child rape, provided infrastructure for it, trafficked it, and that is it. That is where I'm going to focus all my</p>\n<p>resources and that is it. And if you're looking for titillating information on what a [ __ ] creep someone is, that's not why I'm here. >> Yeah. A professionalization of the office uh would be good. >> People don't realize, and this goes to just how much damage social media has done. There are two ways you don't get chained by the community and cast out into the darkness and get eaten alive by bears and wolves. And that is one through either strength or wisdom. And one unfortunate means of somehow</p>\n<p>granting wisdom in a very fake, superficial, but what seems to be increasingly important, I don't know, vehicle is the social media algorithms give you likes and attention and money if you feed into the algorithm. And finding somebody famous who is in these files for whatever reason is going to get you is the algorithms love it. It's embarrassing for them. It creates conversation. It creates likes. It creates another 50, 80, 100 bucks from AdSense on YouTube.</p>\n<p>And it elevates information that in my view often times does nothing but polarize us, divide us. And here's how we end up with a Vance Teal presidency, which is if Vance is is president, be clear, Teal's not going to be his vice president. He'll actually be the president. Vance will be the VP again. This is how it happens on the left. We just [ __ ] attack each other. Casey Wasserman, that's who's got to resign. That that who's that's the guy</p>\n<p>flirtatious emails with Gelain Maxwell before before Epstein is ever convicted of anything. That's the guy who's whose career we're ruining. That's the one who pays the price. >> You saw um that great image. I think it was New Yorker did it. Um, with all the red arrows that point in one direction and then blue arrows are all pointing in</p>\n<p><strong>[33:19]</strong></p>\n<p>different directions and at each other as a, you know, metaphor for how Republicans do politics and how Democrats do politics. And we are the ultimate circular firing squad every time. >> I'm triggered. I'm totally triggered here because and whenever I talk about the epsin by the when I when I think I was summarizing something you had said and I said that if somebody this individual I said something along the lines of this person should be criminally or indicted and pursued for sex with underage women. All of the comments all of the comments</p>\n<p>were about the words I chose. Scott, they're not underage women. They're girls. 100% right. 100% right. I will change my language. They're absolutely right. Essentially, this is what Democrats are really good at. We have fascists and people who seem to be covering for pedophiles coming across the planes towards us and we're in a trench [ __ ] posting each other and saying, \"You're holding the gun wrong. You're my ally, but you're holding the you chose the wrong words, so I'm coming for you.\"</p>\n<p>It's a our inability to embrace imperfect allies is how we lose this war >> 100%. >> Let's take a quick break. Stay with us. >> Support for today's show comes from Framer. Let's say your marketing team wants a new landing page. So, the design team mocks it up and then your engineering department, who's already got too much on their plate, responds with, \"Yeah, we'll get to it.\" Thousands of businesses from earlystage startups to Fortune 500s are choosing to build their sites in Framer, where changes</p>\n<p>take minutes instead of days to solve this very problem. Framer's enterprisegrade noeode website builder used by teams at companies including Perplexity and Miro to move faster. With real-time collaboration, a robust CMS with everything you need for great SEO, and advanced analytics that include integrated AB testing, your designers and marketers are empowered to build and maximize your do from day one. So whether you want to launch a new site, test a few landing pages, or migrate your full.com, Framer has programs for startups, scaleups, and large</p>\n<p>enterprises to make going from idea to live site as easy and as fast as possible. Learn how you can get more out of your.com from a Framer specialist. Or get started building for free today at framer.com/propg for 30% off a framer pro plan. That's framer.com/propg for 30% off. framer.com/propg. rules and restrictions may apply. Welcome back. Before we go, Congress is</p>\n<p>deadlocked over funding the Department of Homeland Security and the fight over ICE reform is unfolding as immigration enforcement continues expanding. Senate Democrats want body cameras and ID rules for agents. Republicans say ICE funding is already secured through 2028 and warn the shutdown is instead hitting FEMA and TSA. Jess, who do you think blinks first and how long uh can this drag on?</p>\n<p><strong>[36:20]</strong></p>\n<p>>> I think it could go on for a while. I mean, especially because it's concentrated in DHS. It does not seem like Democrats really any of them except like Federman uh really has much appetite for compromising. Um especially on some of these key planks. It'll be interesting if Republicans, you know, get it together and come back and say these are the two or three proposals that we can live with. I mean, even some very conservative senators um have said, you know, definitely open to body cams. Masks seem to be where they're drawing</p>\n<p>the line. Like Tom Hman even said, \"We don't want to have to be wearing masks, but people's families are getting doxed.\" Um I'm think that there's probably a correlation between what these agents are doing and the fact that people are coming after them. Um I am not in any way justifying it. I think that, you know, doxing is unacceptable. people's families need to be, you know, kept safe and protected. Um, but there's probably more, as with everything that we agree upon than we don't. Um, but I</p>\n<p>think this one could go for a while. Um, lot of agencies affected, TSA, FEMA, Coast Guard, Secret Service, um, ICE, obviously, US Customs and Border Patrol, but it is funded through the end of the Trump administration because of the reconciliation bill. they got an extra $75 billion. So, it's a bit of a a false choice talking point, I guess, to say, you know, defund ICE or we're going to defund ICE. You can't. That money has gone out the door. But I wanted to frame</p>\n<p>this in a way that you actually did around the Epstein files and even what we were talking about with the FCC overreach. Again, the Trump administration is taking major hits because of these very unpopular policy positions. So, they're 100% on the back foot when it comes to ICE and immigration enforcement. Trump just hit new lows in four major polls, Quinnipak, Yahoo, NBC, and the AP. He's doing way worse than Joe Biden was. If the election were held today and the Ras</p>\n<p>Mucin pollster, who's a right-leaning pollster, even said this, Joe Biden would win. He's now at minus 27 with independence. You cannot win an election at minus 27 with independents, bleeding non-ol support. He was even down two points with white voters. And Democrats haven't won white voters since 1964. So I'm not saying that that poll, it was a Quantis poll. It's a good pollster that we would win white voters, but that's crazy. And now 58% of voters under 30 disapprove of the job Trump's doing. So, every swing category,</p>\n<p>Latinos, especially Latino men, young voters, has swung back. And I think you can draw a direct line between what is going on in America's streets and especially in Minneapolis and this change. And we're always looking for a silver lining or something to be hopeful about. And we were talking about this um last week uh with your buddy uh Jeff Sonnenfeld and his new book and how can</p>\n<p><strong>[39:22]</strong></p>\n<p>you push back and the idea of collective action. The people of Minneapolis have given us a road map. They have shown that you can push back effectively. It's a tragedy what happened with Renee Good and Alex Patty. Of course, I want to talk about that a bit more in terms of what's going on with the ICE. Um, but they will back down if you show up and you peacefully protest and you tell them that this isn't all right. This isn't American. This is not how we do things here. Tom Hman announcing that the surge is over. A small security force is going</p>\n<p>to remain. That's a win for our side. And I think that we should recognize that and know that it is going to take every one of us who feels, you know, distraught, disturbed, incensed, angry, livid over what's going on, that you may have to show up for a protest or two, that you may have to push back in any way that you can, that you may have to resist and unsubscribe. Um, but that you can make change and you're not powerless. >> Yeah, I agree with you. I think that they picked the wrong state, right? And</p>\n<p>I do think it's mobilized people. And to be bereft and believe that we're the first generation to face this type of behavior or a dark time, it just doesn't understand or or really have any historical context. There we have absolutely faced worse predicaments than this. Whether it's civil wars, world wars, plagues, interning Japanese people, you know, we civil rights violations, not mentioning the word AIDS because you think it's such, you know, gay people are such an</p>\n<p>abomination. We have we have faced very big crises and every time Americans have uh equaled the moment and the fear this time is that we have become so fat and happy and so prosperous that we take our institutions and our rights for granted. And I don't think that's happening here. And I think the people of Minnesota have kind of, as you've said, have kind of provided a great example and sort of led the way here. The trust in government, it's just so upsetting. Just 17% of Americans now say they trust the</p>\n<p>government in Washington to do what is right. Just about always is 2% and most of the time is 15%. Now get this. That's 17% versus in 1958 73% of Americans trusted the federal government to do the right thing. always most of the time. Uh by 1980, post Vietnam and Watergate, only a quarter of Americans expressed a high level of trust, but it's still double what it is now. Uh as the economy grew in the late '9s, trust in government also rose. It also rose after 9/11 and then fell after 2008. Uh</p>\n<p>twothirds of Americans report having not very much or no trust in Congress. So there's just a lack again of faith in our in our institutions. You said something earlier in the show I want to double click on and that is quite frankly unless we i.e. Democrats [ __ ] this up and we are famous at snatching defeat from the jaws of victory sea above start ship posting</p>\n<p><strong>[42:23]</strong></p>\n<p>each other instead of actually focusing on the real adversary here but you had said something it looks as if we're going to take back Congress. you had said that now there's some credible pollsters specifically the predictions markets saying there's not a non-zero probability that we actually take the Senate. Do you have any thoughts on that? And you can be can you be more specific about which Senate seats might be in play that weren't before? >> Yeah, I mean so the ones that I I feel really good about uh North Carolina um with Rory Cooper uh running there it I</p>\n<p>don't know. I'm so conflicted about what's going on in the main primary. Um, but it does feel like Susan Collins is more vulnerable than she is usually. And I was someone who thought that there was a chance that she was going to lose uh 6 years ago and she won by double digits. Um, but it does feel like the mood is we need a change. Janet Mills, who's the current governor running for Senate in the Democratic primary, had a brutal,</p>\n<p>awesome ad um about, you know, how concerned Susan Collins has been for decades and how she really does nothing about it. And she also, like many politicians, said, you know, not going to serve for some absurd amount of time. I think it was just two terms, but she's been in there now, I think, like 30 years. Um, so that's pretty hard-hitting. But it seems like Graham Platner the you know the lefty candidate in there has a lot of enthusiasm um on the ground and that's the you know this fight between the younger generation and</p>\n<p>the old guard is definitely coming into play. Um Ohio is really interesting. I love shared Brown. He is you know the workingclass warrior uh that we all uh adore and you know probably the only candidate who I think could win that Ohio seat back. um linking this to what we were just talking about with Epstein. The guy who he's running against, John Hustad, I think that's how you pronounce it, apparently took $100,000 from Epstein. And now Sherid Brown is featuring that in his ads. And that'll be interesting to see. I think it's the only one in the country, at least um on</p>\n<p>the congressional or Senate level, where we're talking about a potential Epstein angle um to it, and we'll see how unpopular that actually makes you. Um, so I think Ohio is, you know, it's a red state now, but Chered Brown is the guy who could do it. Um, you know, Texas I still think is a total pipe dream, um, to be able to do that. And people are really interested in what's going on in Iowa. Um, I was, you know, Rob Sand who's running for governor, feeling good. Nathan Sage just dropped out of the Democratic primary on the Senate</p>\n<p>side and endorsed Josh Turk, uh, who is a very cool and interesting candidate. It has an amazing story. Um, so you know, those are just some places I guess that I'm paying attention, but it is the first time that I've felt like there could be a blue wave. You know, Brian and I have been having those conversations like every young, you know, set of parents. Where would it be</p>\n<p><strong>[45:25]</strong></p>\n<p>better to live, right? Like >> where would it be better to raise kids? I know that you're a big proponent of the Florida model. Um, I couldn't live in Florida under a Governor Dantis. I I just couldn't get there. But it was the first time that I even allowed myself to say, well, like what if David Jolly did win, right? Like what what if it is such a big blue wave that you have a Democrat in the governor's mansion in Florida? Does that change calculus about being in a state like that? And I think that it does. I I'm not I'm not predicting that we have that big of a wave, but those</p>\n<p>conversations don't feel insane to people when you're flipping Trump plus 25 seats, right? in states like Texas and Louisiana. Um, you know, the map is getting bluer and it's lighting up brighter and Democrats at this moment have the enthusiasm on our side showing up for these special elections. We're going to show up on election day. The question will be, you know, what Trump on the trail will do. I happen to think it's just going to make us show up more because he's like that big flashing sign</p>\n<p>that we just can't stand. and midterm voters um on the right don't tend to be as passionate as certainly the party that's trying to get back into power. Um but that's I guess my overview. >> So you mentioned Florida and obviously that's I'm I'm a resident of Florida. What do you think of a matchup between Lieutenant Colonel Vinman who's announced he's running in the Democratic primary for the special election seat for Rubio seat versus the AG appointed to Rubio Senate seat by Governor Dantis?</p>\n<p>Do you think Vinman has a shot? >> I have not looked at polling on that. I think the Vinman's um both of them are very compelling characters. I don't know. It's a tough one because in a lot of ways I think that they're or he's representative of, you know, a conversation about democracy and the rule of law and >> like a lot of those lines of argumentation that we didn't win on previously if you do you know what I'm saying? So</p>\n<p>>> that part is tough for me. Um, but ethically, morally speaking, like the kind of person that I would like to see uh going to Washington. Yeah, 100%. I think that's great. But, you know, it's interesting to see Dantis, who was really on the outs with Trump, obviously challenging him in the last primary, Meatball Ron, I think is what he called him. Apparently, he was playing golf with Trump just a few days ago. And you can see a move to bring the coalition</p>\n<p>back together. Trump is not picking as many fights internally as he was, except if you speak out about the Epstein files. Like he's endorsing everybody in these primaries instead of picking sides. Um, and I think Ashley Moody will definitely appeal to a lot of normies. She's an establishment favorite kind of person. And there are still a lot of</p>\n<p><strong>[48:25]</strong></p>\n<p>Republicans out there that are begging for a world in which there's a return to normaly. I think just as people underestimate Governor Nuome, I think they underestimate Governor DeSantis. I think you learn a lot running a campaign. You have an infrastructure that could be fired up pretty easily. He comes across I think he's I think he comes across as more of a leader than either Rubio or Vance. Um I I I would not count him out. And with respect to Inman, I think he's an American hero. I follow Florida politics semi- closely. Unfortunately, I think it's going to be</p>\n<p>an impeachment nostalgia campaign, and I don't think that's what Flityians care about. I think unfortunately that race is going to be won or lost on boring [ __ ] like uh insurance, which a third of Florida homeowners can't get right now, and HOA fees that have skyrocketed and seniors are having to give up their condos because of regulation. I mean, it's basically you have millions and millions of people in Florida who move down there thinking they'd spend the rest of their lives down there who are having to sell their homes and leave because of uh the insurance market has</p>\n<p>totally turned against them and because of um HOA fe I mean it's just it sounds I'm bored talking about it but I think that is what's going to >> well that's what wins elections right in your day-to-day life. >> Yeah. I think there'll be a lot of great ads about Lieutenant Colonel Linman and his his uniform and talking about how brave he is. And that's not what that's not what's going to turn people out. People are going to think, \"Okay, >> well, it's a great side dish, but the entree has to be >> improving to lower your cost of living</p>\n<p>to make sure you have the insurance that you need.\" I was actually we last year I interviewed David Jolly for the pod who's running on the Democratic side uh for >> governor and he kept emphasizing that because you know he's a Republican turned Democrat and that's the story that people like us always want to talk about like you know when did it hit you that the Republicans are so evil right that you had to come over to the other side and he was like I've got a plan to lower people's taxes right to make sure that you can afford a home like that's what people are showing up for it is a</p>\n<p>luxury to be a quote unquote democracy voter unless you can connect the dots, which I think that we can, between the assault on democracy and your cost of living cuz that is available through the tariffs and all of these abuses with what's going on with immigration enforcement because immigrants make us more prosperous. They make the and they make the country better. They are a net contributor, right? They are the ones who are actually paying more into the system. But you're you're totally right. will be paying attention to the campaign as it uh rolls out. But Vinman is a hero</p>\n<p>who needs an insurance plan. >> There you go. >> Like for actual insurance, not like cuz something's going to happen to it. >> All right, before we go, if you're watching us on YouTube, please make sure you hit subscribe. That's all for this episode. Thank you for listening to Raging Moderates.</p>", "cleanup_applied": false, "cleanup_reason": "legacy_or_disabled"}