{"video_id": "oPlEda_BRHg", "title": "Epstein Scandal TURNS on Trump as Howard Lutnick Gets Caught LYING", "link": "https://www.youtube.com/watch?v=oPlEda_BRHg", "published": "2026-02-12T09:01:12+00:00", "summary": "Scott Galloway and Jessica Tarlov sit down with Yale leadership scholar Jeff Sonnenfeld to unpack his new book, Trump’s Ten Commandments. They dive into Trump’s racist stunts like posting the recent AI Obama video to his “tribal chieftain” style of centralizing power. Jeff breaks down how Trump bends rules, gets things done outside traditional channels, and uses distraction and propaganda to shift the public's focus. \n\nProf G also talks with Prof Sonnenfeld about the Resist and Unsubscribe Movement, and what other things that business leaders can do right now to spark collective action.\n\nFor more on Scott's Resist and Unsubscribe movement: resistandunsubscribe.com\n\nFollow Jessica Tarlov, @JessicaTarlov. \nFollow Prof G, @profgalloway.\nFollow Raging Moderates, @RagingModeratesPod.\n\n#scottgalloway #politics #trump #jessicatarlov #jeffsonnenfeld #trumpstencommandments #venezuela #immigration #elections #democraticparty #democrats #midtermelections #electioninterference #january6th #2020elections #dhs #kristinoem #sarahpalin #trentlott #economicstrike #generalstrike #resistandunsubscribe #resistance #ceo #businessroundtable\n \nPlease support this channel by subscribing here: www.youtube.com/@RagingModerates", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=oPlEda_BRHg\">https://www.youtube.com/watch?v=oPlEda_BRHg</a></p>\n<h2>Transcript</h2>\n<p>Welcome to Raging Moderates. I&#x27;m Scott Galloway &gt;&gt; and I&#x27;m Jessica Tarlov. &gt;&gt; We&#x27;re joined today by Jeffrey Sonninfeld, a longtime Yale leadership scholar and one of Trump&#x27;s most consistent public critics who has written a new book called Trump&#x27;s Ten Commandments, also a role model of mine. Jeff is an academic who decided he wanted to have a lot of impact outside of the four walls of his home institution Yale and has just a big footprint and hosts these kind of agoras of uh CEOs and in this moment his voice has never been louder and more resonant.</p>\n<p>Uh anyways Jeff thanks very much uh thanks so much for joining us today. &gt;&gt; Uh Scott Jesse it&#x27;s an honor to to rejoin you. Thank you very much. And talking about having an impact to be on the walls of academia, I can&#x27;t think of any better role model than you. &gt;&gt; Oh, you guys are adorable. There we go. &gt;&gt; We&#x27;ll fight. We&#x27;ll still fight, but about a fellow raging moderate. &gt;&gt; There you go. &gt;&gt; It&#x27;s a good club. &gt;&gt; Let&#x27;s bust right into it. Last week, Trump posted a racist AI generated video of Barack and Michelle Obama. How does this kind of provocation fit</p>\n<p>into the patterns you identify in Trump&#x27;s Ten Commandments, your new book? &gt;&gt; Well, thanks so much. And we talk about in there is as various elements such as divide and conquer, as you know, in terms of how he divides uh business communities and and and influential uh institutions uh so that they can be subject to different tyades of v vindictiveness. Uh, and there&#x27;s a little bit of that at play here, but in particular, we have a chapter in there called the wall of sound that u that Scott, even you are perhaps too young to</p>\n<p>remember, but I bet you do. As the Phil Spectre, very controversial uh bad guy record producer who uh uh was known for having so many instruments blaring at once in this the same note, same harmony, is that it&#x27;s a it&#x27;s a a kind of a a distraction device that Trump has. Some people call it the the shiny object. Uh some people will uh you know call it the wag the tail and and and applying it to Venezuela, but it&#x27;s a way of uh of distracting no doubt about it that this is bigoted, hostile and racially offensive to put it mildly. Uh</p>\n<p>th those cartoons were not some subtle dog whistle. It was screaming racial uh venom at at the top of lungs. However, wherever he comes out on racial issues, he&#x27;s using it strategically. Even though it comes out angry as as a midnight post, which supposedly some other staffer was on his Truth Social account at the exact second at midnight, but nonetheless, people think wrongly that these are impulsive decisions, these are uh deliberate strategic devices. The Venezuela attack, however you feel about</p>\n<p>drug trafficking, the idea of Chinese and Russian ships surrounding Venezuela, that didn&#x27;t work. and blaming the oil industry execs when they to a person told me they had nothing to do with it, no interest in it. Is that he just, you know, looking for ways to change the subject off of Epstein, affordability, healthc care issues, uh that he tried the Venezuela of Greenland the week after that. There&#x27;s nothing particularly ownorous or threatening that we had to go in to start to threaten the possible military and economic sanctions for Greenland. uh the the the seizing these um election ballots uh out of South</p>\n<p>Falton County. These are desperate efforts to change the subject from domestic largely domestic issues he doesn&#x27;t want to talk about and using race is always a last resort of scoundrels and he&#x27;s not above that. &gt;&gt; Before I just toss it to Jess, I&#x27;d love to know based on your book and your research here, how do we of the ten commandments of Trump, how do we break the tablets? I think a lot of us are frustrated at what is seen as fairly anemic push back by Democrats or a lot of us are just frustrated like what do I</p>\n<p>do? Do you have any thoughts on what the most effective push back and the format and the mediums and the message? &gt;&gt; I&#x27;m so glad Jesse if we take the next two hours to talk about that great question. It&#x27;s a big one. &gt;&gt; I&#x27;m in it to win it. You guys go. That&#x27;s the essence here is u we have these these 10 issues that everything all the power centralized through him. He uses a sleeper effect which is a a propaganda device that was actually studied here at Yale we&#x27;re sorry to say in the 40s and 50s trying to learn from what uh the third Reich was doing in the 30s is</p>\n<p>repeating false information repeat over and over. There&#x27;s a lot of devices in there that you would recognize as manipulative mass communications tools and strategy devices. The most important thing is though what you asked which is instead of labeling him as as an autocrat as as a demagogue or as a as a psychotic sociopath or all the different labels that different disciplines throw out there which which however accurate they may or may not be they don&#x27;t tell us what to do and how to respond to it. It&#x27;s like you don&#x27;t you don&#x27;t make any progress calling an alcoholic a drunk. &gt;&gt; Getting past the fingerpointing and</p>\n<p>trying to figure out what we do about it. It&#x27;s collective action. That&#x27;s how you take down a bully. Uh we have seen it happen successfully in August of 2017 after the tragic killing of an innocent young woman peaceful protester in Charlottesville in August 2017. Uh Trump went on the air that was a Friday night on the air Saturday and made a a very underwhelming statement of sympathy and then somebody whomever Steven Miller I don&#x27;t know advised him to go back into it again the next day Sunday and came out with the equivocation of the white nationalist who murdered this woman being you know good on both sides with</p>\n<p>the quivocation statement that led Ken Fraser of MC one of four black CEOs leading a Fortune 500 firm at the time to say I&#x27;ve had it I&#x27;m out and he told his board you do what you want I can&#x27;t speak for MC I&#x27;m speaking for me and the board fortunately backed is there&#x27;s a slight delay the next day and we started calling through to all different offices of corporate America and that led to a mass exodus a stampede left the business advisory councils to this day the business roundt never made a statement on this but that was a grassroots exit that made a huge difference they walked away from Trump and they didn&#x27;t come back until in 2021</p>\n<p>and January uh there&#x27;s other than Elon Musk there&#x27;s no support in the US business community on the trade front we saw the national association of manufacturers It was a pretty much arc right-wing group that was not interested in civil rights issues, wasn&#x27;t interested in the Vietnam War, wasn&#x27;t interested in environmental concerns, and that&#x27;s why the business roundt was formed as a reaction to them of all things that that showed collective action. Uh, believe it or not, we actually unified 700 college and university presidents to take a stand midappril last spring after Harvard and Colombia and other schools were being</p>\n<p>sequentially attacked. We saw the anemic response of law firms and thought, well, can&#x27;t university world do better. Despite the the nonsense uh the BS of these institutional neutrality statements, these college presidents, university presidents uh overrode their own boards of trustees and came out with a very strong collective set of statements and those edicts stopped. So, it&#x27;s collective action that does it. But it can&#x27;t just be the CEOs. I asked the CEOs, why aren&#x27;t we hearing from more of you? and they say, &quot;Where are the clergy?&quot; Until Minneapolis, if your life depended on it, you couldn&#x27;t name me</p>\n<p>five clergy, interfaith clergy, linking arms the way they did in the 60s and 70s to take a stand. Even now, with the exception of Minneapolis, we don&#x27;t see the trade unions speaking out. We don&#x27;t see the professional associations and and again, we talk about the campuses. Uh these voices which were very important in the 60s to be across sectors are somewhat muted now. Jos &gt;&gt; um I that was all really interesting and now I have many directions that I want to go in but I I want to go back to something that you said in your first answer and you mentioned Epstein which is the kind of topic dour right now and</p>\n<p>as we&#x27;re recording this commerce secretary Howard Lutnik is testifying um before the Senate uh he had a relationship with Jeffrey Epstein he claimed publicly that he didn&#x27;t talk to him after 2005 Senator Van Holland kind of has him dead to rights on that and I want to play this clip and then get your response as to what you think Trump&#x27;s leadership style at this moment is going to lead him to do. So, let&#x27;s look at that. I &gt;&gt; I think you understand the root of concern here. It&#x27;s the way you described very emphatically your first encounter</p>\n<p>with him in his apartment, said you were disgusted, would never have any contact with him again. Did you in fact make the visit to Jeffrey Epstein&#x27;s private island? &gt;&gt; I did have lunch with him as I was on a boat going across on a family vacation. My wife was with me as were my four children and nannies. I had another couple with they were there as well with their children and we had lunch on the island. That is true for an hour and we</p>\n<p>left with all of my children with my nannies and my wife all together. We were on family vacation. We were not apart to suggest there was anything unoured about that in 2012. I don&#x27;t I don&#x27;t recall why we did it. But &gt;&gt; Mr. Secretary, again, &gt;&gt; so I just want to note this is after Jeffrey Abstein is a registered sex offender. Letic said that he didn&#x27;t interface with him after 2005. Based upon what you know about Trump&#x27;s view and his leadership style, how do you think that he&#x27;s going to handle having a</p>\n<p>cabinet secretary caught in this kind of lie and the attention that it brings to the administration? &gt;&gt; Well, Trump doesn&#x27;t ever apologize as we see with the racial situation. And we had somebody uh Trent Lot, if anybody remembers that name, who was the Senate majority leader, Republican Senate Majority Leader, made a a quote unquote off-color joke back in I don&#x27;t think 2004 or so, saying that um if only STM Thurman had won in 1948 for president. That was enough to force his resignation. We saw people such as Wilbur Mills, the chairman of the Ways</p>\n<p>and Means Committee on a indiscretion doesn&#x27;t compare to these things or u or Dennis Hasser, N Gingrich, uh the Bob Livingston, former Republican speakers of the House all had to resign for things. There was shame not that long ago. We saw shame still matter and and what&#x27;s happened here is atrocious. There&#x27;s we have a chapter in there on on how he moves away from losers. uh that he&#x27;s decided that Giuliani and whomever else uh uh Sarah Palin are too much of a liability for him. He me he doesn&#x27;t have a a two-way loyalty. He doesn&#x27;t mind</p>\n<p>cutting things off. The challenge here, which is such a good question, Jesse, is we would predict from that chapter that he would drop Lutnik. I mean, a lot of CEOs tell us after they shake hands with Howard Lutnik, now they want to wash their hands. I mean, obviously they feel soiled. This guy&#x27;s reputation is in the sewer. He has overtly lied. You know, on that clip you showed, it doesn&#x27;t demonstrate whether or not he actually perjured himself under oath, but we do know that he said repeatedly in recently to the media that, as you pointed out, was 2005, he had no more contact with that disgusting person. And now we see</p>\n<p>that he not only built a house next door to him, uh, but he was investing in businesses for years later. He he stayed in contact for 12 years past. He told us he&#x27;d stopped all contact. and apparent if you take a look at the emails suggesting there was a trip to the island. We don&#x27;t actually see the trip. We see the before and after. I don&#x27;t know. But is that if he takes the move on Lutnik and pushes him out, which he should, does that start the quote unquote proverbial slippery slope where all the indiscretions of Hegsth and and others start to spiral out of control? I think it&#x27;s possible that um he could</p>\n<p>lose Lutnik. Lutnik is not popular on the cabinet. Obviously, this would make Secretary of Treasury Scott Besson&#x27;s day to get rid of Lutnik and maybe take Bill Py with him. &gt;&gt; I was going to say I think he wants PY out out too. &gt;&gt; Yeah, they&#x27;d like to send those guys back to the bowling alley. I mean, this is a lot of CEOs say Howard Lutnik is the Fred Flintstone of finance and and that these days would be a compliment. He&#x27;s bringing nothing but shame. But the thing is with Trump himself with 38,000 redacted mentions uh in this report, how</p>\n<p>does he stop it from spreading? It&#x27;s a great question. We would predict that he&#x27;d figure out a way of getting Lutnik out of there. U but u he will first try for a while the denial just like he said just a few months ago that this is a Democratic hoax. There&#x27;s nothing to the Epstein files after on the campaign trail saying this is the this is the answer to the Democrats uh pedophilia uh fraud. &gt;&gt; Yeah, I should check Poly Market for the odds that we strike Iran tonight because I know that&#x27;s usually the go-to distraction. Um &gt;&gt; you&#x27;re exactly right. It&#x27;s something</p>\n<p>like that. Maybe they they need to to worry about this in in in Montaco or Likensstein or or Luxembourg, you know, or some other area of great concern to Donald Trump that he&#x27;ll raid to distract us as a major concern or what blue city he&#x27;s going to come after. &gt;&gt; Well, I want to just say what you said about a shameless administration is so important and run by a man who doesn&#x27;t feel shame. So, as regular people on the ground trying to navigate this, how do you think the American people, and this links obviously to what Scott is doing</p>\n<p>with uh people unsubscribing from these services, companies that don&#x27;t seem to be taking a stand at anything against the administration, but how do you think that we can create an environment where some sense of shame comes back to our elected officials? Obviously, winning elections is part of that. Um, but in the day-to-day, &gt;&gt; well, uh, here&#x27;s the challenge is people watching CNN or MS Now or reading The Atlantic and trottling to themselves, &quot;This guy&#x27;s such a loser. He&#x27;s so stupid.&quot; U, just because Trump uh, often</p>\n<p>appears uh, convincingly ignorant doesn&#x27;t mean he&#x27;s stupid. He&#x27;s dumb as a fox. He has incredible street savvy. people who keep predicting his demise ever since, you know, he attacked the Pope and and John McCain and and people who are PSWs that he considered losers. All these third rails that he&#x27;s taken on and survived, uh they need to recognize that it&#x27;s going to take something more. The collective action is important part. Uh but we also saw that uh this disengagement that Scott talks about is part of an even larger spirit of voice.</p>\n<p>When I talk to CEOs about taking a stand right now, they&#x27;re afraid. You know, he look who he&#x27;s attacked. He&#x27;s attacked Jamie Diamond, the most feared and revered finance in the world, the CEO of JP Morgan. Uh he&#x27;s attacked Brian Moyahan of Bank of America. He&#x27;s he&#x27;s attacked David Solomon at Goldman Sachs, stepping away from finance. He&#x27;s a attacked Coca-Cola. What could that Coke is the most universal expression uh globally as Scott knows as a great marketer? Then the expression okay is expression Coke. He&#x27;s taken on Coca-Cola. He&#x27;s taken on Delta Airlines. He&#x27;s taken on um Harley-Davidson.</p>\n<p>Harley, what could be a more iconic American brand? That their very mascot is uh the symbol is is the u is the bald eagle. Their customers, the riders lead slightly MAGA. their workforce slightly anti-MAGA. The CEO just tries to pilot it down the center of the road because of reciprocal trade barriers from Europe against Trump. Harley had to shut down its plant because all of its bikes were made in in not just North America, made in the US. They had to shut down a plant in Kansas City, open one in Thailand. Trump took that as a personal offense and said, &quot;Don&#x27;t buy Harley the stock plumber.&quot; They fired the CEO, Matt</p>\n<p>Levitage. Check it out. So, you know, that&#x27;s a cautionary tale to CEOs. You can&#x27;t act alone. But like Ken Frasier did is you can stimulate, you can spark as uh the last line in in in Ipsson&#x27;s great play enemy the people is the strongest person in the world. He actually said the strongest man but he meant the strongest person in the world is the person who can stand alone is somebody who can set a model. We need that but we also need that collective action. What else do we need? The CEOs who want to do something say you know we&#x27;re not oligarchs. only three to five percent are the people that that Scott was one of the first to go after in</p>\n<p>terms of this oligarchic control of tech titans is 97 98% of them are hired hands they&#x27;re salaried employees some of them overly salaried you know maybe some too well paid but still they they say we have to respond to constituents but who do they hear from they hear from red state treasurers they hear from red state attorneys general saying our pensioners money in our state we want you to either be silent or be you know mildly somewhat pro MAGA the where the blue state attorneys general have been weirdly quiet quiet not to mention as we mentioned the clergy everybody else so we need to have that kind of pressure</p>\n<p>and as Scott talks about and Jesse was just echoing the consumer boycotts are just one part there&#x27;s a lot of pressure that goes on whether or not because oddly enough a lot of consumer goods companies are not always the first to move these days but they do feel the sensitivity of public pressure so going after consumer goods companies matters a lot &gt;&gt; jeeoff you know this you&#x27;re a role model of mine we share a lot we&#x27;re both academics we both want to have and enjoy having impact outside of the classroom. were both Jews. And I don&#x27;t know, I I see a lot of parallels not with Nazi</p>\n<p>Germany, but with late stage Weimar Republic Germany that I find very alarming what&#x27;s going on in the US right now. And where I I don&#x27;t agree, I don&#x27;t think Trump gives a about the clergy or unions who he listens to are the people that you convene at a greater scale and density than anyone in the world. I&#x27;ve been to your CEO events. You bring together more powerful CEOs in a room than anyone in the world. I think more than Davos in terms of concentration of CEOs of Fortune 500.</p>\n<p>And I&#x27;m empathetic to the notion that nobody wants to go first because if you go first, a good autocrat smacks you back. You do have an obligation to your shareholders. So, everyone is reticent to go first. I get that. What we need is someone at the center of these Fortune 500 CEOs who convinces them to take collective action. I can&#x27;t think of anyone who is more ripe, capable, and well positioned to be that leader than you. What do we need to do? What is required to help Jeffrey</p>\n<p>Sonnenfeld get 10, 50, 100 of the Fortune 500 cos, the people that the president listens to? He&#x27;s only backed away from threats to annex Greenland or tariffs when he hears from the markets or CEOs. You&#x27;re their Yoda. You&#x27;re their whisperer. What is it going to take for Jeffrey Sonnenfeld to get collective action from Fortune 500 CEOs? &gt;&gt; Scott, we have done it repeatedly. uh for example uh the the 2020 elections that Trump says were fraudulent. was the</p>\n<p>absentee ballots leaned heavily uh towards Biden whereas in in person polling was leaning towards Trump and that&#x27;s because the people who believed in science were less likely to go uh to the polling places because of co at the time uh count after count 64 court decisions endless audits and recounts and things and we convened the top 100 CEOs on 12 hours notice to come out with a a stand congratulating the winners to demand a speedy transfer of hour. Uh that made a big difference on the roll backs in 17 states on these crazy voting</p>\n<p>rights restrictions. We brought them together repeatedly. So three or four times we we brought these CEOs together when it when it really mattered. They will. But they also hear from their constituents. You&#x27;re right. Trump doesn&#x27;t care what the clergy have to say or he wouldn&#x27;t have made such a fool of himself at the national prayer breakfast on Friday. But he but those CEOs care what the clergy. They care what the trade unions. They care what the investors, what the community activists, what the campus voices, they care about all these stakeholders. It was just five, six years ago they&#x27;re talking about stakeholder capitalism. Well, where are those stakeholders? They&#x27;re</p>\n<p>sitting home eating their steak, watching TV and chroling expecting Trump&#x27;s imminent demise, and they&#x27;re wrong. They have to speak out. Then the CEOs will respond. CEOs just can&#x27;t say, &quot;Well, it&#x27;s my patriotism, my personal values, my ethics.&quot; No. Unless they&#x27;re one of those handful of oligarchs, they&#x27;re a custodian of other people&#x27;s resources. they need to hear from those other people. As um Toqueville said when he came to the country in 1840, he wrote democracy in America, a French jurist. He wondered why do our laws work. He said it&#x27;s not because of the tightness of the laws. It&#x27;s the looseness of the laws. They adapt the circumstances, but for them to work, what Toqueville said,</p>\n<p>it involves trust in the community. That means business leaders, he specified business leaders and other leaders of the community have to certify the truth. Toqueeville called it social capital. People think that&#x27;s a newly invented term. Toefield coined it in 1840 and he said social capital is as important as financial capital. These people are the pillars. They are the most respected. Sadly, legislators, federal, state, local, the media, academia, clergy have all lost standing in American society. Business leaders are still ascendant. My CEO in the Alamman trust surveys just</p>\n<p>last week and do still the strongest, most trusted voice as my CEO. We do need to hear from them. We have to give them license to speak for us speaking up and telling them to speak. They work for us. Tell them so. Jeffrey Sonnenfeld is a longtime Yale leadership scholar who has written a new book called Trump&#x27;s Ten Commandments and I would propose is the leader we need right now. Uh, Professor Sonnenfeld was really happy to hear from you and appreciate your time. Well, &gt;&gt; thank you very much, folks. Thanks, Jesse. Thanks, Scott.</p>\n<p>&gt;&gt; Thanks.</p>", "chapters_count": 0}