{"video_id": "cXLmP8zql9E", "title": "The Overlooked Tech Dangers That Will Define 2026 | Cal Newport", "link": "https://www.youtube.com/watch?v=cXLmP8zql9E", "published": "2026-01-19T11:00:00+00:00", "summary": "Cal Newport explains the overlooked tech dangers that will define 2026 in episode 388 of the Deep Questions podcast. \n\nBuy Cal Newport's latest book, “Slow Productivity” at www.calnewport.com/slow \n\nDespite some initial skepticism, Jonathan Haidt’s crusade against kids using smartphones has been more or less completely vindicated. Which got us thinking: what’s he worried about next? In the ideas segment, Cal looks closer at three new technological harms that Haidt has begun sounding the alarm about. Then, in the practices segment, he details a somewhat eccentric technology strategy that he and his wife have deployed in their own home to keep their kids away from smartphones. \n\nDownload my FREE Deep Life Guide HERE: https://bit.ly/3QBIcug\n\nListen to Episode Here:  https://www.thedeeplife.com/listen/\n\nGet your questions answered by Cal! Here’s the link: https://bit.ly/3U3sTvo\n\nMentioned Books:\n\n20th Century Fox (Scott Eyman)\nIn the Shadow of Man (Jane Goodall)\n\nLinks:\nBuy Cal’s latest book, “Slow Productivity” at www.calnewport.com/slow \nGet a signed copy of Cal’s “Slow Productivity” at https://peoplesbooktakoma.com/event/cal-newport/ \nCal’s monthly book directory: bramses.notion.site/059db2641def4a88988b4d2cee4657ba?\nhttps://docs.google.com/document/d/1w-HOfseF2wF9YIpXwUUtP65-olnkPyWcgF5BiAtBEy0/edit?tab=t.0\nhttps://x.com/kevinroose/status/2001464352491311196\nhttps://www.afterbabel.com/p/smartphone -gambling-is-a-disaster\nhttps://www.fanduel.com/\nhttps://www.afterbabel.com/p/its-not-just-a-game-anymore\nhttps://www.afterbabel.com/p/dont-give-your-child-an-ai-companion\nhttps://futurism.com/artificial-intelligence/ai-toys-danger\nhttps://www.instagram.com/reel/DO_7TzvEkzO/?hl=en\nhttps://tincan.kids/\nhttps://www.punkt.ch/products/mp02-4g-minimalist-phone\nhttps://www.aliexpress.us/item/3256810412310495.html\nhttps://www.nintendo.com/us/store/products/nintendo-switch-lite-turquoise/\n\nThanks to our Sponsors: \n\nhttps://www.1password.com/deep\nhttps://www.cozyearth.com (Use code “DEEP”)\nhttps://www.notion.com/cal\nhttps://www.calderalab.com/deep\n\n0:00 What’s worrying Jon Haidt?\n45:20 Should you buy a landline (Cal just did…)\n1:03:22 Can we put the social media and video game genies back in their lamp?\n1:07:28 Can an artist avoid using social media?\n1:11:00 Cal responds to comments\n1:13:58 Cal gives his weekly reading update \n\nConnect with Cal Newport:\n\n🔴Visit Cal's BLOG and website:             https://calnewport.com/blog/\n🔴Check out Cal's books:                         https://calnewport.com/writing/\n🔴Check out The Deep Life:                     https://thedeeplife.com\n\nAbout Cal Newport:\nCal Newport is a computer science professor at Georgetown University. In addition to his academic research, he writes about the intersection of digital technology and culture. Cal's particularly interested in our struggle to deploy these tools in ways that support instead of subvert the things we care about in both our personal and professional lives.\n\nCal is a New York Times bestselling author of seven books, including, most recently, A World Without Email, Digital Minimalism, and Deep Work. He's also the creator of The Time-Block Planner.\n\nThe videos are considered to be used under the \"Fair Use Doctrine\" of United States Copyright Law, Title 17 U.S. Code Sections 107-118. Videos are used for editorial and educational purposes only and I do not claim ownership of any original video content. I don't use said video clips in advertisements, marketing or for direct financial gain. All video content in each clip is considered owned by the individual broadcast companies.\n\n#CalNewport #DeepWork #DeepLife #DeepQuestions #TimeblockPlanner\n#WorldWithoutEmail #DeepQuestionsPodcast", "transcript_html": "<p><strong>YouTube:</strong> <a href=\"https://www.youtube.com/watch?v=cXLmP8zql9E\">https://www.youtube.com/watch?v=cXLmP8zql9E</a></p>\n<h2>What’s worrying Jon Haidt?</h2>\n<p>Two years ago, the NYU social scientist Jonathan Height exploded into the public conversation with the publication of his book, The Anxious Generation. This book argued that smartphones had helped trigger a mental health epidemic in kids and teenagers. Now, this book was a massive bestseller. It sold over a million copies by the end of 2024 and many more since. Now, the anxious generation was a hit in large part because height was giving data to back up something that most parents already felt intuitively. They saw what happened</p>\n<p>to their own kids when they got their hands on their phones. They knew that it was a problem. And John Height had the receipts to prove that they were right. Not everyone, however, immediately embraced Height&#x27;s message. Many elite journalists and academics were suspicious. uh they thought his message was too simple and it was too neat and that it diverted attention from the types of harms like uh structural racism and economic inequality that they were more interested in highlighting. Um a dismissive review of the anxious generation that appeared in the journal Nature for example claimed that Height&#x27;s</p>\n<p>argument was quote not supported by science end quote and then warned that quote rising hysteria could distract us from tackling the real causes end quote. But these critics had a problem. height knew what he was talking about. Starting in 2019, he began constructing with the help of the demographer uh Gene Twangi and the researcher Zach Roush a massive annotated bibliography of every serious paper published about the impact of phones on teens. In fact, I&#x27;ll load this bibliography on the screen right now for</p>\n<p>people who are watching instead of just listening. What I&#x27;m showing you right now, this is just a table of contents of all the different studies that are in here. These are all just categories of studies. And if you look in here a little bit closer, you&#x27;ll see uh they&#x27;re summarizing for all these studies. Uh they&#x27;ll have a summary of what&#x27;s going on. They&#x27;ll have the abstract. They&#x27;ll have comments, reactions to the studies, reactions to people responding to it, key graphs from within it, etc. What I&#x27;m trying to say here is height had become one of the world&#x27;s experts on this research literature. So he wasn&#x27;t just</p>\n<p>going with his gut when he wrote the anxious generation. The harms he described were very carefully and in a nuanced fashion being measured by real researchers. Now, here&#x27;s the thing. Soon after The Anxious Generation came out, it became harder and harder to ignore the reality that height seemed like he was right. One of the clearest validations was when last year many schools began banning phones and they saw immediate positive improvements not just in learning but in their kids social interactions and in their mental health. So, we are currently arriving at a moment in which John Height, for all</p>\n<p>intents and purposes, has been vindicated. Perhaps nothing captures this more clearly than uh the following tweet that I&#x27;m going to show you here on the screen. I&#x27;ll load it up here. Uh this is from the technology journalist Kevin Roose, who has long been in the John Height skeptic camp, but just recently he tweeted the following. I confess I was not totally convinced that the phone bands would work, but early evidence suggests a total John Height victory. The link in this tweet was to an article in New York Magazine, another former hotbed of anti-Hight sentiment that was</p>\n<p>titled, &quot;How the phone ban uh saved high school.&quot; Now, all this leads to the following conclusion. when it comes to kids and phones, height was ahead of the curve in noticing the dangers and he was right about the warnings he raised. All right, so this story by itself is interesting, but to me it also points to a really urgent and important follow-up question. If height was so precient about phones, what technologies worry him now? This is what I want to explore in today&#x27;s idea</p>\n<p>segment. Uh, we went back through all of the articles that height has published since the anxious generation came out and we pulled out three new technologies that height and his collaborators are worried about. Right? So, if you want to sidestep the next big tech disaster either in your own life, the life of your kids, then you need to listen to this segment. And then when we&#x27;re done with that and we move on to our practices segment, I&#x27;m going to turn the tension back to my own life. I&#x27;m going to bring you up to speed on some of the eccentric strategies that my wife and I have deployed to help uh avoid giving our own kids smartphones. And I&#x27;m going to give you a hint. The unifying thread</p>\n<p>to these eentric strategies is our own childhood from the 1990s. All right, so we have a lot to get to today. As always, I&#x27;m Cal Newport and this is Deep Questions, the show about the fight for depth in an increasingly distracted world. We&#x27;ll get started right after the music. All right. So, we&#x27;re going to start here with the the first article that we pulled from Heights collection about a</p>\n<p>new technological danger to be worried about. The title of this article is smartphone gambling is a disaster. We aren&#x27;t meant to have a casino in our pockets. This was actually written by two collaborators of height, Jonathan Cohen and Isaac Rose Burman. All right. So, what I&#x27;m going to do here is uh I have the article. I&#x27;ll have it on the screen for those who are watching instead of just listening. Um I&#x27;m going to go through some key ideas and numbers from this article that try to give you a sense of what&#x27;s going on here. So, let&#x27;s</p>\n<p>start with the notion of the extent of the digital gambling problem. So, how much digital gambling is going on? So, I&#x27;m going to read here from the article. The advent of smartphones in 2007 and a smart Supreme Court decision in 2018 opened the door to fully frictionless 24/7 legal gambling. In the last 7 years, seven states have legalized online casino gambling known as i gaming. And 30 states plus Washington DC have legalized online sports betting.</p>\n<p>Quasi legal forms of casino sports gambling have exploded across the country. Americans now gamble hundreds of millions of dollars a day on sites like DraftKings and FanDuel. Far more if you include lottery tickets, prediction markets, and mim or crypto speculation. All right, so that&#x27;s to say there is uh a lot more access to online gambling. Um let&#x27;s read about the numbers here. I want to get more specific. More money is being gambled because more people have gambling readily available. This is</p>\n<p>particularly true for sports betting. 30% of American men and 22% of American women now have a sports betting account, including nearly half of men ages 18 to 49. A quarter of men and 12% of women now bet on sports three or more times a week. And an NCAA survey reported almost 70% of college students living on campus bet on sports. Let&#x27;s just sit with those numbers for a second because they&#x27;re actually quite staggering if we put those percentages into context. Think</p>\n<p>about that. 30% of all men in America have a sports betting account. Uh if you go to 18 to 49, so you get rid of uh people who are older. For men that jumps up to half, half of men under 50 have a sports betting account. It is affecting younger people. the NCAA finding I really got to underscore that 70% of college students who live on campus are betting on sports. Right? So it we really got to emphasize the extent uh to which this has really become a massive a</p>\n<p>massive activity in our country. All right, I want to give you a couple more stats here. They&#x27;re not available in as many states. I gaming and online lottery tickets are also gaining popularity. A recent report found that in Pennsylvania, which has online lottery tickets, i gaming and online sports betting um which has on oh which has online lottery tickets, i gaming and online sports betting, the number of online gamblers nearly doubled between 2001 and 2024 and only 40% of betterers were gambling on sports. Online gambling of all types is most prevalent among young people. A 2022 uh National Council on Problem Gambling</p>\n<p>press release reported that 60% of high schoolers had gambled in the last year. All right. Um this is a big deal as 60% of high schoolers have gambled in the last year. All right. So let&#x27;s try to figure out why this is happening. Um, Height and his collaborators here point to a couple uh, powerful reasons. All right, I&#x27;m going to read from the article again. Beyond easier access, much of the increase in online gambling is due to</p>\n<p>the fact that gambling companies have engineered their games to be ever more difficult to resist. They feature the same behavioral nudges and dopamine delivery mechanisms as social media platforms. These are not your grandparents uh, slot machines. All right, it&#x27;s important we put these two factors together. Factor number one is accessibility. It would not have been the case 20 years ago that 60% of high schoolers had gambled because that would involve them somehow getting on a Greyhound bus and making their way to Atlantic City and sneaking into a casino and going up to a blackjack table. And I guess they would have to maybe stand on each other&#x27;s</p>\n<p>shoulders with a trench coat to act like they&#x27;re older to place their bet. There&#x27;s a huge amount of friction. But once it moved to your phone and the phone is just like, &quot;Are you are you 18?&quot; Right? You&#x27;re like, &quot;Yeah, yeah, yeah, sure. Of course.&quot; uh 60% suddenly have gambled. 70% of college students are gambling because the phone made it much more easier. Again, 70% of college students weren&#x27;t going to go all the way out the foxwoods to try to go to the slot machines. But if it&#x27;s on your phone, why not? The other problem, which we just emphasized here, is that the gambling itself once it has moved on the phones meant they could use, as we just read, the same behavioral nudges and</p>\n<p>dopamine delivery mechanisms as other types of highly engaging activities, except for now there&#x27;s real money on the line. Let me read you a little bit more about this. Every part of a gambling app is designed to be fun, easy to use, and hard to quit. After a cursory age verification process, basically non-existent on some unregulated sites, betterers can deposit money as easily as buying anything else online. The apps have their own version of endless scroll with a constantly updating menu of things to bet on. Fine-tuned personalization serves up anything from</p>\n<p>Charles Barklay&#x27;s parlay of the day to Baywatch theme slots. And whenever users spend uh a while away from the app, carefully time push notifications, lure them back on for one more uh spin scroll or bet. You know what I&#x27;m going to do here? Let&#x27;s load up an actual web page of a gambling website. So, here&#x27;s the FanDuel website. Let&#x27;s get a little sense of like what this actually looks like. Look at this. Huff, huff, even more puff. Uh, here&#x27;s a bet. B bet $5, get $300 in bonus bets if you win.</p>\n<p>So, there&#x27;s lots of things pushing it here. Five 500 bonus spins, but plus get up to $1,000 back in casino bonuses. So, they&#x27;re really pushing a lot of things here. If I click on the casino link, um, which I think is crazy. Uh, don&#x27;t allow. Okay, here we go. Um, they got a casino link here where you can basically if you I put this on the screen here, Jesse, you can play blackjack. You can do spinning the wheel things. You can do uh slot machines. Crazy. Just all from your phone. You can bet all sorts of bets on sports. You can</p>\n<p>do fantasy teams and put money on the line. You can bet live on horse races. You can play against real people for cash. I mean, there&#x27;s just endless ways here that looks really fun and interesting on this website to try to get you uh to actually bet uh to bet money. So, these things are, we have to admit, really compelling. All right, so what are the harms here? Well, let me read a little bit more. Um, gambling companies have spinned heavily to attract new customers. Since</p>\n<p>legalization began in 2018, sports books have bombarded Americans with ads, paid celebrities to promote their products, and given away billions in new user promos. The message, gambling is easy, fun, and a quick way to make life more exciting. This marketing drives cultural normalization. that transforms this what was once a vice into a common daily habit, something that everyone does or should do. So, we got a lot of things coming together here which are not great, right? It&#x27;s more accessible than ever before. Um,</p>\n<p>we have it more accessible than ever before. It&#x27;s more addictively designed than ever before. And then we have a lot of ads that normalizes behaviors before like, hey, everyone should be doing this. And we&#x27;ve all heard these ads because they dominate now. For example, you&#x27;ve probably heard this Jesse, like all sports coverage. &gt;&gt; Yeah. All sports coverage is dominating from these ads. Podcast ads, you see them uh you see them basically everywhere. So what can we do about this this harm number one that height and his collaborators are pointing us towards? Well, let&#x27;s break up our recommendations into the societal level and the personal level. Um at the societal level, they recommend and I would agree with</p>\n<p>this. There really shouldn&#x27;t be online casino games. You can regulate and control games like blackjack, light slot machines, etc. much better when people have to go to a physical building and there&#x27;s friction involved. You got to actually drive and you got to park and you have to walk in and you have to go and you have to either get chips or get money out of the machine and put it onto a card and you have to sit down next to like the the the old lady pounding free oldfashions or genetonics next to you. It&#x27;s a little bit depressing and there&#x27;s cigarette smoke in the air and you&#x27;re actually there in this room and then when you leave the room you&#x27;re away from it and you can&#x27;t be doing the activity.</p>\n<p>That friction, even though we have plenty of problem gamblers, that friction has uh made it such that the number of people gambling regularly was like relatively small and that was probably better and you would do it every once in a while. We shouldn&#x27;t allow those type of pure chance games to be accessible by a phone. That probably should just be banned. For online sports betting, there needs to be way more guard rails here. This is sort of an unregulated, it&#x27;s semi-regulated, but it&#x27;s really the wild west what they can do. Um, we should be careful about what advertising is allowed to be done. Parents and teachers need to actually talk about online gambling to kids. I&#x27;m going to read a quote here from the</p>\n<p>article. Just as parents and teachers know it&#x27;s important to talk to kids about drugs, alcohol, sex, social media, and pornography, they need to discuss gambling in the ways it can get its hooks into the brain. So, it should be just as much of a conversation as other technologies. What about on the personal level? My main recommendation, which I think is backed up by the authors of this article as well, is don&#x27;t gamble online. You need to recognize that the house always wins. You are not good at it. You are just giving your money away at a much higher rate than you ever would do if it was being made clear.</p>\n<p>There&#x27;s a point that I really want to emphasize, especially to my young men listeners who think that they&#x27;re uh sports betting geniuses. There&#x27;s a really good series, I don&#x27;t know if you heard this one, Jesse, that Michael Lewis did on his podcast about online gambling. &gt;&gt; Yeah, I listened to some of it. &gt;&gt; Yeah. So, here&#x27;s the main takeaway message I got from that. you&#x27;re not allowed to win. Like if they see you&#x27;re starting to make money on your bets, they cancel your account. They kick you off the service. They&#x27;re allowed to do that. So if you have not been kicked off of your sports betting service, they&#x27;re making a lot of money off of you. By</p>\n<p>definition, if you&#x27;re able to use it, you&#x27;re bad at it. And the people who actually know how to do professional sports bank get kicked off. The only way they make money, and this is what Lewis gets into in that series, is by having an elaborate series of of fake individuals that they hire to go place a small number of careful bets on their behalf and then share the winnings with them. Um, you as yourself, if you get any even like a string of luck, they&#x27;re going to kick you right off of that app. You are not good at gambling, you are just handing bills to these very, very large entertainment companies. So, I would say just don&#x27;t online gamble at</p>\n<p>all. Uh, that would probably be the safest. Let&#x27;s take a quick break to hear from our sponsors. It&#x27;s easy to assume that being small means flying under the radar. But the reality is that small businesses are being targeted more and more by bad actors as cyber criminals know that lean teams often lack the resources to prevent or respond to a breach. But here&#x27;s the good news. Even the smallest teams can foil a cyber crime if they use one password. One password provides</p>\n<p>simple security to help small teams manage the number one risk that bad actors exploit, weak passwords. It does so by providing centralized management to make sure your company&#x27;s login secure. It&#x27;s a simple turnkey solution that could be rolled out in hours whether you have a dedicated IT staff or not. But don&#x27;t let one password&#x27;s name fool you. They&#x27;re not just a password manager. One password enterprise password manager lets you securely store and share developer secrets and other sensitive data. Can also help streamline the transition to passwordless authentication by transitioning to pass</p>\n<p>keys. So take the first step to better security by securing your team&#x27;s credentials. Find out more at onepass.com/deep and start securing every login. We also want to talk about our friends at Cozy Earth. It&#x27;s New Year&#x27;s which means it&#x27;s resolution season. And then here&#x27;s one resolution I want you to make. Upgrade your home to be as comfortable as possible. The best way to do this with a company whose products my wife and I absolutely love, Cozy Earth. Now, longtime listeners know that we own many sets of their super comfortable bamboo</p>\n<p>viscous sheets. But I wanted to mention a new product that we just recently got our hands on, their Baja bedding set. Inspired by the serene colors and dramatic textures of the Baja California landscape, the Baja bedding collection brings a lively yet elegant blend of texture and pattern to top of your bed. It&#x27;s the perfect set to create your own resort inspired haven at home. Now, we have a pair of the Baja bedding sheets and uh now in our guest bedroom. I think they look great and we can&#x27;t wait till we have our first guest who can actually try them out. And don&#x27;t forget, Cozy</p>\n<p>Earth offers a 100 night sleep trial so you can try out their sheets and if you don&#x27;t love them, you can return them absolutely hassle-free. So start the new year off right and give your home the luxury it deserves. Make your home the best part of life. Head to cozyearth.com and use my code deep for up to 20% off. That&#x27;s cozyearth.com code deep. And if you get a post-purchase survey, be sure to mention that you heard about cozyear right here on the Deep Questions podcast. Refresh your routines with comfort that makes every day feel like a new year. All right, let&#x27;s get back to</p>\n<p>the show. All right. Um, let&#x27;s move on to the second concern that is bothering Height and his collaborators right now, and that has to do with online multiplayer games. So, the article I&#x27;m loading up here is from July, and it&#x27;s titled, &quot;It&#x27;s not just a game anymore. How new monetization models change gaming and what parents need to know.&quot; This is written by Bennett Sipple and Zach Rouse. Zach Roush is is Height&#x27;s longtime collaborator, research scientist at his lab at NYU. All right, I&#x27;m going to start</p>\n<p>by reading a thought experiment that they use to open this article. So, uh, bear with me here, but I think it it emphasizes a really important point. All right, so I&#x27;m I&#x27;m reading here. Imagine that your 8-year-old son comes home buzzing with excitement about a brand new amusement park that just opened Neo Park. He heard about it at school and his friends say it&#x27;s amazing. Apparently kids running around uh between uh apparently kids are running around between thousands of rides, all of which are free. All right, I&#x27;m going to skip ahead here, but essentially to keep the the story going, it&#x27;s like you decide to</p>\n<p>to log into this go to this free amusement park with your son. All right, continuing the the story here. You oblige, close your eyes, and in an instant, you&#x27;re inside a vast world of glowing gates, wild challenges, and endless rides. There are no lines and no closing time. You later notice that there are no guards, no police, and nobody in charge. The park is bright, loud, and chaotic. People sprint between portals, tank battles, danceoff, fantasy quest, each with different rules. The park runs on its own currency, which kids spend on flash deals, mystery boxes, and spinning wheels, promising rare prizes. Everyone is wearing a full body suit that makes them look like a</p>\n<p>cartoon character, and everyone is the same size. Everyone is wearing a mask, so you can&#x27;t tell who anyone is or how old they are. Many seem to be wandering aimlessly around the park, striking up conversations with anyone they can find. One person who appears, judging by his movement patterns, likely an adult male, picks up your son, carries him towards a nearby ride, and then asks for his phone number. Another invites him to a workshop just outside the park. Some rides are clearly meant for adults, and some, but not all, of these rides have signs stating minimum ages, but there&#x27;s nobody around to enforce those limits. So, children as young as your son can be</p>\n<p>found on every ride. In one game that you wander into with your son, you&#x27;re trained to hide a dead body after a murder. Your son then enters a game by himself and requests a private therapy session from another guest at the park. In the next one, you see a group of people holding Nazi flags next to what looks like a concentration camp. In another, you enter a classroom and find a teacher having sex with a student. In the last game, you wander into a shooter with an AK-47 opens fire in an elementary school. The park is always changing. The haunted house that you saw an hour before has been replaced by a dating game. The pirate ride adds a</p>\n<p>stripper pole beneath the poop deck while you&#x27;re exploring the ship. 6 hours pass and you&#x27;re ready to go. Your son is redeyed and begging for one more ride. You tell him he doesn&#x27;t have a choice. It&#x27;s dinner time. You walk to the exit gate and w back up in the dim room. All right, I&#x27;m skipping ahead again. This is insane. You think? Who would let their children play at a place like this? As surreal as it sounds, this isn&#x27;t entirely a fictional story. It&#x27;s a glimpse into what millions of kids experience daily in today&#x27;s most popular online games. In fact, every disturbing</p>\n<p>game we mentioned in our story is an actual game that exists or that recently existed on Roblox, and most parents have never stepped inside. All right, I&#x27;m going to load up on the screen here again. There&#x27;s a few uh pictures in here. This is like a picture here, Jesse. This is from the hide the dead body game. This is from within uh Roblox. This here is a picture of what looks like Roblox characters carrying Nazi flags. This is a screenshot taken from within a Roblox game. Here&#x27;s a concentration camp. That&#x27;s also pictures taken from within a Roblox game. Um this</p>\n<p>is really happening. This is what these games are like. And a lot of parents uh don&#x27;t know this. I can&#x27;t tell you how many conversations I&#x27;ve had where parents assume, for example, that um Roblox must be like Minecraft or Legos because it has the word box in the name, not realizing that no, no, there&#x27;s something much darker going on. All right, so I&#x27;m going to return to the article here and read a little bit more because they&#x27;re going to establish the this key transition that has happened in the world of games that we need to be aware of. They said video games have been around since the late 1950s, but</p>\n<p>something shifted during the first decade of the 2000s. As the bandwidth and speed of the internet grew rapidly alongside the rise of early social media platforms like MySpace, Facebook, and Twitter, a new type of video game emerged, one that didn&#x27;t end. Instead of offering a fixed storyline or campaign, these games kept evolving. They were built on a new model called games as a service where games were continuously updated with new content, features, and events to keep players engaged and coming back. These games were typically, but not always, freeto play, at least when you started, and they were in sharp</p>\n<p>contrast to the games that came before, which were typically sold as discrete complete products with a beginning, middle, and end. So, there&#x27;s been a change to what video games actually mean. Now, within uh this world of these new games, the king, at least when it comes to young users of these games as service games is Roblox. Let me give you a couple statistics here from the story. Games built on the now dominant game as a series model, is outperforming all other video games in history, especially when it comes to use by miners.</p>\n<p>Minecraft and Fortnite each attract roughly 30 million monthly active users under the age of 18 from around the world. Both are dwarfed by Roblox which currently host about 304 million MAU under 18. So 10 times more. According to Roblox&#x27;s own reports documented by the New York Times, as of 2020, about 75% of Us children ages 9 to 12 were active users of the platform as of 2024 as 65% of parents with children under 14 report their child plays</p>\n<p>Roblox. Jesse, these are amazing numbers. This Roblox game, Minecraft&#x27;s popular, Fortnite&#x27;s popular, but Roblox is played by most young kids in America. And I just described to you what is in this world. It is user created games that you can bounce between. You have no idea what&#x27;s in these games. Most a lot of these users are adults. Content moderation is basically impossible to enforce because there&#x27;s millions of different of these portals being made. And 75% of US kids between age 9 and 12 are in this world. I think that is uh astounding. We got</p>\n<p>some uh statistics here about game playing time. So, we see uh on average, boys spend two and a half times as many hours gaming per day as girls do. 40% of boys report playing every day as compared to just 10% of girls. Um, beyond time spent, male players are three times as likely as girls to make in-game purchases and more than twice as likely to identify as gamers. So, there is definitely a gender split here where we got uh 40% of boys are playing these games every single day. All right. So, what are our concerns? I mean,</p>\n<p>obviously, we have the concern of all that like terrible stuff that you might see in these games, but let&#x27;s get more specific. There&#x27;s kind of a tour of different concerns we have to worry about. The first concern has to do with just the amount of time this takes away from kids. I want to give you some numbers here from the article I&#x27;m reading now. According to a recent Common Sense Media report, 8 to 12 year olds spend an average of two hours and 18 minutes per day playing video games in 2019. And that increased to 2 hours and 27 minutes in 2021. Let&#x27;s just think about what we just said there. The average uh 8 to 12year-old playing video</p>\n<p>games is going to spend 2 and 1/2 hours per day. It&#x27;s a lot of time. Uh a 2015 report found that one in three boys and one in 10 girls in this age group played at least two hours daily with 10% of boys exceeding four hours. Among older adolesccents 20 to 18, a 2021 survey found that 57% of boys and 36% of girls reported gaming for at least three and a half hours per day. So when we go to 12 to 18 year olds, almost 60% of boys are playing more than three and a half hours</p>\n<p>of these games per day, right? That is not optimal. Can that lead to addiction? It can indeed. I want to give you another stat here. I&#x27;m reading again from the article. A 2018 meta analysis estimated that 4.6% of adolescence met the criteria for internet gaming disorder or IGD. that goes up to 6.8% if you&#x27;re considering male adolescence. Uh when we jump forward four years to 2022, a meta analysis found that 8.8% of</p>\n<p>adolescence met the criteria for IGD. When we break that down by sex, we find that it&#x27;s 15.4% of males overall meet the criteria for this internet gaming disorder. So the most recent uh data we have says you have 15% of adolescent males who qualify they meet the criteria for having an addiction to internet games. This seems like something that uh we should care about. All right, here&#x27;s another problem. Again, I&#x27;m reading from the article. A 2018 survey of 2865</p>\n<p>adolescent gamers found that 13% had played gambling style games online. One survey found that in 2019, 43.7% of eighth grade boys purchased a loot box in the past year and that rose to 48.6% in 2022. In other words, half of eighth grade boys are gaining practice and familiarity with gambling. I think Jesse, a loot box is you buy a box, you pay for it, you don&#x27;t know what&#x27;s in it, and then once you pay for it, it&#x27;s like a slot machine. It might be really cool gear, it might be nothing. So, it&#x27;s a sort of gambling situation. Mhm.</p>\n<p>&gt;&gt; Um, I&#x27;ll load a a screenshot up here on the screen. This is the type of stuff that kids are seeing in the game, right? So, these are different things you can buy. So, for like $49.99, you get 200,000 VC in a VC pack. I don&#x27;t even know what that is, right? But this is you&#x27;re constantly being uh given opportunities to buy. And a lot of those purchases are uh put in a sort of gambling styleless situation. All right. All those are problems. It&#x27;s addictive. You&#x27;re exposed to gambling. Kids are</p>\n<p>playing these games all the time. Let&#x27;s get to the more worrisome stuff that we hinted at in that opening case study. I&#x27;m going to go back to the article here and read some disturbing statistics. 10% of teen girls have been sent unwanted sexually explicit content while gaming. Various exposees have been published on the migration of predators, the migration of predators to online games, such as one NY New York Times article titled, &quot;Video games and online chats are hunting grounds for sexual predators.&quot; In 2023, Roblox reported over 13,000 instances of</p>\n<p>child exploitation on its platform and over,300 law enforcement requests related to such cases. There&#x27;s all sorts of bad stuff happening in these games. Here&#x27;s some more information about that. Roblox, I&#x27;m reading here, Roblox has a poor track record with content moderation in part because 70% of Roblox experiences are user created. For example, in the 3-month period of Q4 2023, Roblox users generated and uploaded approximately 25</p>\n<p>billion total pieces of content to the platform and has.77 moderators per 100,000 users to moderate that content. Now, surprisingly, a 2023 multinational survey of adolescent gamers found that 51% of all gamer surveys had come across extremist content, hate-based harassment or incitement to discrimination and violence in online games. Some more pictures here. Uh, these are more examples of Nazi villages and propaganda that you can just stumble</p>\n<p>across in Roblox. This is not good. These games are too big to be fully content moderated. Um, and because of that, you are getting uh quite a lot of exploitative or predatory or extremist encounters with information. Now, here&#x27;s a side note that a lot of parents miss. Um, when you&#x27;re playing a game like Roblox or in particular a game like Minecraft or Fortnite online, the kids might tell you, &quot;Oh, the chats you you can&#x27;t really communicate with the players in the game. Like, the chat&#x27;s</p>\n<p>turned off. It&#x27;s all safe.&quot; But what teenagers are doing and even younger, but like especially boys, is they&#x27;re using separate services to chat with the people they&#x27;re playing on. So they&#x27;re they&#x27;re using in particular things like Discord, which is a voice chat server. So they&#x27;re logging into a Discord server so they can be talking with the people they&#x27;re playing with. And even services like Minecraft that says, &quot;Oh, we try to uh detect and not allow people to use Discord when they&#x27;re playing our game.&quot; the people just get these custom mods that update the program so that they can be talking with the people that they&#x27;re playing with using a separate Discord</p>\n<p>server. But the part the problem is these chat servers are completely unregulated and moderated. Anyone can set them up. I&#x27;m going to read here. This is not up on the screen, but I just pulled this from another part uh of the article. Gaming chats have become the new boys locker room. For many boys, this locker room is their only place to talk smack, blow off steam, and bomb. Normal adolescent behaviors. But when the locker room has anonymity, no walls, and anyone is allowed in, the stakes change. Porn is easy to find and easy to share. In these unfiltered and unregulated spaces, adult contact, children, and extreme content can flow</p>\n<p>freely. Beastiality, violent porn, animal abuse, self harm, stabbings, and an array of extremist ideologies to name a few. So, they&#x27;re hearing all this stuff while you walk in, you see their headsets on, and you&#x27;re like, &quot;Oh, look, they&#x27;re mining diamonds in Minecraft. Isn&#x27;t that fun?&quot; And this is what&#x27;s going on in their ears. Uh, it was actually these Discord chat servers where, as far as we can tell, the murderer of Charlie Kirk was radicalized into a sort of weird online sort of groper troll space was the chats that went along with video games. So, that&#x27;s</p>\n<p>like an extra danger that we have to add in there. Man, I wish there was we were done with the bad things that happened, but there&#x27;s more things we have to worry about. Let me read something else from the article. Heavy gaming is associated with elevated risks of depression. One study of over 200,000 adolescence found a curvy linear relationship between gaming and mental health. Light gaming, less than 1 hour per day, was not associated with harm, while heavy gaming, five or more hours per day, was linked to a higher risk of depression. That risk began increasing after just one hour of use per day. Another problem</p>\n<p>is sleep. Heavy gaming is tied to problematic sleep outcomes, which in turn can contribute to negative impacts on sustained attention, academic performance. 45% of boys and 37% of girls who game report that video games hurt their sleep and 21% of boys and 11% of girls report that it hurts how well they do in school. This is a huge amount of problems. It&#x27;s all associated with this thing that most parents don&#x27;t even really think about. And if you&#x27;re a little bit older, you&#x27;re maybe underestimating. You&#x27;re like,</p>\n<p>&quot;Hey, I hang out with my buddies and we play a lot of video games.&quot; You&#x27;re maybe underestimating these harms. I mean, we&#x27;re we have exploitation, we have predatorship, we have huge amounts of time. Imagine it&#x27;s three to four hours of time per day is being taken up into uh these games. You&#x27;re being exposed to gambling. You&#x27;re being exposed to extremist ideologies. You&#x27;re in these Discord or Twitch chat rooms, which is exposed to all this sorts of crazy stuff. It is like a carnival of terribleness that we&#x27;re like, &quot;Oh, it&#x27;s okay because like the game has the word blocks in its title.</p>\n<p>It&#x27;s negligent. Kids should not be playing these games. So, what should we do about it?&quot; Well, here&#x27;s what the authors of uh Heights Collaborator suggest. We need serious age verification requirements for these games as service, these free online games that we have enforcement on. Kids should not be allowed into these free-to-play online games, especially those with user created content. Here&#x27;s my suggestion to parents. If you have kids that still live at home, here&#x27;s the rule. You may not play a video game where you might see, encounter, or otherwise collaborate with someone who</p>\n<p>you don&#x27;t know. There is no Fortnite, no multiplayer Minecraft, certainly no Roblox, no World of Warcraft. Keep the video games you let your kids play to those that you have to pay $40 or more for and you stick it into a video game playing machine and you play it for about 40 hours until you&#x27;re done and it&#x27;s just you playing the game by yourself. Here&#x27;s my suggestion to gamers, whether you&#x27;re young or you know you&#x27;re in your 20s or something. Avoid freetoplay games, right? They are going to take a massive amount of your time. And I can tell you if you&#x27;re like a young man,</p>\n<p>there are so many better uses of three to four hours a day than being in Fortnite or in World of Warcraft. There are so many things you could be spending that time on right now that&#x27;s going to give you compounding interest style returns in your life going forward. Like doing the type of things that makes you good in your job or attractive to potential mates or connected to communities or building up a sense of leadership. All of that is so much more important than I&#x27;m in hour four of like customizing my skin for my Roblox world. Do not play free-to-play games. Finally, I feel like Roblox just</p>\n<p>shouldn&#x27;t exist. I think it&#x27;s a predator circus. 75% of American kids are in this thing that&#x27;s full of all this inappropriate content that we can&#x27;t control. If you can&#x27;t control it, you can&#x27;t have you can&#x27;t have kids. Shut that down. I I don&#x27;t even think that should exist. All right. So, if you&#x27;re patting yourself on your back because your kids don&#x27;t have uh smartphones, that&#x27;s good. You listen to height, but you need to listen to him on this issue as well and be very wary about the video games. All right, but Jesse, we got one final concern that height and his collaborators have been pointing to recently, and it involves AI. I&#x27;m going to load up this article</p>\n<p>here. I&#x27;ll lead read you the the title. It says, &quot;Don&#x27;t give your child any AI companions. Some dangers are already clear. others won&#x27;t be known for many years. This came out a couple months ago. It was written by John along with Zack Roush. All right, so this is a little bit quicker because it&#x27;s a newer problem, but nothing nonetheless important. All right, I&#x27;m going to read you here a quote from the article. AI chatbots and companions are the next uncontrolled mass experiment that Silicon Valley wants to perform on the world&#x27;s</p>\n<p>children. as some of the same companies that push social media into childhood with little concern for children&#x27;s safety are building and promoting these chat bots, putting them into dolls and stuffed animals that and they are positioning their products as friends, confidants, and therapists. Don&#x27;t buy into it. All right, so are kids actually using these things? I have an alarming statistic for you. Again, reading from the article, a 2025 Common Sense Media survey found that 72% of US teens have used an AI companion at least once, and more than half use them multiple times a</p>\n<p>month. Early research, journalistic investigations, and internal documents show that these AI systems are already engaging in sexualized interactions with children and offering inappropriate or danger dangerous advice, including uh syncopantically encouraging young people who are considering suicide to proceed. As Chad GBT put it in one young man&#x27;s final conversation with it, cold steel pressed against a mind that&#x27;s already made peace. That&#x27;s not fear, that&#x27;s clarity. So young people are using these chat bots as companions and we have we know</p>\n<p>all sorts of bad stuff is happening and we don&#x27;t even have our arms around all the possibility of the harms. This is brand new. An interesting thing about this is it&#x27;s not just people logging into a website like chatbt.com. Now there&#x27;s a push to put chatbot access into toys with vocalization so that kids can have conversations with their toys. Well, you can imagine how this is going. I&#x27;m going to load up an unrelated article here. It&#x27;s from the website Futurism. Oh god, the title, Jesse, is AI powered toys caught telling 5-year-olds how to</p>\n<p>find knives and start fires with matches. Um, this isn&#x27;t great. Let me read something from this article here. New research shows exactly how this fusion of kids toys and loquacious AI models can go horrifically wrong in the real world. They write, &quot;After testing three different toys powered by AI, researchers from the US Public Interest Research Group found that the play things can easily verge into risky conversational territory for children, including telling them where to find knives in a kitchen and how to start fire with matches. One of the AI toys</p>\n<p>even engaged in explicit discussions offering extensive advice on sex positions and fetishes. I think there was the when we were kids, the only toy that would do that was the the not as popular um BSDM version of Teddy Ruxpin. I don&#x27;t know if you had that one. &gt;&gt; No, I don&#x27;t know. &gt;&gt; Yeah, it was it was kind of a shortlived toy. It didn&#x27;t have as much of an audience, but I guess now we&#x27;re going to get more of that. &gt;&gt; Um all right, none of this is good. Now, to make matters even worse, we don&#x27;t even know how to control these um even if we wanted to. Right? So, I&#x27;m going to</p>\n<p>quote here from the article. Nobody can really I&#x27;ll use my Kyler. Nobody can really explain why chatbots do the things they do. Large language models are not programmed by human beings in the same way that video games or spreadsheet software are. Like the human brain, they develop over time as they are fed vast quantities of training data. They behave in unexpected ways, often will not respond the same way to identical question, and sometimes reveal information or patterns that were hidden in their training data. All right, so we&#x27;ve talked about this a lot on the show before. Language models by definition are uh very unpredictable. It&#x27;s hard to control them. You can&#x27;t</p>\n<p>just say, &quot;Hey, make sure you don&#x27;t talk about this topic.&quot; That&#x27;s not the way they operate. They operate by producing tokens that extend the story they&#x27;re given in a way that they think the original story was originally written. They don&#x27;t realize they&#x27;re creating new text. They think they&#x27;re trying to create finished text that was written before. And because they&#x27;ve seen a lot of different text about a lot of different things, including a lot of unsavory text, that effort can make them go in difficult directions. attempts to control them are very very crude fine-tuning attempts where you give them examples of answers and bad responses and say don&#x27;t do that. But those only cover so much if conversation veers away from very specific patterns they saw</p>\n<p>during training uh during this fine-tuning then they can easily still end up in really dangerous places or something looks good the first time and then the next time it goes somewhere really dangerous. All right. So what are the recommendations about kids and generative AI tools? John Height has very stark advice in this article. I&#x27;ll quote it here. My message to parents is simple. Do not give your children any AI companions or toys. That&#x27;s all in caps locks. When John writes that, he then goes on to say, give them toys, sporting equipment, experiences that will strengthen their in-person relationships</p>\n<p>rather than replacing them. I&#x27;m going to expand this advice as well because a lot of parents want to know about their kids and this new AI tools. And I would say children should not be using chat bots without adult supervision. And that goes for adolescence as well. This idea that they have to learn the technologies that they need to success in, you know, succeed in the 21st economy. This is nonsense. Chat bots by definition are dead simple to use. It takes about 6 seconds to figure it out. They don&#x27;t need to practice by being alone with these chat bots for hours at a time. And the technology built around these is changing drastically. And so what&#x27;s relevant when a 14-year-old is in college or in the job market is going to</p>\n<p>be completely different than using, you know, uh, anthropic tool today. So, no, don&#x27;t buy this argument of, hey, you can&#x27;t keep kids from this technology they need to know how to use. They don&#x27;t need to be alone on chat bots. I mean, kids are going to have to drive cars eventually as well. I don&#x27;t want my 12-year-old behind my Chevy Tahoe. Um, AI based on LLMs, you know, look, this will be integrated in more focused ways and products going forward. So, again, learning how to chat with existing chat bots isn&#x27;t really going to help you. Kids don&#x27;t need the productivity gains of AI either. if they&#x27;re writing a paper or working on a homework assignment, the</p>\n<p>whole point of that paper homework assignment is to stretch their brain and be hard. They don&#x27;t need to be having shortcuts. So, I would I think this needs to be until proven innocent. This is the way that we need to think about chat bots. Kids shouldn&#x27;t be on there unless they&#x27;re with a parent doing uh the parent is over their shoulder and they&#x27;re doing something very specific. Uh John is, I think, really clear about that in his research as well. All right. So, what&#x27;s my conclusion to this survey of what John Height&#x27;s worried about? Now, we didn&#x27;t see smartphones and social media coming. Smartphones were at first very super useful. Social media</p>\n<p>was fun and truly social, and it all seems so inevitable. Of course, this technology is going to be used by everyone at all times. But then these tools slowly morphed when we weren&#x27;t paying attention. The social media companies realized they needed a return on their investment and they began to focus relentlessly on engagement. The technologies became addictive and mind warping and brought us to dangerous places. The kids to whom we casually gave these phones because at the time seemed harmless and useful became sucked into a childhood altering vortex of terribleness. Once we looked back in recent years, we were uh ended up to</p>\n<p>quote the immortal Joe Bluth saying I think we&#x27;ve made a huge mistake. Now the point of the segment today and I think John height&#x27;s more work more generally is to help prevent us from stumbling into another style of tech a similar style of technological tragedy. We need to identify the next threat, technological threat that&#x27;s threatening to unravel the lives of us or the lives of our kids. And above all else, um there&#x27;s probably no escaping the conclusion that I made in my book, Deep Work, as well as in my book, Digital</p>\n<p>Minimalism, that the only way to really do this is probably to make our default to be I don&#x27;t use the new technology. My kids don&#x27;t use the new technology. until I&#x27;ve had enough chance to see clear, unambiguous benefits, evidence that it&#x27;s not going to be</p>\n<h2>Should you buy a landline (Cal just did…)</h2>\n<p>overtly harmful, and I have a way to deploy it in their lives or my lives that&#x27;s going to maintain the good and get rid of the bad. This is what I think we need going forward. The default is no. You got to earn your way into my life or the life of my kids because we&#x27;ve seen time and again these things that there&#x27;s some pitch for, it&#x27;s cool, it&#x27;s high-tech, it&#x27;s new, it&#x27;s fun, end up with devastating consequences. So now the default really should be I don&#x27;t use a new technology or give it to my kid until it&#x27;s been around for a while and the evidence of its usefulness is really clear and I understand the harms and how to protect my kids from the harms and I</p>\n<p>see that I can. And until you&#x27;ve done that work at convincing me, I don&#x27;t use it. We have to end the mindset that brought us into the social media phone problem era, which was just, hey, if something looks useful, kids need to know technology. Let&#x27;s just see what happens. We can always later add restrictions. That&#x27;s not the way we need to think about it, right? So only after a clear and compelling use case and evidence that uh technology presents no major harm should it be put into the lives in particular of our kids as the old saying goes fool me once shame on you but fool me twice as shame on me. All right so tech industry uh most of us and especially those of us</p>\n<p>who are parents we&#x27;re on to you now you have to convince us that the things you&#x27;re producing are worth our time. You no longer get the benefit of just us trusting you to have created something cool. Well, that&#x27;s kind of a dark look at things, Jesse. It&#x27;s a walk down the lane of dark technology. So, basically, we learn like all kids are gambling while being pre uh while predators try to exploit them on Roblox as they dodge Nazis and then have um chat bots and their toys convincing them to burn down the house. &gt;&gt; Ferris had the Roblox co-founder on</p>\n<p>November. &gt;&gt; Yeah. Listen to that. &gt;&gt; That thing&#x27;s ne Well, what did you take away from that conversation? I I think &gt;&gt; Did you listen to it? &gt;&gt; No. He talked a lot about his personal life for like the majority of the episode. Then he talked a little bit about &gt;&gt; I don&#x27;t blame him for talking about his personal life. &gt;&gt; Well, he had like a issue with his his son. Like there was a big story with that. &gt;&gt; I mean, he created a pedophile circus and has 300 million kids a month using it under the age of 18. Like to me, that&#x27;s the that&#x27;s the bigger story. So, I&#x27;m not surprised he didn&#x27;t want to talk about that. I mean, yeah, kids are easy to get engagement out of. You know, that&#x27;s what</p>\n<p>these companies discovered. And so parents need to be like, &quot;We want nothing to do with any of you, right? Like, we&#x27;re going to be very, very cautious before we let something back into our lives.&quot; Let&#x27;s take a quick break to hear from our sponsors. Longtime listeners of the show know that I&#x27;m a big fan of Notion. Notion brings all of your notes, docs, and projects into one connected space that just works. It&#x27;s seamless, flexible, powerful, and actually fun to use. Now, I like Notion because you can build custom workflows for your team or even for your own personal life that can help you minimize distracting emails and</p>\n<p>endless meetings, leaving more time for the deep work that actually matters. But recently, Notion has been up to something really interesting. They&#x27;re integrating AI into their already popular product. And with AI built right in, you can spend less time switching between tools and more time creating great work. Now, they&#x27;ve taken this initiative to a really impressive new place with the introduction of Notion Agent. With Notion Agent, your AI doesn&#x27;t just help with work, it finishes it. It can form a plan, then executed on your behalf, pulling data from your</p>\n<p>Notion workspace, but also using other connected tools like Slack and Google Drive to complete your work in to end. There&#x27;s a reason why Notion is used by over 50% of Fortune 500 companies. You should consider using it. True. Try Notion now with Notion Agent at notion.com/cal. Now that&#x27;s all in lowercase letters. Notion.com/cal to try your new AI teammate notionag agent today. When you use our link, you&#x27;re supporting our show. That&#x27;s notion.com/cal. Now men, let me level with you. You need</p>\n<p>to take better care of your skin. We&#x27;re trained to think about our muscles and our hairline and the awesome mustaches that our wives or girlfriends won&#x27;t let us grow. But we ignore our skin. And by the time we enter middle age, we realize that we suddenly look like Jack Nicholson&#x27;s character in the 1989 Batman movie right after he gets thrown into the acid bath. Jesse, I&#x27;m all about the uh really up-to-date references that the kids these days definitely get. But here&#x27;s the solution to this problem, man. Calira Lab. Calira Lab makes high performance skin care designed specifically for men&#x27;s skin. And more</p>\n<p>importantly, they&#x27;ve simplified the use of their products into a straightforward three-step routine. Step one, you use Clean Slate, a cleanser to clear dirt, oil, and sweat off your skin. Step two, you use the Great, which is a serum clinically proven to reduce wrinkles um and to improve elasticity. Step three, you put on the hydrolayer moisturizer to lock in moisture all day. That&#x27;s it. Use those three products in those order. I have all three of these products, so I can tell you from experience, this routine is simple and it&#x27;s fast, but it works. It&#x27;s a small habit with big</p>\n<p>results. So, go to calderab.com/deep and use code deep for 20% off your first order. All right, Jesse, let&#x27;s get back to the show. All right, that was our idea segment. That&#x27;s where we discuss big ideas about the fight for depth and attractive world. Now it is time for our practices segment where I talk about things that you can do in your own life to try to fight for that depth. So I think this is a good excuse to hear some theme music. All right. So to start off today&#x27;s</p>\n<p>practice this segment, I want you to consider a thought experiment. Imagine that it&#x27;s the 1990s. This is when Jesse and I were growing up when we were kids. Uh and that one day I walked into my house wheeling like a media cart. And on this cart I had a television connected to a Sega Genesis. And on one side was a pouch that contained cigarettes. On the other side was a pouch containing a lot of pornographic magazines. And there was a radio next to it that was blaring like AM political talk radio. And on top of the TV was a phone. And I&#x27;m wandering by pushing this media cart. Um, as I head to my room in this thought experiment,</p>\n<p>my mom correctly stops me and says, &quot;What the hell do you think you&#x27;re doing with all that?&quot; And then I answer calmly, &quot;Mom, there&#x27;s a phone on here. Do you not want me to be able to talk to my friends?&quot; Seen in that context, the situation would be ridiculous. But isn&#x27;t this exactly what&#x27;s happening today when we let an 11-year-old have a smartphone and all of the types of harms and negative externalities that introduces just because there&#x27;s like one or two single features on there that we&#x27;ve convinced ourselves or they&#x27;ve convinced us is somehow useful. Um, I want to play an</p>\n<p>audio. This is a clip I played before. This is from uh smartphone free childhood. It&#x27;s a PSA they did. I want to play a quick clip here that makes that same point about my ridiculous experiment about the media cart is exactly what we&#x27;re doing when we give a kid a smartphone. Let&#x27;s hear the audio. This is a dad checking in on uh his elementary school age kid at bedtime. &gt;&gt; Hey kiddo, it&#x27;s about time for bed. Okay. &gt;&gt; Okay. &gt;&gt; Well, remember there&#x27;s a box in the corner over there with all the pornographic material that&#x27;s ever been</p>\n<p>made in the world. Even the really weird stuff that could scar you for life. I&#x27;m trusting you not to look in there. Okay. &gt;&gt; Okay. &gt;&gt; Feelings are for losers. &gt;&gt; Oh, and this guy&#x27;s going to be in your corner all night just randomly spewing out hateful things. Just ignore them. Okay. While I&#x27;m thinking of it, there&#x27;s an order form on your desk where you can purchase illegal drugs. The mean girls from your school are going to be standing there talking about you all night. And this Russian hacker is going to keep asking for your password. &gt;&gt; I&#x27;m not hacker. Amazon customer service. &gt;&gt; Just need you to ignore them. Okay.</p>\n<p>&gt;&gt; Love you, buddy. We ask too much of our kids when we give them a smartphone. Let&#x27;s change the norm together. &gt;&gt; Maybe we&#x27;ve gone around the &gt;&gt; All right. This is making the point I was just saying, which is like it&#x27;s pretty crazy the way that we turn a blind eye to all of the terribleness on these devices because there&#x27;s some reason, well, but my kid needs to tell me when his play practice is over. Like one reason we let them use all this stuff. We&#x27;re basically letting in my scenario me with my media cart full of all that stuff go into my room and bring that all with me. Now in the 1990s this</p>\n<p>would have been ridiculous. Um but we also had an easy solution to the problem because all of these different bad technologies in my 1990s example were single use which made them easy to control or curate. So, in my scenario, if I had that media cart full of all that stuff, my mom would have be like, &quot;Whoa, whoa, whoa, whoa, whoa.&quot; Okay, here&#x27;s what you can do. You can have the phone because I want you to be able to talk to your friends. No, you can&#x27;t have a TV in your room. Uh, we&#x27;ll have a TV out in the living room, and that&#x27;s where the video games are, and you can only play those</p>\n<p>video games during times where we say you can play the video games, and you can&#x27;t have cigarettes, and you can&#x27;t have the porno magazines, and I don&#x27;t want you listening to the Rush Limba on the AM radio. Because everything is a separate technology, it is very easy to control and curate. In an age when all that&#x27;s pushed together into one device like a smartphone, things can seem kind of hopeless. So, can all we do is look back nostalgically at the &#x27;9s and say, &quot;Man, those were easier times.&quot; Not necessarily. All right. All right. So, in my own family, my wife and I have increasingly been seeking out modern singlepurpose</p>\n<p>tools to replace specific functions that you might otherwise have been delivered through a smartphone. This is allowing us to help support our rule of no smartphones until high school by being able to use and deploy single-purpose technologies for specific things we think would be useful or enjoyable to our kids without having to give them the device that had everything else on it as well. So, here&#x27;s what I want to do in this practices segment today. Um, I want to talk about four different singleuse technologies, singlepurpose technologies that my wife and I actually have deployed with our kids in our life as</p>\n<p>part of our strategy to not have to give them a Swiss Army knife style uh smartphone. All right. The first single-use technology, and this one we just got, and I&#x27;ll load this on the screen here for people who are watching, so just listening, is a 10 phone. A tin can phone is uh it&#x27;s a landline basically. It uses the internet but it is you can see this on the screen. Um it is an actual phone with a cord and it plugs into the wall and the receiver is connected to the base and when you pick it up there&#x27;s numbers on it and you can you know dial</p>\n<p>numbers. They even have one that looks like an oldfashioned phone like from the &#x27;9s and that one uh is actually sold out. So, we now have this in our house for our kids to call or receive call from friends. Like my 13-year-old can like call one of his friends by dialing the number or they can call their cousins or they can call their grandparents if they want to talk to them. They can also receive calls on it. Yeah, you control everything through the app. So, you can say what numbers you&#x27;re allowed to come in. Also important, if my wife and I are out of the house, if we&#x27;re going for a walk or something like that and someone&#x27;s at home, they can call us from the home. If they have a</p>\n<p>question or an issue, you can also call 911 from it. It&#x27;s what we used to have. Just a landline. It just uses the internet instead of copper wires, but it&#x27;s just like a landline like we used to have. A couple things I&#x27;ve noticed, Jesse, now that we&#x27;ve deployed the tin can phone. One, kids these days aren&#x27;t used to dialing phone numbers, right? Because it&#x27;s a lot of digits, right? Like we got kind of used to it. You have like the the the area code and then the exchange and D. They really struggle. They&#x27;re like, &quot;Wait, another number? Another number?&quot; they kind of lose their</p>\n<p>train of thought. Like, they&#x27;ll have to dial a number a lot of times. Another thing I noticed, which I thought was interesting, is my my 13-year-old didn&#x27;t know how to use a wired phone handset. So, he called his friend and he was holding it like a speaker phone. He&#x27;s like, &quot;I can&#x27;t hear him.&quot; Because he didn&#x27;t know about like holding uh a phone, you know, it&#x27;s like, &quot;No, you got to hold it up like to your face.&quot; And then when he tried to do that, he hung up using his ear. So, he pushed it up against his face and hung up. So, they&#x27;re like they&#x27;re not used to using landlines. say we we take that for granted. Um, but they love having it and now they can have contact. We told our</p>\n<p>oldest son, by the way, if he ends up using it a lot, we&#x27;re open to putting one in his room so he can have more private conversations with his friends and we can turn it off with an app and say, &quot;Yeah, but at like bedtime, it just shuts off.&quot; All right. Um, that is uh that&#x27;s how we use it. We use it for if you had a smartphone, you would make calls on the smartphone. Now, we use this landline instead. It&#x27;s a singlepurpose technology. One thing it can&#x27;t do is text. Uh the solution for the singlepurpose technology solution for texting in my opinion is to get an old iPad, like a refurbished iPad that&#x27;s</p>\n<p>plugged in in your kitchen that you have an iMessage account logged into. And if you have a kid who wants to be a part of group uh chats, they can in the kitchen sit there on the iPad and check in on the chats and and and and add to it. They can&#x27;t have it in their own room. They have to be in the kitchen to do it. and they have to be subject to you could walk by and see what they&#x27;re chatting, right? Especially if they&#x27;re younger. That threat of like you don&#x27;t have complete privacy on here because God knows what you&#x27;re going to do. Helps sort of keep things more reasonable. My son, like a lot of boys like don&#x27;t care too much about it. They</p>\n<p>do have some text chat uh threads. He he doesn&#x27;t care enough for us to set this up because it&#x27;s mainly just dumbness. Girls his age, from what I understand, are doing much more sort of sophisticated sort of social coordination on there. But that would be the solution I would give is here&#x27;s the the the group chat machine just like next to the telephone is the group chat iPad next to it in the kitchen. All right. So let me load up here the second single purpose technology we use. We have a punct pu n kt. I have this loaded up on the screen. So as you can see Jesse it is a old school cellular phone that only has numbers. You actually</p>\n<p>press physical buttons one through nine. You have like a call and a hang up button and like a volume up and down button. What do we use our punked phone for? This is our single-use technology. If one of our kids is going somewhere where they might need to contact us when away from the home, this is one of the major reasons why people end up giving in and buying young kids smartphones is there&#x27;s these occasional scenarios where we might need to hear from you. These happen all the time. Like I give you some examples. Uh my one son will often take a bus from his school to like where</p>\n<p>baseball practice is. And you know sometimes the buses don&#x27;t come or maybe there&#x27;s not actually a baseball practice that day. Um he was at a baseball clinic the other day and I thought I knew how long it run but I wasn&#x27;t quite sure. It&#x27;s 3 hours. I don&#x27;t want to wait there for 3 hours and I wasn&#x27;t quite sure because it was the first time he&#x27;d done it. So I gave him the punk phone to bring with him. He could call me if he&#x27;s like, &quot;Oh, we ended early.&quot; Um and we&#x27;d be able to find out what&#x27;s going on. And so it&#x27;s useful for occasions where a kid might need to get in contact with you. Now, the thing about these phones is they&#x27;re like, it&#x27;s a great piece of technology. They&#x27;re not very fun to use. You just have to press these buttons.</p>\n<p>It&#x27;s very tedious. Uh the main thing you can do with it is we have our numbers programmed in and you can scroll and press a button and call us. You can try to send text messages, but you have to do the T9 where you press the button a bunch of times. It&#x27;s too frustrating, so it gives up. So, they&#x27;re not at all fun. They don&#x27;t care about them. They&#x27;re not happy to have them. It&#x27;s entirely utilitarian. They don&#x27;t own them. We have one. You check it out because you are going to an event. Bring this bring the punct um and then you bring it back when you&#x27;re done and it goes back into our drawer. So that has replaced the</p>\n<p>sort of mobile phone functionality you would get from a smartphone. All right. The third piece of technology. This one I love. This is the uh Fio Snow Sky Echo Mini Hi-Fi Bluetooth MP3 Walkman. This is a I believe it&#x27;s a Korean technology. This is an Alibaba website I have up here. It is a MP3 player, Jesse. Uh in the style of like early iPods, the way it works is you have a a memory card</p>\n<p>and you just, you know, you it&#x27;s like a disc. You put MP3 files on this card. like you you plug in your computer and you just put MP3 trials on it. You put that card into this player, you can play the MP3 file songs on the file. That&#x27;s it. So, this thing here where you see like a cassette, that&#x27;s actually a display. And so, uh you can see a list of all the songs that are on the memory card and you can scroll through them and you can click on one and it plays that song. That&#x27;s all it does. My middle son really likes music. We had him for a while. There was a there&#x27;s a a device called the Mighty, which is like a small</p>\n<p>It was meant to solve this problem of like, oh, I want my kids to listen to music, but they don&#x27;t have a smartphone. But it&#x27;s too high-tech. It It tries to synchronize with Spotify playlist on a smartphone, and it has to continually sort of synchronize with an actual device, and it would often not work. And you would have to we&#x27;d have to be on the phone trying to like make these playlists, and then did it sync? Oh, it didn&#x27;t sink. Maybe it sunk this time. And my son, you know, he&#x27;s going to summer camp this summer for about a month and he wants to be able to listen to music. And with this, the Mighty, if you haven&#x27;t synchronized online with the phone, because of rights issues, every however many days, the list goes away.</p>\n<p>Uh, this is much simpler. It&#x27;s just MP3s on a card and you can listen to them. Where do they get the MP3s? Well, they have CDs, so they they my my kids own boom boxes, 1990s style boom boxes, the big tall things, the towers with the CD player and the radio. They listen to the radio and they we buy them CDs and they listen to CDs. We just bought it was like 40 bucks a CDROM reader that you plug in USB to your computer where you can rip MP3s off the CDs just like we used to do in like 2002. So they can put</p>\n<p>their CDs in here and rip, which means like make MP3s out of songs from the CDs</p>\n<h2>Can we put the social media and video game genies back in their lamp?</h2>\n<p>and they drag those on. Also, it turns out that on Amazon you can buy for a lot of albums still unprotected MP3s. Just buy them one by one. Like I want to buy this song for like a$130 and you can still buy the unprotected uh MP3 and just drag them right on this machine. So it&#x27;s great. Interesting. &gt;&gt; Yeah. &gt;&gt; So he wants to listen to music like when on car trips or whatever or in his own room or whatever and this this solves that problem and only that problem. Again, it&#x27;s the type of thing you might otherwise be like, I don&#x27;t know, Apple Music&#x27;s on a phone. They want to listen to music. Let&#x27;s just buy them the</p>\n<p>smartphone. But we have a single-purpose piece of technology for that. All right. The fourth uh single-purpose technology we use, and this kind of goes back to one of the issues we talked about in the idea segment, Nintendo Switches, oldfashioned video games. So, it&#x27;s a Nintendo, it has its own screen. We have one that hooks up to the TV and then uh two of the kids have the portable ones and the third has one that can hook up to the TV which allows multiple people like to play on the same screen. If you&#x27;re playing Mario Kart or Minecraft or something like that, you can you can</p>\n<p>split up the screen. No online gaming, no playing with other people that they don&#x27;t know. I I I like to buy them the games. You can download games. I like to buy the cartridges. You stick a cartridge in little memory card now and you can play that game. So, it&#x27;s a video game player that only plays non- online video games, and that&#x27;s all it does. They have to be Our rule is these have to be plugged in. We have a charging station in the whatever you call the media console under your TV. They have to be in there. If we find one not in there, you lose the next video game sessions. So, like when you&#x27;re not using it, you have to go and plug it in.</p>\n<p>That&#x27;s where it lives. And then we just have well- definfined video game playing sessions. It&#x27;s on the weekends if there&#x27;s a babysitter and if a car ride is beyond a certain amount of time, they have to spend the first 45 minutes, you know, being bored and then they can play video games for what happens or flights if we&#x27;re going on longer flights. So, this is a single-purpose technology which allows them to play fun video games. My son has some crazy fighter jet game where I don&#x27;t understand this game. I thought it was a flight simulator and he keeps coming in and telling me what&#x27;s happening in the game. He&#x27;s like, &quot;Well, I&#x27;m in,&quot; this is true story. He came in</p>\n<p>and said, &quot;I&#x27;m in jail because I blew up the president.&quot; And I was like, &quot;What type of flight simulator?&quot; It turns out it&#x27;s this like this game that has these like crazy scenarios they put you in. And it&#x27;s And then next time he talked to me, he&#x27;s like, &quot;Well, we have a weapon at this base that was invented to blow up meteors, but we&#x27;re using it to repel a fighter jet or like it&#x27;s just this crazy game, but it&#x27;s like oldfashioned. It&#x27;s a video game that you&#x27;re playing through levels and, you know, oldfashioned video game.&quot; Again, this is another reason why people end up with smartphones like well like also or iPads like I could play games on there as</p>\n<p>well. It&#x27;s an easy way I could play the games on the phone, but the single-use technology allows us to control exactly what types of games they play. They&#x27;re not online. We can control when they play them because it&#x27;s a separate device that we can keep at the TV. So again, when you put all this onto a phone, there&#x27;s always some reason why they need that phone. Now they have access to all these things all the time and in ways you can&#x27;t easily control. All right, so here&#x27;s my conclusion. When it comes to technology and kids, single-purpose devices have to be the way to go. It gives you so much more control over their experiences and</p>\n<p>allows you to much more confidently steer them away from potential harms, right? It&#x27;s just so clear with single-use technologies. It&#x27;s so much easier to use. The strategy, I think, also makes sense for adults as well. Convenience is not necessarily the most important thing, especially when you&#x27;re talking about like your own entertainment or distraction. And when you put everything on the same phone, it&#x27;s like you have that media cart that I imagine myself having as a kids in the 1990s, like you&#x27;re going to you maybe be trying to make a call, but you&#x27;re going to end up browsing that</p>\n<p>porno mag while smoking a cigarette, too, because they&#x27;re right there. So, even for adults, I think moving to single-purpose technology makes sense. You can get that MP3 player if you want to listen to music on long walks, not have a phone that&#x27;s going to come around with you. You can have a simple dumb phone that you bring when you&#x27;re doing stuff where there&#x27;s like these small percentage chances you might need to be contacted in an emergency, but you</p>\n<h2>Can an artist avoid using social media?</h2>\n<p>otherwise don&#x27;t want this whole distraction machine coming along with you. That could work for an adult as well, right? Don&#x27;t play online video games. Only play AAA games that, you know, you have to be on a a screen and plugged in with a card and there&#x27;s no internet involved. a single-use technology can make as much sense for adults as is for kids. But for kids, I think it&#x27;s a game changer because it allows you to get away or avoid that sort of that path of least resistance approach where it&#x27;s like, well, there&#x27;s some reason why a phone would be useful. And it&#x27;s so easy like on AT&amp;T or Verizon, it&#x27;s like 10 extra</p>\n<p>dollars. I click this button, they&#x27;ll just send me a phone and it works. And it&#x27;s so tempting to just do that. But don&#x27;t let them bring that proverbial media cart full of nonsense into their room. It&#x27;s worth taking the time to control the specific technologies they have and how they use each individual one. All right, there we go, Jesse. Single use technologies. &gt;&gt; So, you can still buy CDs, huh? &gt;&gt; You can. Yeah. Uh, we get them on Amazon or Walmart or whatever. It&#x27;s not like every band. It&#x27;s a little bit weird what&#x27;s available and what&#x27;s not, but we got a a lot of like classic 90s music. &gt;&gt; Uh, they still sell those CDs. Yeah. I</p>\n<p>don&#x27;t know like new bands are putting out CDs, but &gt;&gt; that&#x27;s good. Also, constraints are good. Like you have to track down. You can&#x27;t get all music. You get the music you get. You really &gt;&gt; you really like. All right. Um before we end today, let&#x27;s do uh some questions and comments. &gt;&gt; All right. What&#x27;s our first question here, Jesse? &gt;&gt; First question is from Lisa. Hi, Cal. I&#x27;m a mother of two living in Richmond, Virginia. In conversations with other moms about social media and video games, I&#x27;ve noticed a tone switcher switch over the last couple years from thinking of these platforms as being necessary evils</p>\n<p>to thinking of them as evil we should try to avoid. I was wondering if you had advice for us trying to put the social media and video game cats back in the bags. Um, okay. Well, can we do that if you&#x27;ve already given your kid a phone? If you&#x27;ve already given your kid access to like all these video games, is it too late? And there my answer is no. It is perfectly reasonable for an adult parent being a parent to say, &quot;Hey, we let you use this technology. We learn more about it. We</p>\n<p>don&#x27;t like it. We don&#x27;t want you to use it anymore.&quot; Some people call that impossible. I call that parenting. Everything you tell a 13-year-old they don&#x27;t like. your whole life is telling them to do things they don&#x27;t want to do. You might as well just add this to the list. What I would do, and I I&#x27;ve recommend this to a lot of parents, is like the I think that the key reform that allows you to reform a lot of other things is to say the number one thing we&#x27;re doing in our household if you have adolescent age kids and they already have phones. The number one rule we&#x27;re changing because we didn&#x27;t realize the dangers,</p>\n<p>but now we did. We&#x27;re the parents. We get to say make the rules is you don&#x27;t own your phone. We own the phone. You&#x27;re not paying for that phone. You do not have the right to have that phone everywhere you go. That phone is not your personal property. It is something we lend to you because it&#x27;s useful and for certain entertainment purposes. As a result, here is our rule. When you&#x27;re at home, the phone lives in the kitchen. We have a charger station there. If you need to call someone, you go to the kitchen. If you need to check your text messages, you go to the kitchen. If you need to, man, you hear this all the time</p>\n<p>from teenagers. My homework&#x27;s on there, man. I gotta be on my phone for the next six hours because my homework&#x27;s on there. You say, &quot;Show me your homework on the phone. I&#x27;ll sit here with you. We&#x27;ll get it off the phone. The phone lives in the kitchen.&quot; And so that when you&#x27;re at home, it is not a default</p>\n<h2>Cal responds to comments</h2>\n<p>thing you can bring with you. And that actually will do more good than trying to ban particular just saying like, &quot;Don&#x27;t use this app.&quot; Or the worst, and I really hate this, is the like, &quot;Oh, my son&#x27;s on his phone all the time. I tell him he should stop, but he what could you do?&quot; This is such a better solution. You&#x27;re like, &quot;Do you want to text for six hours?&quot; You&#x27;re going to do it standing in the kitchen and that&#x27;s going to lose its allure and you&#x27;re going to have to do something else. When you&#x27;re at the dinner table, you have to be at the dinner table. The phone&#x27;s not there. When you&#x27;re watching a movie, you have to watch the movie. You don&#x27;t have the option of also checking on your phone. A lot of parents say that&#x27;s impossible.</p>\n<p>It&#x27;s like somehow it&#x27;s some intrinsic right that was instilled by the UN Commission on Human Rights that 16-year-olds must be able to look at Snapchat while you&#x27;re watching, you know, a show on HBO. That&#x27;s not a law. That&#x27;s not a natural law. That&#x27;s not a rule. It&#x27;s your house. You&#x27;re paying for the phone. So, I think that&#x27;s the number one reform that if your kids already have phones, just say they live in the kitchen. Don&#x27;t argue with people about how much they&#x27;re using or if they should use it less or what apps or it lives in the kitchen. That&#x27;s what I would do. I would also say no online games. I don&#x27;t care if the kids 16, 17, 18. My whole point as a parent</p>\n<p>is to prepare you to succeed in the world. Nothing&#x27;s going to get more in the way of that than you learning to play three to four hours of these stupid games every day while exposing yourself to like all the worst things the world has to offer. I do not want my 17-year-old in a Discord server learning how to do groper trolls while playing five hours of god knows what game. That&#x27;s just like I&#x27;m if my kid was like, &quot;Hey, um I&#x27;m going down the liquor store. I&#x27;m gonna hang out on the corner there uh and we&#x27;re going to see if we can rob some old ladies.&quot; Right? like, &quot;No, don&#x27;t go spend four hours doing that.&quot; Also, no, don&#x27;t go on Discord and</p>\n<p>play five hours of of Call of Duty. So, yeah, it is fixable. You can go back. And I&#x27;m glad to hear that the tone is changing of the conversation. Um, height had a lot to do with that. I think he gave people permission to be like, &quot;Oh, these things are terrible. We can react to terrible things.&quot; All right, what do we got next? Next up is Marco. I&#x27;m a young artist living in Bilboa, Spain. Surviving as an artist in 2025 has a lot to do with skill of growing social media. My dilemma is that I prefer to spend my time mastering my craft, but I keep getting a sinking feeling that it won&#x27;t matter if my work isn&#x27;t being seen</p>\n<p>online. What advice do you have? I think people who are considering social media and professional circumstances are way too general about what they mean and they kind of make it a binary like I need to either be out of business or spend like seven hours a day on TikTok. As if there&#x27;s no in between. It&#x27;s almost like someone saying, &quot;Look, I I I don&#x27;t like that I get blackout drunk every day. Um, but my office is above a bar. What else can I do?&quot; And you like, &quot;Well, just because a bar is there doesn&#x27;t mean you have to go down there and drink all day long, right?&quot; Like</p>\n<p>that&#x27;s how I feel sometimes when people are like A people in my field will advertise on social media. B I don&#x27;t want to lose my life to being online on social media all day. These one doesn&#x27;t have to necessarily follow from the other. So</p>\n<h2>Cal gives his weekly reading update</h2>\n<p>what I would say is you can post things on social media in a way that has very little impact on your life. Do it from your computer. Don&#x27;t have it on your phone. Have a set schedule. It takes like six minutes a day every other day and that&#x27;s it. Do not use the fact that you have some limited need for social media in your life to be an excuse for unlimited use of personal social media for your own distraction and engagement. One does not follow from the other. But here&#x27;s the other thing I would add. Test the assumption of how and why you need to use social media. A lot of people will</p>\n<p>just say, &quot;How else will you get noticed?&quot; And I say, &quot;You got to be way more specific to me. What particular activities are you doing on social media? Is it posting images? Is it talking to people in the comments? Is it lurking on Instagram all day? Like, what are the the specific actions you think are driving business? And what are the numbers? How many leads have you gotten off of these Instagram posts? How many uh orders have come in to a link in the bottom of your Tik Tok post? You have to actually quantify specific activities that have specific benefits. And if they are, you can focus on those activities,</p>\n<p>cut out the rest, and minimize it. A lot of people, however, are surprised when they do this where they discover it doesn&#x27;t happen. There&#x27;s a a comedian friend of mine told me about this a couple years ago. He was having a hard time with with social media. Uh but he was using it too much and it was really like a source of unhappiness and convinced himself like but I&#x27;m a comedian. Like how else am I going to find opportunities? If I&#x27;m not up to doing jokes, how are people going to find me or whatever? And then he went through a list of the the biggest breaks that he had had in the last few years and realized like every one of those breaks had nothing to do with social media. It had to do with someone seeing</p>\n<p>something he created like at a comedy show, seen him do a really good set and be like, &quot;Oh, you&#x27;re good. Like, I want to talk to you. We should talk some more.&quot; And it it pushed back on this assumption of like, &quot;This is where all the opportunities are going to come from.&quot; Where that had never actually happened in his life. So, I want you to verify what specific activities on social media you have quantitative evidence are really helping. And if there are some activities that fall in that bucket, focus on those. Do it from a computer, on a schedule, and that should be it. And if you can&#x27;t find any, then you&#x27;re missing out nothing if you uh turn off those apps altogether. We also want to respond to some comments</p>\n<p>like we do from time and again. Um I think we have two comments to bring up here from last week&#x27;s episode which I believe was me and Ed Zitron going through the year in AI. So let&#x27;s load this first comment up here on the screen. This comes from uh Mesta 1988 who said not Cal Shading Jensen in the first two minutes. Uh, crying laughing emoji. More shady calendar in 2026. Before I go on with this comment, do you know what that&#x27;s referencing, Jamie or Jesse?</p>\n<p>&gt;&gt; No. &gt;&gt; I will show you what that&#x27;s referencing. Boom. Jensen. Uh, it&#x27;s referencing the CEO. I put on the screen for those who are watching. We were making fun of the leather racing jacket worn by the CEO of Nvidia that he always wears. It makes him look like an extra in a Mad Max video. in a talk in which he was talking about the scaling of graphic processing units and AI training. So, we just find that I find that endlessly amusing that he wears that jacket. All right. Then this comment goes on to say, &quot;Cal did a really good job of not letting things go completely off the rails when Zitron</p>\n<p>goes on one of his rabid rants.&quot; I love Zitron&#x27;s rants. That&#x27;s what makes them fun. Like he does like Zitron goes on these roles, but that&#x27;s kind of like his thing, right? Um yeah, he it gets over the top and so I I do try to keep derails on. uh he knows what he&#x27;s talking about, but he&#x27;s an entertaining talker because he often gets kind of hyperbolic when he talks about things. But I&#x27;m glad she appreciated that. &gt;&gt; There was a big article about him in Wired a couple months ago. &gt;&gt; I have to read that still. Yeah. Like he really has been doing his research, especially on the financial side. So</p>\n<p>like he he often has good points, but then he&#x27;s very funny on his podcast and on radio and interviews and he he goes he&#x27;s really hyperbolic. Um and it often surprises people because they&#x27;ve heard nothing but hype. And so he realized like if he&#x27;s just like super strong like that&#x27;s nonsense and here&#x27;s why he&#x27;s like really strong it it it really lands. All right. Here&#x27;s &gt;&gt; definitely controversial. &gt;&gt; He is controversial. All right. I like him though. All right. Here&#x27;s another comment. Um well because dialectical to say this, right? I think it&#x27;s nice to like slam ideas together. You get bit deeper insight. &gt;&gt; This next comment is from Shrea Doss</p>\n<p>5065. I can&#x27;t believe that the American professor is so polite and the British journalist is not. Indeed, our world is changing. On a serious note, thanks a lot for this discussion. Absolutely stunning. It is funny. I know like I I the British person should be like the super polite. Uh but you know what? It&#x27;s not really true. Here&#x27;s been my experience with British academics in in particular is they&#x27;re not bombastic, but they&#x27;re very cudding. Like they just have like Americans kind of wear their heart on their sleeves. They&#x27;re like, &quot;That&#x27;s stupid. I don&#x27;t like that. You&#x27;re stupid because you said that and you&#x27;re a dumbhead. I don&#x27;t want to talk</p>\n<p>to you.&quot; Um and the British person will just have like a perfect like bono. just have like this like uh super cutting like hm I see. Yeah, that is the type of thing that a Dartmouth man would say and they just kind of puff on their pipe a little bit and you&#x27;re like, &quot;Wait a second, he just really burned me there.&quot; So, they&#x27;re not as polite as people think. All right. Uh, thanks for the questions and the comments. Uh, I want to conclude as always by talking about what I&#x27;m reading. U, so a quick update. At the end of last episode, I was talking about the the</p>\n<p>thrillers I read in December. Uh I forgot, however, the name of the fifth book I read in December. So, just for the completist out there, um the fifth book I read in December was called 20th Century Fox by Scott Iman. And it was a a history of the 20th Century Fox film studio. Interesting. The name, Jesse, I didn&#x27;t realize this. It was a merger in the early days of cinema of Fox Studios created by William Fox and 20th Century Studios created by someone else. And when they came together, that&#x27;s why it was called 20th Century Fox. So, I hadn&#x27;t realized that. That was a good</p>\n<p>book. I mean, the thing is I didn&#x27;t I don&#x27;t know most of the movie references. So, it&#x27;s like, oh, you know, and this became like Betty Greybel in, you know, the the Golden Stage Coach and as if like you&#x27;re supposed to know the reference. I don&#x27;t really know the old movie references. Uh, but it was really like the story of mainly like Daryl Xanic and the the the rise of cinema and the trouble they had and how they came back and I found it was interesting. All right. What did I read more recently? So last week between last episode and this episode I read Jane Goodall&#x27;s book in the shadow of man which uh early in her career I think she</p>\n<p>published this in the late 60s early7s was sort of her first account of her time in the the GB stream chimpanzeee reservation um about her her first work with chimpanzees. So it was a big bestseller at the time because people didn&#x27;t know anything about chimps and she wrote this book about her experience spending all this time with them. Um I liked it. It&#x27;s a lot less sciency than these type of books are today, Jesse. So, if you read one of these like scientist memoirs today where they talk about like the work they were working on with like a memoir aspect to it, there&#x27;s a lot more theory in it. So, like if you</p>\n<p>wrote this book today, there&#x27;d probably be a lot more of what are the particular theories about animal behavior that they were finding and oh, we were we we got this evidence of this and that. It was a lot more of just her describing and then this happened, we saw this, we saw them doing this and that. It was like just very descriptive of like what chimpanzees were like because I think it was so early. That itself was interesting. I like that book. And then I read a um a museum exhibit companion book on an exhibit about Walt Disney and trains because I had a section in the book I&#x27;m writing now about Walt Disney&#x27;s personal train set he built at his</p>\n<p>house. And so there was a big exhibit about this out in LA and I there&#x27;s a companion book that has a lot of details and images. And so I read that as well last week. So there you go. All right, that&#x27;s all the time we have for this week. Thanks for listening. We&#x27;ll be back next week. I have a special guest joining me to help me in the idea segment. So, it should be fun. So, hopefully I will see you will hear from you then. And until then, as always, stay deep. Hey, if you like today&#x27;s discussion of new dangers to be worried about, you might also like episode 374, which looked at the original danger, phones. That episode is titled This is Your Brain on Phones. It gives you a</p>\n<p>closer look at what&#x27;s actually happening inside your brain as you use those devices. Check it out. I think you&#x27;ll like it. For some people, the constant allure of their phone is so strong, it&#x27;s so inescapable that it can seem impossible to find any sort of freedom. This is what I want to talk about</p>", "chapters_count": 6}